      *=================================================================
      *@업무명    : KLA     (프레임워크)
      *@프로그램명: QJL4137 (SQLIO 프로그램)
      *@처리유형  : SQLIO
      *@처리개요  : 사용자가 정의한 SQL 처리
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 :일자  : 변　경　내　용
      * -------:--------:-----------------------------------------------
      *큐로컴:20080401:커스터마이징
      *송재복:20100303:에러처리를 DBIO와 같은 방법으로 변경
      *송재복:20111101:최적화 SQLIO MASTER 수정
      *백재용:20120106: ERROR　수정
      *=================================================================
      ******************************************************************
      **  프로그램명 :대주주(특수관계인 포함)에 대한 신용
      ******************************************************************
      **  TABLE-SYNONYM    : 테이블명                           : CRUD
      **  ----------------   ----------------------------------   ------
      *@테이블           : THKJL0082 이사회승인관련계좌현황 기본
      *@테이블           : THKJL0119 신용공여계정과목정보
      *@테이블           : THKJL0082 이사회승인관련계좌현황 기본
      *@테이블           : THKJL0118 TE상품코드목록
      *@테이블           : THKJL0125 EAD차주일계좌명세
      *@테이블           : THKJL0076 거액익스포져일계좌명세
      *@테이블           : THKJL0082 이사회승인관련계좌현황 기본
      *@테이블           : THKJL0118 TE상품코드목록
      *@테이블           : THKJL0125 EAD차주일계좌명세
      *@테이블           : THKJL0076 거액익스포져일계좌명세
      *@테이블           : THKJL0082 이사회승인관련계좌현황 기본
      *@테이블           : THKJL0118 TE상품코드목록
      *@테이블           : THKJL0125 EAD차주일계좌명세
      *@테이블           : THKJL0076 거액익스포져일계좌명세
      *@테이블           : THKJLR005 해외점포계좌내역
      *@테이블           : THKJL0082 이사회승인관련계좌현황 기본
      *@테이블           : THKJLR019 외화타점예치계좌기본수보
      *@테이블           : THKJL0119 신용공여계정과목정보
      *@테이블           : THKAABPCB 고객기본
      *@테이블           : THKJIBR01 부점기본
      *@테이블           : THKJIBR01 부점기본
      *@테이블           : THKJL0042 자회사대주주기본
      *@테이블           : THKJL0081 이사회승인내역 기본
      *@테이블           : THKJL0042 자회사대주주기본
      *@테이블           : THKJL0081 이사회승인내역 기본
      *@테이블           : THKJL0042 자회사대주주기본
      *@테이블           : THKJL0081 이사회승인내역 기본
      **
      ******************************************************************
       IDENTIFICATION                       DIVISION.
      ******************************************************************
       PROGRAM-ID.                          QJL4137.
       AUTHOR.                              KB.
       INSTALLATION.                        KB.
       DATE-WRITTEN.                        2024-11-14-16.19.45.534207.
       SECURITY.
      ******************************************************************
       ENVIRONMENT                          DIVISION.
      ******************************************************************
      *=================================================================
       CONFIGURATION                        SECTION.
      *=================================================================
       SOURCE-COMPUTER.                     IBM.
       OBJECT-COMPUTER.                     IBM.
      *
      ******************************************************************
       DATA                                 DIVISION.
      ******************************************************************
      *=================================================================
       WORKING-STORAGE                      SECTION.
      *=================================================================
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-S9000050             PIC  X(008) VALUE 'S9000050'.
           03  CO-S9000054             PIC  X(008) VALUE 'S9000054'.
           03  CO-UKLA0003             PIC  X(008) VALUE 'UKLA0003'.
           03  CO-UKLA0002             PIC  X(008) VALUE 'UKLA0002'.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01 CO-AREA.
         03 CO-MASTER-VER              PIC  X(007) VALUE "@Q-M01@".
         03 CO-STAT-OK                 PIC  X(002) VALUE '00'.
         03 CO-STAT-MRNF               PIC  X(002) VALUE '02'.
         03 CO-STAT-ERROR              PIC  X(002) VALUE '09'.
         03 CO-STAT-ABNORMAL           PIC  X(002) VALUE '98'.
         03 CO-STAT-SYSERROR           PIC  X(002) VALUE '99'.

       01 CO-DBSQLE-MSG.
         03  FILLER                    PIC  X(008) VALUE "ERR-CNT=".
         03  DI-ERR-CNT                PIC  -9(05).
         03  FILLER                    PIC  X(009) VALUE "/SQLCODE=".
         03  DI-SQL-CODE               PIC  -9(05).
         03  FILLER                    PIC  X(009) VALUE "/ROW-NUM=".
         03  DI-ROW-NUM                PIC  -9(05).
         03  FILLER                    PIC  X(008) VALUE "/MSG-ID=".
         03  DI-MSG-ID                 PIC  X(010).
         03  FILLER                    PIC  X(001) VALUE SPACE.

      *=================================================================
       01  DBSQLI-AREA.
      *    03  DBSQLI-COPYTM                PIC  X(35).
           03  DBSQLI-SELECT-REQ            PIC S9(09)  COMP.
           03  DBSQLI-ARRAY-CNT             PIC S9(09)  COMP.

       01  DBSQLI-DIAG.
           03  DBSQLI-DIAG-ERRORS           PIC S9(09)  COMP.
           03  DBSQLI-ERROR-CNT             PIC S9(09)  COMP.
           03  DBSQLI-RETURN-SQLCODE        PIC S9(09)  COMP.
           03  DBSQLI-SERCH-SQLCODE         PIC S9(09)  COMP.
           03  DBSQLI-ROW-NUMBER            PIC S9(09)  COMP-3.
           03  DBSQLI-MESSAGE-ID            PIC  X(10).
           03  DBSQLI-MESSAGE-TEXT.
               49  DBSQLI-MSG-LEN           PIC S9(04)  COMP.
               49  DBSQLI-MSG-TXT           PIC  X(200).
           03  DBSQLI-EDIT-NUM              PIC -9(005).
           03  DBSQLI-DEC                   PIC +9(18).
           03  DBSQLI-DEC-P                 PIC 9.9(10).

       77  DBSQLE-TEXT-LEN               PIC S9(009) COMP VALUE +72.
       01  DBSQLE-MESSAGE.
           03  DBSQLE-LEN                PIC S9(004) COMP VALUE +720.
           03  DBSQLE-TEXT               PIC  X(072) OCCURS 10 TIMES
                                         INDEXED BY DBSQLE-IDX.

      *-----------------------------------------------------------------
      *--  SQL CALL AREA
      *-----------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA           END-EXEC.

      *=================================================================
       LINKAGE                              SECTION.
      *=================================================================
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      *-----------------------------------------------------------------
      *  PCO 변수영역
      *-----------------------------------------------------------------
           COPY YCDBSQLA.

      *-----------------------------------------------------------------
      *  PCO 카피북
      *-----------------------------------------------------------------
       01  SQL-TABLE.
           COPY  XQJL4137.

           REPLACE   ==(COM)== BY ==COM==.
       01  YCCSICOM-CA.
           COPY    YCCSICOM.
       01  YCCBICOM-CA.
           COPY    YCCBICOM.
           REPLACE   OFF.

      ******************************************************************
       PROCEDURE                           DIVISION
                                           USING     YCCOMMON-CA
                                                     YCDBSQLA-CA
                                                     SQL-TABLE.
      ******************************************************************
      *
       S0000-START-RTN.

           SET     ADDRESS OF YCCSICOM-CA  TO  COMM-SICOM-ADDR
           SET     ADDRESS OF YCCBICOM-CA  TO  COMM-BICOM-ADDR
           PERFORM S0000-MAIN-RTN        THRU  S0000-MAIN-EXT
           GOBACK.

       S0000-START-EXT.
           EXIT.

      *
       S0000-MAIN-RTN.
      *
           MOVE  "14"                       TO YCFCTLAR-USR-LOG-CD
      *
           INITIALIZE                          XZUGEROR-CA
                                               XQJL4137-OUT
      *    MOVE   "@QJL4137:2024-11-14-16.19.45.534207" TO DBSQLI-COPYTM
           MOVE   00500                     TO   DBSQLI-ARRAY-CNT

           PERFORM Z9900-AREA-INIT-RTN
              THRU Z9900-AREA-INIT-EXT
      *
      * SQLIO-FUNCTION OF YCDBSQLA
           EVALUATE  TRUE
               WHEN  COND-DBSQL-SELECT
                     PERFORM Z9900-SELECT-RTN
                        THRU Z9900-SELECT-EXT
      *
               WHEN  COND-DBSQL-OPEN
                     PERFORM Z9900-OPEN-RTN
                        THRU Z9900-OPEN-EXT
      *
               WHEN  COND-DBSQL-FETCH
                     PERFORM Z9900-FETCH-RTN
                        THRU Z9900-FETCH-EXT
      *
               WHEN  COND-DBSQL-CLOSE
                     PERFORM Z9900-CLOSE-RTN
                        THRU Z9900-CLOSE-EXT

                     PERFORM Z9900-SQLCODE-CHECK-RTN
                        THRU Z9900-SQLCODE-CHECK-EXT
E N D
      *
               WHEN  OTHER
                     MOVE
                     "SQLIO입력항목 검증오류입니다(SQLIO-FUNCTION)"
                                          TO   XZUGEROR-I-MSG
                     MOVE    CO-S9000050  TO   XZUGEROR-I-ERRCD
                     MOVE    CO-UKLA0002  TO   XZUGEROR-I-TREAT-CD
                     PERFORM Z9900-MSG-ERROR-RTN
                        THRU Z9900-MSG-ERROR-EXT
           END-EVALUATE

           PERFORM Z9900-NOMAL-END-RTN
              THRU Z9900-NOMAL-END-EXT

           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------

       Z9900-SELECT-RTN.

           PERFORM Z9900-OPEN-RTN
              THRU Z9900-OPEN-EXT
           IF      SQLCODE = ZERO
                   PERFORM Z9900-FETCH-RTN
                      THRU Z9900-FETCH-EXT
                   PERFORM Z9900-CLOSE-RTN
                      THRU Z9900-CLOSE-EXT
           END-IF
           .
       Z9900-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  처리기능 : CURSOR OPEN
      *-----------------------------------------------------------------
       Z9900-OPEN-RTN.

           PERFORM Z9900-PARAM-CHECK-RTN
              THRU Z9900-PARAM-CHECK-EXT

#DEBUG     IF      YCFCTLAR-DISP-YN = '1'
#DEBUG        IF   COMM-SQL-II-OUTPT-DSTCD     =    "1" OR "9"
#DEBUG     STRING "XQJL4137-I-GROUP-CO-CD        = "
#DEBUG             XQJL4137-I-GROUP-CO-CD         DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-BASE-YM            = "
#DEBUG             XQJL4137-I-BASE-YM             DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-BASE-DD            = "
#DEBUG             XQJL4137-I-BASE-DD             DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-BASE-YMD           = "
#DEBUG             XQJL4137-I-BASE-YMD            DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-BRN-DSTIC          = "
#DEBUG             XQJL4137-I-BRN-DSTIC           DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-JRSDZ-BRNCD        = "
#DEBUG             XQJL4137-I-JRSDZ-BRNCD         DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-JRSDZ-BRNCD1       = "
#DEBUG             XQJL4137-I-JRSDZ-BRNCD1        DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG     STRING "XQJL4137-I-JRSDZ-BRNCD2       = "
#DEBUG             XQJL4137-I-JRSDZ-BRNCD2        DELIMITED BY SIZE
#DEBUG       INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG     PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT

#DEBUG        END-IF
#DEBUG     END-IF

           EXEC  SQL
           DECLARE CUR_SQL  CURSOR WITH HOLD
                                       WITH ROWSET POSITIONING FOR
       WITH TBL1 AS (
       -- 수기계좌
       SELECT A.이사회승인번호
            , A.고객식별자
            , '' AS 고객명
            , '' AS 소관부점코드
            , '' AS 소관부점명
            , '' AS "통화코드1"
            , 0  AS 이사회승인금액
            , '' AS 이사회승인년월일
            , '' AS 이사회승인유효년월일
            , A.관련여신일련번호
            , '' AS 신용공여중분류코드
            , A.계좌번호
            , A.약정계좌번호
            , A.통합계정과목코드
            , B.계정과목명 AS 상품명
            , A.통화코드 AS "통화코드2"
            , A.통화한도
            , A.통화잔액
            , 0  AS "BS기준한도"
            , 0  AS "BS기준잔액"
            , A.시작년월일
            , A.만기년월일
            , A.신용공여익스포져금액
            , A.금리내용
            , A.담보형태구분
            , A.담보설정금액
            , A.취급부점코드
            , A.대출취급형태구분
            , A.수기계좌여부
         FROM        THKJL0082 A
             ,       THKJL0119 B
        WHERE A.그룹회사코드     = B.그룹회사코드
          AND A.통합계정과목코드 = B.통합계정과목코드
          AND B.그룹회사코드     = :XQJL4137-I-GROUP-CO-CD
          AND B.기준년월         = :XQJL4137-I-BASE-YM
          AND A.통합계정과목코드 > ''
          AND A.수기계좌여부     = '1'
        UNION
       --외화콜론,외화대여금 0125 계좌
       SELECT D.이사회승인번호
            , D.고객식별자
            , ''  AS 고객명
            , ''  AS 소관부점코드
            , ''  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , D.관련여신일련번호 AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , MIN(D.계좌번호)     AS 계좌번호
            , MIN(D.약정계좌번호) AS 약정계좌번호
            , MIN(D.통합계정과목코드) AS 통합계정과목코드
            , MIN(B."TE상품명")       AS 상품명
            , A.통화코드 AS "통화코드2"
            , SUM(A.통화한도) AS 통화한도
            , SUM(A.통화잔액) AS 통화잔액
            , SUM(C."BS기준한도") AS "BS기준한도"
            , SUM(C."BS기준잔액") AS "BS기준잔액"
            , MIN(A.시작년월일) AS 시작년월일
            , MAX(A.만기년월일) AS 만기년월일
            , VALUE(SUM(C.신용공여익스포져금액),0)
                       AS 신용공여익스포져금액
            , MIN(D.금리내용    ) AS 금리내용
            , MIN(D.담보형태구분) AS 담보형태구분
            , MAX(D.담보설정금액) AS 담보설정금액
            , D.취급부점코드
            , D.대출취급형태구분
            , '0' AS 수기계좌여부
         FROM        THKJL0082 D
             ,       THKJL0118 B
             ,       THKJL0125 A
              LEFT OUTER JOIN
                     THKJL0076 C
           ON A.그룹회사코드   = C.그룹회사코드
          AND A.기준일         = C.기준일
          AND A.기준년월       = C.기준년월
          AND A.차주고객식별자 = C.차주고객식별자
       --   AND A.한도계좌번호   = C.한도계좌번호
          AND A.한도상품대분류코드 = C.한도상품대분류코드
          AND A.한도상품중분류코드 = C.한도상품중분류코드
          AND A.한도상품템플릿코드 = C.한도상품템플릿코드
          AND A.한도상품번호       = C.한도상품번호
        WHERE A.그룹회사코드       = B.그룹회사코드
          AND A.기준년월           = B.기준년월
          AND A.한도상품대분류코드 = B.상품대분류코드
          AND A.한도상품중분류코드 = B.상품중분류코드
          AND A.한도상품템플릿코드 = B.상품템플릿코드
          AND A.한도상품번호       = B.상품번호
          AND A.그룹회사코드       = D.그룹회사코드
          AND A.한도계좌번호       = D.계좌번호
          AND A.차주고객식별자     = D.고객식별자
          AND A.그룹회사코드  = :XQJL4137-I-GROUP-CO-CD
          AND A.기준일        = :XQJL4137-I-BASE-DD
          AND A.기준년월      = :XQJL4137-I-BASE-YM
          AND A."TE계좌구분"        <> '2'
          AND B.신용익스포져대상여부 = '1'
          AND B."한도기준TE환산율"   > 0
          AND D.계좌번호             > ''
          AND D.수기계좌여부         = '0'
          AND B.상품대분류코드||B.상품중분류코드||
              B.상품템플릿코드||B.상품번호 IN
             ('KT01000F2330','KT01000F2349')
        GROUP BY D.이사회승인번호
                ,D.고객식별자
                ,D.관련여신일련번호
                ,A.통화코드
                ,D.취급부점코드
                ,D.대출취급형태구분
        UNION
       --외화콜론,외화대여금 이외 0125 계좌
       SELECT D.이사회승인번호
            , D.고객식별자
            , ''  AS 고객명
            , ''  AS 소관부점코드
            , ''  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , D.관련여신일련번호 AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , D.계좌번호 AS 계좌번호
            , D.약정계좌번호
            , D.통합계정과목코드
            , B."TE상품명"   AS 상품명
            , A.통화코드 AS "통화코드2"
            , A.통화한도
            , A.통화잔액
            , C."BS기준한도"
            , C."BS기준잔액"
            , A.시작년월일
            , A.만기년월일
            , VALUE(C.신용공여익스포져금액,0)
              AS 신용공여익스포져금액
            , D.금리내용
            , D.담보형태구분
            , D.담보설정금액
            , D.취급부점코드
            , D.대출취급형태구분
            , '0' AS 수기계좌여부
         FROM        THKJL0082 D
             ,       THKJL0118 B
             ,       THKJL0125 A
              LEFT OUTER JOIN
                     THKJL0076 C
           ON A.그룹회사코드   = C.그룹회사코드
          AND A.기준일         = C.기준일
          AND A.기준년월       = C.기준년월
          AND A.차주고객식별자 = C.차주고객식별자
          AND A.한도계좌번호   = C.한도계좌번호
          AND A.한도상품대분류코드 = C.한도상품대분류코드
          AND A.한도상품중분류코드 = C.한도상품중분류코드
          AND A.한도상품템플릿코드 = C.한도상품템플릿코드
          AND A.한도상품번호       = C.한도상품번호
        WHERE A.그룹회사코드       = B.그룹회사코드
          AND A.기준년월           = B.기준년월
          AND A.한도상품대분류코드 = B.상품대분류코드
          AND A.한도상품중분류코드 = B.상품중분류코드
          AND A.한도상품템플릿코드 = B.상품템플릿코드
          AND A.한도상품번호       = B.상품번호
          AND A.그룹회사코드       = D.그룹회사코드
          AND A.한도계좌번호       = D.계좌번호
          AND A.차주고객식별자     = D.고객식별자
          AND A.그룹회사코드  = :XQJL4137-I-GROUP-CO-CD
          AND A.기준일        = :XQJL4137-I-BASE-DD
          AND A.기준년월      = :XQJL4137-I-BASE-YM
          AND A."TE계좌구분"        <> '2'
          AND B.신용익스포져대상여부 = '1'
          AND B."한도기준TE환산율"   > 0
          AND D.계좌번호             > ''
          AND D.수기계좌여부         = '0'
          AND B.상품대분류코드||B.상품중분류코드||
              B.상품템플릿코드||B.상품번호 NOT IN
             ('KT01000F2330','KT01000F2349')
        UNION
       -- R005 해외통합계좌
       SELECT D.이사회승인번호
            , D.고객식별자
            , ''  AS 고객명
            , ''  AS 소관부점코드
            , ''  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , D.관련여신일련번호 AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , D.계좌번호 AS 계좌번호
            , D.약정계좌번호
            , D.통합계정과목코드
            , B."TE상품명"   AS 상품명
            , A.통화코드 AS "통화코드2"
            , A.통화한도
            , A.통화잔액
            , C."BS기준한도"
            , C."BS기준잔액"
            , A.시작년월일
            , A.만기년월일
            , VALUE(C.신용공여익스포져금액,0)
              AS 신용공여익스포져금액
            , D.금리내용
            , D.담보형태구분
            , D.담보설정금액
            , D.취급부점코드
            , D.대출취급형태구분
            , '0' AS 수기계좌여부
         FROM        THKJL0082 D
             ,       THKJL0118 B
             ,       THKJL0125 A
              LEFT OUTER JOIN
                     THKJL0076 C
           ON A.그룹회사코드   = C.그룹회사코드
          AND A.기준일         = C.기준일
          AND A.기준년월       = C.기준년월
          AND A.차주고객식별자 = C.차주고객식별자
          AND A.한도계좌번호   = C.한도계좌번호
          AND A.한도상품대분류코드 = C.한도상품대분류코드
          AND A.한도상품중분류코드 = C.한도상품중분류코드
          AND A.한도상품템플릿코드 = C.한도상품템플릿코드
          AND A.한도상품번호       = C.한도상품번호
             ,       THKJLR005 E
        WHERE A.그룹회사코드       = B.그룹회사코드
          AND A.기준년월           = B.기준년월
          AND A.상품대분류코드     = B.상품대분류코드
          AND A.상품중분류코드     = B.상품중분류코드
          AND A.상품템플릿코드     = B.상품템플릿코드
          AND A.상품번호           = B.상품번호
          AND A.그룹회사코드       = D.그룹회사코드
          AND A.계좌번호           = D.계좌번호
          AND A.그룹회사코드       = E.그룹회사코드
          AND A.기준일             = SUBSTR(E.기준년월일,7,2)
          AND A.기준년월           = SUBSTR(E.기준년월일,1,6)
          AND A.관리부점코드       = E.관리부점코드
          AND A.계좌번호           = E.계좌번호
          AND E.그룹회사코드  = :XQJL4137-I-GROUP-CO-CD
          AND E.기준년월일    = :XQJL4137-I-BASE-YMD
          AND A."TE계좌구분"        <> '2'
          AND B.신용익스포져대상여부 = '1'
          AND B."한도기준TE환산율"   > 0
          AND D.계좌번호             > ''
          AND D.수기계좌여부         = '0'
          AND A.계좌중복일련번호     > 0
        UNION
       -- R019 DEPO계좌
       SELECT D.이사회승인번호
            , D.고객식별자
            , ''  AS 고객명
            , ''  AS 소관부점코드
            , ''  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , D.관련여신일련번호 AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , D.계좌번호 AS 계좌번호
            , D.약정계좌번호
            , D.통합계정과목코드
            , B.계정과목명   AS 상품명
            , A.통화코드 AS "통화코드2"
            , 0          AS 통화한도
            , A.외화잔액 AS 통화잔액
            , 0          AS "BS기준한도"
            , 0          AS "BS기준잔액"
            , ' '        AS 시작년월일
            , ' '        AS 만기년월일
            , A.원화환산금액 AS 신용공여익스포져금액
            , D.금리내용
            , D.담보형태구분
            , D.담보설정금액
            , D.취급부점코드
            , D.대출취급형태구분
            , '0' AS 수기계좌여부
         FROM        THKJL0082 D
             ,       THKJLR019 A
             ,       THKJL0119 B
        WHERE A.그룹회사코드 = B.그룹회사코드
          AND B.기준년월     = SUBSTR(A.기준년월일,1,6)
          AND A.통합계정과목코드  = B.통합계정과목코드
          AND A.그룹회사코드      = D.그룹회사코드
          AND A.통화코드          = D.통화코드
          AND A."거래은행BIC코드" = D.계좌번호
          AND A.고객식별자        = D.고객식별자
          AND A.그룹회사코드 = :XQJL4137-I-GROUP-CO-CD
          AND A.기준년월일   = :XQJL4137-I-BASE-YMD
          AND D.계좌번호          > ''
          AND D.수기계좌여부      = '0'
       )
       SELECT A.이사회승인번호
            , A.고객식별자
            , VALUE((SELECT "고객명1"
                       FROM        THKAABPCB
                      WHERE 그룹회사코드 = A.그룹회사코드
                        AND 고객식별자   = A.고객식별자
                     ),'') AS 고객명
            , A.소관부점코드
            , VALUE((SELECT 부점한글명
                       FROM        THKJIBR01
                      WHERE 그룹회사코드 = A.그룹회사코드
                        AND 부점코드     = A.소관부점코드
                      ORDER BY 적용종료년월일 DESC
                      FETCH FIRST 1 ROWS ONLY
                     ),'') AS 소관부점명
            , A.통화코드 AS "통화코드1"
            , A.이사회승인금액
            , A.이사회승인년월일
            , A.이사회승인유효년월일
            , VALUE(TBL1.관련여신일련번호,0)  AS 관련여신일련번호
            , A.신용공여중분류코드
            , VALUE(TBL1.계좌번호,'')         AS 계좌번호
            , VALUE(TBL1.약정계좌번호,'')     AS 약정계좌번호
            , VALUE(TBL1.통합계정과목코드,'') AS 통합계정과목코드
            , VALUE(TBL1.상품명,'')           AS 상품명
            , VALUE(TBL1."통화코드2",'')      AS "통화코드2"
            , VALUE(TBL1.통화한도,0)          AS 통화한도
            , VALUE(TBL1.통화잔액,0)          AS 통화잔액
            , VALUE(TBL1."BS기준한도",0)      AS "BS기준한도"
            , VALUE(TBL1."BS기준잔액",0)      AS "BS기준잔액"
            , VALUE(TBL1.시작년월일,'')       AS 시작년월일
            , VALUE(TBL1.만기년월일,'')       AS 만기년월일
            , VALUE(TBL1.신용공여익스포져금액,0)
                      AS 신용공여익스포져금액
            , VALUE(TBL1.금리내용,'')         AS 금리내용
            , VALUE(TBL1.담보형태구분,'')     AS 담보형태구분
            , VALUE(TBL1.담보설정금액,0)      AS 담보설정금액
            , VALUE(TBL1.취급부점코드,'')     AS 취급부점코드
            , VALUE((SELECT 부점한글명
                       FROM        THKJIBR01
                      WHERE 그룹회사코드 = A.그룹회사코드
                        AND 부점코드     = TBL1.취급부점코드
                      ORDER BY 적용종료년월일 DESC
                      FETCH FIRST 1 ROWS ONLY
                     ),'') AS 취급부점명
            , VALUE(TBL1.대출취급형태구분,'0') AS 대출취급형태구분
            , VALUE(TBL1.수기계좌여부,'')      AS 수기계좌여부
            , VALUE(B.자회사대주주구분,'')     AS 자회사대주주구분
         FROM        THKJL0042 B
             ,       THKJL0081 A
              LEFT OUTER JOIN TBL1
           ON A.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND A.고객식별자     = TBL1.고객식별자
          AND A.이사회승인번호 = TBL1.이사회승인번호
        WHERE A.그룹회사코드   = B.그룹회사코드
          AND A.고객식별자     = B.고객식별자
          AND B.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND B.기준년월       = :XQJL4137-I-BASE-YM
          AND B.해제년월일     = ' '
          AND (('1'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드 LIKE :XQJL4137-I-JRSDZ-BRNCD)
           OR  ('2'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드  IN (:XQJL4137-I-JRSDZ-BRNCD1
                                  , :XQJL4137-I-JRSDZ-BRNCD2)))
       UNION ALL
       SELECT '' AS 이사회승인번호
            , A.고객식별자
            , ''  AS 고객명
            , '9999'  AS 소관부점코드
            , '소계'  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , 999      AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , ''  AS 계좌번호
            , ''  AS 약정계좌번호
            , ''  AS 통합계정과목코드
            , ''  AS 상품명
            , ''  AS "통화코드2"
            , 0   AS 통화한도
            , 0   AS 통화잔액
            , 0   AS "BS기준한도"
            , 0   AS "BS기준잔액"
            , ''  AS 시작년월일
            , ''  AS 만기년월일
            , VALUE(SUM(TBL1.신용공여익스포져금액),0)
              AS 신용공여익스포져금액
            , ''  AS 금리내용
            , ''  AS 담보형태구분
            , 0   AS 담보설정금액
            , ''  AS 취급부점코드
            , ''  AS 취급부점명
            , ''  AS 대출취급형태구분
            , ''  AS 수기계좌여부
            , ''  AS 자회사대주주구분
         FROM        THKJL0042 B
             ,       THKJL0081 A
              LEFT OUTER JOIN TBL1
           ON A.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND A.고객식별자     = TBL1.고객식별자
          AND A.이사회승인번호 = TBL1.이사회승인번호
        WHERE A.그룹회사코드   = B.그룹회사코드
          AND A.고객식별자     = B.고객식별자
          AND B.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND B.기준년월       = :XQJL4137-I-BASE-YM
          AND B.해제년월일     = ' '
          AND (('1'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드 LIKE :XQJL4137-I-JRSDZ-BRNCD)
           OR  ('2'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드  IN (:XQJL4137-I-JRSDZ-BRNCD1
                                  , :XQJL4137-I-JRSDZ-BRNCD2)))
        GROUP BY A.고객식별자
        UNION ALL
       SELECT '9999999999' AS 이사회승인번호
            , '9999999999' AS 고객식별자
            , '' AS 고객명
            , '9999'  AS 소관부점코드
            , '합계'  AS 소관부점명
            , ''  AS "통화코드1"
            , 0   AS 이사회승인금액
            , ''  AS 이사회승인년월일
            , ''  AS 이사회승인유효년월일
            , 999      AS 관련여신일련번호
            , ''  AS 신용공여중분류코드
            , ''  AS 계좌번호
            , ''  AS 약정계좌번호
            , ''  AS 통합계정과목코드
            , ''  AS 상품명
            , ''  AS "통화코드2"
            , 0   AS 통화한도
            , 0   AS 통화잔액
            , 0   AS "BS기준한도"
            , 0   AS "BS기준잔액"
            , ''  AS 시작년월일
            , ''  AS 만기년월일
            , VALUE(SUM(TBL1.신용공여익스포져금액),0)
              AS 신용공여익스포져금액
            , ''  AS 금리내용
            , ''  AS 담보형태구분
            , 0   AS 담보설정금액
            , ''  AS 취급부점코드
            , ''  AS 취급부점명
            , ''  AS 대출취급형태구분
            , ''  AS 수기계좌여부
            , ''  AS 자회사대주주구분
         FROM        THKJL0042 B
             ,       THKJL0081 A
              LEFT OUTER JOIN TBL1
           ON A.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND A.고객식별자     = TBL1.고객식별자
          AND A.이사회승인번호 = TBL1.이사회승인번호
        WHERE B.그룹회사코드   = A.그룹회사코드
          AND B.고객식별자     = A.고객식별자
          AND B.그룹회사코드   = :XQJL4137-I-GROUP-CO-CD
          AND B.기준년월       = :XQJL4137-I-BASE-YM
          AND B.해제년월일     = ' '
          AND (('1'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드 LIKE :XQJL4137-I-JRSDZ-BRNCD)
           OR  ('2'               = :XQJL4137-I-BRN-DSTIC
          AND   A.소관부점코드  IN (:XQJL4137-I-JRSDZ-BRNCD1
                                  , :XQJL4137-I-JRSDZ-BRNCD2)))
        ORDER BY 고객식별자
                ,소관부점코드
                ,이사회승인번호
                ,관련여신일련번호
         WITH UR
      *
           END-EXEC
      *
           EXEC SQL OPEN  CUR_SQL END-EXEC
      *
           IF  SQLCODE                      =    -502
               PERFORM Z9900-CLOSE-RTN
                  THRU Z9900-CLOSE-EXT
               EXEC SQL OPEN  CUR_SQL END-EXEC
           END-IF

           IF  SQLCODE = ZERO
               SET   COND-DBSQL-OK    TO   TRUE
           ELSE
               PERFORM Z9900-SQLCODE-CHECK-RTN
                  THRU Z9900-SQLCODE-CHECK-EXT
           END-IF
           .
       Z9900-OPEN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  처리기능 : CURSOR FETCH
      *-----------------------------------------------------------------
       Z9900-FETCH-RTN.

120106     PERFORM Z9900-PARAM-CHECK-RTN
120106        THRU Z9900-PARAM-CHECK-EXT
      *
           EXEC SQL
              FETCH NEXT ROWSET FROM CUR_SQL
              FOR  :DBSQLI-SELECT-REQ ROWS
              INTO
                  :XQJL4137-O-BRDC-ATHOR-NO
                 ,:XQJL4137-O-CUST-IDNFR
                 ,:XQJL4137-O-CUSTNM
                 ,:XQJL4137-O-JRSDZ-BRNCD
                 ,:XQJL4137-O-JRSD-BRNZ-NAME
                 ,:XQJL4137-O-CNCYCD1
                 ,:XQJL4137-O-BRDC-ATHOR-AMT
                 ,:XQJL4137-O-BRDC-ATHOR-YMD
                 ,:XQJL4137-O-BRDC-ATHOR-VALD-YMD
                 ,:XQJL4137-O-RELATD-LNBZ-SERNO
                 ,:XQJL4137-O-GRCR-MIDL-CLSFI-CD
                 ,:XQJL4137-O-ACNO
                 ,:XQJL4137-O-AGRE-ACNO
                 ,:XQJL4137-O-INTGRA-TIACC-CD
                 ,:XQJL4137-O-PRDCT-NAME
                 ,:XQJL4137-O-CNCYCD2
                 ,:XQJL4137-O-CRNCY-CLAM
                 ,:XQJL4137-O-CRNCY-BAL
                 ,:XQJL4137-O-BS-BASE-CLAM
                 ,:XQJL4137-O-BS-BASE-BAL
                 ,:XQJL4137-O-START-YMD
                 ,:XQJL4137-O-EXPIR-YMD
                 ,:XQJL4137-O-GRCR-EXPSR-AMT
                 ,:XQJL4137-O-IRTZ-CTNT
                 ,:XQJL4137-O-SCURTY-FORM-DSTCD
                 ,:XQJL4137-O-SCURTY-SETAMT
                 ,:XQJL4137-O-HNDLN-BRNCD
                 ,:XQJL4137-O-HNDLN-BRN-NAME
                 ,:XQJL4137-O-LN-HNDLN-FORM-DSTCD
                 ,:XQJL4137-O-HWRT-ACN-YN
                 ,:XQJL4137-O-SBCO-L-SKHDR-DSTCD
      *
           END-EXEC
      *
           IF      SQLCODE = +100
              IF   SQLERRD(3)  NOT =   ZERO
                   MOVE ZERO                TO   SQLCODE
              END-IF
           END-IF

           MOVE  SQLERRD(3)                 TO   DBSQL-SELECT-CNT
           PERFORM Z9900-SQLCODE-CHECK-RTN
              THRU Z9900-SQLCODE-CHECK-EXT

           .
       Z9900-FETCH-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  처리기능 : CURSOR CLOSE
      *-----------------------------------------------------------------
       Z9900-CLOSE-RTN.

           EXEC SQL CLOSE CUR_SQL END-EXEC
           .
       Z9900-CLOSE-EXT.
           EXIT.
E N D


      *=================================================================
       Z9900-AREA-INIT-RTN.

           INITIALIZE                            DBSQL-OUT
                                                 DBSQL-RESULT
           MOVE  DBSQLI-ARRAY-CNT           TO   DBSQL-ARRAY-CNT
           SET   COND-DBSQL-ABNORMAL        TO   TRUE
           MOVE  ZERO                       TO   SQLCODE
           MOVE  SPACE                      TO   SQLERRMC
           IF    DBSQL-SELECT-REQ-X  =  SPACE OR ZERO OR LOW-VALUE
                 MOVE  DBSQL-ARRAY-CNT      TO   DBSQLI-SELECT-REQ
           ELSE
                 MOVE  DBSQL-SELECT-REQ     TO   DBSQLI-SELECT-REQ
           END-IF
           .
       Z9900-AREA-INIT-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-SQLCODE-CHECK-RTN.
      *
           MOVE  SQLCODE                    TO   DBSQL-SQLCODE

           EVALUATE  SQLCODE
               WHEN  0
                     SET   COND-DBSQL-OK    TO   TRUE
               WHEN  +354
                     PERFORM Z9900-DIAG-ERR-RTN THRU Z9900-DIAG-ERR-EXT
120106               IF  SQLCODE  EQUAL  ZERO
120106                   SET  COND-DBSQL-OK       TO TRUE
120106               ELSE
120106                   SET  COND-DBSQL-SQLER    TO TRUE
120106               END-IF
               WHEN  +100
                     SET   COND-DBSQL-MRNF  TO   TRUE
                     MOVE  "NO DATA FOUND"  TO   XZUGEROR-I-MSG
               WHEN  OTHER
                     IF DBSQL-SQLCODE(4:1) = "9" OR DBSQL-SQLCODE = -805
                         SET  COND-DBSQL-SYSERROR TO TRUE
                     ELSE
                         SET  COND-DBSQL-SQLER    TO TRUE
                     END-IF
           END-EVALUATE

           IF      NOT COND-DBSQL-OK
                   MOVE    ZERO             TO   DBSQL-SELECT-CNT
           END-IF

#DEBUG
#DEBUG     IF      YCFCTLAR-DISP-YN = '1'
#DEBUG        IF   COMM-SQL-II-OUTPT-DSTCD     =    "1" OR "9"
#DEBUG             STRING  'SQL(' DBSQL-PROGRAM-ID ')'
#DEBUG                      DBSQL-FUNCTION
#DEBUG                     "검색건수=" DBSQL-SELECT-CNT
#DEBUG                     "/SQLCODE=" DBSQL-SQLCODE
#DEBUG                     "/결과코드=" DBSQL-STAT  DELIMITED BY SIZE
#DEBUG               INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
#DEBUG             PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
#DEBUG        END-IF
#DEBUG     END-IF

           IF      COND-DBSQL-ABNORMAL OR
                   COND-DBSQL-SYSERROR
                   PERFORM Z9900-SQL-ERROR-MSG-RTN
                      THRU Z9900-SQL-ERROR-MSG-EXT
                   MOVE    DBSQL-SQLCODE     TO  XZUGEROR-I-SQL-CD
                   MOVE    DBSQL-SQLCODE(2:) TO  XZUGEROR-I-ERRCD(4:)
                   MOVE    'D99'             TO  XZUGEROR-I-ERRCD(1:3)
                   MOVE    CO-UKLA0003       TO   XZUGEROR-I-TREAT-CD
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF.
      *
       Z9900-SQLCODE-CHECK-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-PARAM-CHECK-RTN.
      *
#DEBUG     IF      YCFCTLAR-DISP-YN = '1'
#DEBUG       IF    COMM-SQL-II-OUTPT-DSTCD     =    "1" OR "9"
#DEBUG             STRING  "CALLER {"   DBSQL-CALL-PGM-ID
#DEBUG                 "} SQL {"  DBSQL-PROGRAM-ID
#DEBUG                 "} FUNC {" DBSQL-FUNCTION
#DEBUG                 "} ARR {"  DBSQL-ARRAY-CNT
#DEBUG                 "} REQ {"  DBSQL-SELECT-REQ
#DEBUG                 "}"              DELIMITED BY SIZE
#DEBUG               INTO  YCFCTLAR-LOG-CTNT POINTER YCFCTLAR-LOG-PTR
#DEBUG             PERFORM Z9990-USER-LOG-RTN THRU Z9990-USER-LOG-EXT
#DEBUG       END-IF
#DEBUG     END-IF

           IF      DBSQL-SELECT-REQ > DBSQL-ARRAY-CNT
                   MOVE    CO-S9000054      TO  XZUGEROR-I-ERRCD
                   MOVE    CO-UKLA0003      TO  XZUGEROR-I-TREAT-CD
                   MOVE   "DBSQL-SELECT-REQ최대건수 초과"
                                            TO  XZUGEROR-I-MSG
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF.

       Z9900-PARAM-CHECK-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-SQL-ERROR-MSG-RTN.
      *
           IF      NOT (DBSQL-SQLCODE = -805 OR 0)
           CALL    'DSNTIAR'    USING    SQLCA
                                         DBSQLE-MESSAGE
                                         DBSQLE-TEXT-LEN
           END-CALL
           PERFORM VARYING DBSQLE-IDX FROM 1 BY 1
             UNTIL DBSQLE-IDX > 10
                   STRING  DBSQLE-TEXT(DBSQLE-IDX)   DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
           END-PERFORM
           END-IF
           .
       Z9900-SQL-ERROR-MSG-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-DIAG-ERR-RTN.
      *
           MOVE  SQLERRD(3)       TO   DBSQL-SELECT-CNT
           EXEC SQL
                GET DIAGNOSTICS :DBSQLI-DIAG-ERRORS = NUMBER
           END-EXEC
      *
           IF      DBSQLI-DIAG-ERRORS < 1
                   MOVE    DBSQL-SELECT-CNT      TO   SQLERRD(3)
                   MOVE    ZERO                  TO   SQLCODE
                   GO  TO  Z9900-DIAG-ERR-EXT
           END-IF
           MOVE      ZEROS                     TO  DBSQLI-SERCH-SQLCODE
           PERFORM  VARYING DBSQLI-ERROR-CNT FROM 1 BY 1
                      UNTIL DBSQLI-ERROR-CNT > DBSQLI-DIAG-ERRORS
             EXEC SQL
                  GET DIAGNOSTICS CONDITION :DBSQLI-ERROR-CNT
                      :DBSQLI-RETURN-SQLCODE = DB2_RETURNED_SQLCODE,
                      :DBSQLI-MESSAGE-ID     = DB2_MESSAGE_ID,
                      :DBSQLI-MESSAGE-TEXT       = MESSAGE_TEXT,
                      :DBSQLI-ROW-NUMBER     = DB2_ROW_NUMBER
             END-EXEC
             IF  DBSQLI-MESSAGE-ID NOT = SPACE
               IF  DBSQLI-ROW-NUMBER > ZERO
                   MOVE DBSQLI-RETURN-SQLCODE TO   DBSQLI-SERCH-SQLCODE
               END-IF
               MOVE DBSQLI-ERROR-CNT        TO   DI-ERR-CNT
               MOVE DBSQLI-RETURN-SQLCODE   TO   DI-SQL-CODE
               MOVE DBSQLI-ROW-NUMBER       TO   DI-ROW-NUM
               MOVE DBSQLI-MESSAGE-ID       TO   DI-MSG-ID
               MOVE CO-DBSQLE-MSG           TO   YCFCTLAR-LOG-CTNT
               MOVE LENGTH OF CO-DBSQLE-MSG TO   YCFCTLAR-LOG-PTR
               PERFORM Z9990-USER-LOG-RTN   THRU Z9990-USER-LOG-EXT
               MOVE "MSG-TXT="              TO   YCFCTLAR-LOG-CTNT
               MOVE DBSQLI-MSG-TXT          TO   YCFCTLAR-LOG-CTNT(9:)
               ADD  DBSQLI-MSG-LEN  9   GIVING   YCFCTLAR-LOG-PTR
               PERFORM Z9990-USER-LOG-RTN  THRU Z9990-USER-LOG-EXT
             END-IF
      *
           END-PERFORM

      *    SQL ERROR CODE RESET
           MOVE    DBSQL-SELECT-CNT              TO   SQLERRD(3)
           IF      DBSQLI-SERCH-SQLCODE NOT = ZERO
                   SET     COND-DBSQL-SQLER      TO   TRUE
                   MOVE    DBSQL-SQLCODE         TO   SQLCODE
           ELSE
                   MOVE    ZERO                  TO   SQLCODE
           END-IF
           .
       Z9900-DIAG-ERR-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-NOMAL-END-RTN.

           IF      COMM-START-EIO-DSTCD = '9'
                   MOVE '11'                TO   YCFCTLAR-USR-LOG-CD
                   MOVE 999999              TO   YCFCTLAR-LOG-LINE-NO
                   STRING  'PGM END OK :'
                           'STAT=' DBSQL-STAT    DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
           END-IF
           .
       Z9900-NOMAL-END-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-MSG-ERROR-RTN.

           MOVE    CO-STAT-SYSERROR        TO    XZUGEROR-I-STAT
           MOVE    DBSQL-PROGRAM-ID        TO    XZUGEROR-I-PGM-ID
           MOVE    DBSQL-CALL-PGM-ID       TO    XZUGEROR-I-TBL-ID
           MOVE    DBSQL-FUNCTION          TO    XZUGEROR-I-FUNC-CD
           MOVE    'ZUGEROR'               TO    YCFCTLAR-CALL-LOG
           CALL    YCFCTLAR-CALL-LOG    USING    DFHEIBLK
                                                 YCCOMMON-CA
                                                 XZUGEROR-CA
           END-CALL

           IF      COMM-START-EIO-DSTCD = '9'
                   MOVE '11'                TO   YCFCTLAR-USR-LOG-CD
                   MOVE 999999              TO   YCFCTLAR-LOG-LINE-NO
                   STRING  'PGM END OK :'
                           'STAT=' XZUGEROR-I-STAT    DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
           END-IF
           GOBACK.

       Z9900-MSG-ERROR-EXT.
           EXIT.
      ******************************************************************
      **      Q J L 4 1 3 7       P R O G R A M   E N D
      ******************************************************************
