      *=================================================================
      *@업무명    : KLA     (프레임워크)
      *@프로그램명: RJL0071 (DBIO 프로그램)
      *@처리유형  : DBIO
      *@처리개요  : TABLE의 등록, 수정, 삭제, 조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 :일자  : 변　경　내　용
      * -------:--------:----------------------------------------------
      *큐로컴:20080401:커스터마이징
      *지봉래:20100701:PK SELECT_CURSOR CLOSE 기능추가
      *지봉래:20100705:PK SELECT_CURSOR OPEN 중복처리방법기능추가
      *지봉래:20100723:LKUPDT 기능추가
      *이용희:20101202:그룹회사코드인스턴스BICOM-GROUP-CO-CD로CHK
      *송재복:20110830:BATCH UPDATE DELETE 로그FILE저장
      *송재복:20111101: DBIO SQLIO 최적화
      *송재복:20120104: 에러 수정
120503*백재용:20120430: CHECK GROUP-CO-CD WHEN INS OR UPT
      *백재용:20120503: ADD PK CHECK  AND MASTER VER UP(@R-M02)
      *송재복:20120801: SET SAVE-PK FOR LOCK-SELECT    (@R-M03)
      *=================================================================
      ******************************************************************
      **  TABLE-ID         : 테이블명                           : CRUD
      **  ---------  ---------------------------------------------------
      **  THKJL0071 :(신용공여관련기관정보)
      ******************************************************************
       IDENTIFICATION                       DIVISION.
      ******************************************************************
       PROGRAM-ID.                          RJL0071.
       AUTHOR.                              KB.
       INSTALLATION.                        KB.
       DATE-WRITTEN.                        2012-09-25-15.44.37.191531.
       SECURITY.
      ******************************************************************
       ENVIRONMENT                          DIVISION.
      ******************************************************************
      *=================================================================
       CONFIGURATION                        SECTION.
      *=================================================================
       SOURCE-COMPUTER.                     IBM.
       OBJECT-COMPUTER.                     IBM.
      *
      ******************************************************************
       DATA                                 DIVISION.
      ******************************************************************
      *=================================================================
       WORKING-STORAGE                      SECTION.
      *=================================================================
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-S9000001             PIC  X(008) VALUE 'S9000001'.
           03  CO-S9000002             PIC  X(008) VALUE 'S9000002'.
           03  CO-S9000003             PIC  X(008) VALUE 'S9000003'.
           03  CO-S9000004             PIC  X(008) VALUE 'S9000004'.
           03  CO-S9000005             PIC  X(008) VALUE 'S9000005'.
           03  CO-S9000006             PIC  X(008) VALUE 'S9000006'.
           03  CO-S9000007             PIC  X(008) VALUE 'S9000007'.
           03  CO-S9000008             PIC  X(008) VALUE 'S9000008'.
           03  CO-S9000020             PIC  X(008) VALUE 'S9000020'.
           03  CO-S9000099             PIC  X(008) VALUE 'S9000099'.
           03  CO-S9100197             PIC  X(008) VALUE 'S9100197'.
           03  CO-UKLA0012             PIC  X(008) VALUE 'UKLA0012'.
           03  CO-UKLA0002             PIC  X(008) VALUE 'UKLA0002'.

      *-----------------------------------------------------------------
      *  상수영역.
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-MASTER-VER           PIC  X(007) VALUE "@R-M03@".
           03  CO-TABLE-NM             PIC  X(009) VALUE "THKJL0071".
           03  CO-YES                  PIC  X(001) VALUE "1".
           03  CO-NO                   PIC  X(001) VALUE "0".
           03  CO-STAT-OK              PIC  X(002) VALUE "00".
           03  CO-STAT-DUPM            PIC  X(002) VALUE "01".
           03  CO-STAT-NOTFOUND        PIC  X(002) VALUE "02".
           03  CO-STAT-ERROR           PIC  X(002) VALUE "09".
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE "98".
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE "99".
           03  CO-QUOTA                PIC  X(001) VALUE "'".
           03  CO-PK                   PIC  X(002) VALUE "PK".
           03  CO-DAY                  PIC  X(001) VALUE "D".
           03  CO-TEMP                 PIC  X(001) VALUE "T".
           03  CO-STOP                 PIC  X(001) VALUE "S".
      *
       01  DOC-KEY.
           03 DOC-PK0-R.
              05 PIC X(27) VALUE  'PK0.GROUP-CO-CD           ='.
              05 PIC X(27) VALUE  'PK0.BASE-YM               ='.
              05 PIC X(27) VALUE  'PK0.GRNTY-INSTI-NO        ='.
              05 PIC X(27) VALUE  'PK0.T-E-GRNTY-INSTI-CD    ='.
           03 DOC-PK0 REDEFINES DOC-PK0-R OCCURS 04 TIMES PIC X(27).

      *
       01  CVT-KEY.
           03 CVT-PK0.
           05 GROUP-CO-CD                    PIC  X(00003).
           05 BASE-YM                        PIC  X(00006).
           05 GRNTY-INSTI-NO                 PIC  X(00013).
           05 T-E-GRNTY-INSTI-CD             PIC  X(00003).

      *
      *-----------------------------------------------------------------
      *  변수영역
      *-----------------------------------------------------------------
      * LOCK SELECT 정상처리후 PK SAVE 영역
       01  EXTERNAL-RJL0071 EXTERNAL.
           03  SAVE-PK                 PIC  X(150).
           03  SAVE-GUID               PIC  X(036).
      *
       01 WK-AREA.
           03  WK-ERR-SET-YN           PIC  X(001).
           03  WK-QUOTA-CNT            PIC  9(005).
           03  WK-IN-LAST-PRCSS-YMS    PIC  X(020).
           03  WK-IN-LAST-UNO          PIC  X(007).
     *
           03  WK-APPL-ID              PIC  X(02).
           03  WK-DBIO-ID              PIC  X(02).
           03  WK-BEFOR-SELECT-YN      PIC  X(01).
           03  WK-LKSEL-CLOSE-YN       PIC  X(01).

           03  WK-ACCECODE             PIC  X(004).
           03  WK-ACCESS-COND          PIC S9(001) USAGE COMP.
      *-----------------------------------------------------------------
      *  인터페이스영역
      *-----------------------------------------------------------------
      *--  SQL ERROR WORK
       77  ERROR-TEXT-LEN              PIC S9(009) COMP VALUE +72.
       01  ERROR-MESSAGE.
           03  ERROR-LEN               PIC S9(004) COMP VALUE +720.
           03  ERROR-TEXT              PIC  X(072) OCCURS 10 TIMES
                                       INDEXED BY ERR-IDX.
      *--  24*365 LOG
       01  XZSFDBLG-CA.
           COPY  XZSFDBLG.

      *--  BATCH CUD FILE WRITE
       01  XZSFDBUD-CA.
           COPY  XZSFDBUD.



      *-----------------------------------------------------------------
      *  테이블(호스트변수)영역
      *-----------------------------------------------------------------
           EXEC SQL INCLUDE SQLCA                   END-EXEC.
      *
       01 WK-COND-DESC-AREA.
           03 WK-COND-DESC                   PIC  X(2000).

      *    직전 자료 SELECT 용
       01  OLD-REC.
           03 GROUP-CO-CD                    PIC  X(00003).
           03 BASE-YM                        PIC  X(00006).
           03 GRNTY-INSTI-NO                 PIC  X(00013).
           03 T-E-GRNTY-INSTI-CD             PIC  X(00003).
           03 GRNTY-INSTI-NAME               PIC  X(00052).
           03 NEW-SI-CLSFI-CD                PIC  X(00005).
           03 NATNL-CD                       PIC  X(00003).
           03 GRCR-RISK-WGHT                 PIC S9(00003) COMP-3.
           03 GRCR-INSTI-DSTCD               PIC  X(00001).
           03 GRNTY-I-CUST-IDNFR             PIC  X(00010).
           03 SYS-LAST-PRCSS-YMS             PIC  X(00020).
           03 SYS-LAST-UNO                   PIC  X(00007).
      *
       01 WK-CORR-AREA REDEFINES OLD-REC.
           03 WK-CORRECTION                  PIC  X(30000).
      *
      *ACCESSKEY HOST영역
       01  TBL-KEY.
           03 PK0.
           05 GROUP-CO-CD                    PIC  X(00003).
           05 BASE-YM                        PIC  X(00006).
           05 GRNTY-INSTI-NO                 PIC  X(00013).
           05 T-E-GRNTY-INSTI-CD             PIC  X(00003).


           EXEC SQL
           DECLARE SELECT_CURSOR           CURSOR FOR
           SELECT
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

             FROM THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" =  :PK0.T-E-GRNTY-INSTI-CD

            FOR UPDATE OF
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

           END-EXEC

      *=================================================================
       LINKAGE                              SECTION.
      *=================================================================
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *
      *-----------------------------------------------------------------
      *  DBIO 변수영역
      *-----------------------------------------------------------------
           COPY  YCDBIOCA.
      *테이블컬럼나열
       01  DBIO-REC.
           03 GROUP-CO-CD                    PIC  X(00003).
           03 BASE-YM                        PIC  X(00006).
           03 GRNTY-INSTI-NO                 PIC  X(00013).
           03 T-E-GRNTY-INSTI-CD             PIC  X(00003).
           03 GRNTY-INSTI-NAME               PIC  X(00052).
           03 NEW-SI-CLSFI-CD                PIC  X(00005).
           03 NATNL-CD                       PIC  X(00003).
           03 GRCR-RISK-WGHT                 PIC S9(00003) COMP-3.
           03 GRCR-INSTI-DSTCD               PIC  X(00001).
           03 GRNTY-I-CUST-IDNFR             PIC  X(00010).
           03 SYS-LAST-PRCSS-YMS             PIC  X(00020).
           03 SYS-LAST-UNO                   PIC  X(00007).
      *
      *
           REPLACE   ==(COM)== BY ==COM==.
       01  YCCSICOM-CA.
           COPY    YCCSICOM.
       01  YCCBICOM-CA.
           COPY    YCCBICOM.
           REPLACE OFF.

      *I/O데이터HOST영역
       01  TBL-REC.
           03 GROUP-CO-CD                    PIC  X(00003).
           03 BASE-YM                        PIC  X(00006).
           03 GRNTY-INSTI-NO                 PIC  X(00013).
           03 T-E-GRNTY-INSTI-CD             PIC  X(00003).
           03 GRNTY-INSTI-NAME               PIC  X(00052).
           03 NEW-SI-CLSFI-CD                PIC  X(00005).
           03 NATNL-CD                       PIC  X(00003).
           03 GRCR-RISK-WGHT                 PIC S9(00003) COMP-3.
           03 GRCR-INSTI-DSTCD               PIC  X(00001).
           03 GRNTY-I-CUST-IDNFR             PIC  X(00010).
           03 SYS-LAST-PRCSS-YMS             PIC  X(00020).
           03 SYS-LAST-UNO                   PIC  X(00007).
      *

      ******************************************************************
       PROCEDURE                           DIVISION
                                           USING     YCCOMMON-CA
                                                     YCDBIOCA-CA
                                                     DBIO-REC.
      ******************************************************************
      *
       S0000-START-RTN.

           SET     ADDRESS OF YCCSICOM-CA  TO  COMM-SICOM-ADDR
           SET     ADDRESS OF YCCBICOM-CA  TO  COMM-BICOM-ADDR
           SET     ADDRESS OF TBL-REC      TO  ADDRESS OF DBIO-REC
           PERFORM S0000-MAIN-RTN        THRU  S0000-MAIN-EXT
           .
       S0000-START-EXT.
           EXIT.

       S0000-MAIN-RTN.
      *
           MOVE  "13"                       TO   YCFCTLAR-USR-LOG-CD
           PERFORM S0100-INITIAL-RTN      THRU   S0100-INITIAL-EXT
      *
      * DBIO-FUNCTION OF DBIOCA
             EVALUATE  TRUE
                 WHEN  COND-DBIO-SELECT
                       PERFORM S1000-SELECT-RTN
                          THRU S1000-SELECT-EXT
      *
                 WHEN  COND-DBIO-UPDATE
                       PERFORM S4000-UPDATE-RTN
                          THRU S4000-UPDATE-EXT
      *
                 WHEN  COND-DBIO-SELFST
                       PERFORM S2000-SELFST-RTN
                          THRU S2000-SELFST-EXT
      *
                 WHEN  COND-DBIO-INSERT
                       PERFORM S3000-INSERT-RTN
                          THRU S3000-INSERT-EXT
      *
                 WHEN  COND-DBIO-LKUPDT
                       PERFORM S5000-LKUPDT-RTN
                          THRU S5000-LKUPDT-EXT
      *
                 WHEN  COND-DBIO-DELETE
                 WHEN  COND-DBIO-DELFRC
                       PERFORM S6000-DELETE-RTN
                          THRU S6000-DELETE-EXT
      *
                 WHEN  COND-DBIO-OPEN
                       PERFORM S7100-OPEN-RTN
                          THRU S7100-OPEN-EXT
      *
                 WHEN  COND-DBIO-FETCH
                       PERFORM S7200-FETCH-RTN
                          THRU S7200-FETCH-EXT
      *
                 WHEN  COND-DBIO-CLOSE
                       PERFORM S7300-CLOSE-RTN
                          THRU S7300-CLOSE-EXT
      *
                 WHEN  OTHER
                       #ERROR CO-S9000001 CO-UKLA0002  CO-STAT-SYSERROR
             END-EVALUATE
      *
           PERFORM S9000-NOMAL-END-RTN
              THRU S9000-NOMAL-END-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : 프로그램 시작전 기본설정 및 초기화
      *  처리기능 : 프로그램초기화
      *-----------------------------------------------------------------
       S0100-INITIAL-RTN.
      *
           INITIALIZE                            SQLCA
           INITIALIZE                            DBIO-OUT
                                                 DBIO-RESULT
                                                 XZUGEROR-CA

           INITIALIZE                            WK-AREA
                                                 TBL-KEY
      *
           PERFORM S0110-INITIALIZE-RTN    THRU S0110-INITIALIZE-EXT
      *
           PERFORM S0120-PRIVS-RTN         THRU S0120-PRIVS-EXT
           PERFORM S0130-KEYVALUE-MOVE-RTN THRU S0130-KEYVALUE-MOVE-EXT
           PERFORM S0140-USID-INFO-SET-RTN THRU S0140-USID-INFO-SET-EXT
           PERFORM S0150-CHECK-RTN         THRU S0150-CHECK-EXT
           .
       S0100-INITIAL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *  수행조건 : 프로그램 시작전 기본설정 및 초기화
      *  처리기능 : 프로그램 변수 초기화
      *-----------------------------------------------------------------
       S0110-INITIALIZE-RTN.
      *
#DEBUG     IF  COMM-DB-II-OUTPT-DSTCD            =    "1" OR "9"
#DEBUG         #USRLOG            CO-MASTER-VER    "/"
#DEBUG                            DBIO-CALL-PGM-ID "/"
#DEBUG                            DBIO-FUNCTION    "/"
#DEBUG                            DBIO-ACCESS-KEY  "/"
#DEBUG                            DBIO-LOCK-YN     "/"
#DEBUG                            DBIO-ACCESS-COND "/"
#DEBUG                            SICOM-OPER-DSTCD "/"
#DEBUG
#DEBUG     END-IF

           MOVE  YCFCTLAR-PGM-ID            TO   DBIO-PROGRAM-ID
           MOVE  CO-STAT-ABNORMAL           TO   DBIO-STAT
      *
           MOVE  CO-TABLE-NM                TO   DBIO-TABLE-NM

           MOVE  DBIO-ACCESS-KEY            TO   WK-ACCECODE
           MOVE  DBIO-ACCESS-COND           TO   WK-ACCESS-COND

           .
       S0110-INITIALIZE-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : 프로그램 시작전 업무팀의 사용권한 검증
      *  처리기능 : 호출 프로그램명 입력검증 및 프로그램
      *             사용권한
      *-----------------------------------------------------------------
       S0120-PRIVS-RTN.
      *
           IF      DBIO-CALL-PGM-ID(1:1)    =   "Z"
                   GO  TO  S0120-PRIVS-EXT
           END-IF
      *
           MOVE    DBIO-CALL-PGM-ID(2:2)      TO  WK-APPL-ID
           MOVE    YCFCTLAR-PGM-ID(2:2)       TO  WK-DBIO-ID
      *
           IF      WK-APPL-ID     NOT = WK-DBIO-ID
                   STRING  "(" WK-APPL-ID ")업무는 (" WK-DBIO-ID
                           ")DBIO를 사용할 권한이 없습니다"
                           DELIMITED BY SIZE INTO  XZUGEROR-I-MSG
                   #ERROR CO-S9000020 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
           .
       S0120-PRIVS-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIOCA를통해받은DBIO-키를각가의해당키로MOVE
      *  처리기능 : DBIO-ACCESS-KEY에따라분기하여KEYVALUE를MOVE
      *-----------------------------------------------------------------
       S0130-KEYVALUE-MOVE-RTN.
      *   KEY
           EVALUATE TRUE
             WHEN  COND-DBIO-FETCH   OR  COND-DBIO-CLOSE
                   GO  TO  S0130-KEYVALUE-MOVE-EXT
      *      레코드값으로  PK생성
             WHEN  COND-DBIO-INSERT  OR  COND-DBIO-LKUPDT
                   MOVE  CORR DBIO-REC    TO  PK0
                   MOVE  PK0              TO  DBIO-KEY
           END-EVALUATE
      *
           MOVE  DBIO-KEY         TO  PK0
           MOVE  CORR PK0         TO  DBIO-REC


#DEBUG     IF      COMM-DB-II-OUTPT-DSTCD       =    "1" OR "9"
#DEBUG        IF   YCFCTLAR-DISP-YN = CO-YES
#DEBUG             PERFORM S0131-KEYVALUE-DISP-RTN
#DEBUG                THRU S0131-KEYVALUE-DISP-EXT
#DEBUG        END-IF
#DEBUG     END-IF
120503*20120430 CHECK GROUP-CO-CD WHEN INS OR UPT
120503*    IF  COND-DBIO-INSERT  OR  COND-DBIO-LKUPDT
             IF   GROUP-CO-CD OF DBIO-REC NOT = BICOM-GROUP-CO-CD
120503            AND COND-DBIO-PK
                     #ERROR  CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
             END-IF
120503*    END-IF

           .
       S0130-KEYVALUE-MOVE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : DBIOCA를통해받은DBIO-키중접근조건범위에해
      *             필드의 값을 찾아서 MOVE
      *  처리기능 : DBIO-ACCESS-KEY에따라 KEY VALUE를 MOVE
      *-----------------------------------------------------------------
#DEBUG S0131-KEYVALUE-DISP-RTN.
#DEBUG*
#DEBUG     EVALUATE  TRUE
#DEBUG       WHEN  COND-DBIO-PK
#DEBUG           MOVE  CORR PK0    TO CVT-PK0
#DEBUG           MOVE  DOC-PK0(01) TO YCFCTLAR-LOG-CTNT(1:27)
#DEBUG           MOVE  GROUP-CO-CD OF CVT-PK0
#DEBUG                             TO YCFCTLAR-LOG-CTNT(28:)
#DEBUG           MOVE  00031       TO YCFCTLAR-LOG-PTR
#DEBUG           PERFORM Z9990-USER-LOG-RTN THRU Z9990-USER-LOG-EXT
#DEBUG           MOVE  DOC-PK0(02) TO YCFCTLAR-LOG-CTNT(1:27)
#DEBUG           MOVE  BASE-YM OF CVT-PK0
#DEBUG                             TO YCFCTLAR-LOG-CTNT(28:)
#DEBUG           MOVE  00034       TO YCFCTLAR-LOG-PTR
#DEBUG           PERFORM Z9990-USER-LOG-RTN THRU Z9990-USER-LOG-EXT
#DEBUG           MOVE  DOC-PK0(03) TO YCFCTLAR-LOG-CTNT(1:27)
#DEBUG           MOVE  GRNTY-INSTI-NO OF CVT-PK0
#DEBUG                             TO YCFCTLAR-LOG-CTNT(28:)
#DEBUG           MOVE  00041       TO YCFCTLAR-LOG-PTR
#DEBUG           PERFORM Z9990-USER-LOG-RTN THRU Z9990-USER-LOG-EXT
#DEBUG           MOVE  DOC-PK0(04) TO YCFCTLAR-LOG-CTNT(1:27)
#DEBUG           MOVE  T-E-GRNTY-INSTI-CD OF CVT-PK0
#DEBUG                             TO YCFCTLAR-LOG-CTNT(28:)
#DEBUG           MOVE  00031       TO YCFCTLAR-LOG-PTR
#DEBUG           PERFORM Z9990-USER-LOG-RTN THRU Z9990-USER-LOG-EXT
#DEBUG     END-EVALUATE

#DEBUG     .
#DEBUG S0131-KEYVALUE-DISP-EXT.
#DEBUG     EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : 프로그램 시작전 기본설정 및 초기화
      *  처리기능 : 사용자정보 변수 SET
      *-----------------------------------------------------------------
       S0140-USID-INFO-SET-RTN.
      *
           IF      COND-DBIO-UPDATE
                OR COND-DBIO-INSERT OR COND-DBIO-LKUPDT
                OR COND-DBIO-DELETE OR COND-DBIO-DELFRC
                   MOVE  SYS-LAST-PRCSS-YMS OF DBIO-REC
                                            TO   WK-IN-LAST-PRCSS-YMS
                   MOVE  SYS-LAST-UNO       OF DBIO-REC
                                            TO   WK-IN-LAST-UNO
           ELSE
                   GO  TO  S0140-USID-INFO-SET-EXT
           END-IF

      *-----------------------------------------------------------------
      *    이하 프로그램은
      *    호출한 프로그램에서SET된
      *    SYS-LAST-PRCSS-YMS, SYS-LAST-UNO를
      *    변경하지 않고 INSERT를 처리한다
      *-----------------------------------------------------------------
      *-- ZBD0500 : 배치원장 복원작업
      *-- ZBD0510 : 배치원장 반영작업
      *-- ZBD0550 : 계획정지후 본원장반영작업(업무별)
      *-- ZBD0560 : 계획정지후 본원장반영작업(테이블별)
      *---ZXXXXXX : 비상 예비용
           IF      DBIO-CALL-PGM-ID = "ZBD0500" OR "ZBD0510" OR
                                      "ZBD0550" OR "ZBD0560" OR
                                      "ZXXXXXX"
                   CONTINUE
           ELSE
             IF    COND-DBIO-UPDATE
                OR COND-DBIO-INSERT  OR COND-DBIO-LKUPDT
                   MOVE    BICOM-TRAN-START-YMS
                     TO    SYS-LAST-PRCSS-YMS OF DBIO-REC
                   MOVE    BICOM-USER-EMPID
                     TO    SYS-LAST-UNO       OF DBIO-REC
             END-IF
           END-IF
           .
       S0140-USID-INFO-SET-EXT.
           EXIT.
      *
      *
      *-----------------------------------------------------------------
      *  수행조건 : 입력정보 및 기본정보 검증
      *  처리기능 : 기본항목검증
      *-----------------------------------------------------------------
       S0150-CHECK-RTN.
      *
      *
           EVALUATE  TRUE
             WHEN  NOT (SICOM-OPER-DSTCD = CO-TEMP OR CO-DAY OR CO-STOP)
                   STRING "정의되지 않은 거래모드입니다.("
                          "거래모드구분=" SICOM-OPER-DSTCD ")"
                          DELIMITED BY SIZE INTO  XZUGEROR-I-MSG
                   #ERROR  CO-S9000002 CO-UKLA0002 CO-STAT-SYSERROR
             WHEN  BICOM-TRAN-START-YMS = SPACE
                   MOVE   "BICOM-TRAN-START-YMS 미입력"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
             WHEN  BICOM-USER-EMPID     = SPACE
                   MOVE   "BICOM-USER-EMPID 미입력"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
           END-EVALUATE

      * DBIO-FUNCTION 코드 정합성 검증
           IF      COND-DBIO-SELECT  OR  COND-DBIO-UPDATE
               OR  COND-DBIO-INSERT
               OR  COND-DBIO-DELETE  OR  COND-DBIO-DELFRC
               OR  COND-DBIO-SELFST  OR  COND-DBIO-LKUPDT
               OR  COND-DBIO-OPEN    OR  COND-DBIO-FETCH
               OR  COND-DBIO-CLOSE
                   CONTINUE
           ELSE
                   MOVE    "DBIO-FUNCTION코드 오류입니다."
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000001 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF

           IF      COND-DBIO-FETCH   OR  COND-DBIO-CLOSE
                   CONTINUE
           ELSE
               IF  DBIO-KEY                 =    SPACE
      *{E} DBIO-KEY 미입력 오류입니다.
                   MOVE    "DBIO-KEY 미입력 오류입니다."
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000003 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
           END-IF
      *
      * DBIO-ACCESS-KEY 정합성 검증
           IF      COND-DBIO-PK

                   CONTINUE
           ELSE
                   MOVE    "DBIO입력항목 검증오류입니다(ACCESS-KEY)"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000004 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
      *
      * DBIO-ACCESS-COND 정합성 검증
           IF  COND-DBIO-0  OR  COND-DBIO-1  OR
               COND-DBIO-2  OR  COND-DBIO-3  OR
               COND-DBIO-4
               IF  COND-DBIO-SELFST  OR COND-DBIO-OPEN    OR
                   COND-DBIO-FETCH

      *PK의SELECT_CURSOR를CLOSE하기위해COND-DBIO-0를사용함
                   IF  COND-DBIO-0
                       MOVE    "DBIO-ACCESS-COND 오류입니다"
                                            TO   XZUGEROR-I-MSG
                       #ERROR  CO-S9000005 CO-UKLA0002 CO-STAT-SYSERROR
                   END-IF
               END-IF
           ELSE
               IF  COND-DBIO-SELECT  OR COND-DBIO-INSERT  OR
                   COND-DBIO-UPDATE  OR COND-DBIO-LKUPDT  OR
                   COND-DBIO-DELETE  OR COND-DBIO-DELFRC
                   CONTINUE
               ELSE
                   MOVE    "DBIO-ACCESS-COND 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000005 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
           END-IF
      *
      * DBIO-LOCK-YN 정합성검증
           IF      COND-DBIO-LOCK      OR
                   COND-DBIO-UNLOCK
                   CONTINUE
           ELSE
                   MOVE   "DBIO-LOCK-YN(조건) 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000006 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
      *
           IF      COND-DBIO-LOCK AND
                   DBIO-ACCESS-KEY(1:2)  NOT =  CO-PK
                   MOVE   "DBIO-LOCK-YN(조건) 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000006 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
      *
      * 입력값의 조합검증
           IF      DBIO-ACCESS-KEY(1:2)     NOT =  CO-PK
             IF    COND-DBIO-UPDATE
                OR COND-DBIO-INSERT
                OR COND-DBIO-DELETE
                OR COND-DBIO-DELFRC
                   MOVE
                     "DBIO-FUNCTION 또는 DBIO-ACCESS-KEY 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000007 CO-UKLA0002 CO-STAT-SYSERROR
             END-IF
           END-IF
      *
           IF      COND-DBIO-DELETE OR COND-DBIO-DELFRC
               IF  NOT COND-DBIO-LOCK
                   MOVE "DBIO-LOCK-YN(조건) 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000006 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
           ELSE
             IF    COND-DBIO-LOCK
               IF  COND-DBIO-OPEN       OR
                   COND-DBIO-FETCH      OR
                   COND-DBIO-SELFST
                   MOVE "DBIO-LOCK-YN(조건) 오류입니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR  CO-S9000006 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
             END-IF
           END-IF
      *
           IF      COND-DBIO-FETCH OR COND-DBIO-CLOSE
                   GO   TO S0150-CHECK-EXT
           END-IF

           PERFORM S0151-IN-CHECK-RTN
              THRU S0151-IN-CHECK-EXT
           .
       S0150-CHECK-EXT.
           EXIT.

      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-키 값 검증
      *  처리기능 : DBIO-키 값에 NULL 입력시 에러처리
      *-----------------------------------------------------------------
       S0151-IN-CHECK-RTN.

           EVALUATE  TRUE
             WHEN  COND-DBIO-PK
                   EVALUATE  TRUE
                     WHEN  GROUP-CO-CD OF PK0 = SPACE
                           MOVE DOC-PK0(01) TO   XZUGEROR-I-MSG
                     WHEN  BASE-YM OF PK0 = SPACE
                           MOVE DOC-PK0(02) TO   XZUGEROR-I-MSG
                     WHEN  GRNTY-INSTI-NO OF PK0 = SPACE
                           MOVE DOC-PK0(03) TO   XZUGEROR-I-MSG
                     WHEN  T-E-GRNTY-INSTI-CD OF PK0 = SPACE
                           MOVE DOC-PK0(04) TO   XZUGEROR-I-MSG
                     WHEN  1 < DBIO-ACCESS-COND
                           MOVE '1 < DBIO-ACCESS-COND오류입니다.'
                                            TO XZUGEROR-I-MSG
                   END-EVALUATE
           END-EVALUATE
      *


           IF      XZUGEROR-I-MSG NOT = SPACE
             IF    XZUGEROR-I-MSG(2:1) = 'K'
                   MOVE    SPACE                TO   XZUGEROR-I-MSG(35:)
                   #ERROR  CO-S9000003 CO-UKLA0002 CO-STAT-SYSERROR
             ELSE
                   #ERROR  CO-S9000005 CO-UKLA0002 CO-STAT-SYSERROR
             END-IF
           END-IF
           .
       S0151-IN-CHECK-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 SELECT일때 실행된다.
      *  처리기능 : DBIO-ACCESS-KEY와 DBIO-LOCK-YN에따라
      *             다른 조건으로 SELECT를 한다.
      *-----------------------------------------------------------------
       S1000-SELECT-RTN.
      *
           INITIALIZE         TBL-REC
           IF      COND-DBIO-LOCK
               IF  DBIO-KEY       = SAVE-PK
               AND BICOM-GU-ID-NO = SAVE-GUID
                   PERFORM S8720-SELECT0-RTN
                      THRU S8720-SELECT0-EXT
               ELSE
                   PERFORM S8710-SEL-LOCK-RTN
                      THRU S8710-SEL-LOCK-EXT
               END-IF
           ELSE
                   PERFORM S8720-SELECT0-RTN THRU S8720-SELECT0-EXT
           END-IF

           IF      SQLCODE                   NOT =    ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF

120104     MOVE  SYS-LAST-PRCSS-YMS  OF  TBL-REC
120104       TO  DBIO-LAST-PRCSS-YMS
120104     MOVE  SYS-LAST-UNO        OF  TBL-REC
120104       TO  DBIO-LAST-UNO
           .
       S1000-SELECT-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION이 SELFST 일때 실행한다
      *  처리기능 : 조건에 해당하는 첫번째 ROW를 RETURN 한다
      *-----------------------------------------------------------------
       S2000-SELFST-RTN.
      *
           INITIALIZE         TBL-REC

           PERFORM S8740-SEL-FIRST0-RTN THRU S8740-SEL-FIRST0-EXT

           IF      SQLCODE                   NOT =    ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S2000-SELFST-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 INSERT 일때 실행된다.
      *  처리기능 : ST-BI거래모드구분에따라 분기하여 실행한다.
      *-----------------------------------------------------------------
       S3000-INSERT-RTN.
      *
110830*    직전 정보를 읽을필요없음
110830     MOVE     CO-YES                TO    WK-BEFOR-SELECT-YN
110830     PERFORM S8850-BATCH-IUD-WRITE-RTN
110830        THRU S8850-BATCH-IUD-WRITE-EXT
      *
           PERFORM S8400-INSERT-RTN
              THRU S8400-INSERT-EXT
      *
           IF       SQLCODE                       =   ZERO
      * 24-365 거래
               IF (SICOM-OPER-DSTCD          =   CO-TEMP OR CO-STOP)

                   MOVE    TBL-REC          TO    OLD-REC
                   PERFORM S8800-IMAGE-INSERT-RTN
                      THRU S8800-IMAGE-INSERT-EXT
               END-IF
           ELSE
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S3000-INSERT-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 UPDATE 일때 실행된다.
      *  처리기능 : ST-BI거래모드구분에따라 분기하여 실행한다.
      *-----------------------------------------------------------------
       S4000-UPDATE-RTN.
      *
      *
           PERFORM S7500-BEFOR-CHECK-RTN
              THRU S7500-BEFOR-CHECK-EXT
      *
           PERFORM S8500-UPDATE-RTN
              THRU S8500-UPDATE-EXT

           IF      SQLCODE  NOT =    ZERO
                   MOVE  CO-YES             TO    WK-LKSEL-CLOSE-YN
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           ELSE
                   PERFORM S8711-LKSEL-CLOSE-RTN
                      THRU S8711-LKSEL-CLOSE-EXT
           END-IF

           .
       S4000-UPDATE-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION구분이LOCK-UPDATE(LKUPDT)일때
      *  처리기능 : UPDATE하기전읽은DATA와UPATE하기위해읽은
      *             DATA의최종갱신일을비교하여같지않으면오류
      *             처리하고같으면실행한다.
      *-----------------------------------------------------------------
       S5000-LKUPDT-RTN.
      *
      *
           IF      DBIO-KEY       = SAVE-PK
               AND BICOM-GU-ID-NO = SAVE-GUID
                   PERFORM S7400-BEFOR-SEL-RTN
                      THRU S7400-BEFOR-SEL-EXT
           ELSE
                 SET  ADDRESS OF TBL-REC      TO   ADDRESS OF OLD-REC
                 INITIALIZE TBL-REC
                 PERFORM S8710-SEL-LOCK-RTN
                    THRU S8710-SEL-LOCK-EXT
                 SET  ADDRESS OF TBL-REC      TO   ADDRESS OF DBIO-REC
           END-IF

      *    직전 정보를 읽음
           MOVE     CO-YES                TO    WK-BEFOR-SELECT-YN

           PERFORM S4000-UPDATE-RTN
              THRU S4000-UPDATE-EXT

           .
       S5000-LKUPDT-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 DELETE 일때 실행된다.
      *  처리기능 : DBIO-ACCESS-KEY와 DBIO-LOCK-YN에따라
      *             실행 또는 오류 처리 한다.
      *-----------------------------------------------------------------
       S6000-DELETE-RTN.
      *
           IF      COMM-DELETE-LOG-YN  = "1"
              IF   SICOM-OPER-DSTCD             =    CO-DAY
                   PERFORM S7400-BEFOR-SEL-RTN
                      THRU S7400-BEFOR-SEL-EXT
              END-IF
           END-IF

           PERFORM S7500-BEFOR-CHECK-RTN
              THRU S7500-BEFOR-CHECK-EXT

      *    삭제전 내용 로그생성
           IF      COMM-DELETE-LOG-YN  = "1"
                   MOVE  LENGTH OF DBIO-REC      TO   DBIO-TABLE-LEN
             IF    DBIO-TABLE-LEN < LENGTH OF WK-CORRECTION
                   MOVE  SPACE TO  WK-CORRECTION(DBIO-TABLE-LEN + 1:)
             END-IF
      *
             EXEC SQL
                   INSERT INTO        THKLA9020  (
                          "그룹회사코드",
                          "처리일",
                          "테이블명",
                          "처리키명",
                          "처리시각",
                          "처리키길이",
                          "처리데이터길이",
                          "처리데이터내용",
                          "시스템최종처리일시",
                          "시스템최종사용자번호"
                              )
                   VALUES     (
                         :BICOM-GROUP-CO-CD,
                         :BICOM-TRAN-BASE-YMD,
                         :DBIO-TABLE-NM,
                         :DBIO-KEY,
                         :BICOM-TRAN-BASE-HMS,
                          LENGTH(:DBIO-KEY),
                         :DBIO-TABLE-LEN,
                          RTRIM(:WK-CORRECTION),
                         :BICOM-TRAN-START-YMS,
                         :BICOM-USER-EMPID
                              )
             END-EXEC
             IF    SQLCODE                NOT =    ZERO
                   MOVE    "S6000:S6000-DELETE-RTN(INSERT THKLA9020)"
                                            TO    XZUGEROR-I-MSG
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
             END-IF
           END-IF

           EXEC SQL
           DELETE
             FROM THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" =  :PK0.T-E-GRNTY-INSTI-CD

           END-EXEC
      *
           IF      SQLCODE NOT  =    ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S6000-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 OPEN 일때 실행된다.
      *  처리기능 : CURSOR를 생성하고 OPEN하는 RTN으로 분기.
      *-----------------------------------------------------------------
       S7100-OPEN-RTN.
      *
      *
           PERFORM S8100-DECLARE-RTN
              THRU S8100-DECLARE-EXT

           IF      SQLCODE NOT = ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S7100-OPEN-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 FETCH 일때 실행된다.
      *  처리기능 : DATA를 FETCH 하는 RTN으로 분기한다.
      *-----------------------------------------------------------------
       S7200-FETCH-RTN.
      *
      *
           PERFORM S8200-FETCH-RTN
              THRU S8200-FETCH-EXT

           IF      SQLCODE NOT = ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S7200-FETCH-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 CLOSE 일때 실행된다.
      *  처리기능 : CURSOR를 CLOSE 하는 RTN으로 분기한다.
      *-----------------------------------------------------------------
       S7300-CLOSE-RTN.
      *
           PERFORM S8300-CLOSE-RTN
              THRU S8300-CLOSE-EXT

           IF      SQLCODE NOT = ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
           .
       S7300-CLOSE-EXT.
           EXIT.
      *
      *
      *-----------------------------------------------------------------
      *  수행조건 :  UPDATE, DELETE, LKUPDT, DELFRC시　
      *  처리기능 : 테이블의　직전정보를　NOLOCK으로　읽는다
      *-----------------------------------------------------------------
       S7400-BEFOR-SEL-RTN.

           IF    WK-BEFOR-SELECT-YN NOT = CO-YES
                 SET  ADDRESS OF TBL-REC      TO   ADDRESS OF OLD-REC
                 INITIALIZE TBL-REC
                 PERFORM S8720-SELECT0-RTN
                    THRU S8720-SELECT0-EXT
                 MOVE CO-YES               TO  WK-BEFOR-SELECT-YN
                 IF  SQLCODE           NOT =    ZERO
                     MOVE   "S8700:S8720-S8720-SELECT0-RTN"
                                              TO    XZUGEROR-I-MSG
                     MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                     MOVE  #SLINE             TO    XZUGEROR-I-LINE
                     PERFORM Z9900-MSG-ERROR-RTN
                        THRU Z9900-MSG-ERROR-EXT
                 END-IF

                 SET  ADDRESS OF TBL-REC      TO   ADDRESS OF DBIO-REC
           END-IF
           .
       S7400-BEFOR-SEL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION 구분이 UPDATE 일때 실행된다.
      *  처리기능 : ST-BI거래모드구분에따라 분기하여 실행한다.
      *-----------------------------------------------------------------
       S7500-BEFOR-CHECK-RTN.

110830*    BATCH이고 갱신이면 전후 정보저장
110830     PERFORM S8850-BATCH-IUD-WRITE-RTN
110830        THRU S8850-BATCH-IUD-WRITE-EXT

      *DBIO-DELFRC시 시스템최종처리일시,시스템최종사용자번호
      *SELECT SKIP 처리합니다
           IF    COND-DBIO-DELFRC
                 GO TO    S7500-BEFOR-CHECK-EXT
           END-IF

      * TEMP MODE 이면서 UPDATE, LKUPDT 거래인경우
      * 원장보정로그 를 생성 한다.
      * (INSERT, DELETE시는 거래 종료전 로그를 생성)
      * 24-365 거래
           IF  (SICOM-OPER-DSTCD      =    CO-TEMP OR CO-STOP)


               PERFORM S7400-BEFOR-SEL-RTN
                  THRU S7400-BEFOR-SEL-EXT
               PERFORM S7510-CHK-LAST-YMS-UNO-RTN
                  THRU S7510-CHK-LAST-YMS-UNO-EXT
               PERFORM S8800-IMAGE-INSERT-RTN
                  THRU S8800-IMAGE-INSERT-EXT

           ELSE
               IF  WK-BEFOR-SELECT-YN NOT = CO-YES
                   PERFORM S8730-SEL-LAST-YMS-UNO-RTN
                      THRU S8730-SEL-LAST-YMS-UNO-EXT
               END-IF
               PERFORM S7510-CHK-LAST-YMS-UNO-RTN
                  THRU S7510-CHK-LAST-YMS-UNO-EXT
           END-IF
           .
       S7500-BEFOR-CHECK-EXT.
           EXIT.

      *
      *-----------------------------------------------------------------
      *  처리기능 : UPDATE DELETE시 개신 정합성 검증
      *-----------------------------------------------------------------
       S7510-CHK-LAST-YMS-UNO-RTN.

           IF      WK-IN-LAST-PRCSS-YMS  = SYS-LAST-PRCSS-YMS OF OLD-REC
             IF    BICOM-TRAN-START-YMS  = SYS-LAST-PRCSS-YMS OF OLD-REC
               IF  BICOM-USER-EMPID  NOT = SYS-LAST-UNO       OF OLD-REC
                   MOVE "타사용자가 자료를 변경하였습니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR CO-S9000008 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
             END-IF
           ELSE
                   MOVE "타사용자가 자료를 변경하였습니다"
                                            TO   XZUGEROR-I-MSG
                   #ERROR CO-S9000008 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
           .
       S7510-CHK-LAST-YMS-UNO-EXT.
           EXIT.

      *
      *-----------------------------------------------------------------
      *  수행조건 : 조건에 해당하는 SQL로 분기 한다
      *  처리기능 : SELECT FIRST 와 SELECT 조건비교 후 분기
      *-----------------------------------------------------------------
       S8100-DECLARE-RTN.
      *

           EVALUATE  TRUE
             WHEN  COND-DBIO-PK
                   PERFORM S8110-DECLARE-KEY0-RTN
                      THRU S8110-DECLARE-KEY0-EXT
           END-EVALUATE

      *
           .
       S8100-DECLARE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : PK/AK조건에 해당하는 데이타를 생성
      *  처리기능 : CURSOR를 생성하고 OPEN시킨다.
      *-----------------------------------------------------------------
      *
      *DECLARE & OPEN을 ACCESS-KEY별로 반복적으로 정의
      *
       S8110-DECLARE-KEY0-RTN.
           EXEC SQL DECLARE CUR_MODE_KEY0 CURSOR FOR
           SELECT
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

             FROM  THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" >= :PK0.T-E-GRNTY-INSTI-CD
              AND (( 1 <= :WK-ACCESS-COND
                AND "TE보증기관코드" >  :PK0.T-E-GRNTY-INSTI-CD))
            ORDER BY
                  "그룹회사코드" ASC
                , "기준년월" ASC
                , "보증기관번호" ASC
                , "TE보증기관코드" ASC
           END-EXEC
      *
           EXEC SQL OPEN  CUR_MODE_KEY0 END-EXEC
      *
           IF  SQLCODE                      =    -502
               EXEC SQL CLOSE  CUR_MODE_KEY0 END-EXEC
               EXEC SQL OPEN   CUR_MODE_KEY0 END-EXEC
120104     END-IF
120104     .
       S8110-DECLARE-KEY0-EXT.
           EXIT.
      *

      *
      *-----------------------------------------------------------------
      *  수행조건 : 조건에 해당하는 데이타를 가져온다
      *  처리기능 : 1ROW씩 가져와서 MOVE 한다.
      *-----------------------------------------------------------------
       S8200-FETCH-RTN.
      *
           EVALUATE  TRUE
             WHEN  COND-DBIO-PK
                   PERFORM S8210-FETCH-KEY0-RTN
                      THRU S8210-FETCH-KEY0-EXT
           END-EVALUATE

      *
120104     IF SQLCODE = ZERO
120104        MOVE  SYS-LAST-PRCSS-YMS  OF  TBL-REC
120104          TO  DBIO-LAST-PRCSS-YMS
120104        MOVE  SYS-LAST-UNO        OF  TBL-REC
120104          TO  DBIO-LAST-UNO
120104     END-IF
           .
       S8200-FETCH-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : SELECT MODE PK/AK조건데이타를가져온다
      *  처리기능 : 1ROW를 가져온다..
      *-----------------------------------------------------------------
      *
      *FETCH 를 ACCESS-KEY별로 반복적으로 정의
      *
       S8210-FETCH-KEY0-RTN.
           EXEC SQL FETCH CUR_MODE_KEY0 INTO
                  :TBL-REC.GROUP-CO-CD
                , :TBL-REC.BASE-YM
                , :TBL-REC.GRNTY-INSTI-NO
                , :TBL-REC.T-E-GRNTY-INSTI-CD
                , :TBL-REC.GRNTY-INSTI-NAME
                , :TBL-REC.NEW-SI-CLSFI-CD
                , :TBL-REC.NATNL-CD
                , :TBL-REC.GRCR-RISK-WGHT
                , :TBL-REC.GRCR-INSTI-DSTCD
                , :TBL-REC.GRNTY-I-CUST-IDNFR
                , :TBL-REC.SYS-LAST-PRCSS-YMS
                , :TBL-REC.SYS-LAST-UNO

           END-EXEC
           .
       S8210-FETCH-KEY0-EXT.
           EXIT.
      *

      *
      *-----------------------------------------------------------------
      *  수행조건 : 열려있는 CURSOR를 CLOSE 한다.
      *  처리기능 : CURSOR를 CLOSE시킨다.
      *-----------------------------------------------------------------
       S8300-CLOSE-RTN.
      *
      * LOCK SELECT를 FREE한다.
           IF  COND-DBIO-PK AND COND-DBIO-0
               PERFORM S8711-LKSEL-CLOSE-RTN
                  THRU S8711-LKSEL-CLOSE-EXT
           ELSE
      *
           EVALUATE  TRUE
             WHEN  COND-DBIO-PK
                   EXEC SQL CLOSE CUR_MODE_KEY0 END-EXEC
           END-EVALUATE

      *
           END-IF
      *
           .
       S8300-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION이 INSERT 일때  실행된다.
      *  처리기능 : 테이블내의 조건에 해당하는 DATA 1ROW INSERT
      *-----------------------------------------------------------------
       S8400-INSERT-RTN.
      *
      *
           EXEC SQL
           INSERT INTO  THKJL0071  (
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

                      )
           VALUES          (
                  :TBL-REC.GROUP-CO-CD
                , :TBL-REC.BASE-YM
                , :TBL-REC.GRNTY-INSTI-NO
                , :TBL-REC.T-E-GRNTY-INSTI-CD
                , :TBL-REC.GRNTY-INSTI-NAME
                , :TBL-REC.NEW-SI-CLSFI-CD
                , :TBL-REC.NATNL-CD
                , :TBL-REC.GRCR-RISK-WGHT
                , :TBL-REC.GRCR-INSTI-DSTCD
                , :TBL-REC.GRNTY-I-CUST-IDNFR
                , :TBL-REC.SYS-LAST-PRCSS-YMS
                , :TBL-REC.SYS-LAST-UNO

                      )
           END-EXEC
           .
       S8400-INSERT-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION이 UPDATE 일때  실행된다.
      *  처리기능 : 테이블내의 조건에 해당하는 DATA 1ROW UPDATE
      *-----------------------------------------------------------------
       S8500-UPDATE-RTN.
      *
           EXEC SQL
           UPDATE THKJL0071  SET
                  "그룹회사코드"
                         = :TBL-REC.GROUP-CO-CD
                , "기준년월"
                         = :TBL-REC.BASE-YM
                , "보증기관번호"
                         = :TBL-REC.GRNTY-INSTI-NO
                , "TE보증기관코드"
                         = :TBL-REC.T-E-GRNTY-INSTI-CD
                , "보증기관명"
                         = :TBL-REC.GRNTY-INSTI-NAME
                , "신표준산업분류코드"
                         = :TBL-REC.NEW-SI-CLSFI-CD
                , "국가코드"
                         = :TBL-REC.NATNL-CD
                , "신용공여위험가중치"
                         = :TBL-REC.GRCR-RISK-WGHT
                , "신용공여기관구분"
                         = :TBL-REC.GRCR-INSTI-DSTCD
                , "보증기관고객식별자"
                         = :TBL-REC.GRNTY-I-CUST-IDNFR
                , "시스템최종처리일시"
                         = :TBL-REC.SYS-LAST-PRCSS-YMS
                , "시스템최종사용자번호"
                         = :TBL-REC.SYS-LAST-UNO

           WHERE CURRENT OF SELECT_CURSOR
           END-EXEC

           .
       S8500-UPDATE-EXT.
           EXIT.
      *
      *
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-LOCK-YN = "Y"  잠금상태일때 실행한다.
      *  처리기능 : 테이블을 잠금 상태로 읽어온다.
      *-----------------------------------------------------------------
       S8710-SEL-LOCK-RTN.
      *
      *
      *
           EXEC SQL
               OPEN SELECT_CURSOR
           END-EXEC
      *
           IF      SQLCODE  =    -502
                   EXEC SQL CLOSE SELECT_CURSOR END-EXEC
                   EXEC SQL OPEN  SELECT_CURSOR END-EXEC
           END-IF

           IF      SQLCODE NOT =  ZERO
                   MOVE  CO-STAT-ERROR      TO    DBIO-STAT
                   MOVE  #SLINE             TO    XZUGEROR-I-LINE
                   PERFORM Z9900-MSG-ERROR-RTN
                      THRU Z9900-MSG-ERROR-EXT
           END-IF
      *
           EXEC SQL
               FETCH SELECT_CURSOR
               INTO
                  :TBL-REC.GROUP-CO-CD
                , :TBL-REC.BASE-YM
                , :TBL-REC.GRNTY-INSTI-NO
                , :TBL-REC.T-E-GRNTY-INSTI-CD
                , :TBL-REC.GRNTY-INSTI-NAME
                , :TBL-REC.NEW-SI-CLSFI-CD
                , :TBL-REC.NATNL-CD
                , :TBL-REC.GRCR-RISK-WGHT
                , :TBL-REC.GRCR-INSTI-DSTCD
                , :TBL-REC.GRNTY-I-CUST-IDNFR
                , :TBL-REC.SYS-LAST-PRCSS-YMS
                , :TBL-REC.SYS-LAST-UNO

           END-EXEC
120801     IF COND-DBIO-LKUPDT
120801       IF  SQLCODE NOT = ZERO
120801           MOVE CO-YES TO WK-LKSEL-CLOSE-YN
120801           MOVE CO-STAT-ERROR TO DBIO-STAT
120801           MOVE #SLINE TO XZUGEROR-I-LINE
120801           PERFORM Z9900-MSG-ERROR-RTN
120801              THRU Z9900-MSG-ERROR-EXT
120801       END-IF
120801     ELSE
120801       IF  SQLCODE NOT = ZERO
120801           MOVE CO-YES TO WK-LKSEL-CLOSE-YN
120801       ELSE
120801           MOVE DBIO-KEY TO SAVE-PK
120801           MOVE BICOM-GU-ID-NO TO SAVE-GUID
120801       END-IF
120801     END-IF
           .
       S8710-SEL-LOCK-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : SELECT LOCK 해제를 실행한다.
      *  처리기능 : 테이블을 일반 상태로 읽어온다.
      *-----------------------------------------------------------------
       S8711-LKSEL-CLOSE-RTN.
      *     DEADLOCK OR TIMEOUT 은 이미 CLOSE됨
           IF    SQLCODE            NOT =   -911
                 EXEC SQL CLOSE SELECT_CURSOR END-EXEC
                 MOVE  SPACE                  TO   SAVE-PK
                 MOVE  SPACE                  TO   SAVE-GUID
             IF  SQLCODE NOT = ZERO
               IF  WK-LKSEL-CLOSE-YN NOT = CO-YES
                 MOVE    CO-STAT-ERROR     TO    XZUGEROR-I-STAT
                 MOVE    #SLINE            TO    XZUGEROR-I-LINE
                 PERFORM Z9900-MSG-ERROR-RTN
                    THRU Z9900-MSG-ERROR-EXT
               END-IF
             END-IF
           END-IF
           .
       S8711-LKSEL-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *  수행조건 : DBIO-잡금여부가 잠금해지 상태일때 실행한다
      *  처리기능 : 테이블을 일반 상태로 읽어온다.
      *-----------------------------------------------------------------
      *
      *SELECT-NOLOCK을 ACCESS-KEY별로 반복적으로 정의
      *
       S8720-SELECT0-RTN.
           EXEC SQL
           SELECT
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

             INTO
                  :TBL-REC.GROUP-CO-CD
                , :TBL-REC.BASE-YM
                , :TBL-REC.GRNTY-INSTI-NO
                , :TBL-REC.T-E-GRNTY-INSTI-CD
                , :TBL-REC.GRNTY-INSTI-NAME
                , :TBL-REC.NEW-SI-CLSFI-CD
                , :TBL-REC.NATNL-CD
                , :TBL-REC.GRCR-RISK-WGHT
                , :TBL-REC.GRCR-INSTI-DSTCD
                , :TBL-REC.GRNTY-I-CUST-IDNFR
                , :TBL-REC.SYS-LAST-PRCSS-YMS
                , :TBL-REC.SYS-LAST-UNO

             FROM  THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" =  :PK0.T-E-GRNTY-INSTI-CD
           END-EXEC.
       S8720-SELECT0-EXT.
           EXIT.
      *

      *
      *
      *-----------------------------------------------------------------
      *SELECT-FIRST을 ACCESS-KEY별로 반복적으로 정의
      *-----------------------------------------------------------------
       S8740-SEL-FIRST0-RTN.
           EXEC SQL
           SELECT
                  "그룹회사코드"
                , "기준년월"
                , "보증기관번호"
                , "TE보증기관코드"
                , "보증기관명"
                , "신표준산업분류코드"
                , "국가코드"
                , "신용공여위험가중치"
                , "신용공여기관구분"
                , "보증기관고객식별자"
                , "시스템최종처리일시"
                , "시스템최종사용자번호"

             INTO
                  :TBL-REC.GROUP-CO-CD
                , :TBL-REC.BASE-YM
                , :TBL-REC.GRNTY-INSTI-NO
                , :TBL-REC.T-E-GRNTY-INSTI-CD
                , :TBL-REC.GRNTY-INSTI-NAME
                , :TBL-REC.NEW-SI-CLSFI-CD
                , :TBL-REC.NATNL-CD
                , :TBL-REC.GRCR-RISK-WGHT
                , :TBL-REC.GRCR-INSTI-DSTCD
                , :TBL-REC.GRNTY-I-CUST-IDNFR
                , :TBL-REC.SYS-LAST-PRCSS-YMS
                , :TBL-REC.SYS-LAST-UNO

             FROM  THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" >= :PK0.T-E-GRNTY-INSTI-CD
              AND (( 1 <= :WK-ACCESS-COND
                AND "TE보증기관코드" >  :PK0.T-E-GRNTY-INSTI-CD))
            ORDER BY
                  "그룹회사코드" ASC
                , "기준년월" ASC
                , "보증기관번호" ASC
                , "TE보증기관코드" ASC
            FETCH FIRST 1 ROWS ONLY
           END-EXEC.
       S8740-SEL-FIRST0-EXT.
           EXIT.
      *


      *-----------------------------------------------------------------
      *  수행조건 : DBIO-FUNCTION이"UPDATE","LKUPDT","DELETE"일때
      *             LOCK UPDATE검증을위해실행한다.
      *  처리기능 : UPDATE할대상의LAST-MODFI-YMS를가져온다
      *-----------------------------------------------------------------
       S8730-SEL-LAST-YMS-UNO-RTN.
      *
           EXEC SQL
           SELECT 시스템최종처리일시,  시스템최종사용자번호
             INTO :OLD-REC.SYS-LAST-PRCSS-YMS,:OLD-REC.SYS-LAST-UNO
             FROM THKJL0071
            WHERE "그룹회사코드" =  :PK0.GROUP-CO-CD
              AND "기준년월" =  :PK0.BASE-YM
              AND "보증기관번호" =  :PK0.GRNTY-INSTI-NO
              AND "TE보증기관코드" =  :PK0.T-E-GRNTY-INSTI-CD

           END-EXEC

           IF    SQLCODE          NOT  =   ZERO
                 MOVE    CO-STAT-ERROR     TO    XZUGEROR-I-STAT
                 MOVE    #SLINE            TO    XZUGEROR-I-LINE
                 PERFORM Z9900-MSG-ERROR-RTN
                    THRU Z9900-MSG-ERROR-EXT
           END-IF

           .
       S8730-SEL-LAST-YMS-UNO-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : TEMP,STOP MODE 일때 이미지복원을
      *             위해 실행한다.
      *  처리기능 : 거래모드가 TEMP/STOP이며
      *             INSERT,UPDATE,DELETE 가 발행하면
      *             원장보정로그/원장반영로그
      *             에 INSERT 하여 기록을 남긴다.
      *-----------------------------------------------------------------
       S8800-IMAGE-INSERT-RTN.
      *PK 영역에 "'" 데이터 존재검증
           MOVE     CORR PK0                TO CVT-PK0.
           INSPECT  CVT-PK0   TALLYING
                    WK-QUOTA-CNT FOR  ALL CO-QUOTA

      *
           IF WK-QUOTA-CNT > ZERO
                   STRING  'PK 영역에 "'
                           CO-QUOTA
                           '" 데이터 존재'  DELIMITED BY SIZE
                     INTO  XZUGEROR-I-MSG
                   #ERROR CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
           END-IF
      *
           MOVE  SPACE                      TO   WK-COND-DESC
           STRING
                  'WHERE "그룹회사코드" = '
                         "'" GROUP-CO-CD OF CVT-PK0 "'"
                  '  AND "기준년월" = '
                         "'" BASE-YM OF CVT-PK0 "'"
                  '  AND "보증기관번호" = '
                         "'" GRNTY-INSTI-NO OF CVT-PK0 "'"
                  '  AND "TE보증기관코드" = '
                         "'" T-E-GRNTY-INSTI-CD OF CVT-PK0 "'"

                    DELIMITED BY SIZE       INTO WK-COND-DESC

      *
           EVALUATE  SICOM-OPER-DSTCD
      *
               WHEN  CO-TEMP
                     PERFORM S8810-IMAGE-INSERT-RTN
                        THRU S8810-IMAGE-INSERT-RTN
                 IF  SQLCODE  NOT = ZERO
                   IF SQLCODE   = -803
                     MOVE ZERO              TO    SQLCODE
                   ELSE
                     MOVE   "S8800-TEMP-INSERT-RTN ZSFDBLG "
                                            TO    XZUGEROR-I-MSG
                     MOVE   SQLCODE         TO    XZUGEROR-I-SQL-CD
                     #ERROR CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
                   END-IF
                 END-IF
               WHEN  CO-STOP
                     MOVE  DBIO-REC                  TO  WK-CORRECTION
                     PERFORM S8810-IMAGE-INSERT-RTN
                        THRU S8810-IMAGE-INSERT-RTN
                 IF  SQLCODE  NOT = ZERO
                     MOVE   "S8800-STOP-SELECT-RTN ZSFDBLG "
                                            TO    XZUGEROR-I-MSG
                     MOVE   SQLCODE         TO    XZUGEROR-I-SQL-CD
                     #ERROR CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
                 END-IF
               WHEN  OTHER
                     CONTINUE
           END-EVALUATE
           .
       S8800-IMAGE-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : STOP TEMP MODE 일때 원장복원을 수행
      *  처리기능 : 거래모드가 TEMP OR STOP이며
      *             INSERT,UPDATE,DELETE 가 발행하면
      *             원장보정로그
      *             에 INSERT 하여 기록을 남긴다.
      *-----------------------------------------------------------------

       S8810-IMAGE-INSERT-RTN.

           INITIALIZE  XZSFDBLG-RETURN
           MOVE  LENGTH OF DBIO-REC      TO   DBIO-TABLE-LEN
           IF    DBIO-TABLE-LEN < LENGTH OF WK-CORRECTION
                 MOVE  SPACE TO  WK-CORRECTION(DBIO-TABLE-LEN + 1:)
           END-IF
      *
           ADD   LENGTH OF YCCOMMON-CA
                 LENGTH OF YCDBIOCA-CA
                 LENGTH OF XZSFDBLG-CA
                 LENGTH OF WK-CORRECTION
                 LENGTH OF WK-COND-DESC
            GIVING  COMM-CALLG-SCOP-LEN
      *
           MOVE  "ZSFDBLG"                  TO   YCFCTLAR-CALL-PGM
           CALL  YCFCTLAR-CALL-PGM        USING  DFHEIBLK
                                                 YCCOMMON-CA
                                                 YCDBIOCA-CA
                                                 XZSFDBLG-CA
                                                WK-CORRECTION
                                                WK-COND-DESC
           END-CALL
      *
           MOVE  DBIO-SQLCODE               TO   SQLCODE
           .
       S8810-IMAGE-INSERT-EXT.
           EXIT.
      *
      *-----------------------------------------------------------------
      *   변경전후 정보를 WRITE한다.
      *-----------------------------------------------------------------
       S8850-BATCH-IUD-WRITE-RTN.
      *
           IF  COMM-ONLINE-YN NOT = CO-YES
               AND   COND-DBIO-CHGLOG-YES
               PERFORM S7400-BEFOR-SEL-RTN THRU S7400-BEFOR-SEL-EXT
      *        최종일변경
               MOVE  BICOM-TRAN-START-YMS   TO XZSFDBUD-I-TRAN-START-YMS
               MOVE  LENGTH OF DBIO-REC     TO    DBIO-TABLE-LEN
               MOVE  "ZSFDBUD"              TO    YCFCTLAR-CALL-PGM
               CALL  YCFCTLAR-CALL-PGM      USING DFHEIBLK
                                                  YCCOMMON-CA
                                                  XZSFDBUD-CA
                                                  YCDBIOCA-CA
                                                  OLD-REC
                                                  DBIO-REC
               END-CALL
               IF    XZSFDBUD-R-STAT NOT = CO-STAT-OK
                     MOVE   "S8850-BATCH-IUD-WRITE-RTN ZSFDBUD"
                                               TO    XZUGEROR-I-MSG
                     #ERROR CO-S9000099 CO-UKLA0002 CO-STAT-SYSERROR
               END-IF
           END-IF
           .
       S8850-BATCH-IUD-WRITE-EXT.
           EXIT.

      *
      *-----------------------------------------------------------------
      *  수행조건 : 프로그램을정상적으로수행후정상종료를함
      *  처리기능 : 처리결과를정상으로MOVE한후종료RTN호출
      *-----------------------------------------------------------------
       S9000-NOMAL-END-RTN.

           MOVE  CO-STAT-OK                    TO DBIO-STAT
           IF      COMM-START-EIO-DSTCD = '9'
                   MOVE '11'                TO   YCFCTLAR-USR-LOG-CD
                   MOVE 999999              TO   YCFCTLAR-LOG-LINE-NO
                   STRING  'PGM END OK :'
                           'STAT=' DBIO-STAT    DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
           END-IF
           GOBACK.
       S9000-NOMAL-END-EXT.
           EXIT.

      *-----------------------------------------------------------------
       Z9900-SQL-ERROR-MSG-RTN.

           IF      NOT (SQLCODE = -805 OR 0 OR  -803 OR 100)
             CALL  'DSNTIAR'    USING    SQLCA
                                         ERROR-MESSAGE
                                         ERROR-TEXT-LEN
             END-CALL

             PERFORM VARYING ERR-IDX FROM 1 BY 1
               UNTIL ERR-IDX > 10
                   MOVE '13'                TO   YCFCTLAR-USR-LOG-CD
                   MOVE 999999              TO   YCFCTLAR-LOG-LINE-NO
                   STRING  ERROR-TEXT(ERR-IDX)   DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
             END-PERFORM
           END-IF
           .
       Z9900-SQL-ERROR-MSG-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *  수행조건 : 프로그램내부에서에러발생시처리함
      *  처리기능 : 에러에관련된정보를XZUGEROR-CA에MOVE후
      *             XZUGEROR을호출하고에러정보를DISPLAY한다.
      *-----------------------------------------------------------------
       Z9900-MSG-ERROR-RTN.

           MOVE  CO-YES                     TO  WK-ERR-SET-YN
           IF    XZUGEROR-I-STAT NOT = CO-STAT-SYSERROR
             MOVE  SQLCODE                  TO   XZUGEROR-I-SQL-CD
                                                 DBIO-SQLCODE
             EVALUATE  SQLCODE
               WHEN  ZERO
                     MOVE  ZERO             TO   XZUGEROR-I-SQL-CD
                     MOVE  CO-STAT-SYSERROR TO   XZUGEROR-I-STAT
               WHEN  +100
                     MOVE  CO-STAT-NOTFOUND TO   XZUGEROR-I-STAT
                     MOVE  CO-NO            TO   WK-ERR-SET-YN
                     INITIALIZE                  DBIO-REC
               WHEN  -803
                     MOVE  CO-STAT-DUPM     TO   XZUGEROR-I-STAT
                     MOVE  CO-NO            TO   WK-ERR-SET-YN
               WHEN  OTHER
                     IF  DBIO-SQLCODE(4:1) = "9" OR DBIO-SQLCODE = -805
                         MOVE CO-STAT-SYSERROR TO   XZUGEROR-I-STAT
                     ELSE
                         MOVE CO-STAT-ERROR TO   XZUGEROR-I-STAT
                     END-IF
                     MOVE  "D9900000"       TO   XZUGEROR-I-ERRCD
                     MOVE  XZUGEROR-I-SQL-CD(2:)
                                            TO   XZUGEROR-I-ERRCD(4:)
                     MOVE  CO-UKLA0002      TO   XZUGEROR-I-TREAT-CD
                     PERFORM Z9900-SQL-ERROR-MSG-RTN
                        THRU Z9900-SQL-ERROR-MSG-EXT
             END-EVALUATE
           END-IF

      *    LOCK SELECT CURSUR CLOSE
           IF    WK-LKSEL-CLOSE-YN = CO-YES
                 PERFORM S8711-LKSEL-CLOSE-RTN
                    THRU S8711-LKSEL-CLOSE-EXT
                 IF      SQLCODE              NOT  =   ZERO
                        #USRLOG "(S8710) CLOSE SELECT_CURSOR SQLCODE : "
                                %08 SQLCODE
                 END-IF
           END-IF
      *
           MOVE  XZUGEROR-I-STAT            TO   DBIO-STAT

           IF   WK-ERR-SET-YN = CO-YES
                 MOVE  YCFCTLAR-PGM-ID      TO   XZUGEROR-I-PGM-ID
                 MOVE  DBIO-CALL-PGM-ID     TO   XZUGEROR-I-TBL-ID
                 MOVE  DBIO-FUNCTION        TO   XZUGEROR-I-FUNC-CD
                 MOVE  'ZUGEROR'            TO   YCFCTLAR-CALL-LOG
                 CALL    YCFCTLAR-CALL-LOG USING YCCOMMON-CA
                                                 XZUGEROR-CA
                 END-CALL
           END-IF
           MOVE    YCFCTLAR-PGM-ID         TO    COMM-LAST-EXE-PGM-NAME
      *
           IF      COMM-START-EIO-DSTCD = '9'
                   MOVE '11'                TO   YCFCTLAR-USR-LOG-CD
                   MOVE 999999              TO   YCFCTLAR-LOG-LINE-NO
                   STRING  'PGM END ER :'
                           'STAT=' XZUGEROR-I-STAT  DELIMITED BY SIZE
                     INTO  YCFCTLAR-LOG-CTNT  POINTER YCFCTLAR-LOG-PTR
                   PERFORM Z9990-USER-LOG-RTN THRU    Z9990-USER-LOG-EXT
           END-IF

           GOBACK
           .
       Z9900-MSG-ERROR-EXT.
           EXIT.
      *--------------------------------------------------------------------*
      *    E N D   O F   P R O G R A M                                     *
      *--------------------------------------------------------------------*
