      *=================================================================
      *@업무명    : KJL (토탈익스포져)
      *@프로그램명: BJLCUST (고객번호　추출　적용　서브프로그램)
      *@처리유형  : BATCHSUB
      *@처리개요  :고객번호　및　계좌적용구분　추출
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *백현정:20090428: 신규작성
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM         : 테이블명               : 접근유형
      **  ---------------------   --------------------------------------
      **  채무자고객기본      : THKJL0015                : R
      **
      ******************************************************************
      ** 계좌적용구분
      **  1 : 법인여신
      **  2 : 개인사업자
      **  3 : 국민은행（국내）
      **  4 : 해외점포（차주：국민은행）
      **  5 : 해외법인（차주：기타）
      **  6 : 해외법인（차주：국민은행）
      **  7 : 개인여신
      **  8 : 대한민국정부
      **  9 : 기타
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLCUST.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/03/09.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호
      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBS01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBS01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBS02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBS02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBS03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBS03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBS04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBS04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBS05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBS05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBS09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBS09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBS91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBS91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBS92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBS92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLCUST'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-100              PIC  X(003) VALUE '100'.
           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-4                PIC  X(001) VALUE '4'.
           03  CO-CHA-5                PIC  X(001) VALUE '5'.
           03  CO-CHA-6                PIC  X(001) VALUE '6'.
           03  CO-CHA-7                PIC  X(001) VALUE '7'.
           03  CO-CHA-8                PIC  X(001) VALUE '8'.
           03  CO-CHA-9                PIC  X(001) VALUE '9'.

      *  부점코드
       01  CO-BRCODE.
           03  CO-BRCD-9537            PIC  X(004) VALUE '9537'.
           03  CO-BRCD-9579            PIC  X(004) VALUE '9579'.
           03  CO-BRCD-9553            PIC  X(004) VALUE '9553'.
           03  CO-BRCD-6558            PIC  X(004) VALUE '6558'.

       01  CO-CORP-NO1.
           03  CO-CORP-NO1-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO1-2           PIC  X(005) VALUE '11114'.
           03  CO-CORP-NO1-3           PIC  X(005) VALUE '80469'.
       01  CO-CORP-NO2.
           03  CO-CORP-NO2-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO2-2           PIC  X(005) VALUE '11100'.
           03  CO-CORP-NO2-3           PIC  X(005) VALUE '15655'.
       01  CO-CORP-NO3.
           03  CO-CORP-NO3-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO3-2           PIC  X(005) VALUE '11123'.
           03  CO-CORP-NO3-3           PIC  X(005) VALUE '65321'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *-- 법인등록번호（모기업법인등록번호）
           03  WK-MAMA-CORPNO      PIC  X(013).
      *-- 고객유형코드
           03  WK-BRWR-NO-DSTCD    PIC  X(001).

           03  FILLER              PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
        EXEC  SQL  INCLUDE  SQLCA       END-EXEC.

        EXEC  SQL  BEGIN  DECLARE       SECTION  END-EXEC.

      *    HOST INPUT
        01  WK-HOST-IN.
      *   그룹회사코드
           03  WK-H-I-GROUP-CO-CD       PIC  X(003).

        EXEC  SQL  END    DECLARE       SECTION  END-EXEC.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    고객번호　추출
       01  XBJLCUST-CA.
           COPY  XBJLCUST.
      *=================================================================
       PROCEDURE                       DIVISION
      *=================================================================
                                       USING       YCCOMMON-CA
                                                   XBJLCUST-CA.
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *초기화

      *    WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE       WK-AREA
                            WK-HOST-IN

      *   출력영역　및　결과코드　초기화
           INITIALIZE       XBJLCUST-OUT
                            XBJLCUST-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *입력값검증

      *관리부실점코드는　필수　입력항목　제외함
      *    IF  XBJLCUST-I-BRCD = SPACE
      *       #USRLOG '<< ERROR  - XBJLCUST-I-BRCD >>'
      *@에러메시지 : 필수항목 미입력 오류입니다.
      *@조치메시지 : 필수 항목입력요망!
      *       #ERROR   CO-EBS03001  CO-UBS03001  CO-STAT-ERROR
      *    END-IF

      *주민번호및법인등록번호
           IF  XBJLCUST-I-BRWR-NO = SPACE
      *@에러메시지 : 필수항목 미입력 오류입니다.
      *@조치메시지 : 필수 항목입력요망!
              #ERROR   CO-EBS03001  CO-UBS03001  CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *업무처리

      *@  고객정보추출(THKJL0015)조회
            PERFORM  S3100-THKJL0015-SELECT-RTN
               THRU  S3100-THKJL0015-SELECT-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  고객정보추출(THKJL0015)조회
      *-----------------------------------------------------------------
       S3100-THKJL0015-SELECT-RTN.
      *고객정보추출(THKJL0015)조회

           INITIALIZE                  WK-MAMA-CORPNO
                                       WK-BRWR-NO-DSTCD

           EXEC  SQL
            SELECT   VALUE(모기업법인등록번호,' ')
                 ,   VALUE(차주번호구분,'0')
              INTO   :WK-MAMA-CORPNO
                 ,   :WK-BRWR-NO-DSTCD
              FROM   DB2DBA.THKJL0015
             WHERE  그룹회사코드 = :XBJLCUST-I-GROUP-CO-CD
               AND  차주번호     = :XBJLCUST-I-BRWR-NO
            END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *             고객별　계좌적용구분　분류
                     PERFORM  S3110-GOGAK-GUBUN-RTN
                        THRU  S3110-GOGAK-GUBUN-EXT
               WHEN  CO-NOT-FOUND
      *             고객고유번호
                     MOVE XBJLCUST-I-BRWR-NO  TO  XBJLCUST-O-BINO
      *             고객정보없으면　모기업법인등록번호＝고객고유번호
                     MOVE XBJLCUST-I-BRWR-NO  TO  XBJLCUST-O-MAMA-CORPNO
      *             해외현지법인여부
                     MOVE CO-CHA-0    TO  XBJLCUST-O-HWGB
      *             계좌적용구분＝＇９＇（기타）
                     MOVE CO-CHA-9    TO  XBJLCUST-O-GJGB
               WHEN  OTHER
                     MOVE 'KJL0015'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR CO-EBS09001 CO-UBS09001 CO-STAT-ERROR
            END-EVALUATE
           .
       S3100-THKJL0015-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  고객별　계좌적용구분　분류
      *-----------------------------------------------------------------
       S3110-GOGAK-GUBUN-RTN.

      *   고객별　계좌적용구분　분류
      *   고객고유번호
           MOVE XBJLCUST-I-BRWR-NO  TO  XBJLCUST-O-BINO

      *   모기업법인등록번호
           IF  WK-MAMA-CORPNO = ' ' OR
               WK-MAMA-CORPNO = '             '
           THEN
      *      모기업법인번호가　미입력일경우　임의코드를　그대로　입력
               MOVE XBJLCUST-I-BRWR-NO  TO  XBJLCUST-O-MAMA-CORPNO
           ELSE
      *      모기업법인번호가　입력되었을경우　모기업법인번호를　입력
               MOVE WK-MAMA-CORPNO      TO  XBJLCUST-O-MAMA-CORPNO
           END-IF

      *   계좌적용구분　입력을위해　관리부실점코드를　체크한다
      *   국민은행　해외현지법인이나　자회사일경우
           EVALUATE  XBJLCUST-I-BRCD
               WHEN  CO-BRCD-9537
               WHEN  CO-BRCD-9579
               WHEN  CO-BRCD-9553
               WHEN  CO-BRCD-6558
      *            （구）주택은행= 1101111480469
      *            （구）국민은행= 1101110015655
      *             국민은행     = 1101112365321
                     IF WK-MAMA-CORPNO = CO-CORP-NO1 OR
                        WK-MAMA-CORPNO = CO-CORP-NO2 OR
                        WK-MAMA-CORPNO = CO-CORP-NO3
                    THEN
      *              계좌적용구분
                        MOVE CO-CHA-6    TO  XBJLCUST-O-GJGB
                    ELSE
      *              계좌적용구분
                        MOVE CO-CHA-5    TO  XBJLCUST-O-GJGB
                    END-IF
               WHEN  OTHER
                    IF WK-MAMA-CORPNO = CO-CORP-NO1 OR
                       WK-MAMA-CORPNO = CO-CORP-NO2 OR
                       WK-MAMA-CORPNO = CO-CORP-NO3
                    THEN
      *                여신종류구분에따라　국민은행（국내／해외）구분
                       IF XBJLCUST-I-YSGB = CO-CHA-1
      *                계좌적용구분
                       THEN  MOVE CO-CHA-3    TO  XBJLCUST-O-GJGB
      *                계좌적용구분
                       ELSE  MOVE CO-CHA-4    TO  XBJLCUST-O-GJGB
                       END-IF
                    ELSE
      *               차주번호구분＝＇１＇（주민등록번호）
                       IF WK-BRWR-NO-DSTCD = CO-CHA-1
                       THEN
      *                  계좌적용구분
                          MOVE CO-CHA-2    TO  XBJLCUST-O-GJGB
                       ELSE
      *                  계좌적용구분
                          MOVE CO-CHA-1    TO  XBJLCUST-O-GJGB
                       END-IF
                    END-IF
           END-EVALUATE

      * 대한민국정부　계좌적용구분　８로변경
           IF   WK-MAMA-CORPNO = '0000000000999'
           THEN MOVE CO-CHA-8       TO  XBJLCUST-O-GJGB
           END-IF

      *   해외현지법인구분
           IF   WK-BRWR-NO-DSTCD = CO-CHA-6
           THEN
                MOVE CO-CHA-1       TO  XBJLCUST-O-HWGB
           ELSE
                MOVE CO-CHA-0       TO  XBJLCUST-O-HWGB
           END-IF
           .
       S3110-GOGAK-GUBUN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@3 종료처리

      *@3.1 프로그램 종료
      *@처리내용 : 프로그램을 정상 종료 함
           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
