      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD275 (BT보증서담보PF대출보증추출)
      *@처리유형  : BATCH
      *@처리개요  : 보증서담보 부동산 PF대출 보증분에 대한
      *@              시공사 간접익스포져 반영
      *@              담보구분 443 주택금융신용보증서(PF보증용)
      *@              담보구분 473 주택사업금융보증서
      *@                                         (주택도시보증공사)
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *하윤희:20170518: 신규작성
      * HYH    :20180111: 유효 담보여신계좌번호 체크 추가
      * HYH    :20180309: 담보구분 414 조합사업비대출보증서 추가
      * HYH    :20190411:보증서담보 부동산PF대출 보증분에 대한
      *                  시공사 복수등록 허용
      * HYH    :20200305: 차주식별자 기준 동일계좌에 대해
      *                   직접/간접 존재시 간접 제외
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM          : 테이블명              : 접근유형
      **  ----------------------   -------------------------------------
      **  보증서담보명세       : THKIE0431               : R
      **  담보설정정보         : THKIE0436               : R
      **  담보여신계좌연결정보 : THKIE0437               : R
      **  고객기본             : THKAABPCB               : R
      **  간접계정과목코드목록 : THKJL0019               : R
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD275.
       AUTHOR.                         하윤희.
       DATE-WRITTEN.                   17/05/18.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT  OT-FILE             ASSIGN       TO  OTFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  OT-FILE LABEL RECORD IS     STANDARD    RECORDING MODE F.
       01  OT-REC.
           COPY  TRJL0027.
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호
      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD275'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.


           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.
           03  CO-CHA-N                PIC  X(001) VALUE 'N'.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-KRW              PIC  X(003) VALUE 'KRW'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-OT-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-SKIP-CNT       PIC  9(013) VALUE  ZEROS.
           03  WK-KHC0402-OK-CNT1      PIC  9(013) VALUE  ZEROS.
           03  WK-KHC0402-OK-CNT2      PIC  9(013) VALUE  ZEROS.
           03  WK-KHC0402-NFND-CNT     PIC  9(013) VALUE  ZEROS.
           03  WK-AC-OK-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-OK-CNT2           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-NO-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-NO-CNT2           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-NO-CNT3           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WT-CNT            PIC  9(013) VALUE  ZEROS.

      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *        채무자구분
           03  WK-DBTR-DSTCD           PIC  X(002).
      *        간접TE환산율
           03  WK-INDR-TE-UTCRT        PIC S9(003) COMP-3.
      *        간접익스포져환산금액
           03  WK-INDR-EXPSR-AMT       PIC S9(015)V9(3) COMP-3.
      *------------------------------------------------------------
      *        원화환산금액
           03  WK-WONGK                PIC S9(015) COMP-3.
      *------------------------------------------------------------
      *        명목액　원천구분
           03  WK-GUBUN                PIC  X(012).

      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
       01  XBJLTGEX-CA.
           COPY    XBJLTGEX.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRJL0019-REC.
           COPY    TRJL0019.
       01  TKJL0019-KEY.
           COPY    TKJL0019.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD           PIC  X(00003).
      *       기준일
           03 WK-H-I-BASE-DD               PIC  X(00002).
      *       기준년월
           03 WK-H-I-BASE-YM               PIC  X(00006).
      *       기준년월일
           03 WK-H-I-BASE-YMD              PIC  X(00008).

       01  WK-HOST-OUT.
      *       담보설정번호
           03 WK-H-O-SCURTY-STUP-NO        PIC  X(00009).
      *       시공사고객식별자
           03 WK-H-O-CNSC-CUST-IDNFR       PIC  X(00010).
      *       시공사고객고유번호구분
           03 WK-H-O-CNSC-CUNIQNO-DSTIC    PIC  X(00002).
      *       담보고객식별자
           03 WK-H-O-SCURTY-CUST-IDNFR     PIC  X(00010).
      *       담보고객구분
           03 WK-H-O-DBTR-DSTIC            PIC  X(00001).
      *       담보구분
           03 WK-H-O-SCURTY-DSTCD          PIC  X(00003).
      *       통화코드
           03 WK-H-O-CNCYCD                PIC  X(00003).
      *       설정금액
           03 WK-H-O-SETAMT                PIC S9(00015) COMP-3.
      *       담보여신계좌번호
           03 WK-H-O-SCURTY-LNBZ-ACNO      PIC  X(00020).
      *       담보설정비율구분
           03 WK-H-O-SCURTY-S-RATO-DSTCD   PIC  X(00001).


       EXEC  SQL  END  DECLARE         SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *  THKIE0437 (담보여신계좌연결　정보)
      *  THKIE0436 (담보설정정보)
      *  THKIE0431 (보증서담보명세)
      *  D.시공사고객식별자 ==> 시공사(보증채무)
      *  B.담보고객식별자   ==> 차주  (채무자/피보증)
      *  KIE 송하종차장 쿼리 작성
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKIE0431_CUR     CURSOR FOR
             SELECT B.담보설정번호
                  , D.시공사고객식별자
                  , E.고객고유번호구분 AS 시공사고객번호구분
                  , B.담보고객식별자
                  , '' 담보고객구분
                  , B.담보구분
                  , A.통화코드
                  , A.설정금액
                  , VALUE((SELECT  관련계좌번호
                             FROM   DB2DBA.THKHC0007
                            WHERE  그룹회사코드 = 'KB0'
                              AND  주계좌번호   = C.담보여신계좌번호
                              AND  상품계약간관계구분= '02'
                              AND  상품계약간상태구분='1'
                              FETCH  FIRST 1 ROW ONLY
                           ),C.담보여신계좌번호) AS 담보여신계좌번호
                  , A.담보설정비율구분
             FROM   DB2DBA.THKIE0436 A
                  , DB2DBA.THKIE0431 B
                  , DB2DBA.THKIE0437 C
                  , DB2DBA.THKIE0455 D
                  , DB2DBA.THKAABPCB E
              WHERE A.그룹회사코드   = 'KB0'
                AND A.그룹회사코드   = B.그룹회사코드
                AND A.그룹회사코드   = C.그룹회사코드
                AND A.그룹회사코드   = D.그룹회사코드
                AND E.그룹회사코드   = D.그룹회사코드
                AND A.설정상태구분   = '2'
                AND A.담보형태구분   = '1'
                AND A.담보해지구분  <> '2'
                AND A.담보설정번호   = B.담보설정번호
                AND A.담보고객식별자 = B.담보고객식별자
                AND A.담보설정번호   = C.담보설정번호
                AND C.대출계좌연결여부 = '1'
                AND A.설정금액       > 0
                AND B.담보구분 IN ('443','473','414')
                AND D.담보설정번호   = A.담보설정번호
                AND D.설정부가정보구분 = '01'
                AND E.고객식별자       = D.시공사고객식별자
                AND NOT EXISTS
                    (SELECT 1
                       FROM DB2DBA.THKJL0127
                      WHERE 그룹회사코드   = C.그룹회사코드
                        AND 기준일         = :WK-H-I-BASE-DD
                        AND 기준년월       = :WK-H-I-BASE-YM
                        AND 차주고객식별자 = D.시공사고객식별자
                        AND 한도계좌번호   = C.담보여신계좌번호)
                WITH UR
           END-EXEC.

      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@WK-AREA PARAMETER 초기화
           INITIALIZE    WK-AREA
                         WK-SYSIN

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD275 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *       정상처리
              CONTINUE
           ELSE
      *       에러처리
              #ERROR   XBJISTDT-R-ERRCD
                       XBJISTDT-R-TREAT-CD
                       XBJISTDT-R-STAT
              #OKEXIT  CO-CHA-08
           END-IF

           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

           OPEN OUTPUT OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE OPEN ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

           PERFORM  S3100-KIE0431-OPEN-RTN
              THRU  S3100-KIE0431-OPEN-EXT

           PERFORM  S3200-KIE0431-FETCH-RTN
              THRU  S3200-KIE0431-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

      *@담보고객구분추출
                    PERFORM  S3300-KAABPCB-SELECT-RTN
                       THRU  S3300-KAABPCB-SELECT-EXT

                    PERFORM  S3600-DATA-MOVE-RTN
                       THRU  S3600-DATA-MOVE-EXT

                    PERFORM  S3700-DATA-WRITE-RTN
                       THRU  S3700-DATA-WRITE-EXT

                    PERFORM  S3200-KIE0431-FETCH-RTN
                       THRU  S3200-KIE0431-FETCH-EXT

           END-PERFORM

           PERFORM  S3800-KIE0431-CLOSE-RTN
              THRU  S3800-KIE0431-CLOSE-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KIE0431-OPEN-RTN.

           EXEC SQL
               OPEN  THKIE0431_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KIE0431'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KIE0431-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KIE0431-FETCH-RTN.

           INITIALIZE        WK-AREA
                             WK-GUBUN

           EXEC SQL
              FETCH  THKIE0431_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KIE0431'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

            IF FUNCTION MOD(WK-AC-FE-CNT, 10000) = CO-NUM-0
               #USRLOG 'WK-AC-FE-CNT : ' WK-AC-FE-CNT
            END-IF
           .
       S3200-KIE0431-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  담보고객구분　추출
      *-----------------------------------------------------------------
       S3300-KAABPCB-SELECT-RTN.

      * 담보고객식별자－－＞　담보 고객번호구분 조회
      * 간접 상품중분류 01:개인 02:기업 분류기준

           EXEC SQL
             SELECT  고객고유번호구분
               INTO  :WK-DBTR-DSTCD
               FROM   DB2DBA.THKAABPCB
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  고객식별자   = :WK-H-O-SCURTY-CUST-IDNFR
               WITH   UR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  CO-NOT-FOUND
                     #USRLOG ' THKAABPCB NOT FND 담보고객식별자: '
                               WK-H-O-SCURTY-CUST-IDNFR
                             '설정번호: ' WK-H-O-SCURTY-STUP-NO
                     MOVE  SPACE       TO  WK-DBTR-DSTCD
               WHEN  OTHER
                     MOVE 'KAABPCB'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT 02 S3300시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KAABPCB-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   DATA MOVE
      *-----------------------------------------------------------------
       S3600-DATA-MOVE-RTN.

           INITIALIZE                  OT-REC


      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0027-GROUP-CO-CD

      *    기준일
           MOVE  WK-H-I-BASE-DD
             TO  RJL0027-BASE-DD

      *    기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0027-BASE-YM

      *    담보보증고객식별자＝시공사고객식별자
           MOVE  WK-H-O-CNSC-CUST-IDNFR
             TO  RJL0027-SCURTY-G-CUSZ-IDNFR

      *    계약식별자 = THKIE0431_담보설정번호
           MOVE  WK-H-O-SCURTY-STUP-NO
             TO  RJL0027-CTRC-IDNFR

      *    시공사고객구분 = THKIE0431_시공사고객번호구분
           MOVE  WK-H-O-CNSC-CUNIQNO-DSTIC
             TO  RJL0027-GRNR-CUST-DSTCD

      *    담보고객식별자＝담보고객식별자
           MOVE  WK-H-O-SCURTY-CUST-IDNFR
             TO  RJL0027-SCURTY-CUST-IDNFR

      *    담보고객식별자의 채무자구분
           MOVE  WK-DBTR-DSTCD
             TO  RJL0027-DBTR-DSTCD

      *    담보구분
           MOVE  WK-H-O-SCURTY-DSTCD
             TO  RJL0027-SCURTY-DSTCD

      *@@@ 간접계정코드　중분류코드　세트
           PERFORM  S3610-SELECT-GANCODE-RTN
              THRU  S3610-SELECT-GANCODE-EXT

      *    대출자격구분
           MOVE  SPACE
             TO  RJL0027-LN-QULFI-DSTCD

      *   과목코드
           MOVE  'CNC'
             TO  RJL0027-SBJCT-CD

      *@@@ 보증금액 원화 환산
           PERFORM  S3620-SELECT-GANJAN-RTN
              THRU  S3620-SELECT-GANJAN-EXT

      *@@@간접TE환산율조회
           PERFORM  S3630-KJL0019-SELECT-RTN
              THRU  S3630-KJL0019-SELECT-EXT

           INITIALIZE        WK-INDR-EXPSR-AMT
           COMPUTE  WK-INDR-EXPSR-AMT
                 =  RJL0027-INDR-TTL-AMT
                 *  (WK-INDR-TE-UTCRT / 100)

      *    간접익스포져금액
           MOVE  WK-INDR-EXPSR-AMT
             TO  RJL0027-INDR-EXPSR-AMT

      *    관련테이블명
           MOVE  WK-GUBUN
             TO  RJL0027-RELATD-TBL-NAME

      *    담보계약식별자
           MOVE  SPACE
             TO  RJL0027-SCURTY-CTRC-IDNFR

      *    담보계약계좌번호
           MOVE  WK-H-O-SCURTY-LNBZ-ACNO
             TO  RJL0027-SCURTY-CTRC-ACNO

      *    시스템최종처리일시
           MOVE  BICOM-TRAN-BASE-YMS
             TO  RJL0027-SYS-LAST-PRCSS-YMS

      *    시스템최종사용자번호
           MOVE  BICOM-USER-EMPID
             TO  RJL0027-SYS-LAST-UNO

           .
       S3600-DATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   간접계정코드　중분류코드　세트
      *-----------------------------------------------------------------
       S3610-SELECT-GANCODE-RTN.

      *    상품대분류코드
           MOVE  'GJ'
             TO  RJL0027-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  '06'
             TO  RJL0027-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드 CNC:시공사
           MOVE  'CNC'
             TO  RJL0027-PRDCT-TMPLT-CD

      *    간접중분류구분
           MOVE  '06'
             TO  RJL0027-INDR-M-CLSFI-DSTCD

      *   상품번호＝＇００＇＋담보구분３자리
           MOVE  '00'
             TO  RJL0027-PRDCT-NO(1:2)

      *****담보구분 = 상품번호（３：３）코드 셋팅
      *@   443 주택금융신용보증서(PF보증용)
      *@   473 주택사업금융보증서(주택도시보증공사)
      *@   414 조합사업비대출보증서

           MOVE  WK-H-O-SCURTY-DSTCD
             TO  RJL0027-PRDCT-NO(3:3)

           .
       S3610-SELECT-GANCODE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   보증금액　원화　환산
      *    설정금액 =  간접명목금액　산출
      *-----------------------------------------------------------------
       S3620-SELECT-GANJAN-RTN.

      *   통화코드
           MOVE  WK-H-O-CNCYCD
             TO  RJL0027-CNCYCD

      *   통화설정금액
           MOVE  WK-H-O-SETAMT
             TO  RJL0027-CRNCY-SETAMT

      *    설정금액　원화환산
           IF  WK-H-O-CNCYCD = CO-CHA-KRW

      *        원화환산금액
                MOVE  WK-H-O-SETAMT
                  TO  RJL0027-WONC-AUC

      *        간접명목금액
                MOVE  WK-H-O-SETAMT
                  TO  RJL0027-INDR-TTL-AMT

           ELSE
      *       통화별　원화환산금액CALCURATER
               PERFORM  S3621-BJLTGEX-CALL-RTN
                  THRU  S3621-BJLTGEX-CALL-EXT

      *        원화환산금액
                MOVE  WK-WONGK
                  TO  RJL0027-WONC-AUC

      *        간접명목금액
                MOVE  WK-WONGK
                  TO  RJL0027-INDR-TTL-AMT

           END-IF

      *    명목액원천구분- 1:설정금액
           MOVE  'THKIE0431-1'
             TO   WK-GUBUN

           .
       S3620-SELECT-GANJAN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  간접익스포져계정코드목록(THKJL0019) 조회
      *-----------------------------------------------------------------
       S3630-KJL0019-SELECT-RTN.

           INITIALIZE    TKJL0019-KEY

      *          그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  KJL0019-PK-GROUP-CO-CD

      *          기준년월
           MOVE  WK-H-I-BASE-YM
             TO  KJL0019-PK-BASE-YM

      *         상품대분류코드
           MOVE  RJL0027-PRDCT-LAG-CLSFI-CD
             TO  KJL0019-PK-PRDCT-LAG-CLSFI-CD

      *         상품중분류코드
           MOVE  RJL0027-PRDCT-MEDM-CLSFI-CD
             TO  KJL0019-PK-PRDCT-MEDM-CLSFI-CD

      *         상품템플릿코드
           MOVE  RJL0027-PRDCT-TMPLT-CD
             TO  KJL0019-PK-PRDCT-TMPLT-CD

      *         상품번호
           MOVE  RJL0027-PRDCT-NO
             TO  KJL0019-PK-PRDCT-NO

           EXEC SQL
             SELECT  VALUE("간접TE환산율",0)
               INTO  :WK-INDR-TE-UTCRT
               FROM  DB2DBA.THKJL0019
              WHERE  그룹회사코드   = :KJL0019-PK-GROUP-CO-CD
                AND  기준년월       = :KJL0019-PK-BASE-YM
                AND  상품대분류코드 = :KJL0019-PK-PRDCT-LAG-CLSFI-CD
                AND  상품중분류코드 = :KJL0019-PK-PRDCT-MEDM-CLSFI-CD
                AND  상품템플릿코드 = :KJL0019-PK-PRDCT-TMPLT-CD
                AND  상품번호       = :KJL0019-PK-PRDCT-NO
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  CO-NOT-FOUND
                     MOVE  ZERO        TO  WK-INDR-TE-UTCRT
               WHEN  OTHER
                     MOVE 'KJL0019'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3630-KJL0019-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   통화별원화환산금액 CALCURATER
      *-----------------------------------------------------------------
       S3621-BJLTGEX-CALL-RTN.

           INITIALIZE    XBJLTGEX-CA

      *    처리구분(1:통화별환산2:외환매매익　역환산)
           MOVE  CO-CHA-1
             TO  XBJLTGEX-I-GBCD

      *    유효년월일－기준년월일
           MOVE  WK-H-I-BASE-YMD
             TO  XBJLTGEX-I-BASE-YMD

      *    통화코드
           MOVE  WK-H-O-CNCYCD
             TO  XBJLTGEX-I-CNCYCD

      *    통화한도금액
           MOVE  ZERO
             TO  XBJLTGEX-I-CRNCY-CLAM

      *    통화기준잔액
           MOVE  WK-H-O-SETAMT
             TO  XBJLTGEX-I-CRNCY-BAL

      *    통화기준잔액- 파생상품BS금액용
           MOVE  ZERO
             TO  XBJLTGEX-I-BS-BAL

           #DYCALL  BJLTGEX YCCOMMON-CA XBJLTGEX-CA

           IF  XBJLTGEX-R-STAT = CO-STAT-OK
      *        원화환산금액
               MOVE  XBJLTGEX-O-TTL-AMT-BASE-BAL
                 TO  WK-WONGK
           ELSE
      *        원화환산금액
               MOVE  ZERO
                 TO  WK-WONGK
           END-IF

           .
       S3621-BJLTGEX-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA WRITE
      *-----------------------------------------------------------------
       S3700-DATA-WRITE-RTN.

           WRITE OT-REC

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE WRITE ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           ADD   CO-NUM-1              TO  WK-AC-WT-CNT
           .
       S3700-DATA-WRITE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3800-KIE0431-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKIE0431_CUR
           END-EXEC
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KIE0431'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3800-KIE0431-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE     OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE CLOSE ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKIE0431_CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* SKIP            COUNT  = ' WK-AC-FE-SKIP-CNT
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD275 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
