      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD252 (BT수요자금융추출)
      *@처리유형  : BATCH
      *@처리개요  : 일반여신계좌　중　수요자금융부분　추출.
      *@ 1)  자금구분／계정과목별　구분하여　정비
      *@ 2)  정형화된　작업이므로 HARD_CORDING 이　가능
      *@     대출자격구분 업체명           법인번호
      *@        081        삼성캐피탈         1101111132276
      *@        307         LG카드            1101110412926
      *@        082        현대캐피탈         1101110995378
      *@        000        롯데카드           1101110641434
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090416: 신규작성
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **  여신계약기본   : THKHC0401                     : R
      **  부점기본       : THKJIBR01                     : R
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD252.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/04/16.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT  OT-FILE             ASSIGN       TO  OTFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  OT-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC.
           COPY  TRJL0025.
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(007) VALUE 'BJLD252'.
           03  CO-TBL-ID               PIC  X(009) VALUE 'THKHC0401'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-00000            PIC  X(005) VALUE '00000'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-11               PIC  X(002) VALUE '11'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-13               PIC  X(002) VALUE '13'.
           03  CO-CHA-14               PIC  X(002) VALUE '14'.
           03  CO-CHA-15               PIC  X(002) VALUE '15'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-17               PIC  X(002) VALUE '17'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-KRW              PIC  X(003) VALUE 'KRW'.
           03  CO-CHA-SOO              PIC  X(003) VALUE 'SOO'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.

       01  CO-CORP-NO1.
           03  CO-CORP-NO1-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO1-2           PIC  X(005) VALUE '11103'.
           03  CO-CORP-NO1-3           PIC  X(005) VALUE '46901'.

       01  CO-IDNFR-NO1.
           03  CO-IDNFR-NO1-1          PIC  X(003) VALUE '700'.
           03  CO-IDNFR-NO1-2          PIC  X(003) VALUE '137'.
           03  CO-IDNFR-NO1-3          PIC  X(004) VALUE '1824'.

       01  CO-CORP-NO2.
           03  CO-CORP-NO2-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO2-2           PIC  X(005) VALUE '11104'.
           03  CO-CORP-NO2-3           PIC  X(005) VALUE '12926'.

       01  CO-IDNFR-NO2.
           03  CO-IDNFR-NO2-1          PIC  X(003) VALUE '700'.
           03  CO-IDNFR-NO2-2          PIC  X(003) VALUE '150'.
           03  CO-IDNFR-NO2-3          PIC  X(004) VALUE '1057'.

       01  CO-CORP-NO3.
           03  CO-CORP-NO3-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO3-2           PIC  X(005) VALUE '11109'.
           03  CO-CORP-NO3-3           PIC  X(005) VALUE '95378'.

       01  CO-IDNFR-NO3.
           03  CO-IDNFR-NO3-1          PIC  X(003) VALUE '700'.
           03  CO-IDNFR-NO3-2          PIC  X(003) VALUE '171'.
           03  CO-IDNFR-NO3-3          PIC  X(004) VALUE '0076'.

       01  CO-CORP-NO4.
           03  CO-CORP-NO4-1           PIC  X(003) VALUE '110'.
           03  CO-CORP-NO4-2           PIC  X(005) VALUE '11126'.
           03  CO-CORP-NO4-3           PIC  X(005) VALUE '44733'.

       01  CO-IDNFR-NO4.
           03  CO-IDNFR-NO4-1          PIC  X(003) VALUE '700'.
           03  CO-IDNFR-NO4-2          PIC  X(003) VALUE '604'.
           03  CO-IDNFR-NO4-3          PIC  X(004) VALUE '8991'.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-OT-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-SKIP-CNT          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FETCH-CNT         PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WRITE-CNT         PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
           03  WK-SW-SUB-EOF           PIC  X(001) VALUE  SPACE.
               88  SUB-EOF-Y                       VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *        상품KEY
           03  WK-PRDCT-KEY            PIC  X(015).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE ACCESS INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TKHC0401-KEY.
           COPY    TKHC0401.
       01  TRHC0401-REC.
           COPY    TRHC0401.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(003).
      *       기준일
           03 WK-H-I-BASE-DD                PIC  X(002).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(006).
      *       기준년월일
           03 WK-H-I-BASE-YMD               PIC  X(008).

       01  WK-HOST-OUT.
      *       대출자격구분
           03 WK-H-O-GUBUN                  PIC  X(002).
      *       상품대분류코드
           03 WK-H-O-PRDCT-LAG-CLSFI-CD     PIC  X(002).
      *       상품중분류코드
           03 WK-H-O-PRDCT-MEDM-CLSFI-CD    PIC  X(002).
      *       상품템플릿코드
           03 WK-H-O-PRDCT-TMPLT-CD         PIC  X(003).
      *       상품번호
           03 WK-H-O-PRDCT-NO               PIC  X(005).
      *       현한도금액
           03 WK-H-O-HNHDGK                 PIC S9(015)V9(3) COMP-3.
      *       잔액
           03 WK-H-O-JANNEK                 PIC S9(015)V9(3) COMP-3.
       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
      *  수요자금융관련　개인여신부분
           EXEC SQL
            DECLARE  THKHC0401_CUR     CURSOR FOR
             SELECT  AA.대출자격구분
                  ,  AA.상품대분류코드
                  ,  AA.상품중분류코드
                  ,  AA.상품템플릿코드
                  ,  AA.상품번호
                  ,  SUM(AA.현한도금액)
                  ,  SUM(AA.잔액)
               FROM
            (SELECT (CASE
                     WHEN  A.대출자격구분 = '081' THEN '11'
                     WHEN  A.대출자격구분 = '307' THEN '12'
                     WHEN  A.대출자격구분 = '082' THEN '13'
                     WHEN  A.대출자격구분 = '000' THEN '14'
                     ELSE 'AA'
                     END)   AS 대출자격구분
                  , 'CF'    AS 상품대분류코드
                  , '01'    AS 상품중분류코드
                  , '001'   AS 상품템플릿코드
                  , '00001' AS 상품번호
                  ,  A.한도사용금액 AS 현한도금액
                  ,  A.계약금액 AS 잔액
               FROM  DB2DBA.THKHC0401 A
              WHERE  A.그룹회사코드   = :WK-H-I-GROUP-CO-CD
                AND  A.한도계좌여부   = '0'
                AND (A.상품계약폐기년월일 >= :WK-H-I-BASE-YMD
                 OR  A.상품계약폐기년월일  = ' ')
                AND  A.관리부점코드 NOT IN
                    (SELECT  부점코드
                       FROM  DB2DBA.THKJIBR01
                      WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                        AND  부점구분     = '19')
                AND  A.상품대분류코드  = '25'
                AND  A.상품중분류코드  = '32'
                AND  A.상품템플릿코드  = '113'
                AND  A.상품번호 = '00001'
                AND  A.대출자격구분IN ('081','082','307','000')
                AND  A.상품계약상태구분 <> '3') AA
           GROUP BY  AA.대출자격구분
                  ,  AA.상품대분류코드
                  ,  AA.상품중분류코드
                  ,  AA.상품템플릿코드
                  ,  AA.상품번호
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@WK-AREA PARAMETER 초기화
           INITIALIZE    WK-AREA
                         WK-SYSIN

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD252 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF

           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

           OPEN OUTPUT OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE OPEN ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리: 수요자금융자료　중　개인여신부분　추출
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

           PERFORM  S3100-KHC0401-OPEN-RTN
              THRU  S3100-KHC0401-OPEN-EXT

           PERFORM  S3200-KHC0401-FETCH-RTN
              THRU  S3200-KHC0401-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

                    PERFORM  S3300-DATA-MOVE-RTN
                       THRU  S3300-DATA-MOVE-EXT

      ****************************************
      *통화한도금금액，통화금일금액        *
      * B/S 　잔액（매매기준적용）         *
      *명목액기준한도,명목액기준잔액     *
      ****************************************
                    IF  RJL0025-CRNCY-CLAM        = ZERO AND
                        RJL0025-CRNCY-BAL         = ZERO AND
                        RJL0025-BS-BASE-BAL       = ZERO AND
                        RJL0025-TTL-AMT-BASE-CLAM = ZERO AND
                        RJL0025-TTL-AMT-BASE-BAL  = ZERO
                    THEN
                         ADD   CO-NUM-1    TO  WK-AC-SKIP-CNT
                    ELSE
                        IF  WK-H-O-GUBUN  = 'AA'
                        THEN
                             ADD   CO-NUM-1    TO  WK-AC-SKIP-CNT
                        ELSE
                            PERFORM  S3400-DATA-WRITE-RTN
                               THRU  S3400-DATA-WRITE-EXT
                        END-IF
                    END-IF

                    PERFORM  S3200-KHC0401-FETCH-RTN
                       THRU  S3200-KHC0401-FETCH-EXT
           END-PERFORM

           PERFORM  S3500-KHC0401-CLOSE-RTN
              THRU  S3500-KHC0401-CLOSE-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KHC0401-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKHC0401_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
            END-EVALUATE.
           .
       S3100-KHC0401-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KHC0401-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT

           EXEC SQL
              FETCH  THKHC0401_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FETCH-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
            END-EVALUATE.
           .
       S3200-KHC0401-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA MOVE
      *-----------------------------------------------------------------
       S3300-DATA-MOVE-RTN.

           INITIALIZE    OT-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0025-GROUP-CO-CD

      *    계좌번호＝상품대＋상품중＋템플릿＋상번번호＋대출자격구분
           STRING WK-H-O-PRDCT-LAG-CLSFI-CD
                  WK-H-O-PRDCT-MEDM-CLSFI-CD
                  WK-H-O-PRDCT-TMPLT-CD
                  WK-H-O-PRDCT-NO
                  WK-H-O-GUBUN
           DELIMITED BY SIZE INTO  RJL0025-ACNO

      *    기준일
           MOVE  WK-H-I-BASE-DD
             TO  RJL0025-BASE-DD

      *    기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0025-BASE-YM

      *    계좌중복일련번호
           MOVE  CO-NUM-1
             TO  RJL0025-ACN-DUP-SERNO

      *기업（수요자금융）
           EVALUATE  WK-PRDCT-KEY
      *삼성캐피탈
               WHEN  CO-CHA-11
      *              고객식별자
                     MOVE  CO-IDNFR-NO1
                       TO  RJL0025-CUST-IDNFR
      *              고객관리번호
                     MOVE  CO-CHA-00000
                       TO  RJL0025-CUST-MGT-NO
      *              차주번호
                     MOVE  CO-CORP-NO1
                       TO  RJL0025-BRWR-NO
      *엘지캐피탈
               WHEN  CO-CHA-12
      *              고객식별자
                     MOVE  CO-IDNFR-NO2
                       TO  RJL0025-CUST-IDNFR
      *              고객관리번호
                     MOVE  CO-CHA-00000
                       TO  RJL0025-CUST-MGT-NO
      *              차주번호
                     MOVE  CO-CORP-NO2
                       TO  RJL0025-BRWR-NO
      *현대캐피탈
               WHEN  CO-CHA-13
      *              고객식별자
                     MOVE  CO-IDNFR-NO3
                       TO  RJL0025-CUST-IDNFR
      *              고객관리번호
                     MOVE  CO-CHA-00000
                       TO  RJL0025-CUST-MGT-NO
      *              차주번호
                     MOVE  CO-CORP-NO3
                       TO  RJL0025-BRWR-NO
      *동양파이낸셜＝롯데카드
               WHEN  CO-CHA-14
      *              고객식별자
                     MOVE  CO-IDNFR-NO4
                       TO  RJL0025-CUST-IDNFR
      *              고객관리번호
                     MOVE  CO-CHA-00000
                       TO  RJL0025-CUST-MGT-NO
      *              차주번호
                     MOVE  CO-CORP-NO4
                       TO  RJL0025-BRWR-NO
               WHEN  OTHER
                     CONTINUE
           END-EVALUATE

      *    해외현지법인여부
           MOVE  CO-CHA-0
             TO  RJL0025-OVSES-LCAL-COPR-YN

      *    관리부점코드
           MOVE  SPACE
             TO  RJL0025-MGT-BRNCD

      *    계좌적용구분
           MOVE  CO-CHA-1
             TO  RJL0025-ACN-APLY-DSTCD

      *    한도계좌여부
           MOVE  CO-CHA-0
             TO  RJL0025-LIMT-ACN-YN

      *    상품대분류코드
           MOVE  WK-H-O-PRDCT-LAG-CLSFI-CD
             TO  RJL0025-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O-PRDCT-MEDM-CLSFI-CD
             TO  RJL0025-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O-PRDCT-TMPLT-CD
             TO  RJL0025-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O-PRDCT-NO
             TO  RJL0025-PRDCT-NO

      *    시작년월일
           MOVE  SPACE
             TO  RJL0025-START-YMD

      *    만기년월일
           MOVE  SPACE
             TO  RJL0025-EXPIR-YMD

      *    종료년월일
           MOVE  SPACE
             TO  RJL0025-END-YMD

      *    상품계약상태구분
           MOVE  CO-CHA-1
             TO  RJL0025-PRDCT-C-STUS-DSTCD

      *    통화코드
           MOVE  CO-CHA-KRW
             TO  RJL0025-CNCYCD

      *    통화한도
           MOVE  WK-H-O-JANNEK
             TO  RJL0025-CRNCY-CLAM

      *    통화잔액
           MOVE  WK-H-O-JANNEK
             TO  RJL0025-CRNCY-BAL

      *    BS기준잔액
           MOVE  WK-H-O-JANNEK
             TO  RJL0025-BS-BASE-BAL

      *    명목액기준한도
           MOVE  WK-H-O-JANNEK
             TO  RJL0025-TTL-AMT-BASE-CLAM

      *    명목액기준잔액
           MOVE  WK-H-O-JANNEK
             TO  RJL0025-TTL-AMT-BASE-BAL

      *    TE한도환산금액
           MOVE  ZERO
             TO  RJL0025-TE-LIMT-AUC

      *    TE잔액환산금액
           MOVE  ZERO
             TO  RJL0025-TE-BAL-AUC

      *    CP한도환산금액
           MOVE  ZERO
             TO  RJL0025-INLS-GRCR-LIMT-AUC

      *    CP잔액환산금액
           MOVE  ZERO
             TO  RJL0025-INLS-GRCR-BAL-AUC

      *    CA담보제외금액
           MOVE  ZERO
             TO  RJL0025-CA-SCURTY-ECLUD-AMT

      *    CA담보환산금액
           MOVE  ZERO
             TO  RJL0025-CA-SCURTY-AUC

      *    관련테이블명
           MOVE  CO-TBL-ID
             TO  RJL0025-RELATD-TBL-NAME

      *    과목코드
           MOVE  CO-CHA-SOO
             TO  RJL0025-SBJCT-CD

      *    시스템최종처리일시
           MOVE  BICOM-TRAN-BASE-YMS
             TO  RJL0025-SYS-LAST-PRCSS-YMS

      *    시스템최종사용자번호
           MOVE  BICOM-USER-EMPID
             TO  RJL0025-SYS-LAST-UNO
           .
       S3300-DATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA WRITE
      *-----------------------------------------------------------------
       S3400-DATA-WRITE-RTN.

           WRITE  OT-REC

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE WRITE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           ADD   CO-NUM-1              TO  WK-AC-WRITE-CNT
           .
       S3400-DATA-WRITE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3500-KHC0401-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKHC0401_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
            END-EVALUATE
           .
       S3500-KHC0401-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE     OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE CLOSE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKHC0401_CUR   COUNT  = ' WK-AC-FETCH-CNT
           #USRLOG '* SKIP            COUNT  = ' WK-AC-SKIP-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WRITE-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD252 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
