      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD331 (BT신용공여차주별집계원장추출)
      *@처리유형  : BATCH
      *@처리개요  : 신용공여차주별집계원장추출한다.
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090401: 신규작성
      * HYH    :20120227:  1,000건 단위 COMMIT 주기 변경
      * HYH    :20150226:  10건 단위 COMMIT 주기 변경
      * HYH    :20170224:  KB-PIN 전환
      * HYH    :20180914:  신)익스포져 관련DB변경
      * YBH    :20210218:  DB LOG 생성추가
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM               : 테이블명         : 접근유형
      **  ---------------------------   --------------------------------
      **  차주일계좌명세            : THKJL0125          : R
      **  계정코드목록              : THKJL0018          : R
      **  채무자고객기본            : THKJL0015          : R
      **  차주신용공여일집계        : THKJL0033          : CD
      **  차주신용공여월집계        : THKJL0034          : CD
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD331.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/04/01.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD331'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-SQL-OK               PIC  9(003) VALUE  000.
           03  CO-SQL-NTFND            PIC  9(003) VALUE  100.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-KRW              PIC  X(003) VALUE 'KRW'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
210218     03  CO-NUM-1000             PIC  9(004) VALUE  1000.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-DEL-FET-CNT1      PIC  9(013) VALUE  ZEROS.
           03  WK-AC-DELETE-CNT1       PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-SK-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT1          PIC  9(013) VALUE  ZEROS.
      *
           03  WK-AC-DEL-FET-CNT2      PIC  9(013) VALUE  ZEROS.
           03  WK-AC-DELETE-CNT2       PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT2           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT2          PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).

       01  WK-AREA1.
           03  WK-TBL-ID               PIC  X(008).
           03  WK-FUNC-CD              PIC  X(008).
           03  WK-REC-CNT              PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *월말영영일　추출
       01  XCJIIL09-CA.
           COPY    XCJIIL09.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TKJL0033-KEY.
           COPY    TKJL0033.
       01  TRJL0033-REC.
           COPY    TRJL0033.
       01  TKJL0034-KEY.
           COPY    TKJL0034.
       01  TRJL0034-REC.
           COPY    TRJL0034.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY  YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *        기준일
           03 WK-H-I-BASE-DD                PIC  X(00002).
      *        기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).

210218 01  WK-HOST-DEL-OUT1.
      *       그룹회사코드
           03 WK-H-DO1-GROUP-CO-CD          PIC  X(00003).
      *       기준일
           03 WK-H-DO1-BASE-DD              PIC  X(00002).
      *       기준년월
           03 WK-H-DO1-BASE-YM              PIC  X(00006).
170224*       고객식별자
           03 WK-H-DO1-CUST-IDNFR           PIC  X(00010).
      *       상품대분류코드
           03 WK-H-DO1-PRDCT-LAG-CLSFI-CD   PIC  X(00002).
      *       상품중분류코드
           03 WK-H-DO1-PRDCT-MEDM-CLSFI-CD  PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-DO1-PRDCT-TMPLT-CD       PIC  X(00003).
      *       상품번호
           03 WK-H-DO1-PRDCT-NO             PIC  X(00005).

       01  WK-HOST-OUT1.
      *       기준년월
           03 WK-H-O1-BASE-YM               PIC  X(00006).
      *       기준일
           03 WK-H-O1-BASE-DD               PIC  X(00002).
170224*       고객식별자
           03 WK-H-O1-CUST-IDNFR            PIC  X(00010).
      *       상품대분류코드
           03 WK-H-O1-PRDCT-LAG-CLSFI-CD    PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O1-PRDCT-MEDM-CLSFI-CD   PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O1-PRDCT-TMPLT-CD        PIC  X(00003).
      *       상품번호
           03 WK-H-O1-PRDCT-NO              PIC  X(00005).
      *       BS기준잔액
           03 WK-H-O1-BS-BASE-BAL           PIC S9(00015) COMP-3.
      *       CA담보환산금액
           03 WK-H-O1-CA-SCURTY-AUC         PIC S9(00015) COMP-3.
      *       제외자산금액
           03 WK-H-O1-ECLUD-ASAM            PIC S9(00015) COMP-3.

210218 01  WK-HOST-DEL-OUT2.
      *       그룹회사코드
           03 WK-H-DO2-GROUP-CO-CD          PIC  X(00003).
      *       기준년월
           03 WK-H-DO2-BASE-YM              PIC  X(00006).
170224*       고객식별자
           03 WK-H-DO2-CUST-IDNFR           PIC  X(00010).
      *       상품대분류코드
           03 WK-H-DO2-PRDCT-LAG-CLSFI-CD   PIC  X(00002).
      *       상품중분류코드
           03 WK-H-DO2-PRDCT-MEDM-CLSFI-CD  PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-DO2-PRDCT-TMPLT-CD       PIC  X(00003).
      *       상품번호
           03 WK-H-DO2-PRDCT-NO             PIC  X(00005).

       01  WK-HOST-OUT2.
      *       기준년월
           03 WK-H-O2-BASE-YM               PIC  X(00006).
170224*       고객식별자
           03 WK-H-O2-CUST-IDNFR            PIC  X(00010).
      *       상품대분류코드
           03 WK-H-O2-PRDCT-LAG-CLSFI-CD    PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O2-PRDCT-MEDM-CLSFI-CD   PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O2-PRDCT-TMPLT-CD        PIC  X(00003).
      *       상품번호
           03 WK-H-O2-PRDCT-NO              PIC  X(00005).
      *       BS기준잔액
           03 WK-H-O2-BS-BASE-BAL           PIC S9(00015) COMP-3.
      *       CA담보환산금액
           03 WK-H-O2-CA-SCURTY-AUC         PIC S9(00015) COMP-3.
      *       제외자산금액
           03 WK-H-O2-ECLUD-ASAM            PIC S9(00015) COMP-3.
       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
210218*   재작업용 삭제대상
           EXEC SQL
            DECLARE  THKJL0033_DEL_CUR   CURSOR  WITH HOLD FOR
             SELECT  그룹회사코드
                  ,  기준일
                  ,  기준년월
                  ,  고객식별자
                  ,  상품대분류코드
                  ,  상품중분류코드
                  ,  상품템플릿코드
                  ,  상품번호
               FROM  DB2DBA.THKJL0033
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준일       = :WK-H-I-BASE-DD
           END-EXEC

            EXEC SQL
            DECLARE  THKJL0125_CUR   CURSOR  WITH HOLD FOR
             SELECT  AA.기준년월
                  ,  AA.기준일
                  ,  VALUE( AA.고객식별자,'----------') 고객식별자
                  ,  AA.상품대분류코드
                  ,  AA.상품중분류코드
                  ,  AA.상품템플릿코드
                  ,  AA.상품번호
                  ,  SUM(AA."BS기준잔액")
                  ,  SUM(AA."CA담보환산금액")
                  ,  SUM(AA.제외자산금액)
               FROM  (
             SELECT  A.기준년월
                  ,  A.기준일
                  ,  A.고객식별자
                  ,  A.상품대분류코드
                  ,  A.상품중분류코드
                  ,  A.상품템플릿코드
                  ,  A.상품번호
                  ,  A."BS기준잔액"
                  ,  A."CA담보환산금액"
                  , (CASE
                     WHEN C."CA대상계정여부" = '1'
                     THEN A."BS기준잔액" - A."CA담보환산금액"
                     ELSE 0
                     END) AS 제외자산금액
               FROM  DB2DBA.THKJL0125 A
180914            ,  DB2DBA.THKJL0118 C
              WHERE  A.그룹회사코드  = :WK-H-I-GROUP-CO-CD
                AND  A.기준일        = :WK-H-I-BASE-DD
                AND  A.기준년월      = :WK-H-I-BASE-YM
                AND  A.고객식별자
                     NOT IN ( '----------','==========',
                              '          ','**********',
                              '$$$$$$$$$$')
                AND  A."TE계좌고객구분"  IN ('1','2')
                AND  A.그룹회사코드   = C.그룹회사코드
                AND  A.기준년월       = C.기준년월
                AND  A.상품대분류코드 = C.상품대분류코드
                AND  A.상품중분류코드 = C.상품중분류코드
                AND  A.상품템플릿코드 = C.상품템플릿코드
                AND  A.상품번호       = C.상품번호
                  )  AA
           GROUP BY  AA.기준년월
                  ,  AA.기준일
                  ,  AA.고객식별자
                  ,  AA.상품대분류코드
                  ,  AA.상품중분류코드
                  ,  AA.상품템플릿코드
                  ,  AA.상품번호
           END-EXEC.

210218*   재작업용 삭제대상
           EXEC SQL
            DECLARE  THKJL0034_DEL_CUR   CURSOR  WITH HOLD FOR
             SELECT  그룹회사코드
                  ,  기준년월
                  ,  고객식별자
                  ,  상품대분류코드
                  ,  상품중분류코드
                  ,  상품템플릿코드
                  ,  상품번호
               FROM  DB2DBA.THKJL0034
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
           END-EXEC

           EXEC SQL
            DECLARE  THKJL0033_CUR     CURSOR WITH HOLD FOR
             SELECT  :WK-H-I-BASE-YM
                  ,  고객식별자
                  ,  상품대분류코드
                  ,  상품중분류코드
                  ,  상품템플릿코드
                  ,  상품번호
                  ,  "BS기준잔액"
                  ,  "CA담보환산금액"
                  ,  제외자산금액
               FROM  DB2DBA.THKJL0033
              WHERE  그룹회사코드  = :WK-H-I-GROUP-CO-CD
                AND  기준일        = :WK-H-I-BASE-DD
                AND  기준년월      = :WK-H-I-BASE-YM
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-KJL0033-DELETE-RTN
              THRU  S3000-KJL0033-DELETE-EXT

           PERFORM  S3000-KJL0025-PROCESS-RTN
              THRU  S3000-KJL0025-PROCESS-EXT

      *@  영업말일을　추출한다
           PERFORM  S6000-XCJIIL09-CALL-RTN
              THRU  S6000-XCJIIL09-CALL-EXT

      *@  매월영업말일일경우　신용공여　차주별　월집계정보　추출
           IF  WK-SYSIN-BASE-YMD = XCJIIL09-O-ENMN-BZOPR-YMD
           THEN
               PERFORM  S5000-KJL0034-DELETE-RTN
                  THRU  S5000-KJL0034-DELETE-EXT
               PERFORM  S5000-KJL0034-PROCESS-RTN
                  THRU  S5000-KJL0034-PROCESS-EXT
           END-IF

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@DBIO, SQLIO PARAMETER 초기화
           INITIALIZE       WK-AREA
                            WK-SYSIN
                            YCDBIOCA-CA
                            XZUGEROR-CA

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD331 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   차주신용공여일집계(THKJL0033)삭제
      *-----------------------------------------------------------------
       S3000-KJL0033-DELETE-RTN.

           #USRLOG '*DELETE START TIME : ' FUNCTION CURRENT-DATE

           PERFORM  S3100-KJL0033-OPEN-RTN
              THRU  S3100-KJL0033-OPEN-EXT

           PERFORM  S3200-KJL0033-FETCH-RTN
              THRU  S3200-KJL0033-FETCH-EXT

           PERFORM  UNTIL EOF-Y

                    PERFORM  S3300-KJL0033-DELETE-RTN
                       THRU  S3300-KJL0033-DELETE-EXT

                    PERFORM  S3200-KJL0033-FETCH-RTN
                       THRU  S3200-KJL0033-FETCH-EXT
           END-PERFORM

      *    DELETE 1000건 단위 COMMIT 처리
           INITIALIZE                      WK-AREA1
           MOVE  'KJL0033'             TO  WK-TBL-ID
           MOVE  'LAST'                TO  WK-FUNC-CD
           MOVE   WK-AC-DELETE-CNT1    TO  WK-REC-CNT

           PERFORM  S8000-COMMIT-PROCESS-RTN
              THRU  S8000-COMMIT-PROCESS-EXT

           PERFORM  S3400-KJL0033-CLOSE-RTN
              THRU  S3400-KJL0033-CLOSE-EXT

           #USRLOG '*DELETE END   TIME : ' FUNCTION CURRENT-DATE
           .

       S3000-KJL0033-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0033-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0033_DEL_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0033-OPEN-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0033-FETCH-RTN.

           INITIALIZE                  WK-HOST-DEL-OUT1

           EXEC SQL
              FETCH  THKJL0033_DEL_CUR
               INTO  :WK-HOST-DEL-OUT1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD   CO-NUM-1    TO  WK-AC-DEL-FET-CNT1
               WHEN  CO-SQL-NTFND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0033-FETCH-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   차주신용공여일집계(THKJL0033)삭제
      *-----------------------------------------------------------------
       S3300-KJL0033-DELETE-RTN.

           EXEC SQL
             DELETE  FROM DB2DBA.THKJL0033
              WHERE  그룹회사코드     = :WK-H-DO1-GROUP-CO-CD
                AND  기준일           = :WK-H-DO1-BASE-DD
                AND  기준년월         = :WK-H-DO1-BASE-YM
                AND  고객식별자       = :WK-H-DO1-CUST-IDNFR
                AND  상품대분류코드   = :WK-H-DO1-PRDCT-LAG-CLSFI-CD
                AND  상품중분류코드   = :WK-H-DO1-PRDCT-MEDM-CLSFI-CD
                AND  상품템플릿코드   = :WK-H-DO1-PRDCT-TMPLT-CD
                AND  상품번호         = :WK-H-DO1-PRDCT-NO
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD  CO-NUM-1     TO  WK-AC-DELETE-CNT1

      *    DELETE 1000건 단위 COMMIT 처리
                     INITIALIZE                      WK-AREA1
                     MOVE  'KJL0033'             TO  WK-TBL-ID
                     MOVE  'DELETE'              TO  WK-FUNC-CD
                     MOVE   WK-AC-DELETE-CNT1    TO  WK-REC-CNT

                     PERFORM  S8000-COMMIT-PROCESS-RTN
                        THRU  S8000-COMMIT-PROCESS-EXT

               WHEN  CO-SQL-NTFND
                     #USRLOG '<< THKJL0033 DELETE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *@에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S3300-KJL0033-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJL0033-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0033_DEL_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S3400-KJL0033-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   업무처리
      *-----------------------------------------------------------------
       S3000-KJL0025-PROCESS-RTN.

           PERFORM  S3100-KJL0025-OPEN-RTN
              THRU  S3100-KJL0025-OPEN-EXT

           PERFORM  S3200-KJL0025-FETCH-RTN
              THRU  S3200-KJL0025-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

      *            고객식별자 없으면 제외함
                    IF  WK-H-O1-CUST-IDNFR = '----------'
                    THEN
                        ADD   CO-NUM-1
                         TO   WK-AC-SK-CNT1
                    ELSE
                        PERFORM  S3300-KJL0033-INSERT-RTN
                           THRU  S3300-KJL0033-INSERT-EXT
                    END-IF

                    PERFORM  S3200-KJL0025-FETCH-RTN
                       THRU  S3200-KJL0025-FETCH-EXT
           END-PERFORM

           PERFORM  S3400-KJL0025-CLOSE-RTN
              THRU  S3400-KJL0025-CLOSE-EXT
           .
       S3000-KJL0025-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0025-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0125_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0025'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0025-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0025-FETCH-RTN.

           EXEC SQL
              FETCH  THKJL0125_CUR
               INTO  :WK-HOST-OUT1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT1
               WHEN  CO-SQL-NTFND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0025'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0025-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   차주신용공여일집계(THKJL0033)등록
      *-----------------------------------------------------------------
       S3300-KJL0033-INSERT-RTN.

           INITIALIZE    TKJL0033-KEY
                         TRJL0033-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0033-GROUP-CO-CD

      *    기준일
           MOVE  WK-H-I-BASE-DD
             TO  RJL0033-BASE-DD

      *    기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0033-BASE-YM

170224*    고객식별자
           MOVE  WK-H-O1-CUST-IDNFR
             TO  RJL0033-CUST-IDNFR

      *    상품대분류코드
           MOVE  WK-H-O1-PRDCT-LAG-CLSFI-CD
             TO  RJL0033-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O1-PRDCT-MEDM-CLSFI-CD
             TO  RJL0033-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O1-PRDCT-TMPLT-CD
             TO  RJL0033-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O1-PRDCT-NO
             TO  RJL0033-PRDCT-NO

      *    BS기준잔액
           MOVE  WK-H-O1-BS-BASE-BAL
             TO  RJL0033-BS-BASE-BAL

      *    CA담보환산금액
           MOVE  WK-H-O1-CA-SCURTY-AUC
             TO  RJL0033-CA-SCURTY-AUC

      *    제외자산금액
           MOVE  WK-H-O1-ECLUD-ASAM
             TO  RJL0033-ECLUD-ASAM

210218**DB  LOG  WRITE START
           IF  WK-AC-INT-CNT1 < CO-NUM-1000
               SET  COND-DBIO-CHGLOG-YES  TO TRUE
           ELSE
               SET  COND-DBIO-CHGLOG-NO   TO TRUE
           END-IF

           #DYDBIO  INSERT-CMD-Y TKJL0033-PK TRJL0033-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT1
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *    1000건　마다　 DISPLAY
           IF  FUNCTION MOD(WK-AC-FE-CNT1, 1000) = CO-NUM-0
               #USRLOG '* WK-AC-INT-CNT1  = ' WK-AC-INT-CNT1
           END-IF

      *    10건　마다 COMMIT
           IF  FUNCTION MOD(WK-AC-FE-CNT1, 10) = CO-NUM-0

               EXEC SQL
                 COMMIT
               END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처
               EVALUATE  SQLCODE
                   WHEN  CO-SQL-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF
           .
       S3300-KJL0033-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJL0025-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0125_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0025'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-KJL0025-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   차주신용공여월집계(THKJL0034)삭제
      *-----------------------------------------------------------------
       S5000-KJL0034-DELETE-RTN.

           #USRLOG '*DELETE START TIME : ' FUNCTION CURRENT-DATE

           PERFORM  S5100-KJL0034-OPEN-RTN
              THRU  S5100-KJL0034-OPEN-EXT

           PERFORM  S5200-KJL0034-FETCH-RTN
              THRU  S5200-KJL0034-FETCH-EXT

           PERFORM  UNTIL EOF-Y

                    PERFORM  S5300-KJL0034-DELETE-RTN
                       THRU  S5300-KJL0034-DELETE-EXT

                    PERFORM  S5200-KJL0034-FETCH-RTN
                       THRU  S5200-KJL0034-FETCH-EXT
           END-PERFORM

      *    DELETE 1000건 단위 COMMIT 처리
           INITIALIZE                      WK-AREA1
           MOVE  'KJL0034'             TO  WK-TBL-ID
           MOVE  'LAST'                TO  WK-FUNC-CD
           MOVE   WK-AC-DELETE-CNT2    TO  WK-REC-CNT

           PERFORM  S8000-COMMIT-PROCESS-RTN
              THRU  S8000-COMMIT-PROCESS-EXT

           PERFORM  S5400-KJL0034-CLOSE-RTN
              THRU  S5400-KJL0034-CLOSE-EXT

           #USRLOG '*DELETE END   TIME : ' FUNCTION CURRENT-DATE
           .

       S5000-KJL0034-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR OPEN
      *-----------------------------------------------------------------
       S5100-KJL0034-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0034_DEL_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S5100-KJL0034-OPEN-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR FETCH
      *-----------------------------------------------------------------
       S5200-KJL0034-FETCH-RTN.

           INITIALIZE                  WK-HOST-DEL-OUT2

           EXEC SQL
              FETCH  THKJL0034_DEL_CUR
               INTO  :WK-HOST-DEL-OUT2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD   CO-NUM-1    TO  WK-AC-DEL-FET-CNT2
               WHEN  CO-SQL-NTFND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S5200-KJL0034-FETCH-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   차주신용공여월집계(THKJL0034)삭제
      *-----------------------------------------------------------------
       S5300-KJL0034-DELETE-RTN.

           EXEC SQL
             DELETE  FROM DB2DBA.THKJL0034
              WHERE  그룹회사코드     = :WK-H-DO2-GROUP-CO-CD
                AND  기준년월         = :WK-H-DO2-BASE-YM
                AND  고객식별자       = :WK-H-DO2-CUST-IDNFR
                AND  상품대분류코드   = :WK-H-DO2-PRDCT-LAG-CLSFI-CD
                AND  상품중분류코드   = :WK-H-DO2-PRDCT-MEDM-CLSFI-CD
                AND  상품템플릿코드   = :WK-H-DO2-PRDCT-TMPLT-CD
                AND  상품번호         = :WK-H-DO2-PRDCT-NO
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD  CO-NUM-1     TO  WK-AC-DELETE-CNT2

      *    DELETE 1000건 단위 COMMIT 처리
                     INITIALIZE                      WK-AREA1
                     MOVE  'KJL0034'             TO  WK-TBL-ID
                     MOVE  'DELETE'              TO  WK-FUNC-CD
                     MOVE   WK-AC-DELETE-CNT2    TO  WK-REC-CNT

                     PERFORM  S8000-COMMIT-PROCESS-RTN
                        THRU  S8000-COMMIT-PROCESS-EXT

               WHEN  CO-SQL-NTFND
                     #USRLOG '<< THKJL0034 DELETE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *@에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S5300-KJL0034-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
210218*@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S5400-KJL0034-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0034_DEL_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S5400-KJL0034-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   업무처리
      *-----------------------------------------------------------------
       S5000-KJL0034-PROCESS-RTN.

           PERFORM  S5100-KJL0033-OPEN-RTN
              THRU  S5100-KJL0033-OPEN-EXT

           PERFORM  S5200-KJL0033-FETCH-RTN
              THRU  S5200-KJL0033-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

                    PERFORM  S5300-KJL0034-INSERT-RTN
                       THRU  S5300-KJL0034-INSERT-EXT

                    PERFORM  S5200-KJL0033-FETCH-RTN
                       THRU  S5200-KJL0033-FETCH-EXT
           END-PERFORM

           PERFORM  S5400-KJL0033-CLOSE-RTN
              THRU  S5400-KJL0033-CLOSE-EXT
           .
       S5000-KJL0034-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S5100-KJL0033-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0033_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S5100-KJL0033-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S5200-KJL0033-FETCH-RTN.

           EXEC SQL
              FETCH  THKJL0033_CUR
               INTO  :WK-HOST-OUT2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT2
               WHEN  CO-SQL-NTFND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S5200-KJL0033-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   차주신용공여월집계(THKJL0034)등록
      *-----------------------------------------------------------------
       S5300-KJL0034-INSERT-RTN.

           INITIALIZE    TKJL0034-KEY
                         TRJL0034-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0034-GROUP-CO-CD

      *    기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0034-BASE-YM

170224*    고객식별자
           MOVE  WK-H-O2-CUST-IDNFR
             TO  RJL0034-CUST-IDNFR

      *    상품대분류코드
           MOVE  WK-H-O2-PRDCT-LAG-CLSFI-CD
             TO  RJL0034-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O2-PRDCT-MEDM-CLSFI-CD
             TO  RJL0034-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O2-PRDCT-TMPLT-CD
             TO  RJL0034-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O2-PRDCT-NO
             TO  RJL0034-PRDCT-NO

      *    BS기준잔액
           MOVE  WK-H-O2-BS-BASE-BAL
             TO  RJL0034-BS-BASE-BAL

      *    CA담보환산금액
           MOVE  WK-H-O2-CA-SCURTY-AUC
             TO  RJL0034-CA-SCURTY-AUC

      *    제외자산금액
           MOVE  WK-H-O2-ECLUD-ASAM
             TO  RJL0034-ECLUD-ASAM

210218**DB  LOG  WRITE START
           IF  WK-AC-INT-CNT2 < CO-NUM-1000
               SET  COND-DBIO-CHGLOG-YES  TO TRUE
           ELSE
               SET  COND-DBIO-CHGLOG-NO   TO TRUE
           END-IF

           #DYDBIO  INSERT-CMD-Y TKJL0034-PK TRJL0034-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT2
               WHEN  OTHER
                     MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *    1000건　마다　 DISPLAY
           IF  FUNCTION MOD(WK-AC-INT-CNT2, 1000) = CO-NUM-0
               #USRLOG '* WK-AC-INT-CNT2  = ' WK-AC-INT-CNT2
           END-IF

      *    10건　마다　 COMMIT
           IF  FUNCTION MOD(WK-AC-INT-CNT2, 10) = CO-NUM-0
               EXEC SQL
                 COMMIT
               END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처
               EVALUATE  SQLCODE
                   WHEN  CO-SQL-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0034'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

                               .
       S5300-KJL0034-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S5400-KJL0033-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0033_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S5400-KJL0033-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   월말영업일　산출
      *-----------------------------------------------------------------
       S6000-XCJIIL09-CALL-RTN.

           INITIALIZE    XCJIIL09-CA

      *   그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  XCJIIL09-I-GROUP-CO-CD

      *   구분코드
           MOVE  CO-CHA-1
             TO  XCJIIL09-I-DSTCD

      *   년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  XCJIIL09-I-YMD

      *   감산월
           MOVE  CO-NUM-0
             TO  XCJIIL09-I-PLS-SBTR-MN

           #DYCALL  CJIIL09  YCCOMMON-CA  XCJIIL09-CA

           IF  XCJIIL09-R-STAT NOT = CO-STAT-OK
               #ERROR  XCJIIL09-R-ERRCD
                       XCJIIL09-R-TREAT-CD
                       XCJIIL09-R-STAT
               #OKEXIT CO-CHA-08
           END-IF
           .
       S6000-XCJIIL09-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SQL 문장을 직접 기술하여 Commit 발행
      *-----------------------------------------------------------------
       S8000-COMMIT-PROCESS-RTN.

      *    1000 건　마다　 COMMIT & USRLOG
           IF  (FUNCTION MOD(WK-REC-CNT, 1000) = CO-NUM-0)  OR
               (WK-FUNC-CD                     = 'LAST'  )

               #USRLOG  '*' WK-TBL-ID '-' WK-FUNC-CD '-' WK-REC-CNT

               EXEC SQL
                    COMMIT
               END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처리
               EVALUATE  SQLCODE
                   WHEN  CO-SQL-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE  WK-TBL-ID   TO  XZUGEROR-I-TBL-ID
                         MOVE  WK-FUNC-CD  TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF
           .

       S8000-COMMIT-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0033_DEL_CUR COUNT= ' WK-AC-DEL-FET-CNT1
           #USRLOG '* KJL0033 DELETE    COUNT= ' WK-AC-DELETE-CNT1
           #USRLOG '* THKJL0125_CUR   COUNT  = ' WK-AC-FE-CNT1
           #USRLOG '* KJL0033 SKIP    COUNT  = ' WK-AC-SK-CNT1
           #USRLOG '* KJL0033 INSERT  COUNT  = ' WK-AC-INT-CNT1
           #USRLOG '*--------------------------------------*'
           IF  WK-SYSIN-BASE-YMD = XCJIIL09-O-ENMN-BZOPR-YMD
           #USRLOG '* THKJL0034_DEL_CUR COUNT= ' WK-AC-DEL-FET-CNT2
           #USRLOG '* KJL0034 DELETE    COUNT= ' WK-AC-DELETE-CNT2
           #USRLOG '* THKJL0033_CUR   COUNT  = ' WK-AC-FE-CNT2
           #USRLOG '* KJL0034 INSERT  COUNT  = ' WK-AC-INT-CNT2
           #USRLOG '*--------------------------------------*'
           END-IF
           #USRLOG '* BJLD331 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
