      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLDR81 (BT파생상품거래별평가금액현황적재)
      *@처리유형  : BATCH
      *@처리개요  : 수보받은파생상품거래별평가금액현황적재
      *@원천파일  : FF#.SHRDWA.DEAL.REVAL(204 BYTES) - EDW
      *@수보파일  : KJL.SD.BJLDR81.V001(250 BYTES)
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *김진태:20100104: 신규작성
      *김진태:20100115: 테이블컬럼변경
      *백현정:20100531: 인스턴스코드（여부）Y/N -> 1/0으로　변경
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM       : 테이블명                : 접근유형
      **  ----------------   -------------------------------------------
      ** 거래건별평가금액   :  THKJLR008                : CD
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLDR81.
       AUTHOR.                         김진태.
       DATE-WRITTEN.                   10/01/04.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT IN-FILE              ASSIGN       TO  INFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  IN-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  IN-REC.
      *       기준년월일
           03 IN-BASE-YMD                   PIC  X(00008).
      *       외화거래번호
           03 IN-FC-TRAN-NO                 PIC  X(00010).
      *       차주번호
           03 IN-BRWR-NO                    PIC  X(00013).
      *       외화고객고유번호
           03 IN-FC-CUNIQNO                 PIC  X(00016).
      *       차주명
           03 IN-BRWR-NAME                  PIC  X(00040).
      *       네팅여부
           03 IN-NTNG-YN                    PIC  X(00001).
      *       파생상품코드
           03 IN-DRVT-PRDCT-CD              PIC  X(00005).
      *       상품유형코드
           03 IN-PRDCT-PTRN-CD              PIC  X(00005).
      *       매입매도구분
           03 IN-BUY-SELLZ-DSTCD            PIC  X(00001).
      *       거래년월일
           03 IN-TRAN-YMD                   PIC  X(00008).
      *       만기년월일
           03 IN-EXPIR-YMD                  PIC  X(00008).
      *       거래통화코드
           03 IN-TRAN-CNCYCD                PIC  X(00003).
      *       거래통화금액
           03 IN-TRAN-CRNCY-AMT             PIC  9(00013).99.
      *       상대통화코드
           03 IN-CNPRT-CNCYCD               PIC  X(00003).
      *       상대통화금액
           03 IN-CNPRT-CRNCY-AMT            PIC  9(00013).99.
      *       평가금액
           03 IN-VALPR                      PIC  -(00014)9.
      *       추가항목금액
           03 IN-SUPPL-ITEM-AMT             PIC  -(00014)9.
      *       영업부점
           03 IN-BRNCD                      PIC  X(00004).
      *       고객식별자
           03 IN-CUST-IDNFR                 PIC  X(00010).
      *       고객관리번호
           03 IN-CUST-MGT-NO                PIC  X(00005).
      *       ISO국가코드
           03 IN-ISO-NATNL-CD               PIC  X(00002).
      *       예약
           03 IN-RESERVED                   PIC  X(00046).
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLDR81'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-K                PIC  X(001) VALUE 'K'.
           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.
           03  CO-CHA-N                PIC  X(001) VALUE 'N'.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-AMEM             PIC  X(004) VALUE 'AMEM'.

           03  CO-NUM-1                PIC  9(001) VALUE  1.
           03  CO-NUM-40               PIC  9(002) VALUE  40.
           03  CO-NUM-42               PIC  9(002) VALUE  42.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-IN-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-READ-CNT          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INSERT-CNT        PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  IN-EOF-Y                        VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *    일련번호
           03  WK-SEQ                  PIC  9(007) COMP.
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * TABLE KEY COPYBOOK
       01  TKJLR008-KEY.
           COPY    TKJLR008.
      * TABLE RECORD COPYBOOK
       01  TRJLR008-REC.
           COPY    TRJLR008.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * DBIO INTERFACE COPYBOOK
           COPY    YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA       END-EXEC.
       EXEC  SQL  BEGIN  DECLARE       SECTION  END-EXEC.
       01  WK-HOST-IN.
      *        그룹회사코드
           03  WK-H-I-GROUP-CO-CD          PIC  X(003).
      *        기준년월일
           03  WK-H-I-BASE-YMD             PIC  X(008).
      *       기준일
           03  WK-H-I-BASE-DD              PIC  X(002).
       EXEC  SQL  END  DECLARE         SECTION  END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM S3000-SYSDATA-MOVE-RTN
              THRU S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM S3000-KJLR008-DELETE-RTN
              THRU S3000-KJLR008-DELETE-EXT
           PERFORM S3000-KJLR008-PROCESS-RTN
              THRU S3000-KJLR008-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@ 초기화
           INITIALIZE WK-AREA
                      WK-SYSIN
                      YCDBIOCA-CA

      *@JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN  FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLDR81 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *@   그룹회사코드
           MOVE WK-SYSIN-GROUP-CD
             TO BICOM-GROUP-CO-CD

      *@   구분코드
           MOVE WK-SYSIN-JOB-YMD
             TO BICOM-TRAN-BASE-YMD

      *@   공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *@   RETURN 정보 확인
           IF XBJISTDT-R-STAT = ZEROS
      *@      정상처리
              CONTINUE
           ELSE
      *@      에러처리
              #ERROR   XBJISTDT-R-ERRCD
                       XBJISTDT-R-TREAT-CD
                       XBJISTDT-R-STAT
              #OKEXIT  CO-CHA-08
           END-IF

      *@ FILE OPEN ROUTINE CALL
           PERFORM S1100-FILE-OPEN-RTN
              THRU S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

      *@   초기화
           INITIALIZE  WK-SWITCHES

      *@   OPEN INPUT FILE
           OPEN INPUT IN-FILE

      *@   결과확인
           IF WK-IN-F-ST NOT = CO-STAT-OK
              MOVE 'IN-FILE OPEN ERROR : FILE-ST IS '
                TO XZUGEROR-I-MSG
              MOVE WK-IN-F-ST  TO  XZUGEROR-I-MSG(34:2)
              #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
              #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@  그룹회사구분코드
           IF WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
              MOVE '그룹회사구분코드 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  작업실행일
           IF WK-SYSIN-JOB-YMD = SPACE
              MOVE '작업실행일 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  작업명
           IF WK-SYSIN-JOB-NAME = SPACE
              MOVE '작업명 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  처리회차
           IF WK-SYSIN-JOB-SEQ = SPACE
              MOVE '처리회차 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  배치작업구분
           IF WK-SYSIN-BATCH-GB = SPACE
              MOVE '배치작업구분 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  작업자ID
           IF WK-SYSIN-WORK-ID = SPACE
              MOVE '작업자ID 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

      *@  자료기준년월일
           IF WK-SYSIN-BASE-YMD = SPACE
              MOVE '자료기준년월일 미입력 오류입니다.'
                TO XZUGEROR-I-MSG
              #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

      *@   초기화
           INITIALIZE WK-HOST-IN

      *@   그룹회사구분코드
           MOVE WK-SYSIN-GROUP-CD
             TO WK-H-I-GROUP-CO-CD

      *@   기준년월일
           MOVE WK-SYSIN-BASE-YMD
             TO WK-H-I-BASE-YMD

      *@   기준일
           MOVE WK-SYSIN-BASE-YMD(7:2)
             TO WK-H-I-BASE-DD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   파생상품거래별평가금액(THKJLR008)삭제
      *-----------------------------------------------------------------
       S3000-KJLR008-DELETE-RTN.

      *@ TABLE LOCK
           EXEC SQL
               LOCK TABLE DB2DBA.THKJLR008 IN EXCLUSIVE MODE
           END-EXEC

      *@ TABLE DELETE
           EXEC SQL
             DELETE
               FROM DB2DBA.THKJLR008
              WHERE 그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND SUBSTR(기준년월일,7,2) = :WK-H-I-BASE-DD
           END-EXEC

      *@   결과확인
           EVALUATE SQLCODE
               WHEN CO-OK
               WHEN CO-NOT-FOUND
                    CONTINUE
               WHEN OTHER
                    MOVE 'KJLR008'    TO  XZUGEROR-I-TBL-ID
                    MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                    MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                    MOVE 'DELETE시 오류가 발생했습니다'
                      TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                    #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                    #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      *@Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처리
           EVALUATE SQLCODE
               WHEN CO-OK
                    CONTINUE
               WHEN OTHER
                    MOVE 'KJLR008'    TO  XZUGEROR-I-TBL-ID
                    MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                    MOVE SQLCODE     TO  XZUGEROR-I-SQL-CD
                    MOVE 'DB  Commit 시   오류가   발생했습니다 '
                      TO XZUGEROR-I-MSG
                    #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                    #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJLR008-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-KJLR008-PROCESS-RTN.

      *@   SAM FILE READ ROUTINE CALL
           PERFORM S3200-READ-FILE-RTN
              THRU S3200-READ-FILE-EXT

      *@   SAM FILE READ LOOP
           PERFORM UNTIL IN-EOF-Y
      *기준년월일＝자료기준일자　일치　확인　로직　삭제
      *사유：ＦＦ＃．ＳＨＲＤＷＡ．ＥＸＰＯＳＵＲＥ파일이
      *　　　ＥＤＷ에적재되는시간이오전１０시이후이며이시간이후
      *　　　일일작업을진행할수없으므로Ｄ－２일자료를사용하기로함
      *      IF WK-SYSIN-BASE-YMD NOT = IN-BASE-YMD
      *         #USRLOG '*--------------------------------------*'
      *         #USRLOG '작업기준일자／자료기준일자　불일치.'
      *         #USRLOG 'SYSIN  DATE = ' WK-SYSIN-BASE-YMD
      *         #USRLOG 'INFILE DATE = ' IN-BASE-YMD
      *         PERFORM S9000-FINAL-RTN
      *            THRU S9000-FINAL-EXT
      *      END-IF

      *@     THKJLR008 INSERT ROUTINE
             PERFORM S3300-KJLR008-INSERT-RTN
                THRU S3300-KJLR008-INSERT-EXT
      *@     SAM FILE READ ROUTINE CALL
             PERFORM S3200-READ-FILE-RTN
                THRU S3200-READ-FILE-EXT
           END-PERFORM
           .
       S3000-KJLR008-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@ READ FILE
      *-----------------------------------------------------------------
       S3200-READ-FILE-RTN.

      *@   READ  FILE
           READ  IN-FILE  AT  END
             SET IN-EOF-Y TO  TRUE
           END-READ

      *@   결과확인
           EVALUATE WK-IN-F-ST
               WHEN ZERO
               WHEN CO-CHA-04
                    ADD   CO-NUM-1    TO  WK-AC-READ-CNT
               WHEN CO-CHA-10
                    SET   IN-EOF-Y    TO  TRUE
               WHEN OTHER
                    MOVE 'IN-FILE OPEN ERROR : FILE-ST IS '
                      TO XZUGEROR-I-MSG
                    MOVE WK-IN-F-ST  TO  XZUGEROR-I-MSG(34:2)
                    #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
                    #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-READ-FILE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  파생상품거래별평가금액(THKJLR008)등록
      *-----------------------------------------------------------------
       S3300-KJLR008-INSERT-RTN.

      *@   초기화
           INITIALIZE TKJLR008-KEY
                      TRJLR008-REC

      *@   그룹회사코드
           MOVE WK-H-I-GROUP-CO-CD
             TO RJLR008-GROUP-CO-CD

      *@   기준년월일
           MOVE WK-H-I-BASE-YMD
             TO RJLR008-BASE-YMD

      *@   외화거래번호
           MOVE IN-FC-TRAN-NO
             TO RJLR008-FC-TRAN-NO

      *@   파생상품구분
           MOVE IN-DRVT-PRDCT-CD
             TO RJLR008-DRVT-PRDCT-DSTCD

      *@   일련번호<-SEQ+1
           ADD   CO-NUM-1  TO  WK-SEQ
           MOVE  WK-SEQ
             TO  RJLR008-SERNO

      *@   차주번호
           MOVE IN-BRWR-NO
             TO RJLR008-BRWR-NO

      *@   외화고객고유번호
           MOVE IN-FC-CUNIQNO
             TO RJLR008-FC-CUNIQNO

      *@   고객식별자
           MOVE IN-CUST-IDNFR
             TO RJLR008-CUST-IDNFR

      *@   고객관리번호
           MOVE IN-CUST-MGT-NO
             TO RJLR008-CUST-MGT-NO

      *-----------------------------------------------------------------
      *백현정:20100531: 인스턴스코드（여부）Y/N -> 1/0으로　변경
      *-----------------------------------------------------------------
      *@   네팅여부
           IF  IN-NTNG-YN = CO-CHA-Y
           THEN
               MOVE CO-CHA-1
                 TO RJLR008-NTNG-YN
           ELSE
               MOVE CO-CHA-0
                 TO RJLR008-NTNG-YN
           END-IF
      *-----------------------------------------------------------------

      *@   외화상품유형구분
           MOVE IN-PRDCT-PTRN-CD(1:3)
             TO RJLR008-FC-PRDCT-PTRN-DSTCD

      *@   매입매도구분
           MOVE IN-BUY-SELLZ-DSTCD
             TO RJLR008-BUY-SELLZ-DSTCD

      *@   거래년월일
           MOVE IN-TRAN-YMD
             TO RJLR008-TRAN-YMD

      *@   만기년월일
           MOVE IN-EXPIR-YMD
             TO RJLR008-EXPIR-YMD

      *@   거래통화코드
           MOVE IN-TRAN-CNCYCD
             TO RJLR008-TRAN-CNCYCD

      *@   거래통화금액
           MOVE IN-TRAN-CRNCY-AMT
             TO RJLR008-TRAN-CRNCY-AMT

      *@   상대통화코드
           MOVE IN-CNPRT-CNCYCD
             TO RJLR008-CNPRT-CNCYCD

      *@   상대통화금액
           MOVE IN-CNPRT-CRNCY-AMT
             TO RJLR008-CNPRT-CRNCY-AMT

      *@   평가금액
           MOVE IN-VALPR
             TO RJLR008-VALPR

      *@   추가항목금액
           MOVE IN-SUPPL-ITEM-AMT
             TO RJLR008-SUPPL-ITEM-AMT

      *@   영업부점코드
           MOVE IN-BRNCD
             TO RJLR008-BZOPR-BRNCD

      *@   ISO국가코드
           MOVE IN-ISO-NATNL-CD
             TO RJLR008-ISO-NATNL-CD

      *@   DBIO CALL
           #DYDBIO  INSERT-CMD-Y TKJLR008-PK TRJLR008-REC

      *@   결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    ADD  CO-NUM-1    TO  WK-AC-INSERT-CNT
               WHEN OTHER
                    MOVE 'KJLR008'   TO  XZUGEROR-I-TBL-ID
                    MOVE 'INSERT'    TO  XZUGEROR-I-FUNC-CD
                    MOVE DBIO-SQLCODE
                      TO XZUGEROR-I-SQL-CD
                    MOVE 'INSERT시 오류가 발생했습니다'
                      TO XZUGEROR-I-MSG
                    #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                    #USRLOG 'TRAN-NO = ' IN-FC-TRAN-NO
                    #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KJLR008-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

      *@   CLOSE  FILE
           CLOSE  IN-FILE

      *@   파일상태확인
           IF WK-IN-F-ST NOT = CO-STAT-OK
              MOVE 'IN-FILE CLOSE ERROR : FILE-ST IS '
                TO XZUGEROR-I-MSG
              MOVE WK-IN-F-ST  TO  XZUGEROR-I-MSG(34:2)
              #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
              #OKEXIT CO-CHA-08
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* FILE READ       COUNT  = ' WK-AC-READ-CNT
           #USRLOG '* KJLR008 INSERT  COUNT  = ' WK-AC-INSERT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLDR81 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
