      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD601 (BT한도관리최고한도산업등급별ＴＥ）
      *@현황 추출)
      *@처리유형  : BATCH
      *@처리개요  :
      *@ 1. THKJL0039(산업별TE현황）내용　동일
      *@  ＜차이점＞
      *@  －금융업：대분류　기타　제외
      *@  －금융업（공공행정）：최고한도제외등록차주　정부투자은행(6)
      *@  －공공행정：대분류　공공행정
      *@  －기　타：대분류　기타
      *@ 2.금융업（공공행정）
      *@  －대분류C25 -> C99분류
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *백현정:20090914: 신규작성
      *백현정:20101031:  EAD기준자료　추출
      * HYH    :20120227:  1,000건 단위 COMMIT 주기 변경
      * YBH    :20160722: 산업등급 구분 제외처리
      * HYH    :20170224: KB-PIN 전환
      * YBH    :20170406: 월말재작업 TABLE변경
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM       : 테이블명                 : 접근유형
      **  -------------------   ----------------------------------------
      **  차주익스포져일집계: THKJL0129                  : R
      **  산업별관리한도기본: THKJL0051                  : R
      **  채무자고객기본    : THKJL0015                  : R
      **  고객기본일정보    : THKJL0152                  : R
      **  표준산업코드목록  : THKJL0044                  : R
      **  산업등급별TE현황: THKJL0060                  : CUD
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD601.
       AUTHOR.                         백현정.
       DATE-WRITTEN.                   10/10/31.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD601'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-C25              PIC  X(003) VALUE 'C25'.
           03  CO-CHA-C99              PIC  X(003) VALUE 'C99'.
           03  CO-CHA-000              PIC  X(003) VALUE '000'.
           03  CO-CHA-0000             PIC  X(004) VALUE '0000'.
           03  CO-CHA-00000            PIC  X(005) VALUE '00000'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-UPT-CNT           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-SK-CNT            PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *DISPLAY
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차(001:정기일작업/002:월말재작업)
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRJL0015-REC.
           COPY  TRJL0015.
       01  TRJL0051-REC.
           COPY  TRJL0051.
       01  TKJL0051-KEY.
           COPY  TKJL0051.
       01  TRJL0060-REC.
           COPY  TRJL0060.
       01  TKJL0060-KEY.
           COPY  TKJL0060.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY  YCDBIOCA.
           COPY  YCDBSQLA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
       EXEC  SQL  BEGIN  DECLARE             SECTION  END-EXEC.
       01  WK-HOST-IN.
      *        그룹회사코드
           03  WK-H-I-GROUP-CO-CD            PIC  X(003).
      *        기준일
           03  WK-H-I-BASE-DD                PIC  X(002).
      *        기준년월
           03  WK-H-I-BASE-YM                PIC  X(006).
      *        기준년월일
           03  WK-H-I-BASE-YMD               PIC  X(008).

       01  WK-HOST-OUT.
170224*       차주고객식별자
           03  WK-H-O-BRWR-CUST-IDNFR        PIC  X(00010).
      *        명목액기준한도
           03  WK-H-O-TTL-AMT-BASE-CLAM      PIC S9(00015) COMP-3.
      *        명목액기준잔액
           03  WK-H-O-TTL-AMT-BASE-BAL       PIC S9(00015) COMP-3.
      *        TE한도환산금액
           03  WK-H-O-TE-LIMT-AUC            PIC S9(00015) COMP-3.
      *        TE잔액환산금액
           03  WK-H-O-TE-BAL-AUC             PIC S9(00015) COMP-3.
      *       한도관리제외구분
           03  WK-LIMT-M-ECLUD-DSTCD         PIC  X(00001).
       EXEC  SQL  END  DECLARE               SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKJL0129_CUR     CURSOR WITH HOLD FOR
             SELECT  차주고객식별자
                  ,  SUM(명목액기준한도)
                  ,  SUM(명목액기준잔액)
                  ,  SUM("한도기준TE금액")
                  ,  SUM("잔액기준TE금액")
               FROM  DB2DBA.THKJL0129
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준일       = :WK-H-I-BASE-DD
                AND  기준년월     = :WK-H-I-BASE-YM
                AND  차주고객식별자     IN
                      (SELECT  차주고객식별자
                         FROM  DB2DBA.THKJL0129
                        WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                          AND  기준일       = :WK-H-I-BASE-DD
                          AND  기준년월     = :WK-H-I-BASE-YM
                        GROUP  BY 차주고객식별자
                       HAVING  SUM("한도기준TE금액") >= 0)
                AND  차주고객식별자 NOT IN
                      (SELECT  고객식별자
                         FROM   DB2DBA.THKJL0059
                        WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                          AND  한도관리제외구분= '2')
              GROUP  BY 차주고객식별자
              UNION  ALL
             SELECT  차주고객식별자, 0,0,0,0
               FROM  DB2DBA.THKJL0129
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준일       = :WK-H-I-BASE-DD
                AND  기준년월     = :WK-H-I-BASE-YM
                AND  차주고객식별자 IN
                      (SELECT  차주고객식별자
                         FROM  DB2DBA.THKJL0129
                        WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                          AND  기준일       = :WK-H-I-BASE-DD
                          AND  기준년월     = :WK-H-I-BASE-YM
                        GROUP  BY 차주고객식별자
                       HAVING  SUM("한도기준TE금액") < 0)
                AND  차주고객식별자 NOT IN
                      (SELECT  고객식별자
                         FROM   DB2DBA.THKJL0059
                        WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                          AND  한도관리제외구분= '2')
              GROUP  BY 차주고객식별자
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@   초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@   입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@   업무처리
      *@   산업별익스포져（최고한도제외）DELETE
           PERFORM  S3000-KJL0060-DELETE-RTN
              THRU  S3000-KJL0060-DELETE-EXT

      *    차주별익스포져일정보 SELECT
           PERFORM  S3000-KJL0129-PROCESS-RTN
              THRU  S3000-KJL0129-PROCESS-EXT

      *@   처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@DBIO, SQLIO PARAMETER 초기화
           INITIALIZE       WK-AREA
                            WK-SYSIN
                            YCDBIOCA-CA

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD601 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업기준일자 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   산업등급별TE현황(THKJL0060)삭제
      *-----------------------------------------------------------------
       S3000-KJL0060-DELETE-RTN.

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0060 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             DELETE  FROM  DB2DBA.THKJL0060
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월일   = :WK-H-I-BASE-YMD
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     #USRLOG '<< THKJL0060 DELETE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit 시   오류가   발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0060-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  차주익스포져일집계SELECT업무처리
      *-----------------------------------------------------------------
       S3000-KJL0129-PROCESS-RTN.

           PERFORM  S3100-KJL0129-OPEN-RTN
              THRU  S3100-KJL0129-OPEN-EXT

           PERFORM  S3200-KJL0129-FETCH-RTN
              THRU  S3200-KJL0129-FETCH-EXT

           PERFORM  UNTIL EOF-Y

                    IF  FUNCTION MOD(WK-AC-FE-CNT,50000) = CO-NUM-0
                        #USRLOG 'WK-AC-FE-CNT : ' WK-AC-FE-CNT
                    END-IF

      *차주고객정보원장추출
                    PERFORM  S3300-KJL0015-SELECT-RTN
                       THRU  S3300-KJL0015-SELECT-EXT

      *산업별한도－관리한도산출
                    PERFORM  S3300-KJL0051-SELECT-RTN
                       THRU  S3300-KJL0051-SELECT-EXT

      *DBIO-KEY 미입력시 SKIP
                    IF  RJL0015-LAG-CLSFI-BZTYP-CD = SPACE OR
                        RJL0015-TE-PEER-DSTCD = SPACE
                    THEN
                        ADD  CO-NUM-1  TO  WK-AC-SK-CNT
                        #USRLOG ' KJL0129_BRWR-CUST-IDNFR :'
                                  WK-H-O-BRWR-CUST-IDNFR
                        #USRLOG ' RJL0015-LAG-CLSFI-BZTYP-CD :'
                                  RJL0015-LAG-CLSFI-BZTYP-CD
                        #USRLOG ' RJL0015-TE-PEER-DSTCD :'
                                  RJL0015-TE-PEER-DSTCD
                    ELSE
      *최고한도　산업별자료　축적
                        PERFORM  S3300-PROCESS-SUB-RTN
                           THRU  S3300-PROCESS-SUB-EXT
                    END-IF

                    PERFORM  S3200-KJL0129-FETCH-RTN
                       THRU  S3200-KJL0129-FETCH-EXT
           END-PERFORM

           PERFORM  S3400-KJL0129-CLOSE-RTN
              THRU  S3400-KJL0129-CLOSE-EXT
           .
       S3000-KJL0129-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0129-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0129_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0129-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0129-FETCH-RTN.

           EXEC SQL
              FETCH  THKJL0129_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0129-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   채무자고객기본(THKJL0015)조회
      *-----------------------------------------------------------------
       S3300-KJL0015-SELECT-RTN.

           INITIALIZE    TRJL0015-REC

      *   자료기준　시점의　산업TE 적용
170406     IF WK-SYSIN-JOB-SEQ = '001'
      *       정기일작업
               EXEC SQL
                 SELECT  B.대분류업종코드
                      ,  B."TEPEER구분"
                   INTO  :RJL0015-LAG-CLSFI-BZTYP-CD
                      ,  :RJL0015-TE-PEER-DSTCD
                   FROM  DB2DBA.THKJL0015 A
                      ,  DB2DBA.THKJL0044 B
                  WHERE  A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
170224              AND  A.고객식별자   = :WK-H-O-BRWR-CUST-IDNFR
                    AND  A.그룹회사코드 = B.그룹회사코드
                    AND  B.기준년월     = :WK-H-I-BASE-YM
                    AND  A.신표준산업분류코드= B.신표준산업분류코드
               END-EXEC
           ELSE
170406*       월말재작업
               EXEC SQL
                 SELECT  B.대분류업종코드
                      ,  B."TEPEER구분"
                   INTO  :RJL0015-LAG-CLSFI-BZTYP-CD
                      ,  :RJL0015-TE-PEER-DSTCD
                   FROM  DB2DBA.THKJL0152 A
                      ,  DB2DBA.THKJL0044 B
                  WHERE  A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
                    AND  A.기준년월     = :WK-H-I-BASE-YM
170224              AND  A.고객식별자   = :WK-H-O-BRWR-CUST-IDNFR
                    AND  A.그룹회사코드      = B.그룹회사코드
                    AND  A.기준년월          = B.기준년월
                    AND  A.신표준산업분류코드= B.신표준산업분류코드
               END-EXEC
           END-IF

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *피어코드
                     IF  RJL0015-TE-PEER-DSTCD = CO-CHA-00000 OR
                         RJL0015-TE-PEER-DSTCD =  SPACE OR
                         RJL0015-TE-PEER-DSTCD(1:1) = SPACE
                     THEN
                         MOVE  CO-CHA-00000
                           TO  RJL0015-TE-PEER-DSTCD
                     END-IF

      *대분류
                     IF  RJL0015-LAG-CLSFI-BZTYP-CD = CO-CHA-000 OR
                         RJL0015-LAG-CLSFI-BZTYP-CD =  SPACE OR
                         RJL0015-LAG-CLSFI-BZTYP-CD(1:1) = SPACE
                     THEN
                         MOVE  CO-CHA-000
                           TO  RJL0015-LAG-CLSFI-BZTYP-CD
                     END-IF

      *금융업（공공행정）분류－대분류　금융업AND 정부투자은행
      *  이면　대분류　변경: C25 -> C99
                     IF  RJL0015-LAG-CLSFI-BZTYP-CD = CO-CHA-C25
                     THEN
                         PERFORM  S3310-KJL0059-SELECT-RTN
                            THRU  S3310-KJL0059-SELECT-EXT
                     END-IF
               WHEN  CO-NOT-FOUND
      *피어코드
                     MOVE  CO-CHA-00000
                       TO  RJL0015-TE-PEER-DSTCD
      *대분류
                     MOVE  CO-CHA-000
                       TO  RJL0015-LAG-CLSFI-BZTYP-CD
               WHEN  OTHER
                     MOVE 'KJL0015'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KJL0015-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   산업별관리한도기본(THKJL0051)조회
      *-----------------------------------------------------------------
       S3300-KJL0051-SELECT-RTN.

           INITIALIZE    TKJL0051-KEY
                         TRJL0051-REC

           EXEC SQL
             SELECT  VALUE(산업관리한도,0)
               INTO  :RJL0051-IDSTRY-MGT-CLAM
               FROM  DB2DBA.THKJL0051
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
                AND  "TEPEER구분" = :RJL0015-TE-PEER-DSTCD
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0051'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KJL0051-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   금융업（공공행정）여부　확인(THKJL0059)조회
      *-----------------------------------------------------------------
       S3310-KJL0059-SELECT-RTN.

           INITIALIZE    WK-LIMT-M-ECLUD-DSTCD

           EXEC SQL
             SELECT  VALUE(한도관리제외구분,' ')
               INTO  :WK-LIMT-M-ECLUD-DSTCD
               FROM  DB2DBA.THKJL0059
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  고객식별자   = :WK-H-O-BRWR-CUST-IDNFR
                AND  한도관리제외구분<> '2'
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *대분류　변경C25 -> C99
                     MOVE  CO-CHA-C99
                       TO  RJL0015-LAG-CLSFI-BZTYP-CD
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0051'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3310-KJL0059-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   최고한도-산업별　익스포져　원장　구축
      *-----------------------------------------------------------------
       S3300-PROCESS-SUB-RTN.

           INITIALIZE    TKJL0060-KEY
                         TRJL0060-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  KJL0060-PK-GROUP-CO-CD

      *    기준년월일
           MOVE  WK-H-I-BASE-YMD
             TO  KJL0060-PK-BASE-YMD

      *    산업평가등급구분
160722     MOVE  CO-CHA-0000
             TO  KJL0060-PK-IDSTRY-V-GRD-DSTCD

      *    대분류업종코드
           MOVE  RJL0015-LAG-CLSFI-BZTYP-CD
             TO  KJL0060-PK-LAG-CLSFI-BZTYP-CD

      *    TEPEER구분
           MOVE  RJL0015-TE-PEER-DSTCD
             TO  KJL0060-PK-TE-PEER-DSTCD

           #DYDBIO  SELECT-CMD-Y  TKJL0060-PK  TRJL0060-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     PERFORM  S3310-KJL0060-UPDATE-RTN
                        THRU  S3310-KJL0060-UPDATE-EXT
               WHEN  COND-DBIO-MRNF
                     PERFORM  S3320-KJL0060-INSERT-RTN
                        THRU  S3320-KJL0060-INSERT-EXT
               WHEN  OTHER
                     MOVE  'KJL0060'   TO  XZUGEROR-I-TBL-ID
                     MOVE  'SELECT  '  TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE  'DB작업시　오류가　발생'
                                       TO  XZUGEROR-I-MSG
      *사용자정의 에러코드 설정(13: DB작업 오류)
      *@DB작업　오류
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-PROCESS-SUB-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   산업등급별TE현황(최고한도관리)(THKJL0060)수정
      *-----------------------------------------------------------------
       S3310-KJL0060-UPDATE-RTN.

      *대분류업종코드　기타는　대상업체건수＝０
           IF  (RJL0060-LAG-CLSFI-BZTYP-CD = CO-CHA-000  AND
                RJL0060-TE-PEER-DSTCD      = CO-CHA-00000 )
           THEN
      *        대상업체건수
               ADD  CO-NUM-0
                TO  RJL0060-TAGET-ENTP-NOITM
           ELSE
      *        대상업체건수
               ADD  CO-NUM-1
                TO  RJL0060-TAGET-ENTP-NOITM
           END-IF

      *         명목액기준한도
           ADD  WK-H-O-TTL-AMT-BASE-CLAM
            TO  RJL0060-TTL-AMT-BASE-CLAM

      *         명목액기준잔액
           ADD  WK-H-O-TTL-AMT-BASE-BAL
            TO  RJL0060-TTL-AMT-BASE-BAL

      *         TE한도환산금액
           ADD  WK-H-O-TE-LIMT-AUC
            TO  RJL0060-TE-LIMT-AUC

      *         TE잔액환산금액
           ADD  WK-H-O-TE-BAL-AUC
            TO  RJL0060-TE-BAL-AUC

           #DYDBIO  UPDATE-CMD-Y TKJL0060-PK TRJL0060-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-UPT-CNT
               WHEN  OTHER
                     MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'UPDATE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'UPDATE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  1000건마다 DISPLAY & COMMIT처리
           IF  FUNCTION MOD(WK-AC-UPT-CNT, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-UPT-CNT : ' WK-AC-UPT-CNT

               EXEC SQL
                    COMMIT
               END-EXEC

      *       리턴코드가 정상이 아니면 에러처리
               EVALUATE  SQLCODE
                   WHEN  ZERO
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

                               .
       S3310-KJL0060-UPDATE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   산업등급별TE현황(최고한도관리)(THKJL0060)등록
      *-----------------------------------------------------------------
       S3320-KJL0060-INSERT-RTN.

      *          그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0060-GROUP-CO-CD

      *          기준년월일
           MOVE  WK-H-I-BASE-YMD
             TO  RJL0060-BASE-YMD

      *          산업평가등급구분
160722     MOVE  CO-CHA-0000
             TO  RJL0060-IDSTRY-V-GRD-DSTCD

      *          대분류업종코드
           MOVE  RJL0015-LAG-CLSFI-BZTYP-CD
             TO  RJL0060-LAG-CLSFI-BZTYP-CD

      *          TEPEER구분
           MOVE  RJL0015-TE-PEER-DSTCD
             TO  RJL0060-TE-PEER-DSTCD

      *대분류업종코드　기타는　대상업체건수＝０
           IF  (RJL0060-LAG-CLSFI-BZTYP-CD = CO-CHA-000  AND
                RJL0060-TE-PEER-DSTCD      = CO-CHA-00000 )
           THEN
      *        대상업체건수
               MOVE  0
                 TO  RJL0060-TAGET-ENTP-NOITM
           ELSE
      *        대상업체건수
               MOVE  1
                 TO  RJL0060-TAGET-ENTP-NOITM
           END-IF

      *대분류업종코드　금융업（공공행정）산업관리한도＝０
           IF   RJL0060-LAG-CLSFI-BZTYP-CD = CO-CHA-C99
           THEN
      *          산업관리한도
                MOVE  ZERO
                  TO  RJL0060-IDSTRY-MGT-CLAM
           ELSE
      *          산업관리한도
                MOVE  RJL0051-IDSTRY-MGT-CLAM
                  TO  RJL0060-IDSTRY-MGT-CLAM
           END-IF

      *          명목액기준한도
           MOVE  WK-H-O-TTL-AMT-BASE-CLAM
             TO  RJL0060-TTL-AMT-BASE-CLAM

      *          명목액기준잔액
           MOVE  WK-H-O-TTL-AMT-BASE-BAL
             TO  RJL0060-TTL-AMT-BASE-BAL

      *          TE한도환산금액
           MOVE  WK-H-O-TE-LIMT-AUC
             TO  RJL0060-TE-LIMT-AUC

      *          TE잔액환산금액
           MOVE  WK-H-O-TE-BAL-AUC
             TO  RJL0060-TE-BAL-AUC

           #DYDBIO  INSERT-CMD-Y TKJL0060-PK TRJL0060-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT
               WHEN  OTHER
                     MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  1000건마다 DISPLAY & COMMIT처리
           IF  FUNCTION MOD(WK-AC-INT-CNT, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-INT-CNT : ' WK-AC-INT-CNT

               EXEC SQL
                    COMMIT
               END-EXEC

      *       리턴코드가 정상이 아니면 에러처리
               EVALUATE  SQLCODE
                   WHEN  ZERO
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0060'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

                               .
       S3320-KJL0060-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJL0129-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0129_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-KJL0129-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0129_CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* UPDATE          COUNT  = ' WK-AC-UPT-CNT
           #USRLOG '* INSERT          COUNT  = ' WK-AC-INT-CNT
           #USRLOG '* SKIP            COUNT  = ' WK-AC-SK-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD601 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00.
       S9000-FINAL-EXT.
           EXIT.
