      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD411 (BT거액신용공여정보원장추출)
      *@처리유형  : BATCH
      *@처리개요  : 당행자기자본　기준금액１０％　초과시　집계함
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090402: 신규작성
      * HYH    :20120227:  1,000건 단위 COMMIT 주기 변경
      * HYH    :20150226:  10건 단위 COMMIT 주기 변경
      * HYH    :20170224:  KB-PIN 전환
      * HYH    :20180914:  신)익스포져 관련 DB변경
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM       : 테이블명                 : 접근유형
      **  -------------------   ----------------------------------------
      **  그룹신용공여일실적: THKJL0037                  : R
      **  계정코드목록      : THKJL0118                  : R
      **  차주신용공여일실적: THKJL0033                  : R
      **  TE자기자본기본    : THKJL0049                  : R
      **  거액신용공여실적  : THKJL0041                  : CD
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD411.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/04/02.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD411'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT2           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT3           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT4           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT1          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT2          PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF1              PIC  X(001) VALUE  SPACE.
               88  EOF1-Y                          VALUE 'Y'.
           03  WK-SW-EOF2              PIC  X(001) VALUE  SPACE.
               88  EOF2-Y                          VALUE 'Y'.
           03  WK-SW-EOF3              PIC  X(001) VALUE  SPACE.
               88  EOF3-Y                          VALUE 'Y'.
           03  WK-SW-EOF4              PIC  X(001) VALUE  SPACE.
               88  EOF4-Y                          VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *RJL0049-ONCP-BSAMT*가중치
           03  WK-ONCP-BSAMT           PIC S9(015) COMP-3.

           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRJL0037-REC.
           COPY    TRJL0037.
       01  TKJL0037-KEY.
           COPY    TKJL0037.
       01  TRJL0038-REC.
           COPY    TRJL0038.
       01  TKJL0038-KEY.
           COPY    TKJL0038.
       01  TRJL0041-REC.
           COPY    TRJL0041.
       01  TKJL0041-KEY.
           COPY    TKJL0041.
       01  TRJL0049-REC.
           COPY    TRJL0049.
       01  TKJL0049-KEY.
           COPY    TKJL0049.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY    YCDBIOCA.
           COPY    YCDBSQLA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA       END-EXEC.

       EXEC  SQL  BEGIN  DECLARE       SECTION  END-EXEC.
       01  WK-HOST-IN.
      *        그룹회사코드
           03  WK-H-I-GROUP-CO-CD      PIC  X(003).
      *        기준일
           03  WK-H-I-BASE-DD          PIC  X(002).
      *        기준년월
           03  WK-H-I-BASE-YM          PIC  X(006).

      *        기준년월일
           03  WK-H-I-BASE-YMD         PIC  X(008).
      *        계열기업군코드
           03  WK-H-I-AFFLT-CORP-GROUP-CD
                                       PIC  X(006).
170224*       고객식별자
           03  WK-H-I-CUST-IDNFR       PIC  X(010).

       01  WK-HOST-OUT1.
      *        계열기업군코드
           03  WK-H-O1-AFFLT-CORP-GROUP-CD
                                       PIC  X(006).
      *        담보환산금액
           03  WK-H-O1-CA-SCURTY-AUC   PIC S9(015) COMP-3.

       01  WK-HOST-OUT2.
      *        기준년월일
           03  WK-H-O2-BASE-YMD        PIC  X(008).
      *        계열기업군코드
           03  WK-H-O2-AFFLT-CORP-GROUP-CD
                                       PIC  X(006).
      *        한도기업구분
           03  WK-H-O2-LIMT-CORP-DSTCD PIC  X(001).
      *        회계구분
           03  WK-H-O2-ACCTG-DSTCD     PIC  X(001).
      *        은행신용공여금액
           03  WK-H-O2-BNK-GRCR-AMT    PIC S9(015) COMP-3.
      *        금융감독원신용공여금액
           03  WK-H-O2-FSS-GRCR-AMT    PIC S9(015) COMP-3.
      *        제외대상금액
           03  WK-H-O2-ECLUD-TAGETZ-AMT
                                       PIC S9(015) COMP-3.

       01  WK-HOST-OUT3.
170224*       고객식별자
           03  WK-H-O3-CUST-IDNFR      PIC  X(010).
      *        담보환산금액
           03  WK-H-O3-CA-SCURTY-AUC   PIC S9(015) COMP-3.

       01  WK-HOST-OUT4.
      *        기준년월일
           03  WK-H-O4-BASE-YMD        PIC  X(008).
170224*       고객식별자
           03  WK-H-O4-CUST-IDNFR      PIC  X(010).
      *        한도기업구분
           03  WK-H-O4-LIMT-CORP-DSTCD PIC  X(001).
      *        회계구분
           03  WK-H-O4-ACCTG-DSTCD     PIC  X(001).
      *        은행신용공여금액
           03  WK-H-O4-BNK-GRCR-AMT    PIC S9(015) COMP-3.
      *        금융감독원신용공여금액
           03  WK-H-O4-FSS-GRCR-AMT    PIC S9(015) COMP-3.
      *        제외대상금액
           03  WK-H-O4-ECLUD-TAGETZ-AMT
                                       PIC S9(015) COMP-3.
       EXEC  SQL  END  DECLARE         SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKJL0037_CUR1    CURSOR WITH HOLD FOR
             SELECT  계열기업군코드
                  ,  SUM("CA담보환산금액")
               FROM  DB2DBA.THKJL0037
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월일   = :WK-H-I-BASE-YMD
           GROUP BY  계열기업군코드
           END-EXEC.

           EXEC SQL
            DECLARE  THKJL0037_CUR2    CURSOR WITH HOLD FOR
             SELECT  기준년월일
                  ,  계열기업군코드
                  ,  한도기업구분
                  ,  회계구분
                  ,  SUM(은행신용공여금액)
                  ,  SUM(금감신용공여금액)
                  ,  SUM(제외대상금액)
               FROM
            (SELECT  A.기준년월일       AS 기준년월일
                  ,  A.계열기업군코드   AS 계열기업군코드
                  ,  '2'                  AS 한도기업구분
                  ,  B."TE회계구분"     AS 회계구분
                  ,  A."BS기준잔액 "    AS 은행신용공여금액
                  ,  A."CA담보환산금액" AS 금감신용공여금액
                  ,  A.제외자산금액     AS 제외대상금액
               FROM  DB2DBA.THKJL0037 A,
180914               DB2DBA.THKJL0118 B
              WHERE  A.그룹회사코드   = :WK-H-I-GROUP-CO-CD
                AND  A.기준년월일     = :WK-H-I-BASE-YMD
                AND  A.계열기업군코드 = :WK-H-I-AFFLT-CORP-GROUP-CD
                AND  B.기준년월       = :WK-H-I-BASE-YM
                AND  A.그룹회사코드   = B.그룹회사코드
                AND  A.상품대분류코드 = B.상품대분류코드
                AND  A.상품중분류코드 = B.상품중분류코드
                AND  A.상품템플릿코드 = B.상품템플릿코드
                AND  A.상품번호       = B.상품번호) CAL1
           GROUP BY  기준년월일
                  ,  계열기업군코드
                  ,  한도기업구분
                  ,  회계구분
           END-EXEC.

           EXEC SQL
            DECLARE  THKJL0033_CUR1    CURSOR WITH HOLD FOR
             SELECT  고객식별자
                  ,  SUM("CA담보환산금액")
               FROM  DB2DBA.THKJL0033
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준일       = :WK-H-I-BASE-DD
                AND  기준년월     = :WK-H-I-BASE-YM
           GROUP BY  고객식별자
           END-EXEC.

           EXEC SQL
            DECLARE  THKJL0033_CUR2    CURSOR WITH HOLD FOR
             SELECT  기준년월일
                  ,  고객식별자
                  ,  한도기업구분
                  ,  회계구분
                  ,  SUM(은행신용공여금액)
                  ,  SUM(금감신용공여금액)
                  ,  SUM(제외대상금액)
               FROM
            (SELECT  A.기준년월 || A.기준일 AS 기준년월일
                  ,  A.고객식별자       AS 고객식별자
                  ,  '1'                  AS 한도기업구분
                  ,  B."TE회계구분"     AS 회계구분
                  ,  A."BS기준잔액 "    AS 은행신용공여금액
                  ,  A."CA담보환산금액" AS 금감신용공여금액
                  ,  A.제외자산금액     AS 제외대상금액
               FROM  DB2DBA.THKJL0033 A
                  ,  DB2DBA.THKJL0118 B
              WHERE  A.그룹회사코드   = B.그룹회사코드
                AND  A.기준년월       = B.기준년월
                AND  A.그룹회사코드   = :WK-H-I-GROUP-CO-CD
                AND  A.기준일         = :WK-H-I-BASE-DD
                AND  A.기준년월       = :WK-H-I-BASE-YM
                AND  A.고객식별자     = :WK-H-I-CUST-IDNFR
                AND  A.그룹회사코드   = B.그룹회사코드
                AND  A.상품대분류코드 = B.상품대분류코드
                AND  A.상품중분류코드 = B.상품중분류코드
                AND  A.상품템플릿코드 = B.상품템플릿코드
                AND  A.상품번호       = B.상품번호) CAL2
           GROUP BY  기준년월일
                  ,  고객식별자
                  ,  한도기업구분
                  ,  회계구분
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *   자기자본기준금액
           PERFORM  S3000-KJL0049-SELECT-RTN
              THRU  S3000-KJL0049-SELECT-EXT

      *@  그룹사   SELECT업무처리
           PERFORM  S3000-KJL0041-DELETE-RTN
              THRU  S3000-KJL0041-DELETE-EXT
           PERFORM  S3000-KJL0041-PROCESS-RTN
              THRU  S3000-KJL0041-PROCESS-EXT

      *@  개별기업 SELECT업무처리
           PERFORM  S4000-KJL0041-PROCESS-RTN
              THRU  S4000-KJL0041-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@DBIO, SQLIO PARAMETER 초기화
           INITIALIZE       WK-AREA
                            WK-SYSIN
                            YCDBIOCA-CA
                            XZUGEROR-CA

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD411 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업기준일자 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   TE자기자본기본(THKJL0049) 조회
      *-----------------------------------------------------------------
       S3000-KJL0049-SELECT-RTN.

           INITIALIZE    TKJL0049-KEY
                         TRJL0049-REC

      *    경영지표　자기자본기준금액　산출
           EXEC SQL
             SELECT  기준년월
                  ,  자기자본기준금액
               INTO  :RJL0049-BASE-YM
                  ,  :RJL0049-ONCP-BSAMT
               FROM  DB2DBA.THKJL0049
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
                AND  자기자본구분 = '4'
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *              경영지표자기자본 *0.1
                     COMPUTE  WK-ONCP-BSAMT
                           =  RJL0049-ONCP-BSAMT
                           *  0.1
               WHEN  CO-NOT-FOUND
                     MOVE  ZERO        TO  WK-ONCP-BSAMT
               WHEN  OTHER
                     MOVE 'KJL0049'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0049-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   거액신용공여실적(THKJL0041)삭제
      *-----------------------------------------------------------------
       S3000-KJL0041-DELETE-RTN.

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0041 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             DELETE  FROM DB2DBA.THKJL0041
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월일   = :WK-H-I-BASE-YMD
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit 시   오류가   발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0041-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-KJL0041-PROCESS-RTN.

           PERFORM  S3100-KJL0037-OPEN-RTN
              THRU  S3100-KJL0037-OPEN-EXT

           PERFORM  S3200-KJL0037-FETCH-RTN
              THRU  S3200-KJL0037-FETCH-EXT

           PERFORM  UNTIL EOF1-Y
      *CA담보환산금액 >= 경영지표자기자본 * 0.1
                    IF  WK-H-O1-CA-SCURTY-AUC >= WK-ONCP-BSAMT
                        PERFORM  S3300-PROCESS-SUB-RTN
                           THRU  S3300-PROCESS-SUB-EXT
                    END-IF

                    PERFORM  S3200-KJL0037-FETCH-RTN
                       THRU  S3200-KJL0037-FETCH-EXT
           END-PERFORM

           PERFORM  S3400-KJL0037-CLOSE-RTN
              THRU  S3400-KJL0037-CLOSE-EXT
           .
       S3000-KJL0041-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0037-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0037_CUR1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0037-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0037-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT1

           EXEC SQL
              FETCH  THKJL0037_CUR1
               INTO  :WK-HOST-OUT1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT1
               WHEN  CO-NOT-FOUND
                     SET   EOF1-Y      TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE.
           .
       S3200-KJL0037-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3300-PROCESS-SUB-RTN.

           PERFORM  S3310-KJL0037-OPEN-RTN
              THRU  S3310-KJL0037-OPEN-EXT

           PERFORM  S3320-KJL0037-FETCH-RTN
              THRU  S3320-KJL0037-FETCH-EXT

           PERFORM  UNTIL EOF2-Y

                    PERFORM  S3330-KJL0041-INSERT-RTN
                       THRU  S3330-KJL0041-INSERT-EXT

                    PERFORM  S3320-KJL0037-FETCH-RTN
                       THRU  S3320-KJL0037-FETCH-EXT
           END-PERFORM

           PERFORM  S3340-KJL0037-CLOSE-RTN
              THRU  S3340-KJL0037-CLOSE-EXT
           .
       S3300-PROCESS-SUB-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3310-KJL0037-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

      *          계열기업군코드
           MOVE  WK-H-O1-AFFLT-CORP-GROUP-CD
             TO  WK-H-I-AFFLT-CORP-GROUP-CD

           EXEC SQL
               OPEN  THKJL0037_CUR2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3310-KJL0037-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3320-KJL0037-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT2

           EXEC SQL
              FETCH  THKJL0037_CUR2
               INTO  :WK-HOST-OUT2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT2
               WHEN  CO-NOT-FOUND
                     SET   EOF2-Y      TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE.
           .
       S3320-KJL0037-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   거액신용공여실적(THKJL0041)등록
      *-----------------------------------------------------------------
       S3330-KJL0041-INSERT-RTN.

           INITIALIZE    TKJL0041-KEY
                         TRJL0041-REC

      *          그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0041-GROUP-CO-CD

      *          기준년월일
           MOVE  WK-H-O2-BASE-YMD
             TO  RJL0041-BASE-YMD

      *          고객식별자 OR 계열기업군코드
           MOVE  WK-H-O2-AFFLT-CORP-GROUP-CD
             TO  RJL0041-CUST-IDNFR

      *          한도기업구분
           MOVE  WK-H-O2-LIMT-CORP-DSTCD
             TO  RJL0041-LIMT-CORP-DSTCD

      *          회계구분
           MOVE  WK-H-O2-ACCTG-DSTCD
             TO  RJL0041-ACCTG-DSTCD

      *          KB신용공여금액
           MOVE  WK-H-O2-BNK-GRCR-AMT
             TO  RJL0041-KB-GRCR-AMT

      *          FS신용공여금액
           MOVE  WK-H-O2-FSS-GRCR-AMT
             TO  RJL0041-FS-GRCR-AMT

      *          제외대상금액
           MOVE  WK-H-O2-ECLUD-TAGETZ-AMT
             TO  RJL0041-ECLUD-TAGETZ-AMT

      *          자기자본기준년월
           MOVE  RJL0049-BASE-YM
             TO  RJL0041-ONCP-BASE-YM

      *          자기자본기준금액
           MOVE  RJL0049-ONCP-BSAMT
             TO  RJL0041-ONCP-BSAMT

      *             자기자본초과금액
           COMPUTE  RJL0041-ONCP-EXCS-AMT
                 =  RJL0049-ONCP-BSAMT
                 *  0.1

           #DYDBIO  INSERT-CMD-Y TKJL0041-PK TRJL0041-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT1
               WHEN  OTHER
                     MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  1000건마다 DISPLAY
           IF  FUNCTION MOD(WK-AC-INT-CNT1, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-INT-CNT1 : ' WK-AC-INT-CNT1
           END-IF

      *@1  1000건마다 COMMIT처리
           IF  FUNCTION MOD(WK-AC-INT-CNT1, 10) = CO-NUM-0

               EXEC SQL
                    COMMIT
               END-EXEC

      *       리턴코드가 정상이 아니면 에러처리
               EVALUATE  SQLCODE
                   WHEN  CO-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

                               .
       S3330-KJL0041-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3340-KJL0037-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0037_CUR2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3340-KJL0037-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJL0037-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0037_CUR1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0037'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-KJL0037-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S4000-KJL0041-PROCESS-RTN.

           PERFORM  S4100-KJL0033-OPEN-RTN
              THRU  S4100-KJL0033-OPEN-EXT

           PERFORM  S4200-KJL0033-FETCH-RTN
              THRU  S4200-KJL0033-FETCH-EXT

           PERFORM  UNTIL EOF3-Y
      *그룹에　속하지　않은　개별기업 SELECT
      * CA 담보환산금액 >=  경영지표자기자본 * 0.1

                    IF  WK-H-O3-CA-SCURTY-AUC >= WK-ONCP-BSAMT
                        PERFORM  S4300-PROCESS-SUB-RTN
                           THRU  S4300-PROCESS-SUB-EXT
                    END-IF

                    PERFORM  S4200-KJL0033-FETCH-RTN
                       THRU  S4200-KJL0033-FETCH-EXT
           END-PERFORM

           PERFORM  S4400-KJL0033-CLOSE-RTN
              THRU  S4400-KJL0033-CLOSE-EXT
           .
       S4000-KJL0041-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S4100-KJL0033-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0033_CUR1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4100-KJL0033-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S4200-KJL0033-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT3

           EXEC SQL
              FETCH  THKJL0033_CUR1
               INTO  :WK-HOST-OUT3
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT3
               WHEN  CO-NOT-FOUND
                     SET   EOF3-Y      TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE.
           .
       S4200-KJL0033-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S4300-PROCESS-SUB-RTN.

           PERFORM  S4310-KJL0033-OPEN-RTN
              THRU  S4310-KJL0033-OPEN-EXT

           PERFORM  S4320-KJL0033-FETCH-RTN
              THRU  S4320-KJL0033-FETCH-EXT

           PERFORM  UNTIL EOF4-Y

                    PERFORM  S4330-KJL0041-INSERT-RTN
                       THRU  S4330-KJL0041-INSERT-EXT

                    PERFORM  S4320-KJL0033-FETCH-RTN
                       THRU  S4320-KJL0033-FETCH-EXT
           END-PERFORM

           PERFORM  S4340-KJL0033-CLOSE-RTN
              THRU  S4340-KJL0033-CLOSE-EXT
           .
       S4300-PROCESS-SUB-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S4310-KJL0033-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

      *    고객식별자
           MOVE  WK-H-O3-CUST-IDNFR
             TO  WK-H-I-CUST-IDNFR

           EXEC SQL
               OPEN  THKJL0033_CUR2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4310-KJL0033-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S4320-KJL0033-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT4

           EXEC SQL
              FETCH  THKJL0033_CUR2
               INTO  :WK-HOST-OUT4
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT4
               WHEN  CO-NOT-FOUND
                     SET   EOF4-Y      TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE.
           .
       S4320-KJL0033-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   거액신용공여실적(THKJL0041)등록
      *-----------------------------------------------------------------
       S4330-KJL0041-INSERT-RTN.

      *          그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0041-GROUP-CO-CD

      *          기준년월일
           MOVE  WK-H-O4-BASE-YMD
             TO  RJL0041-BASE-YMD

      *          고객식별자
           MOVE  WK-H-O4-CUST-IDNFR
             TO  RJL0041-CUST-IDNFR

      *          한도기업구분
           MOVE  WK-H-O4-LIMT-CORP-DSTCD
             TO  RJL0041-LIMT-CORP-DSTCD

      *          회계구분
           MOVE  WK-H-O4-ACCTG-DSTCD
             TO  RJL0041-ACCTG-DSTCD

      *          KB신용공여금액
           MOVE  WK-H-O4-BNK-GRCR-AMT
             TO  RJL0041-KB-GRCR-AMT

      *          FS신용공여금액
           MOVE  WK-H-O4-FSS-GRCR-AMT
             TO  RJL0041-FS-GRCR-AMT

      *          제외대상금액
           MOVE  WK-H-O4-ECLUD-TAGETZ-AMT
             TO  RJL0041-ECLUD-TAGETZ-AMT

      *          자기자본기준년월
           MOVE  RJL0049-BASE-YM
             TO  RJL0041-ONCP-BASE-YM

      *          자기자본기준금액
           MOVE  RJL0049-ONCP-BSAMT
             TO  RJL0041-ONCP-BSAMT

      *             자기자본초과금액
           COMPUTE  RJL0041-ONCP-EXCS-AMT
                 =  RJL0049-ONCP-BSAMT
                 *  0.1

           #DYDBIO  INSERT-CMD-Y TKJL0041-PK TRJL0041-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT2
               WHEN  OTHER
                     MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  1000건마다 DISPLAY
           IF  FUNCTION MOD(WK-AC-INT-CNT2, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-INT-CNT2 : ' WK-AC-INT-CNT2
           END-IF

      *@1  10건마다  COMMIT처리
           IF  FUNCTION MOD(WK-AC-INT-CNT2, 10) = CO-NUM-0

               EXEC SQL
                    COMMIT
               END-EXEC

      *       리턴코드가 정상이 아니면 에러처리
               EVALUATE  SQLCODE
                   WHEN  CO-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0041'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF
                               .
       S4330-KJL0041-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S4340-KJL0033-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0033_CUR2
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4340-KJL0033-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S4400-KJL0033-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0033_CUR1
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0033'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4400-KJL0033-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0037_CUR1  COUNT  = ' WK-AC-FE-CNT1
           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0037_CUR2  COUNT  = ' WK-AC-FE-CNT2
           #USRLOG '* KJL0041 INSERT  COUNT  = ' WK-AC-INT-CNT1
           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0033_CUR1  COUNT  = ' WK-AC-FE-CNT3
           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0033_CUR2  COUNT  = ' WK-AC-FE-CNT4
           #USRLOG '* KJL0041 INSERT  COUNT  = ' WK-AC-INT-CNT2
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD411 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00.
       S9000-FINAL-EXT.
           EXIT.
