      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD551 (BT국별익스포져(국외점포)계정추출)
      *@처리유형  : BATCH
      *@처리개요  : 국별익스포져(국외점포)계정추출한다.
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090406: 신규작성
      *백현정:20100514: 상품정보　미매핑이면　국별상품정보SELECT
      *백현정:20100628: 상품정보등록　여신만　국별익스포져　대상
      * HYH    :20170116: 상품코드 매핑 통합계정과목코드로 변경
      * HYH    :20170224:  KB-PIN 전환
      * HYH    :20200107: 건별여신 TE 산출 요건 변경
      * 건별여신 (국제한도구분 = '3') 경우
      * 모계좌(한도계좌번호)의 만기년월일을 기준으로
      * 만기전：한도RJL0055-USD-CLAM(X),  잔액RJL0055-USD-TDD-BAL(O)
      * 만기후：한도RJL0055-USD-TDD-BAL(O)잔액RJL0055-USD-TDD-BAL(O)
      * 단, 모계좌가 없는 경우 만기후 기준으로 산출
      * 세부현황의 만기일은 건별여신의 만기일로 표시
      * YBH    :20250626: 국별익스포져 대상계좌 분류기준 변경
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM         : 테이블명               : 접근유형
      **  ---------------------   --------------------------------------
      **  해외점포계좌내역    : THKJLR005                : R
      **  국별수기국적계좌관리: THKJL0026                : R
      **  국별계정과목코드목록: THKJL0054                : R
      **  국별익스포져계좌명세: THKJL0055                : CD
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD551.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/04/06.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD551'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-4                PIC  X(001) VALUE '4'.
           03  CO-CHA-5                PIC  X(001) VALUE '5'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-R05              PIC  X(003) VALUE 'R05'.

           03  CO-CHA-00000            PIC  X(005) VALUE '00000'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FETCH-CNT         PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INSERT-CNT        PIC  9(013) VALUE  ZEROS.
           03  WK-KJL0054-OK-CNT       PIC  9(013) VALUE  ZEROS.
           03  WK-KJL0054-NFND-CNT     PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *상품정보
           03  WK-PRDCT-INFO           PIC  X(008).
      *계좌중복일련번호
           03  WK-SEQ                  PIC  9(007) COMP.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.

      *-----------------------------------------------------------------
      * TABLE ACCESS INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TKJL0055-KEY.
           COPY    TKJL0055.
       01  TRJL0055-REC.
           COPY    TRJL0055.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY  YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 WK-H-I-BASE-YMD               PIC  X(00008).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).

       02  WK-HOST-OUT.
      *       기준년월일
           03 WK-H-O-BASE-YMD               PIC  X(00008).
      *       관리부점코드
           03 WK-H-O-MGT-BRNCD              PIC  X(00004).
      *       계좌번호
           03 WK-H-O-ACNO                   PIC  X(00020).
170224*       고객식별자
           03 WK-H-O-CUST-IDNFR             PIC  X(00010).
170224*       고객관리번호
           03 WK-H-O-CUST-MGT-NO            PIC  X(00005).
      *       ISO국가코드
           03 WK-H-O-ISO-NATNL-CD           PIC  X(00002).
      *       신규년월일
           03 WK-H-O-NEW-YMD                PIC  X(00008).
      *       만기년월일
           03 WK-H-O-EXPIR-YMD              PIC  X(00008).
      *       현지취급통화코드
           03 WK-H-O-LCAL-HNDLN-CNCYCD      PIC  X(00003).
      *       현지한도약정금액
           03 WK-H-O-LCAL-LIMT-AGRE-AMT     PIC S9(00015)V9(3) COMP-3.
      *       현지통화대출잔액
           03 WK-H-O-LCAL-CRNCY-LN-BAL      PIC S9(00015)V9(3) COMP-3.
      *       상품대분류코드
           03 WK-H-O-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 WK-H-O-PRDCT-NO               PIC  X(00005).
      *       해외점포영업년월일
           03 WK-H-O-OVSES-S-BZOPR-YMD      PIC  X(00008).
      *       원화환산잔액
           03 WK-H-O-WONC-UTCNG-BAL         PIC S9(00015)V9(3) COMP-3.
      *       해외점포계좌구분
           03 WK-H-O-OVSES-S-ACN-DSTCD      PIC  X(00001).
      *       국제한도구분
           03 WK-H-O-INTN-LIMT-DSTCD        PIC  X(00001).
      *       USD한도약정금액
           03 WK-H-O-USD-LIMT-AGRE-AMT      PIC S9(00015)V9(3) COMP-3.
      *       USD대출잔액
           03 WK-H-O-USD-LN-BAL             PIC S9(00015)V9(3) COMP-3.
      *       통합계정과목코드
           03 WK-H-O-INTGRA-TIACC-CD        PIC  X(00013).
      *       모계좌만기년월일
           03 WK-H-O-MAMA-EXPIR-YMD         PIC  X(00008).
       EXEC  SQL  END  DECLARE              SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKJLR005_CUR     CURSOR WITH HOLD FOR
             SELECT  A.기준년월일
                  ,  A.관리부점코드
                  ,  A.계좌번호
                  ,  A.고객식별자
                  ,  A.고객관리번호
250626            ,  VALUE(D."ISO국가코드",A."ISO국가코드")
                          AS "ISO국가코드"
                  ,  A.신규년월일
                  ,  A.만기년월일
                  ,  A.현지취급통화코드
                  ,  A.현지한도약정금액
                  ,  A.현지통화대출잔액
                  ,  VALUE(B.상품대분류코드,' ')
                  ,  VALUE(B.상품중분류코드 ,' ')
                  ,  VALUE(B.상품템플릿코드 ,' ')
                  ,  VALUE(B.상품번호 ,' ')
                  ,  A.해외점포영업년월일
                  ,  A.원화환산잔액
                  ,  A.해외점포계좌구분
                  ,  A.국제한도구분
                  ,  A."USD한도약정금액"
                  ,  A."USD대출잔액"
                  ,  A.통합계정과목코드
                  ,  CASE WHEN A.국제한도구분 = '3'
                          THEN VALUE(
                              (SELECT 만기년월일
                                 FROM DB2DBA.THKJLR005
                                WHERE 그룹회사코드 = A.그룹회사코드
                                  AND 기준년월일   = A.기준년월일
                                  AND 계좌번호     = A.한도계좌번호
                                  FETCH FIRST 1 ROWS ONLY ),'00010101')
                          ELSE A.만기년월일
                     END AS 모계좌만기년월일
               FROM  DB2DBA.THKJLR005 A --해외점포계좌내역
250626               LEFT OUTER JOIN
                     DB2DBA.THKJL0026 D
                 ON  A.그룹회사코드 = D.그룹회사코드
                AND  A.계좌번호     = D.계좌번호
                  ,  DB2DBA.THKJL0054 B --국별계정과목코드목록
              WHERE  A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  A.그룹회사코드 =  B.그룹회사코드
                AND  A.기준년월일   = :WK-H-I-BASE-YMD
250626          AND VALUE(D."ISO국가코드",A."ISO국가코드") <> 'KR'
                AND (A."USD한도약정금액" > 0 OR
                     A."USD대출잔액"     > 0)
                AND  B.기준년월       = :WK-H-I-BASE-YM
                AND  B.상품대분류코드 = 'FI'
                AND  ((A.통합계정과목코드 <> '4030202000000'
                   AND A.통합계정과목코드 = B.통합계정과목코드 )
                 OR   (A.통합계정과목코드 =  '4030202000000'
                   AND A.계정과목코드     = B.상품번호))
               WITH  UR
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-KJL0055-DELETE-RTN
              THRU  S3000-KJL0055-DELETE-EXT
           PERFORM  S3000-KJL0055-PROCESS-RTN
              THRU  S3000-KJL0055-PROCESS-EXT

      *@   처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@DBIO, SQLIO PARAMETER 초기화
           INITIALIZE       WK-AREA
                            WK-SYSIN
                            YCDBIOCA-CA

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD551 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   국별익스포져계좌명세(THKJL0055)삭제
      *-----------------------------------------------------------------
       S3000-KJL0055-DELETE-RTN.

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0055 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             DELETE  FROM  DB2DBA.THKJL0055
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월일   = :WK-H-I-BASE-YMD
                AND  과목코드     = 'R05'
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0055'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0055'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit 시   오류가   발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0055-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-KJL0055-PROCESS-RTN.

           PERFORM  S3100-KJLR005-OPEN-RTN
              THRU  S3100-KJLR005-OPEN-EXT

           PERFORM  S3200-KJLR005-FETCH-RTN
              THRU  S3200-KJLR005-FETCH-EXT

           PERFORM  UNTIL EOF-Y

                    PERFORM  S3300-KJL0055-INSERT-RTN
                       THRU  S3300-KJL0055-INSERT-EXT

                    PERFORM  S3200-KJLR005-FETCH-RTN
                       THRU  S3200-KJLR005-FETCH-EXT
           END-PERFORM

           PERFORM  S3400-KJLR005-CLOSE-RTN
              THRU  S3400-KJLR005-CLOSE-EXT
           .
       S3000-KJL0055-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJLR005-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJLR005_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJLR005'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJLR005-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJLR005-FETCH-RTN.

           EXEC SQL
              FETCH  THKJLR005_CUR
               INTO :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FETCH-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJLR005'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJLR005-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@    국별익스포져계좌명세(THKJL0055)등록
      *-----------------------------------------------------------------
       S3300-KJL0055-INSERT-RTN.

           INITIALIZE    TKJL0055-KEY
                         TRJL0055-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0055-GROUP-CO-CD

      *    기준년월일
           MOVE  WK-H-I-BASE-YMD
             TO  RJL0055-BASE-YMD

      *    계좌번호
           MOVE  WK-H-O-ACNO
             TO  RJL0055-ACNO

      *    계좌중복일련번호
           ADD   CO-NUM-1              TO  WK-SEQ
           MOVE  WK-SEQ
             TO  RJL0055-ACN-DUP-SERNO

170224*    고객식별자
           MOVE  WK-H-O-CUST-IDNFR
             TO  RJL0055-CUST-IDNFR

      *    고객관리번호
           MOVE  WK-H-O-CUST-MGT-NO
             TO  RJL0055-CUST-MGT-NO


      *--------------------------------------------------------------
      * 2010.06.28:상품정보등록여신만　국별익스포져대상으로　주석처리
      *--------------------------------------------------------------
      *상품정보　미매핑이면　국별원장(THKJL0054) SELECT
      *    IF WK-H-O-PRDCT-LAG-CLSFI-CD  = SPACE  AND
      *       WK-H-O-PRDCT-MEDM-CLSFI-CD = SPACE  AND
      *       WK-H-O-PRDCT-TMPLT-CD      = SPACE  AND
      *       WK-H-O-PRDCT-NO            = SPACE
      *    THEN
      *       PERFORM  S3310-KJL0054-SELECT-RTN
      *          THRU  S3310-KJL0054-SELECT-EXT
      *    END-IF
      *--------------------------------------------------------------

      *    상품대분류코드
           MOVE  WK-H-O-PRDCT-LAG-CLSFI-CD
             TO  RJL0055-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O-PRDCT-MEDM-CLSFI-CD
             TO  RJL0055-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O-PRDCT-TMPLT-CD
             TO  RJL0055-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O-PRDCT-NO
             TO  RJL0055-PRDCT-NO

      *    대출자격구분
           MOVE  SPACE
             TO  RJL0055-LN-QULFI-DSTCD

      *    국가코드
           MOVE  WK-H-O-ISO-NATNL-CD
             TO  RJL0055-ISO-NATNL-CD

      *    관리부점코드
           MOVE  WK-H-O-MGT-BRNCD
             TO  RJL0055-MGT-BRNCD

      *    시작년월일
           IF  WK-H-O-NEW-YMD = SPACES  OR
               WK-H-O-NEW-YMD = '00000000'
           THEN
               MOVE  '00010101'
                 TO  RJL0055-START-YMD
           ELSE
               MOVE  WK-H-O-NEW-YMD
                 TO  RJL0055-START-YMD
           END-IF

      *    만기년월일
           IF  WK-H-O-EXPIR-YMD = SPACES  OR
               WK-H-O-EXPIR-YMD = '00000000'
           THEN
               MOVE  '00010101'
                 TO  RJL0055-EXPIR-YMD
           ELSE
               MOVE  WK-H-O-EXPIR-YMD
                 TO  RJL0055-EXPIR-YMD
           END-IF

      *    종료년월일
           MOVE  '00010101'
             TO  RJL0055-END-YMD

      *    과목코드
           MOVE  CO-CHA-R05
             TO  RJL0055-SBJCT-CD

      *    통화코드
           MOVE  WK-H-O-LCAL-HNDLN-CNCYCD
             TO  RJL0055-CNCYCD

      *    통화한도
           MOVE  WK-H-O-LCAL-LIMT-AGRE-AMT
             TO  RJL0055-CRNCY-CLAM

      *    통화금일잔액
           MOVE  WK-H-O-LCAL-CRNCY-LN-BAL
             TO  RJL0055-CRNCY-TDD-BAL

      * 국제한도구분 :  새로신설됨 (200505)
           EVALUATE  WK-H-O-INTN-LIMT-DSTCD
               WHEN  CO-CHA-1
      * 한도여신------------------------------------------------------
      * 만기전：한도 RJL0055-USD-CLAM(O),잔액 RJL0055-USD-TDD-BAL(X)
      * 만기후：한도 RJL0055-USD-CLAM(X),잔액 RJL0055-USD-TDD-BAL(X)
      *-----------------------------------------------------------------
      *              계약한도구분
                     MOVE  CO-CHA-01
                       TO  RJL0055-CTRC-LIMT-DSTCD
                     IF  RJL0055-EXPIR-YMD >= WK-H-I-BASE-YMD
                     THEN
      *                  USD한도
                         MOVE  WK-H-O-USD-LIMT-AGRE-AMT
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  ZERO
                           TO  RJL0055-USD-TDD-BAL
                     ELSE
      *                  USD한도
                         MOVE  ZERO
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  ZERO
                           TO  RJL0055-USD-TDD-BAL
                     END-IF
               WHEN  CO-CHA-3
      * 건별여신(모계좌의 만기일로 만기전/후 판단)----------
      * 만기전：한도RJL0055-USD-CLAM(X),잔액RJL0055-USD-TDD-BAL(O)
      * 만기후：한도RJL0055-USD-TDD-BAL(O)=잔액RJL0055-USD-TDD-BAL(O
      *-----------------------------------------------------------------
      *              계약한도구분
                     MOVE  CO-CHA-03
                       TO  RJL0055-CTRC-LIMT-DSTCD
                     IF  WK-H-O-MAMA-EXPIR-YMD >= WK-H-I-BASE-YMD
                     THEN
      *                  USD한도
                         MOVE  ZERO
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-TDD-BAL
                     ELSE
      *                  USD한도
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-TDD-BAL
                     END-IF
               WHEN  CO-CHA-4
      * 개별여신------------------------------------------------------
      * 만기전：한도 RJL0055-USD-CLAM(O)=잔액 RJL0055-USD-TDD-BAL(O)
      * 만기후：한도 RJL0055-USD-CLAM(O)=잔액 RJL0055-USD-TDD-BAL(O)
      *-----------------------------------------------------------------
      *              계약한도구분
                     MOVE  CO-CHA-04
                       TO  RJL0055-CTRC-LIMT-DSTCD
                     IF  RJL0055-EXPIR-YMD >= WK-H-I-BASE-YMD
                     THEN
      *                  USD한도
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-TDD-BAL
                     ELSE
      *                  USD한도
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-CLAM
      *                  USD금일잔액
                         MOVE  WK-H-O-USD-LN-BAL
                           TO  RJL0055-USD-TDD-BAL
                     END-IF
               WHEN  OTHER
      * 한도내한도여신------------------------------------------------
      * 만기전：한도 RJL0055-USD-CLAM(X),잔액 RJL0055-USD-TDD-BAL(X)
      * 만기후：한도 RJL0055-USD-CLAM(X),잔액 RJL0055-USD-TDD-BAL(X)
      *-----------------------------------------------------------------
      *              계약한도구분
                     MOVE  CO-CHA-02
                       TO  RJL0055-CTRC-LIMT-DSTCD
                     MOVE  ZERO
                       TO  RJL0055-USD-CLAM
                     MOVE  ZERO
                       TO  RJL0055-USD-TDD-BAL
           END-EVALUATE

           #DYDBIO  INSERT-CMD-Y TKJL0055-PK TRJL0055-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INSERT-CNT
               WHEN  OTHER
                     MOVE 'KJL0055'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *    1000건　마다　 COMMIT
           IF  FUNCTION MOD(WK-AC-FETCH-CNT,1000) = CO-NUM-0
           THEN
               #USRLOG '* WK-AC-FETCH-CNT  = ' WK-AC-FETCH-CNT
               EXEC SQL
                 COMMIT
               END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처
               EVALUATE  SQLCODE
                   WHEN  CO-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0055'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF
           .
       S3300-KJL0055-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJLR005-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJLR005_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJLR005'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-KJLR005-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJLR005_CUR   COUNT  = ' WK-AC-FETCH-CNT
           #USRLOG '* KJL0055 INSERT  COUNT  = ' WK-AC-INSERT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD551 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
