      *=================================================================
      *@¾÷¹«¸í    : KJL (ÅäÅ»ÀÍ½ºÆ÷Á®)
      *@ÇÁ·Î±×·¥¸í: BJLD671 (»ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è) - EAD
      *@Ã³¸®À¯Çü  : BATCH
      *@Ã³¸®°³¿ä  : »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è ÃßÃâ
      *@ 1.±ÝÀ¶¾÷
      *@  £­±ÝÀ¶¾÷£ºÃÖ°íÇÑµµÁ¦¿Üµî·ÏÂ÷ÁÖBCC,KBÁöÁÖ(2)Æ÷ÇÔ- EAD
      *-----------------------------------------------------------------
      *                 P R O G R A M   º¯¡¡°æ¡¡ÀÌ¡¡·Â
      *-----------------------------------------------------------------
      *@¼º¸í : ÀÏÀÚ : º¯¡¡°æ¡¡³»¡¡¿ë
      * ----------------------------------------------------------------
      *¹éÇöÁ¤:20110722: ½Å±Ô°³¹ß
      *¹éÇöÁ¤:20110801:ÇÑµµÃÊ°úÀÏ£¯¿¹¿ÜÀû¿ëÀÏ¡¡ÄÃ·³Ãß°¡
      * YBH  :20120111:¾÷Á¾´ëºÐ·ù º¯°æ°ü·Ã ¼öÁ¤
      *               : D17(À½½ÄÁÖÁ¡¾÷)==>C17(¼÷¹ÚÀ½½ÄÁ¡¾÷)
      * HYH  :20120227:  1,000°Ç ´ÜÀ§ COMMIT ÁÖ±â º¯°æ
      * HYH  :20120510:  THKJL0065 Ç×¸ñ Ãß°¡
      *                (Ãë±ÞÁß´Ü³â¿ùÀÏ, ¿¹¿ÜÀû¿ë³â¿ùÀÏ,
      *                 Ãë±Þ±âÁØ1Àû¿ë³â¿ùÀÏ,Ãë±Þ±âÁØ1Àû¿ë³â¿ùÀÏ)
      * HYH  :20120810: A0920 Â÷·®¿ë¿¬·á¼Ò¸Å¾÷ => D11
      *                 A1444 ¿åÅÁ¾÷           => D23
      *                 A1360 ÀÏ¹Ýº´¿ø         => D24 º°µµ ÃßÃâ
      * HYH  :20140110: A0840 °¡±¸Á¦Á¶¾÷       => D04
      *                 A0490 Á¦Ã¶Á¦°­         => D06
      *                 A0920 Â÷·®¿ë¿¬·á¼Ò¸Å¾÷ => D11
      *                 C26   °ø°ø±â°ü
      *                 ±â¾÷±Ô¸ð ±âÅ¸·Î º°µµ ºÐ·ù
      * HYH  :20160108: A0311 ÇÕ¼º°í¹«~        => D05
      *                 A1010 È£ÅÚ¾÷           => E17
      *                 A1011 ¿©°ü¾÷
      *                 A1012 ÈÞ¾çÄÜµµ¿î¿µ¾÷   => D17¼÷¹Ú¾÷(È£ÅÚ
      *                 A1013 ±âÅ¸¼÷¹Ú                        Á¦¿Ü)
      * YBH  :20170117: A1010 È£ÅÚ¾÷           => C17
      * HYH  :20170224: KB-PIN ÀüÈ¯
      * YBH    :20170406: ¿ù¸»ÀçÀÛ¾÷ TABLEº¯°æ
      * YBH    :20170912:A1410	=> D22	·¹Á®
      *                  A1420	=> D22	·¹Á®
      *                  A1421	=> D22	·¹Á®
      *                  A1422	=> D22	·¹Á®
      *                  A1423	=> D22	·¹Á®
      *                  A1290	=> E22	¼ÒÇÁÆ®¿þ¾î
      *                  A1291	=> E22	¼ÒÇÁÆ®¿þ¾î
      *                  A1292	=> E22	¼ÒÇÁÆ®¿þ¾î
      *                  A1310	=> F22	¿µÈ­±¤°í¾÷
      *                  A1370	=> F22	¿µÈ­±¤°í¾÷
      *                  A1380	=> F22	¿µÈ­±¤°í¾÷
      *                  A1390	=> F22	¿µÈ­±¤°í¾÷
      *                  A1400	=> F22	¿µÈ­±¤°í¾÷
      * YBH    :20171023: µî·ÏµÈ°èÁÂÀÇ »ê¾÷T/E º¯°æ
      *                   (¸ð±â¾÷°í°´½Äº°ÀÚ==>ÇØ´ç°í°´½Äº°ÀÚ)
      * YBH    :20171130: ÇÑµµ°ü¸®¹æ½Äº¯°æ(HARD CORDING Á¦°Å)
      * YBH    :20180117: ´ëÃâ±Ý¾×(¹Ì±âÇ¥±Ý¾×) Ãß°¡
      *                 : »ê¾÷TE±â¾÷±Ô¸ð:¹ýÀÎ Ãß°¡
      * YBH    :20180125: Àü³âµµ¸»ÀÍ½ºÆ÷Á® »êÃâ½Ã
      *                   ¼ÒÈ£ÀÍ½ºÆ÷Á®±¸ºÐ ÃßÃâ ±âÁØº¯°æ
      * YBH    :20180622: THKIHB105 Å×ÀÌºíº¯°æ°ü·Ã COPYBOOK¹Ì»ç¿ë
      * YBH    :20190109: Z37 TE±Ý¾×À» C37-»ýÈ°µµ¼Ò¸Å
      *                  »ê¾÷TE±Ý¾×À¸·Î º¯°æÃ³¸® Ãß°¡
      * YBH    :20200102: »ê¾÷TE»êÃâ½Ã ±¹³»¿Ü±¸ºÐÀ»
      *                   »óÇ°´ëºÐ·ù ×FIø ºÐ·ùÇÔ.
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM               : Å×ÀÌºí¸í         : Á¢±ÙÀ¯Çü
      **  -------------------------   ----------------------------------
      **  Â÷ÁÖÀÍ½ºÆ÷Á®ÀÏ½ÇÀû        : THKJL0129          : R
      **  »ê¾÷º°±Ô¸ðº°SUBÇÑµµ°ü¸® : THKJL0065          : R
      **  Ã¤¹«ÀÚ°í°´±âº»            : THKJL0015          : R
      **  °í°´±âº»ÀÏÁ¤º¸            : THKJL0152          : R
      **  ¼ÒÈ£ÀÏº°Â÷ÁÖ¸í¼¼          : THKIHB105          : R
      **  Ç¥ÁØ»ê¾÷ÄÚµå¸ñ·Ï          : THKJL0044          : R
      **  ½É»ç¹Ì±âÇ¥¿©½ÅÇöÈ²¼öº¸    : THKJLR003          : R
      **  »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è: THKJL0067          : CD
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD671.
       AUTHOR.                         ¹éÇöÁ¤
       DATE-WRITTEN.                   10/10/31.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *Ç×¸ñ:ÄÚµå±¸ºÐ(1)+¿À·ù ¹ß»ý PGM(2)+¿À·ù¹ß»ý ·çÆ¾+
      *½Äº°¹øÈ£

      *01 : ÃÊ±âÈ­ Ã³¸®(C/A Á¶¸³,Open µî)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB ÀÔ·Â Ã³¸®
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : ³»ºÎ º» Ã³¸®
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB Ãâ·Â Ã³¸®
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : Á¾·á Ã³¸®(Commit, Close µî)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : ±âÅ¸
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch ÃÊ±âÈ­ À¯Æ¿¸®Æ¼ È£Ãâ
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch ÁøÇà°ü¸® À¯Æ¿¸®Æ¼ È£Ãâ
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD671'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-4                PIC  X(001) VALUE '4'.
           03  CO-CHA-5                PIC  X(001) VALUE '5'.
           03  CO-CHA-6                PIC  X(001) VALUE '6'.
           03  CO-CHA-7                PIC  X(001) VALUE '7'.
           03  CO-CHA-8                PIC  X(001) VALUE '8'.
           03  CO-CHA-9                PIC  X(001) VALUE '9'.
           03  CO-CHA-A                PIC  X(001) VALUE 'A'.

           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-06               PIC  X(002) VALUE '06'.
           03  CO-CHA-07               PIC  X(002) VALUE '07'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-C20              PIC  X(003) VALUE 'C20'.
           03  CO-CHA-000              PIC  X(003) VALUE '000'.
           03  CO-CHA-0000             PIC  X(004) VALUE '0000'.
           03  CO-CHA-00000            PIC  X(005) VALUE '00000'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT2           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT3           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-SKP-CNT           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-UPT-CNT           PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-GUBUN                PIC  X(001).
           03  WK-IDSTRY-TCS-DSTCD     PIC  X(001).
      *       Àü³âµµ
           03  WK-BEFORE-YEAR          PIC  9(004).
      *       Àü³âµµ¸»¿ù
           03  WK-BEFORE-YM            PIC  X(006).
180622     03  WK-SOHO-EXPSR-DSTCD     PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *±×·ìÈ¸»çÄÚµå
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *ÀÛ¾÷½ÇÇàÀÏ
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *ÀÛ¾÷¸í
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *Ã³¸®È¸Â÷(001:Á¤±âÀÏÀÛ¾÷/002:¿ù¸»ÀçÀÛ¾÷)
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *¹èÄ¡ÀÛ¾÷±¸ºÐ
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *ÀÛ¾÷ÀÚID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *ÀÚ·á±âÁØ³â¿ùÀÏ
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *¼ÒÈ£±âÁØ³â¿ùÀÏ
           03  WK-SYSIN-SOHO-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *°øÅë¿µ¿ª ±âÁØÀÏÀÚ Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
171117*¿ù¸»»êÃâPARAMETER
       01  XCJIDT05-CA.
           COPY XCJIDT05.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.

      *-----------------------------------------------------------------
      * TABLE ACCESS INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRJL0015-REC.
           COPY    TRJL0015.
       01  TKJL0067-KEY.
           COPY    TKJL0067.
       01  TRJL0067-REC.
           COPY    TRJL0067.
       01  TRJL0065-REC.
           COPY    TRJL0065.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY    YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS °ü·Ã COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       ±×·ìÈ¸»çÄÚµå
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       ±âÁØÀÏ
           03 WK-H-I-BASE-DD                PIC  X(00002).
      *       ±âÁØ³â¿ù
           03 WK-H-I-BASE-YM                PIC  X(00006).
      *       ±âÁØ³â¿ùÀÏ
           03 WK-H-I-BASE-YMD               PIC  X(00008).
      *       ¼ÒÈ£±âÁØ³â¿ùÀÏ
           03 WK-H-I-SOHO-YMD               PIC  X(00008).
      *       Àü³âµµ¸»¿ù
           03 WK-H-I-BEFORE-YM              PIC  X(00006).
180125*       Àü³âµµ¸»¿ùÀÏ
           03 WK-H-I-BEFORE-YMD             PIC  X(00008).


       01  WK-HOST-OUT.
170224*       Â÷ÁÖ°í°´½Äº°ÀÚ
           03 WK-H-O-BRWR-CUST-IDNFR        PIC  X(00010).
      *       »ê¾÷º°±Ô¸ðº°TE±Ý¾×
           03 WK-H-O-IDSTRY-PSP-TE-AMT      PIC S9(00015) COMP-3.
200102*       ±¹¿Ü»ê¾÷±Ô¸ðTE±Ý¾×
           03 WK-H-O-ABRD-I-SCAL-T-E-AMT    PIC S9(00015) COMP-3.

       EXEC  SQL  END    DECLARE       SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
           DECLARE  THKJL0129_CUR     CURSOR WITH HOLD FOR
           SELECT Â÷ÁÖ°í°´½Äº°ÀÚ
                 ,CASE WHEN SUM("ÇÑµµ±âÁØTE±Ý¾×") >= 0
                       THEN SUM(CASE WHEN »óÇ°´ëºÐ·ùÄÚµå <> 'FI'
                                     THEN "ÇÑµµ±âÁØTE±Ý¾×"
                                     ELSE 0
                                END)
                       ELSE 0
                  END AS "±¹³»TE±Ý¾×"
200102           ,CASE WHEN SUM("ÇÑµµ±âÁØTE±Ý¾×") >= 0
                       THEN SUM(CASE WHEN »óÇ°´ëºÐ·ùÄÚµå = 'FI'
                                     THEN "ÇÑµµ±âÁØTE±Ý¾×"
                                     ELSE 0
                                END)
                       ELSE 0
                  END AS "±¹¿ÜTE±Ý¾×"
             FROM DB2DBA.THKJL0129
            WHERE ±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
              AND ±âÁØÀÏ       = :WK-H-I-BASE-DD
              AND ±âÁØ³â¿ù     = :WK-H-I-BASE-YM
              AND Â÷ÁÖ°í°´½Äº°ÀÚ NOT IN
                 (SELECT °í°´½Äº°ÀÚ
                    FROM DB2DBA.THKJL0059
                   WHERE ±×·ìÈ¸»çÄÚµå     = :WK-H-I-GROUP-CO-CD
                     AND ÇÑµµ°ü¸®Á¦¿Ü±¸ºÐ = '1'
                  )
            GROUP BY Â÷ÁÖ°í°´½Äº°ÀÚ
             WITH UR
           END-EXEC.



171117*@  Àü³âµµ¸»TE »êÃâ
           EXEC SQL
           DECLARE  THKJL0130_CUR     CURSOR WITH HOLD FOR
           SELECT Â÷ÁÖ°í°´½Äº°ÀÚ
                 ,CASE WHEN SUM("ÇÑµµ±âÁØTE±Ý¾×") >= 0
                       THEN SUM(CASE WHEN »óÇ°´ëºÐ·ùÄÚµå <> 'FI'
                                     THEN "ÇÑµµ±âÁØTE±Ý¾×"
                                     ELSE 0
                                END)
                       ELSE 0
                  END AS "±¹³»TE±Ý¾×"
200102           ,CASE WHEN SUM("ÇÑµµ±âÁØTE±Ý¾×") >= 0
                       THEN SUM(CASE WHEN »óÇ°´ëºÐ·ùÄÚµå = 'FI'
                                     THEN "ÇÑµµ±âÁØTE±Ý¾×"
                                     ELSE 0
                                END)
                       ELSE 0
                  END AS "±¹¿ÜTE±Ý¾×"
             FROM DB2DBA.THKJL0130
            WHERE ±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
              AND ±âÁØ³â¿ù     = :WK-H-I-BEFORE-YM
              AND Â÷ÁÖ°í°´½Äº°ÀÚ NOT IN
                 (SELECT °í°´½Äº°ÀÚ
                    FROM DB2DBA.THKJL0059
                   WHERE ±×·ìÈ¸»çÄÚµå     = :WK-H-I-GROUP-CO-CD
                     AND ÇÑµµ°ü¸®Á¦¿Ü±¸ºÐ = '1'
                  )
            GROUP BY Â÷ÁÖ°í°´½Äº°ÀÚ
             WITH UR
           END-EXEC.



171117*@  ´ëÃâ±Ý¾×(¹Ì±âÇ¥±Ý¾×) »êÃâ
           EXEC SQL
           DECLARE  THKJLR003_CUR     CURSOR WITH HOLD FOR
           SELECT ½É»ç°í°´½Äº°ÀÚ
                 ,SUM(´ëÃâ±Ý¾×) AS ´ëÃâ±Ý¾×
             FROM DB2DBA.THKJLR003
            WHERE ±×·ìÈ¸»çÄÚµå       = :WK-H-I-GROUP-CO-CD
              AND ±âÁØ³â¿ùÀÏ         = :WK-H-I-BASE-YMD
            GROUP BY ½É»ç°í°´½Äº°ÀÚ
             WITH UR
           END-EXEC.


      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  Ã³¸®¸ÞÀÎ
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  ÃÊ±âÈ­
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  ÀÔ·Â°ª¡¡CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  ¾÷¹«Ã³¸®
           PERFORM  S3000-KJL0067-DELETE-RTN
              THRU  S3000-KJL0067-DELETE-EXT

171117*   ÀÏÁ¤±â ÇÑµµ ¹× TE »êÃâ
           MOVE  CO-CHA-1
             TO  WK-GUBUN
           PERFORM  S3000-KJL0067-PROCESS-RTN
              THRU  S3000-KJL0067-PROCESS-EXT

171117*   Àü³âµµ¸» TE »êÃâ
           MOVE  CO-CHA-2
             TO  WK-GUBUN
           PERFORM  S3000-KJL0067-PROCESS-RTN
              THRU  S3000-KJL0067-PROCESS-EXT

180117*   ´ëÃâ±Ý¾×(¹Ì±âÇ¥±Ý¾×) »êÃâ
           MOVE  CO-CHA-3
             TO  WK-GUBUN
           PERFORM  S3000-KJL0067-PROCESS-RTN
              THRU  S3000-KJL0067-PROCESS-EXT


190116*    SUB-LIMIT ÀÛ¾÷ ¿Ï·á
           EXEC SQL
             COMMIT
           END-EXEC

      *    Commit Ã³¸®°á°ú
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit ½Ã   ¿À·ù°¡   ¹ß»ýÇß½À´Ï´Ù '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           #USRLOG '*THKJL0067 SUB LIMIT END OK--------------------*'

190109*   Z37 TE±Ý¾×, C37 »ê¾÷TE±Ý¾×À¸·Î º¯°æ
           PERFORM  S4000-KJL0067-UPDATE-RTN
              THRU  S4000-KJL0067-UPDATE-EXT

      *@  Ã³¸®Á¾·á
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    ÃÊ±âÈ­
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@WK-AREA,DBIO,PARAMETER ÃÊ±âÈ­
           INITIALIZE    WK-AREA
                         WK-SYSIN
                         YCDBIOCA-CA

      * JCL SYSIN ACCEPT  Ã³¸®±âÁØ
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD671 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    ±×·ìÈ¸»çÄÚµå
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    ±¸ºÐÄÚµå
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    °øÅë UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN Á¤º¸ È®ÀÎ
           IF  XBJISTDT-R-STAT = ZEROS
      *        Á¤»óÃ³¸®
               CONTINUE
           ELSE
      *        ¿¡·¯Ã³¸®
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  ÀÔ·Â°ª°ËÁõ
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   ±×·ìÈ¸»ç±¸ºÐÄÚµå
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '±×·ìÈ¸»ç±¸ºÐÄÚµå ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ÀÛ¾÷½ÇÇàÀÏ
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE 'ÀÛ¾÷½ÇÇàÀÏ ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ÀÛ¾÷¸í
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE 'ÀÛ¾÷¸í ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   Ã³¸®È¸Â÷
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE 'Ã³¸®È¸Â÷ ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ¹èÄ¡ÀÛ¾÷±¸ºÐ
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '¹èÄ¡ÀÛ¾÷±¸ºÐ ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ÀÛ¾÷ÀÚID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE 'ÀÛ¾÷ÀÚID ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ÀÚ·á±âÁØ³â¿ùÀÏ
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE 'ÀÚ·á±âÁØ³â¿ùÀÏ ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   ¼ÒÈ£±âÁØ³â¿ùÀÏ
           IF  WK-SYSIN-SOHO-YMD = SPACE
               MOVE '¼ÒÈ£±âÁØ³â¿ùÀÏ ¹ÌÀÔ·Â ¿À·ùÀÔ´Ï´Ù.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    ±×·ìÈ¸»çÄÚµå
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    ±âÁØÀÏ
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    ±âÁØ³â¿ù
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    ±âÁØ³â¿ùÀÏ
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD

      *    ¼ÒÈ£±âÁØ³â¿ùÀÏ
           MOVE  WK-SYSIN-SOHO-YMD
             TO  WK-H-I-SOHO-YMD

      *   Àü³âµµ¸»¿ù = ±âÁØ³â - 1³â + '12'
           MOVE  WK-SYSIN-BASE-YMD(1:4)
             TO  WK-BEFORE-YEAR

           COMPUTE WK-BEFORE-YEAR = WK-BEFORE-YEAR - 1

           MOVE  WK-BEFORE-YEAR
             TO  WK-BEFORE-YM(1:4)

           MOVE  '12'
             TO  WK-BEFORE-YM(5:2)

171117*@1 ¿ù¸»ÀÏ¡¡ÃßÃâ
           PERFORM S3100-CJIDT05-CALL-RTN
              THRU S3100-CJIDT05-CALL-EXT

      *   Àü³âµµ¸»¿ù(¿ù¸»¿µ¾÷³â¿ùÀÏ)
           MOVE  XCJIDT05-O-ENMN-BZOPR-YMD(1:6)
             TO  WK-H-I-BEFORE-YM

180125*   Àü³âµµ¸»¿ùÀÏ(¿ù¸»¿µ¾÷³â¿ùÀÏ)
           MOVE  XCJIDT05-O-ENMN-BZOPR-YMD
             TO  WK-H-I-BEFORE-YMD

                             .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.

      *-----------------------------------------------------------------01961005
      *@  ¿ù¸»ÀÏ¡¡ÃßÃâ                                                01962005
      *-----------------------------------------------------------------01963005
       S3100-CJIDT05-CALL-RTN.                                          01964005
                                                                        01965005
      *@1.1 ÃÊ±âÈ­                                                    01965105
           INITIALIZE  XCJIDT05-IN                                      01966005

      *@1.2 È£Ãâº¯¼ö MOVE                                             01967005
      *@   ±×·ìÈ¸»çÄÚµå                                               01968005
           MOVE BICOM-GROUP-CO-CD                                       01969005
             TO XCJIDT05-I-GROUP-CO-CD                                  01969105
      *@   ±âÁØ³â¿ùÀÏ                                                 01969205
           MOVE WK-BEFORE-YM
             TO XCJIDT05-I-YMD(1:6)                                     01969405
           MOVE CO-CHA-01                                               01969505
             TO XCJIDT05-I-YMD(7:2)                                     01969605

      *@1.3 ÇÁ·Î±×·¥È£Ãâ                                              01970005
           #DYCALL CJIDT05 YCCOMMON-CA XCJIDT05-CA                      01970105

      *@1.4 È£Ãâ°á°úÈ®ÀÎ                                              01970205
      *@  È£Ãâ°á°ú°¡°æ°íÀÎ°æ¿ìµµÁ¤»óÃ³¸®ÇÑ´Ù
      *@  ÀÔ·ÂÀÏÀÚ°¡¿ù¸»ÀÎ°æ¿ì£°£¶£¨°æ°í£©
      *@  ÀÔ·ÂÀÏÀÚ°¡³â¸»ÀÎ°æ¿ì£°£·£¨°æ°í£©
           IF XCJIDT05-R-STAT = ZEROS     OR                            01970305
                                CO-CHA-06 OR
                                CO-CHA-07
               CONTINUE                                                 01970505
           ELSE                                                         01970605
               #ERROR XCJIDT05-R-ERRCD                                  01970705
                      XCJIDT05-R-TREAT-CD                               01970805
                      XCJIDT05-R-STAT                                   01970905
           END-IF                                                       01971005
           .                                                            01971105

       S3100-CJIDT05-CALL-EXT.                                          01971205
           EXIT.                                                        01971305

      *-----------------------------------------------------------------
      *@   »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è(THKJL0067)»èÁ¦
      *-----------------------------------------------------------------
       S3000-KJL0067-DELETE-RTN.

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0067 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             DELETE  FROM  DB2DBA.THKJL0067
              WHERE  ±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
                AND  ±âÁØ³â¿ùÀÏ   = :WK-H-I-BASE-YMD
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     #USRLOG '<< THKJL0067 DELETE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
      *¿¡·¯¸Þ½ÃÁö:³»ºÎ º» Ã³¸®
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit Ã³¸®°á°ú SQL-CODE¸¦ È®ÀÎÇÏ¿© Á¤»ó/¿À·ù Ã³
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit ½Ã   ¿À·ù°¡   ¹ß»ýÇß½À´Ï´Ù '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0067-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   ¾÷¹«Ã³¸®
      *-----------------------------------------------------------------
       S3000-KJL0067-PROCESS-RTN.

           PERFORM  S3100-KJL0129-OPEN-RTN
              THRU  S3100-KJL0129-OPEN-EXT

           PERFORM  S3200-KJL0129-FETCH-RTN
              THRU  S3200-KJL0129-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

                    IF  FUNCTION MOD(WK-AC-FE-CNT, 50000) = CO-NUM-0
                        #USRLOG 'FETCH COUNT : ' WK-AC-FE-CNT
                    END-IF

      *             Â÷ÁÖ°í°´Á¤º¸¿øÀåÃßÃâ
                    PERFORM  S3300-KJL0015-SELECT-RTN
                       THRU  S3300-KJL0015-SELECT-EXT

171130*       µî·ÏµÈ SUBÇ×¸ñ¸¸ »êÃâ,³ª¸ÓÁöSKIP
               IF RJL0015-LAG-CLSFI-BZTYP-CD = SPACE
                   ADD 1
                    TO WK-AC-SKP-CNT
               ELSE
      *           »ê¾÷TE±â¾÷±Ô¸ð±âÁØ¡¡±¸ºÐ
                   PERFORM  S3400-GIUPGB-SELECT-RTN
                      THRU  S3400-GIUPGB-SELECT-EXT

      *           »ê¾÷º°±Ô¸ðº°SUBÇÑµµ£­°ü¸®ÇÑµµ»êÃâ
                   PERFORM  S3500-KJL0065-SELECT-RTN
                      THRU  S3500-KJL0065-SELECT-EXT

      *           »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°èÀÚ·á¡¡»ý¼º
                   PERFORM  S3600-PROCESS-SUB-RTN
                      THRU  S3600-PROCESS-SUB-EXT
               END-IF

                    PERFORM  S3200-KJL0129-FETCH-RTN
                       THRU  S3200-KJL0129-FETCH-EXT
           END-PERFORM

           PERFORM  S3600-KJL0129-CLOSE-RTN
              THRU  S3600-KJL0129-CLOSE-EXT
           .
       S3000-KJL0067-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0129-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
               EXEC SQL
                   OPEN  THKJL0129_CUR
               END-EXEC
           WHEN CO-CHA-2
               EXEC SQL
                   OPEN  THKJL0130_CUR
               END-EXEC
           WHEN CO-CHA-3
               EXEC SQL
                   OPEN  THKJLR003_CUR
               END-EXEC
           END-EVALUATE

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
            END-EVALUATE
           .
       S3100-KJL0129-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0129-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
               EXEC SQL
                  FETCH  THKJL0129_CUR
                   INTO  :WK-HOST-OUT
               END-EXEC
           WHEN CO-CHA-2
               EXEC SQL
                  FETCH  THKJL0130_CUR
                   INTO  :WK-HOST-OUT
               END-EXEC
           WHEN CO-CHA-3
               EXEC SQL
                  FETCH  THKJLR003_CUR
                   INTO  :WK-HOST-OUT
               END-EXEC
           END-EVALUATE

           EVALUATE  SQLCODE
           WHEN  CO-OK
               ADD   CO-NUM-1    TO  WK-AC-FE-CNT

               EVALUATE WK-GUBUN
               WHEN CO-CHA-1
                   ADD   CO-NUM-1    TO  WK-AC-FE-CNT1
               WHEN CO-CHA-2
                   ADD   CO-NUM-1    TO  WK-AC-FE-CNT2
               WHEN CO-CHA-3
                   ADD   CO-NUM-1    TO  WK-AC-FE-CNT3
               END-EVALUATE

           WHEN  CO-NOT-FOUND
               SET   EOF-Y       TO  TRUE
           WHEN  OTHER
               MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
               MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
               MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
               MOVE 'CURSOR FETCH½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                 TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0129-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   Ã¤¹«ÀÚ°í°´±âº»(THKJL0015)ÀÚ·á¡¡ÃßÃâ
      *-----------------------------------------------------------------
       S3300-KJL0015-SELECT-RTN.

           INITIALIZE    TRJL0015-REC

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
           WHEN CO-CHA-3
      *@      ÀÚ·á±âÁØ¡¡½ÃÁ¡ÀÇ¡¡»ê¾÷TE Àû¿ë
170406         IF WK-SYSIN-JOB-SEQ = '001'
      *           Á¤±âÀÏÀÛ¾÷
                   EXEC SQL
                   SELECT B."SUB¾÷Á¾ÄÚµå"
                        , REPLACE(A."TE±â¾÷±Ô¸ð±¸ºÐ",' ','0')
                     INTO :RJL0015-LAG-CLSFI-BZTYP-CD
                        , :RJL0015-TE-CORP-SCAL-DSTCD
                     FROM DB2DBA.THKJL0015 A
                        , DB2DBA.THKJL0044 B
                    WHERE A.±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
                      AND A.°í°´½Äº°ÀÚ   = :WK-H-O-BRWR-CUST-IDNFR
                      AND A.±×·ìÈ¸»çÄÚµå      = B.±×·ìÈ¸»çÄÚµå
                      AND B.±âÁØ³â¿ù          = :WK-H-I-BASE-YM
                      AND A.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå= B.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå
                   END-EXEC
               ELSE
170406*           ¿ù¸»ÀçÀÛ¾÷
                   EXEC SQL
                   SELECT B."SUB¾÷Á¾ÄÚµå"
                        , REPLACE(A."TE±â¾÷±Ô¸ð±¸ºÐ",' ','0')
                     INTO :RJL0015-LAG-CLSFI-BZTYP-CD
                        , :RJL0015-TE-CORP-SCAL-DSTCD
                     FROM DB2DBA.THKJL0152 A
                        , DB2DBA.THKJL0044 B
                    WHERE A.±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
                      AND A.±âÁØ³â¿ù     = :WK-H-I-BASE-YM
170224                AND A.°í°´½Äº°ÀÚ   = :WK-H-O-BRWR-CUST-IDNFR
                      AND A.±×·ìÈ¸»çÄÚµå      = B.±×·ìÈ¸»çÄÚµå
                      AND A.±âÁØ³â¿ù          = B.±âÁØ³â¿ù
                      AND A.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå= B.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå
                   END-EXEC
               END-IF
           WHEN CO-CHA-2
      *       Àü³âµµ¸»TE(»ê¾÷ºÐ·ùÁ¤º¸´Â ´ç¿ù Á¤º¸·Î »êÃâ)
               EXEC SQL
               SELECT B."SUB¾÷Á¾ÄÚµå"
                    , REPLACE(A."TE±â¾÷±Ô¸ð±¸ºÐ",' ','0')
                 INTO :RJL0015-LAG-CLSFI-BZTYP-CD
                    , :RJL0015-TE-CORP-SCAL-DSTCD
                 FROM DB2DBA.THKJL0152 A
                    , DB2DBA.THKJL0044 B
                WHERE A.±×·ìÈ¸»çÄÚµå = :WK-H-I-GROUP-CO-CD
                  AND A.±âÁØ³â¿ù     = :WK-H-I-BEFORE-YM
170224            AND A.°í°´½Äº°ÀÚ   = :WK-H-O-BRWR-CUST-IDNFR
                  AND A.±×·ìÈ¸»çÄÚµå = B.±×·ìÈ¸»çÄÚµå
                  AND B.±âÁØ³â¿ù     = :WK-H-I-BASE-YM
                  AND A.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå= B.½ÅÇ¥ÁØ»ê¾÷ºÐ·ùÄÚµå
               END-EXEC
           END-EVALUATE

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *            ¼ÒÈ£¿øÀåÃßÃâ£¨°í°´½Äº°ÀÚÃ£À»¶§¸¸¼ÒÈ£ÀÚ·áÃßÃâ£©
                    PERFORM  S3300-KIHB105-SELECT-RTN
                       THRU  S3300-KIHB105-SELECT-EXT
               WHEN  CO-NOT-FOUND
      *             ±â¾÷±Ô¸ð±¸ºÐ
                     MOVE  CO-CHA-0
                       TO  RJL0015-TE-CORP-SCAL-DSTCD
               WHEN  OTHER
                     MOVE 'KJL0015'     TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE      TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                        TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KJL0015-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   ¼ÒÈ£°í°´±âº»(THKIHB105)ÀÚ·á¡¡ÃßÃâ
      *-----------------------------------------------------------------
       S3300-KIHB105-SELECT-RTN.

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
           WHEN CO-CHA-3
      *       ÀÚ·á±âÁØ¡¡½ÃÁ¡ÀÇ¡¡»ê¾÷TE Àû¿ë
               EXEC SQL
               SELECT  A.¼ÒÈ£ÀÍ½ºÆ÷Á®±¸ºÐ
                 INTO  :WK-SOHO-EXPSR-DSTCD
                 FROM  DB2DBA.THKIHB105 A
                WHERE  A.±×·ìÈ¸»çÄÚµå   = :WK-H-I-GROUP-CO-CD
                  AND  A.½É»ç°í°´½Äº°ÀÚ = :WK-H-O-BRWR-CUST-IDNFR
                  AND  A.°í°´°ü¸®¹øÈ£   = '00000'
                  AND  A.±âÁØ³â¿ùÀÏ     = :WK-H-I-SOHO-YMD
                 WITH  UR
               END-EXEC
           WHEN CO-CHA-2
180125*       Àü³âµµ¸» ½ÃÁ¡ÀÇ »ê¾÷TE Àû¿ë
               EXEC SQL
               SELECT  ¼ÒÈ£ÀÍ½ºÆ÷Á®±¸ºÐ
                 INTO  :WK-SOHO-EXPSR-DSTCD
                 FROM  DB2DBA.THKIHB105
                WHERE  ±×·ìÈ¸»çÄÚµå   = :WK-H-I-GROUP-CO-CD
                  AND  ½É»ç°í°´½Äº°ÀÚ = :WK-H-O-BRWR-CUST-IDNFR
                  AND  °í°´°ü¸®¹øÈ£   = '00000'
                  AND  ±âÁØ³â¿ùÀÏ     = :WK-H-I-BEFORE-YMD
                 WITH  UR
               END-EXEC
           END-EVALUATE

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  CO-NOT-FOUND
                     MOVE  CO-CHA-0
                       TO  WK-SOHO-EXPSR-DSTCD
               WHEN  OTHER
                     MOVE 'KIHB105'     TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE      TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                        TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KIHB105-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   »ê¾÷TE±â¾÷±Ô¸ð±âÁØ¡¡±¸ºÐ
      *-----------------------------------------------------------------
       S3400-GIUPGB-SELECT-RTN.

           INITIALIZE    WK-IDSTRY-TCS-DSTCD

      *±â¾÷±Ô¸ð¼ÂÆÃ£¨¼ÒÈ££±£º¼Ò¸Å£¬¼ÒÈ££²£º±â¾÷£©
           EVALUATE  TRUE ALSO TRUE
               WHEN  WK-SOHO-EXPSR-DSTCD = CO-CHA-1  ALSO TRUE
      *»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ£½£´£¨¼Ò¸ÅÇü¼ÒÈ££©
                     MOVE CO-CHA-4
                       TO WK-IDSTRY-TCS-DSTCD
               WHEN  WK-SOHO-EXPSR-DSTCD = CO-CHA-2  ALSO TRUE
      *»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ£½£³£¨±â¾÷Çü¼ÒÈ££©
                     MOVE CO-CHA-3
                       TO WK-IDSTRY-TCS-DSTCD
               WHEN  WK-SOHO-EXPSR-DSTCD = CO-CHA-0  ALSO
                     (RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-1 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-7 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-A )
      *»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ£½£±£¨´ë±â¾÷£­´ë±â¾÷£¯°ø°ø±â¾÷£¯ÁÖÃ¤¹«£©
                      MOVE CO-CHA-1
                        TO WK-IDSTRY-TCS-DSTCD
               WHEN  WK-SOHO-EXPSR-DSTCD = CO-CHA-0  ALSO
                     (RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-2 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-3 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-4 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-5 OR
                      RJL0015-TE-CORP-SCAL-DSTCD = CO-CHA-6 )
      *»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ£½£²£¨Áß¼Ò±â¾÷£­Áß¼Ò±â¾÷°£ÁÖ£¯¿µ¼¼±â¾÷£©
                     MOVE CO-CHA-2
                       TO WK-IDSTRY-TCS-DSTCD
               WHEN  OTHER
      *»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ£½£¹£¨±âÅ¸£©
                     MOVE CO-CHA-9
                       TO WK-IDSTRY-TCS-DSTCD
           END-EVALUATE

                              .
       S3400-GIUPGB-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   »ê¾÷º°±Ô¸ðº°SUBÇÑµµ°ü¸®(THKJL0065)ÀÚ·á¡¡ÃßÃâ
      *-----------------------------------------------------------------
       S3500-KJL0065-SELECT-RTN.

           INITIALIZE    TRJL0065-REC

           EXEC SQL
             SELECT  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"
                    ,"»ê¾÷º°±Ô¸ðº°SUBÇÑµµ"
                    ,¿¹¿ÜÀû¿ë³â¿ùÀÏ
                    ,Ãë±ÞÁß´Ü³â¿ùÀÏ
                    ,"Ãë±Þ±âÁØ1Àû¿ë³â¿ùÀÏ"
                    ,"Ãë±Þ±âÁØ2Àû¿ë³â¿ùÀÏ"
                    ,REPLACE(Á¶È¸¿©ºÎ,' ','0')
200102              ,±¹¿Ü»ê¾÷±Ô¸ðÇÑµµ±Ý¾×
               INTO  :RJL0065-IDSTRY-TCS-DSTCD
                    ,:RJL0065-IDSTRY-PSP-SUB-CLAM
                    ,:RJL0065-ECEPT-APLY-YMD
                    ,:RJL0065-HNDLN-DSCN-YMD
                    ,:RJL0065-HNDLN-B-1-APLY-YMD
                    ,:RJL0065-HNDLN-B-2-APLY-YMD
                    ,:RJL0065-INQURY-YN
200102              ,:RJL0065-ABRD-IS-SUB-CLAM
               FROM  DB2DBA.THKJL0065
              WHERE ±×·ìÈ¸»çÄÚµå   = :WK-H-I-GROUP-CO-CD
                AND ±âÁØ³â¿ù       = :WK-H-I-BASE-YM
                AND ´ëºÐ·ù¾÷Á¾ÄÚµå = :RJL0015-LAG-CLSFI-BZTYP-CD
                AND (("»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" = :WK-IDSTRY-TCS-DSTCD)
                 OR  ("»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" = '5'
                AND   :WK-IDSTRY-TCS-DSTCD    IN ('3','4'))
180117           OR  ("»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" = '6'
                AND   :WK-IDSTRY-TCS-DSTCD    IN ('1','2'))
                 OR  ("»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" = 'A'))
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  CO-NOT-FOUND
      *             »ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ
                     MOVE WK-IDSTRY-TCS-DSTCD
                       TO RJL0065-IDSTRY-TCS-DSTCD
                     MOVE CO-CHA-0
                       TO RJL0065-INQURY-YN
               WHEN  OTHER
                     MOVE 'KJL0065'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3500-KJL0065-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   ¾÷¹«Ã³¸®SUB
      *-----------------------------------------------------------------
       S3600-PROCESS-SUB-RTN.

           INITIALIZE    TKJL0067-KEY
                         TRJL0067-REC

      *    ±×·ìÈ¸»çÄÚµå£­Á¶¸³
           MOVE  WK-H-I-GROUP-CO-CD
             TO  KJL0067-PK-GROUP-CO-CD

      *    ±âÁØ³â¿ùÀÏ
           MOVE  WK-H-I-BASE-YMD
             TO  KJL0067-PK-BASE-YMD

      *    ´ëºÐ·ù¾÷Á¾ÄÚµå
           MOVE  RJL0015-LAG-CLSFI-BZTYP-CD
             TO  KJL0067-PK-LAG-CLSFI-BZTYP-CD

      *    »ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ
           MOVE  RJL0065-IDSTRY-TCS-DSTCD
             TO  KJL0067-PK-IDSTRY-TCS-DSTCD

           #DYDBIO  SELECT-CMD-Y  TKJL0067-PK  TRJL0067-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     PERFORM  S3610-KJL0067-UPDATE-RTN
                        THRU  S3610-KJL0067-UPDATE-EXT
               WHEN  COND-DBIO-MRNF
                     PERFORM  S3620-KJL0067-INSERT-RTN
                        THRU  S3620-KJL0067-INSERT-EXT
               WHEN  OTHER
                     MOVE  'KJL0067'   TO  XZUGEROR-I-TBL-ID
                     MOVE  'SELECT  '  TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE  'DBÀÛ¾÷½Ã¡¡¿À·ù°¡¡¡¹ß»ý'
                                       TO  XZUGEROR-I-MSG
      *»ç¿ëÀÚÁ¤ÀÇ ¿¡·¯ÄÚµå ¼³Á¤(13: DBÀÛ¾÷ ¿À·ù)
      *@DBÀÛ¾÷¡¡¿À·ù
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S3600-PROCESS-SUB-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è(THKJL0067)¼öÁ¤
      *-----------------------------------------------------------------
       S3610-KJL0067-UPDATE-RTN.

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
200102*       ±¹³»´ë»ó¾÷Ã¼°Ç¼ö
               IF  WK-H-O-IDSTRY-PSP-TE-AMT > 0
                   ADD  CO-NUM-1
                    TO  RJL0067-TAGET-ENTP-NOITM
               END-IF

      *        »ê¾÷º°±Ô¸ðº°TE±Ý¾×(±¹³»)
               ADD  WK-H-O-IDSTRY-PSP-TE-AMT
                TO  RJL0067-IDSTRY-PSP-TE-AMT

200102*       ±¹¿Ü´ë»ó¾÷Ã¼°Ç¼ö
               IF  WK-H-O-ABRD-I-SCAL-T-E-AMT > 0
                   ADD  CO-NUM-1
                    TO  RJL0067-ABRD-T-ENTP-NOITM
               END-IF
      *       ±¹¿Ü»ê¾÷±Ô¸ðTE±Ý¾×
               ADD  WK-H-O-ABRD-I-SCAL-T-E-AMT
                TO  RJL0067-ABRD-I-SCAL-T-E-AMT
      *       ÀüÃ¼´ë»ó¾÷Ã¼°Ç¼ö
               ADD  CO-NUM-1
                TO  RJL0067-WHOL-T-ENTP-NOITM
           WHEN CO-CHA-2
171117*       Àü³âµµ¸»ÀÍ½ºÆ÷Á®±Ý¾×(±¹³»)
               ADD  WK-H-O-IDSTRY-PSP-TE-AMT
                TO  RJL0067-PYY-X-END-EXPSR-AMT

200102*       ±¹¿ÜÀü³â¸»TE±Ý¾×
               ADD  WK-H-O-ABRD-I-SCAL-T-E-AMT
                TO  RJL0067-ABRD-PXE-EXPSR-AMT
           WHEN CO-CHA-3
180117*       ´ëÃâ±Ý¾×
               ADD  WK-H-O-IDSTRY-PSP-TE-AMT
                TO  RJL0067-LN-AMT
           END-EVALUATE

           #DYDBIO  UPDATE-CMD-Y TKJL0067-PK TRJL0067-REC

      *   ¸®ÅÏÄÚµå°¡ Á¤»óÀÌ ¾Æ´Ï¸é ¿¡·¯Ã³¸®
           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-UPT-CNT
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'UPDATE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'UPDATE½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
            END-EVALUATE

      *@1  1000°Ç¸¶´Ù DISPLAY & COMMITÃ³¸®
           IF  FUNCTION MOD(WK-AC-UPT-CNT, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-UPT-CNT : ' WK-AC-UPT-CNT

               EXEC SQL
                    COMMIT
               END-EXEC

      *       ¸®ÅÏÄÚµå°¡ Á¤»óÀÌ ¾Æ´Ï¸é ¿¡·¯Ã³¸®
               EVALUATE  SQLCODE
                   WHEN  ZERO
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit½Ã¿À·ù°¡¹ß»ýÇß½À´Ï´Ù '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

           .
       S3610-KJL0067-UPDATE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è(THKJL0067)µî·Ï
      *-----------------------------------------------------------------
       S3620-KJL0067-INSERT-RTN.

      *    ±×·ìÈ¸»çÄÚµå£­Á¶¸³
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0067-GROUP-CO-CD

      *    ±âÁØ³â¿ùÀÏ
           MOVE  WK-H-I-BASE-YMD
             TO  RJL0067-BASE-YMD

      *    ´ëºÐ·ù¾÷Á¾ÄÚµå
           MOVE  RJL0015-LAG-CLSFI-BZTYP-CD
             TO  RJL0067-LAG-CLSFI-BZTYP-CD

      *    »ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ
           MOVE  RJL0065-IDSTRY-TCS-DSTCD
             TO  RJL0067-IDSTRY-TCS-DSTCD

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
200102*        ´ë»ó¾÷Ã¼°Ç¼ö(±¹³»)
               IF  WK-H-O-IDSTRY-PSP-TE-AMT > 0
                   MOVE  CO-NUM-1
                     TO  RJL0067-TAGET-ENTP-NOITM
               END-IF

      *        »ê¾÷º°±Ô¸ðº°SUBÇÑµµ(±¹³»)
               MOVE  RJL0065-IDSTRY-PSP-SUB-CLAM
                 TO  RJL0067-IDSTRY-PSP-SUB-CLAM

      *        »ê¾÷º°±Ô¸ðº°TE±Ý¾×(±¹³»)
               MOVE  WK-H-O-IDSTRY-PSP-TE-AMT
                 TO  RJL0067-IDSTRY-PSP-TE-AMT

      *        ÇÑµµÃÊ°ú³â¿ùÀÏ
               MOVE  SPACE
                 TO  RJL0067-LIMT-EXCS-YMD

      *        ¿¹¿ÜÀû¿ë³â¿ùÀÏ
               MOVE  RJL0065-ECEPT-APLY-YMD
               TO    RJL0067-ECEPT-APLY-YMD

      *        Ãë±ÞÁß´Ü³â¿ùÀÏ
               MOVE  RJL0065-HNDLN-DSCN-YMD
               TO    RJL0067-HNDLN-DSCN-YMD

      *        Ãë±Þ±âÁØ1Àû¿ë³â¿ùÀÏ
               MOVE  RJL0065-HNDLN-B-1-APLY-YMD
               TO    RJL0067-HNDLN-B-1-APLY-YMD

      *        Ãë±Þ±âÁØ2Àû¿ë³â¿ùÀÏ
               MOVE  RJL0065-HNDLN-B-2-APLY-YMD
               TO    RJL0067-HNDLN-B-2-APLY-YMD

171130*       Á¶È¸¿©ºÎ
               MOVE  RJL0065-INQURY-YN
                 TO  RJL0067-INQURY-YN

200102*       ±¹¿Ü´ë»ó¾÷Ã¼°Ç¼ö
               IF  WK-H-O-ABRD-I-SCAL-T-E-AMT > 0
                   MOVE  CO-NUM-1
                     TO  RJL0067-ABRD-T-ENTP-NOITM
               END-IF
      *       ±¹¿Ü»ê¾÷±Ô¸ðÇÑµµ±Ý¾×
               MOVE  RJL0065-ABRD-IS-SUB-CLAM
                 TO  RJL0067-ABRD-IS-SUB-CLAM
      *       ±¹¿Ü»ê¾÷±Ô¸ðTE±Ý¾×
               MOVE  WK-H-O-ABRD-I-SCAL-T-E-AMT
                 TO  RJL0067-ABRD-I-SCAL-T-E-AMT
      *       ÀüÃ¼´ë»ó¾÷Ã¼°Ç¼ö
               MOVE  CO-NUM-1
                 TO  RJL0067-WHOL-T-ENTP-NOITM
           WHEN CO-CHA-2
171117*       Àü³âµµ¸»ÀÍ½ºÆ÷Á®±Ý¾×(±¹³»)
               MOVE  WK-H-O-IDSTRY-PSP-TE-AMT
                 TO  RJL0067-PYY-X-END-EXPSR-AMT

171130*       Á¶È¸¿©ºÎ
               MOVE  CO-CHA-0
                 TO  RJL0067-INQURY-YN

200102*       ±¹¿ÜÀü³â¸»TE±Ý¾×
               MOVE  WK-H-O-ABRD-I-SCAL-T-E-AMT
                 TO  RJL0067-ABRD-PXE-EXPSR-AMT
           WHEN CO-CHA-3
180117*       ´ëÃâ±Ý¾×
               MOVE  WK-H-O-IDSTRY-PSP-TE-AMT
                 TO  RJL0067-LN-AMT
           END-EVALUATE

           #DYDBIO  INSERT-CMD-Y TKJL0067-PK TRJL0067-REC

      *   ¸®ÅÏÄÚµå°¡ Á¤»óÀÌ ¾Æ´Ï¸é ¿¡·¯Ã³¸®
           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  1000°Ç¸¶´Ù DISPLAY & COMMITÃ³¸®
           IF  FUNCTION MOD(WK-AC-INT-CNT, 1000) = CO-NUM-0
               #USRLOG 'WK-AC-INT-CNT : ' WK-AC-INT-CNT

               EXEC SQL
                    COMMIT
               END-EXEC

      *       ¸®ÅÏÄÚµå°¡ Á¤»óÀÌ ¾Æ´Ï¸é ¿¡·¯Ã³¸®
               EVALUATE  SQLCODE
                   WHEN  ZERO
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit½Ã¿À·ù°¡¹ß»ýÇß½À´Ï´Ù '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

           .
       S3620-KJL0067-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3600-KJL0129-CLOSE-RTN.

           EVALUATE WK-GUBUN
           WHEN CO-CHA-1
               EXEC SQL
                   CLOSE  THKJL0129_CUR
               END-EXEC
           WHEN CO-CHA-2
               EXEC SQL
                   CLOSE  THKJL0130_CUR
               END-EXEC
           WHEN CO-CHA-3
               EXEC SQL
                   CLOSE  THKJLR003_CUR
               END-EXEC
           END-EVALUATE

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0129'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3600-KJL0129-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
190109*@   »ê¾÷º°±Ô¸ðº°ÀÍ½ºÆ÷Á®ÀÏÁý°è(THKJL0067)°»½Å
      *-----------------------------------------------------------------
       S4000-KJL0067-UPDATE-RTN.

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0067 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             UPDATE DB2DBA.THKJL0067 A
                SET "»ê¾÷º°±Ô¸ðº°TE±Ý¾×" =
                    VALUE((SELECT SUM("»ê¾÷º°±Ô¸ðº°TE±Ý¾×")
                      FROM DB2DBA.THKJL0066
                     WHERE ±×·ìÈ¸»çÄÚµå   = A.±×·ìÈ¸»çÄÚµå
                       AND ±âÁØ³â¿ùÀÏ     = A.±âÁØ³â¿ùÀÏ
                       AND ´ëºÐ·ù¾÷Á¾ÄÚµå = 'C37'
                       AND ((  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" =
                             A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ")
                        OR  (  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" IN ('3','4')
                       AND   A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = '5')
                        OR  (  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" IN ('1','2')
                       AND   A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = '6')
                        OR  (A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = 'A'))
                    ),0)
200102             ,"±¹¿Ü»ê¾÷±Ô¸ðTE±Ý¾×" =
                    VALUE((SELECT SUM("±¹¿Ü»ê¾÷±Ô¸ðTE±Ý¾×")
                      FROM DB2DBA.THKJL0066
                     WHERE ±×·ìÈ¸»çÄÚµå   = A.±×·ìÈ¸»çÄÚµå
                       AND ±âÁØ³â¿ùÀÏ     = A.±âÁØ³â¿ùÀÏ
                       AND ´ëºÐ·ù¾÷Á¾ÄÚµå = 'C37'
                       AND ((  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" =
                             A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ")
                        OR  (  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" IN ('3','4')
                       AND   A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = '5')
                        OR  (  "»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ" IN ('1','2')
                       AND   A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = '6')
                        OR  (A."»ê¾÷TE±â¾÷±Ô¸ð±¸ºÐ"  = 'A'))
                    ),0)
                   ,½Ã½ºÅÛÃÖÁ¾Ã³¸®ÀÏ½Ã   = HEX(CURRENT_TIMESTAMP)
                   ,½Ã½ºÅÛÃÖÁ¾»ç¿ëÀÚ¹øÈ£ = :CO-PGM-ID
              WHERE ±×·ìÈ¸»çÄÚµå   = :WK-H-I-GROUP-CO-CD
                AND ±âÁØ³â¿ùÀÏ     = :WK-H-I-BASE-YMD
                AND ´ëºÐ·ù¾÷Á¾ÄÚµå = 'Z37'
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     #USRLOG '<< THKJL0067 UPDATE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'UPDATE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'UPDATE½Ã ¿À·ù°¡ ¹ß»ýÇß½À´Ï´Ù'
                                       TO  XZUGEROR-I-MSG
      *¿¡·¯¸Þ½ÃÁö:³»ºÎ º» Ã³¸®
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit Ã³¸®°á°ú SQL-CODE¸¦ È®ÀÎÇÏ¿© Á¤»ó/¿À·ù Ã³
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0067'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit ½Ã   ¿À·ù°¡   ¹ß»ýÇß½À´Ï´Ù '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S4000-KJL0067-UPDATE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   Ã³¸®Á¾·á
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL     TOT   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* THKJL0129_CUR   COUNT  = ' WK-AC-FE-CNT1
           #USRLOG '* THKJL0130_CUR   COUNT  = ' WK-AC-FE-CNT2
           #USRLOG '* THKJLR003_CUR   COUNT  = ' WK-AC-FE-CNT3
           #USRLOG '* SKIP            COUNT  = ' WK-AC-SKP-CNT
           #USRLOG '* KJL0067 INSERT  COUNT  = ' WK-AC-INT-CNT
           #USRLOG '* KJL0067 UPDATE  COUNT  = ' WK-AC-UPT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD671 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
