      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD274 (BT간접익스포져 일반계좌 MC)
      *@처리유형  : BATCH
      *@처리개요  : 간접익스포져 일반계좌 MC
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090331: 신규작성
      * HYH    :20120227:  1,000건 단위 COMMIT 주기 변경
      * HYH    :20120713:  THKJL0027 일자별 파티션삭제로 변경
      * YBH    :20140527: 그룹내간접여부 추가
      * YBH    :20140805: 그룹내간접여부 처리시
      *                   계열적용구분 체크 추가
      * HYH    :20150226:  10건 단위 COMMIT 주기 변경
      * HYH    :20170120:  KB-PIN 항목 추가
      * HYH    :20170224:  KB-PIN 전환
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM         : 테이블명               : 접근유형
      **  ---------------------   --------------------------------------
      **  간접보증인계좌일실적: THKJL0027                : CD
      **  간접보증인계좌월실적: THKJL0028                : CD
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD274.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/03/31.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT IN-FILE              ASSIGN       TO  INFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  IN-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  IN-REC.
      *       그룹회사코드
           03 IN-GROUP-CO-CD           PIC  X(003).
      *       기준일
           03 IN-BASE-DD               PIC  X(002).
      *       기준년월
           03 IN-BASE-YM               PIC  X(006).
      *       담보보증고객식별자
           03 IN-SCURTY-G-CUSZ-IDNFR   PIC  X(010).
      *       계약식별자
           03 IN-CTRC-IDNFR            PIC  X(025).
      *       담보보증차주번호
           03 IN-SCURTY-G-BRWR-NO      PIC  X(013).
      *       보증인고객구분
           03 IN-GRNR-CUST-DSTCD       PIC  X(002).
      *       차주번호
           03 IN-BRWR-NO               PIC  X(013).
      *       채무자구분
           03 IN-DBTR-DSTCD            PIC  X(002).
      *       담보구분
           03 IN-SCURTY-DSTCD          PIC  X(003).
      *       상품대분류코드
           03 IN-PRDCT-LAG-CLSFI-CD    PIC  X(002).
      *       상품중분류코드
           03 IN-PRDCT-MEDM-CLSFI-CD   PIC  X(002).
      *       상품템플릿코드
           03 IN-PRDCT-TMPLT-CD        PIC  X(003).
      *       상품번호
           03 IN-PRDCT-NO              PIC  X(005).
      *       대출자격구분
           03 IN-LN-QULFI-DSTCD        PIC  X(003).
      *       간접중분류구분
           03 IN-INDR-M-CLSFI-DSTCD    PIC  X(002).
      *       과목코드
           03 IN-SBJCT-CD              PIC  X(003).
      *       통화코드
           03 IN-CNCYCD                PIC  X(003).
      *       통화설정금액
           03 IN-CRNCY-SETAMT          PIC S9(015)V9(3) COMP-3.
      *       원화환산금액
           03 IN-WONC-AUC              PIC S9(015) COMP-3.
      *       간접명목금액
           03 IN-INDR-TTL-AMT          PIC S9(015) COMP-3.
      *       간접익스포져금액
           03 IN-INDR-EXPSR-AMT        PIC S9(015) COMP-3.
      *       관련테이블명
           03 IN-RELATD-TBL-NAME       PIC  X(012).
      *       담보계약식별자
           03 IN-SCURTY-CTRC-IDNFR     PIC  X(025).
      *       담보계약계좌번호
           03 IN-SCURTY-CTRC-ACNO      PIC  X(020).
      *       시스템최종처리일시
           03 IN-SYS-LAST-PRCSS-YMS    PIC  X(020).
      *       시스템최종사용자번호
           03 IN-SYS-LAST-UNO          PIC  X(007).
140527*       그룹내간접여부
           03 IN-GROUP-WTIN-INDR-YN    PIC  X(001).
170120*       담보고객식별자
           03 IN-SCURTY-CUST-IDNFR     PIC  X(010).


      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호
      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD274'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-SQL-OK               PIC  9(003) VALUE  000.
           03  CO-SQL-NTFND            PIC  9(003) VALUE  100.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-IN-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-READ-CNT          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FETCH-CNT         PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INSERT-CNT1       PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INSERT-CNT2       PIC  9(013) VALUE  ZEROS.
           03  WK-AC-DELETE-CNT        PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
140527     03  WK-GROUP-WTIN-INDR-YN   PIC  X(001).

       01  WK-AREA1.
           03  WK-TBL-ID               PIC  X(008).
           03  WK-FUNC-CD              PIC  X(008).
           03  WK-REC-CNT              PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *월말영영일　추출
       01  XCJIIL09-CA.
           COPY    XCJIIL09.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TKJL0027-KEY.
           COPY  TKJL0027.
       01  TRJL0027-REC.
           COPY  TRJL0027.
       01  TKJL0028-KEY.
           COPY  TKJL0028.
       01  TRJL0028-REC.
           COPY  TRJL0028.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY  YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).
      *       기준일
           03 WK-H-I-BASE-DD                PIC  X(00002).
170224*       담보보증고객식별자
           03 WK-H-I-SCURTY-G-CUSZ-IDNFR    PIC  X(00010).
170224*       담보고객식별자
           03 WK-H-I-SCURTY-CUST-IDNFR      PIC  X(00010).

       01  WK-HOST-OUT.
      *       담보보증고객식별자
           03 WK-H-O-SCURTY-G-CUSZ-IDNFR    PIC  X(00010).
      *       계약식별자
           03 WK-H-O-CTRC-IDNFR             PIC  X(00025).
      *       담보보증차주번호
           03 WK-H-O-SCURTY-G-BRWR-NO       PIC  X(00013).
      *       보증인고객구분
           03 WK-H-O-GRNR-CUST-DSTCD        PIC  X(00002).
      *       차주번호
           03 WK-H-O-BRWR-NO                PIC  X(00013).
      *       채무자구분
           03 WK-H-O-DBTR-DSTCD             PIC  X(00002).
      *       담보구분
           03 WK-H-O-SCURTY-DSTCD           PIC  X(00003).
      *       상품대분류코드
           03 WK-H-O-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 WK-H-O-PRDCT-NO               PIC  X(00005).
      *       대출자격구분
           03 WK-H-O-LN-QULFI-DSTCD         PIC  X(00003).
      *       간접중분류구분
           03 WK-H-O-INDR-M-CLSFI-DSTCD     PIC  X(00002).
      *       과목코드
           03 WK-H-O-SBJCT-CD               PIC  X(00003).
      *       통화코드
           03 WK-H-O-CNCYCD                 PIC  X(00003).
      *       통화설정금액
           03 WK-H-O-CRNCY-SETAMT           PIC S9(00015)V9(3) COMP-3.
      *       원화환산금액
           03 WK-H-O-WONC-AUC               PIC S9(00015) COMP-3.
      *       간접명목금액
           03 WK-H-O-INDR-TTL-AMT           PIC S9(00015) COMP-3.
      *       간접익스포져금액
           03 WK-H-O-INDR-EXPSR-AMT         PIC S9(00015) COMP-3.
      *       관련테이블명
           03 WK-H-O-RELATD-TBL-NAME        PIC  X(00012).
      *       담보계약식별자
           03 WK-H-O-SCURTY-CTRC-IDNFR      PIC  X(00025).
      *       담보계약계좌번호
           03 WK-H-O-SCURTY-CTRC-ACNO       PIC  X(00020).
140527*       그룹내간접여부
           03 WK-H-O-GROUP-WTIN-INDR-YN     PIC  X(00001).
170120*       담보고객식별자
           03 WK-H-O-SCURTY-CUST-IDNFR      PIC  X(00010).



       EXEC  SQL  END  DECLARE              SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKJL0027_CUR     CURSOR WITH HOLD FOR
             SELECT  담보보증고객식별자
                  ,  계약식별자
                  ,  담보보증차주번호
                  ,  보증인고객구분
                  ,  차주번호
                  ,  채무자구분
                  ,  담보구분
                  ,  상품대분류코드
                  ,  상품중분류코드
                  ,  상품템플릿코드
                  ,  상품번호
                  ,  대출자격구분
                  ,  간접중분류구분
                  ,  과목코드
                  ,  통화코드
                  ,  통화설정금액
                  ,  원화환산금액
                  ,  간접명목금액
                  ,  간접익스포져금액
                  ,  관련테이블명
                  ,  담보계약식별자
                  ,  담보계약계좌번호
140527            ,  그룹내간접여부
170120            ,  담보고객식별자
               FROM  DB2DBA.THKJL0027
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준일       = :WK-H-I-BASE-DD
                AND  기준년월     = :WK-H-I-BASE-YM
               WITH UR
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리  20120713 일자별 파티션으로 변경
           PERFORM  S3000-KJL0027-PROCESS-RTN
              THRU  S3000-KJL0027-PROCESS-EXT

      *@  영업말일을　추출한다
           PERFORM  S5000-XCJIIL09-CALL-RTN
              THRU  S5000-XCJIIL09-CALL-EXT

      *@  매월영업말일일경우　보증인별계좌정보　월집계정보　추출
           IF  WK-SYSIN-BASE-YMD = XCJIIL09-O-ENMN-BZOPR-YMD
               PERFORM  S4000-KJL0028-DELETE-RTN
                  THRU  S4000-KJL0028-DELETE-EXT
               PERFORM  S4000-KJL0028-PROCESS-RTN
                  THRU  S4000-KJL0028-PROCESS-EXT
           END-IF

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@DBIO, SQLIO PARAMETER 초기화
           INITIALIZE       WK-AREA
                            WK-AREA1
                            WK-SYSIN
                            YCDBIOCA-CA

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD274 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *       정상처리
              CONTINUE
           ELSE
      *       에러처리
              #ERROR   XBJISTDT-R-ERRCD
                       XBJISTDT-R-TREAT-CD
                       XBJISTDT-R-STAT
              #OKEXIT  CO-CHA-08
           END-IF

           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           OPEN  INPUT  IN-FILE

           IF  WK-IN-F-ST NOT = CO-STAT-OK
               MOVE 'IN-FILE OPEN ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-IN-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
               #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-KJL0027-PROCESS-RTN.

           PERFORM  S3100-READ-FILE-RTN
              THRU  S3100-READ-FILE-EXT

           PERFORM  UNTIL EOF-Y
                    PERFORM  S3200-KJL0027-INSERT-RTN
                       THRU  S3200-KJL0027-INSERT-EXT

                    PERFORM  S3100-READ-FILE-RTN
                       THRU  S3100-READ-FILE-EXT
           END-PERFORM

      *    마지막 10건 미만 INSERT / UPDATE  COMMIT 처리
           INITIALIZE                      WK-AREA1
           MOVE  'KJL0027'             TO  WK-TBL-ID
           MOVE  'LAST'                TO  WK-FUNC-CD
           MOVE   WK-AC-INSERT-CNT1    TO  WK-REC-CNT

           PERFORM  S8000-COMMIT-PROCESS-RTN
              THRU  S8000-COMMIT-PROCESS-EXT

                                .
       S3000-KJL0027-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    READ FILE
      *-----------------------------------------------------------------
       S3100-READ-FILE-RTN.

           READ  IN-FILE               AT  END
            SET  EOF-Y                 TO  TRUE
           END-READ

           EVALUATE  WK-IN-F-ST
               WHEN  ZERO
               WHEN  CO-CHA-04
                     ADD   CO-NUM-1    TO  WK-AC-READ-CNT
               WHEN  CO-CHA-10
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'IN-FILE READ ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
                     MOVE  WK-IN-F-ST
                                       TO  XZUGEROR-I-MSG(34:2)
                     #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           IF  FUNCTION MOD(WK-AC-READ-CNT, 50000) = CO-NUM-0
               #USRLOG '* FILE READ       COUNT  = ' WK-AC-READ-CNT
           END-IF
           .
       S3100-READ-FILE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   간접보증인일계좌명세(THKJL0027)등록
      *-----------------------------------------------------------------
       S3200-KJL0027-INSERT-RTN.

           INITIALIZE    TKJL0027-KEY
                         TRJL0027-REC

      *    그룹회사코드
           MOVE  IN-GROUP-CO-CD
             TO  RJL0027-GROUP-CO-CD

      *    기준일
           MOVE  IN-BASE-DD
             TO  RJL0027-BASE-DD

      *    기준년월
           MOVE  IN-BASE-YM
             TO  RJL0027-BASE-YM

      *    담보보증고객식별자
           MOVE  IN-SCURTY-G-CUSZ-IDNFR
             TO  RJL0027-SCURTY-G-CUSZ-IDNFR

      *    계약식별자
           MOVE  IN-CTRC-IDNFR
             TO  RJL0027-CTRC-IDNFR

      *    담보보증차주번호
           MOVE  IN-SCURTY-G-BRWR-NO
             TO  RJL0027-SCURTY-G-BRWR-NO

      *    보증인고객구분
           MOVE  IN-GRNR-CUST-DSTCD
             TO  RJL0027-GRNR-CUST-DSTCD

      *    차주번호
           MOVE  IN-BRWR-NO
             TO  RJL0027-BRWR-NO

      *    채무자구분
           MOVE  IN-DBTR-DSTCD
             TO  RJL0027-DBTR-DSTCD

      *    담보구분
           MOVE  IN-SCURTY-DSTCD
             TO  RJL0027-SCURTY-DSTCD

      *    상품대분류코드
           MOVE  IN-PRDCT-LAG-CLSFI-CD
             TO  RJL0027-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  IN-PRDCT-MEDM-CLSFI-CD
             TO  RJL0027-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  IN-PRDCT-TMPLT-CD
             TO  RJL0027-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  IN-PRDCT-NO
             TO  RJL0027-PRDCT-NO

      *    대출자격구분
           MOVE  IN-LN-QULFI-DSTCD
             TO  RJL0027-LN-QULFI-DSTCD

      *    간접중분류구분
           MOVE  IN-INDR-M-CLSFI-DSTCD
             TO  RJL0027-INDR-M-CLSFI-DSTCD

      *    과목코드
           MOVE  IN-SBJCT-CD
             TO  RJL0027-SBJCT-CD

      *    통화코드
           MOVE  IN-CNCYCD
             TO  RJL0027-CNCYCD

      *    통화설정금액
           MOVE  IN-CRNCY-SETAMT
             TO  RJL0027-CRNCY-SETAMT

      *    원화환산금액
           MOVE  IN-WONC-AUC
             TO  RJL0027-WONC-AUC

      *    간접명목금액
           MOVE  IN-INDR-TTL-AMT
             TO  RJL0027-INDR-TTL-AMT

      *    간접익스포져금액
           MOVE  IN-INDR-EXPSR-AMT
             TO  RJL0027-INDR-EXPSR-AMT

      *    관련테이블명
           MOVE  IN-RELATD-TBL-NAME
             TO  RJL0027-RELATD-TBL-NAME

      *    담보계약식별자
           MOVE  IN-SCURTY-CTRC-IDNFR
             TO  RJL0027-SCURTY-CTRC-IDNFR

      *    담보계약계좌번호
           MOVE  IN-SCURTY-CTRC-ACNO
             TO  RJL0027-SCURTY-CTRC-ACNO

140527*@1  그룹내간접여부 취득처리
           PERFORM S3210-KJL0014-SELECT-RTN
              THRU S3210-KJL0014-SELECT-EXT

140527*    그룹내간접여부
           MOVE  WK-GROUP-WTIN-INDR-YN
             TO  RJL0027-GROUP-WTIN-INDR-YN

170120*    담보고객식별자
           MOVE  IN-SCURTY-CUST-IDNFR
             TO  RJL0027-SCURTY-CUST-IDNFR



           #DYDBIO  INSERT-CMD-Y TKJL0027-PK TRJL0027-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INSERT-CNT1

      *    INSERT / UPDATE 10건 단위 COMMIT 처리
                     INITIALIZE                      WK-AREA1
                     MOVE  'KJL0027'             TO  WK-TBL-ID
                     MOVE  'INSERT'              TO  WK-FUNC-CD
                     MOVE   WK-AC-INSERT-CNT1    TO  WK-REC-CNT

                     PERFORM  S8000-COMMIT-PROCESS-RTN
                        THRU  S8000-COMMIT-PROCESS-EXT

               WHEN  OTHER
                     #USRLOG '* TRJL0027-REC :' TRJL0027-REC
                     MOVE 'KJL0027'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

                               .
       S3200-KJL0027-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
140527*@   계열사기본(THKJL0014)조회
      *-----------------------------------------------------------------
       S3210-KJL0014-SELECT-RTN.

      *   담보보증고객식별자
           MOVE IN-SCURTY-G-CUSZ-IDNFR
             TO WK-H-I-SCURTY-G-CUSZ-IDNFR

      *   담보고객식별자
           MOVE IN-SCURTY-CUST-IDNFR
             TO WK-H-I-SCURTY-CUST-IDNFR


           EXEC SQL
           SELECT CASE WHEN VALUE(B.계열기업군코드,'') = ''
                        AND VALUE(C.계열기업군코드,'') = ''
                       THEN '0'
                       WHEN VALUE(B.계열기업군코드,'') =
                            VALUE(C.계열기업군코드,'')
                       THEN '1'
                       ELSE '0'
                  END
             INTO :WK-GROUP-WTIN-INDR-YN
             FROM (SELECT
                   :WK-H-I-GROUP-CO-CD         AS 그룹회사코드
                  ,:WK-H-I-BASE-YM             AS 기준년월
                  ,:WK-H-I-SCURTY-G-CUSZ-IDNFR AS 담보보증고객식별자
                  ,:WK-H-I-SCURTY-CUST-IDNFR   AS 담보고객식별자
                    FROM SYSIBM.SYSDUMMY1) A
                  LEFT OUTER JOIN
                  DB2DBA.THKJL0014 B
               ON A.그룹회사코드       = B.그룹회사코드
              AND A.기준년월           = B.기준년월
              AND A.담보보증고객식별자 = B.고객식별자
140805        AND B.계열적용구분       = '1'
                  LEFT OUTER JOIN
                  DB2DBA.THKJL0014 C
               ON A.그룹회사코드     = C.그룹회사코드
              AND A.기준년월         = C.기준년월
              AND A.담보고객식별자   = C.고객식별자
140805        AND C.계열적용구분     = '1'
            WHERE A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
             WITH UR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0014'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
           END-EVALUATE
           .

       S3210-KJL0014-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   간접보증인월계좌명세(THKJL0028)삭제
      *-----------------------------------------------------------------
       S4000-KJL0028-DELETE-RTN.

           #USRLOG '*DELETE START TIME : ' FUNCTION CURRENT-DATE

           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0028 IN EXCLUSIVE MODE
           END-EXEC

           EXEC SQL
             DELETE  FROM  DB2DBA.THKJL0028
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
               WHEN  CO-SQL-NTFND
                     #USRLOG '<< THKJL0028 DELETE OK >>'
               WHEN  OTHER
                     MOVE 'KJL0028'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           MOVE  SQLERRD(3)      TO WK-AC-DELETE-CNT
           #USRLOG '*DELETE COUNT : ' WK-AC-DELETE-CNT

           EXEC SQL
             COMMIT
           END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처
           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0028'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit 시   오류가   발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

           #USRLOG '*DELETE END TIME : ' FUNCTION CURRENT-DATE

                               .
       S4000-KJL0028-DELETE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S4000-KJL0028-PROCESS-RTN.

           PERFORM  S4100-KJL0027-OPEN-RTN
              THRU  S4100-KJL0027-OPEN-EXT

           PERFORM  S4200-KJL0027-FETCH-RTN
              THRU  S4200-KJL0027-FETCH-EXT

           PERFORM  UNTIL EOF-Y

                    PERFORM  S4300-KJL0028-INSERT-RTN
                       THRU  S4300-KJL0028-INSERT-EXT

                    PERFORM  S4200-KJL0027-FETCH-RTN
                       THRU  S4200-KJL0027-FETCH-EXT
           END-PERFORM

      *    INSERT / UPDATE 10건 단위 COMMIT 처리
           INITIALIZE                      WK-AREA1
           MOVE  'KJL0028'             TO  WK-TBL-ID
           MOVE  'LAST'                TO  WK-FUNC-CD
           MOVE   WK-AC-INSERT-CNT2    TO  WK-REC-CNT

           PERFORM  S8000-COMMIT-PROCESS-RTN
              THRU  S8000-COMMIT-PROCESS-EXT

           PERFORM  S4400-KJL0027-CLOSE-RTN
              THRU  S4400-KJL0027-CLOSE-EXT
           .
       S4000-KJL0028-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S4100-KJL0027-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0027_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0027'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4100-KJL0027-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S4200-KJL0027-FETCH-RTN.

           EXEC SQL
              FETCH  THKJL0027_CUR
               INTO :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     ADD   CO-NUM-1    TO  WK-AC-FETCH-CNT
               WHEN  CO-SQL-NTFND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0027'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4200-KJL0027-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@    간접보증인월계좌명세(THKJL0028)등록
      *-----------------------------------------------------------------
       S4300-KJL0028-INSERT-RTN.

           INITIALIZE    TKJL0028-KEY
                         TRJL0028-REC

      *    그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0028-GROUP-CO-CD

      *    기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0028-BASE-YM

      *    담보보증차주번호
           MOVE  WK-H-O-SCURTY-G-BRWR-NO
             TO  RJL0028-SCURTY-G-BRWR-NO

      *    계약식별자
           MOVE  WK-H-O-CTRC-IDNFR
             TO  RJL0028-CTRC-IDNFR

      *    보증인고객구분
           MOVE  WK-H-O-GRNR-CUST-DSTCD
             TO  RJL0028-GRNR-CUST-DSTCD

      *    차주번호
           MOVE  WK-H-O-BRWR-NO
             TO  RJL0028-BRWR-NO

      *    채무자구분
           MOVE  WK-H-O-DBTR-DSTCD
             TO  RJL0028-DBTR-DSTCD

      *    담보구분
           MOVE  WK-H-O-SCURTY-DSTCD
             TO  RJL0028-SCURTY-DSTCD

      *    상품대분류코드
           MOVE  WK-H-O-PRDCT-LAG-CLSFI-CD
             TO  RJL0028-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O-PRDCT-MEDM-CLSFI-CD
             TO  RJL0028-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O-PRDCT-TMPLT-CD
             TO  RJL0028-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O-PRDCT-NO
             TO  RJL0028-PRDCT-NO

      *    대출자격구분
           MOVE  WK-H-O-LN-QULFI-DSTCD
             TO  RJL0028-LN-QULFI-DSTCD

      *    간접중분류구분
           MOVE  WK-H-O-INDR-M-CLSFI-DSTCD
             TO  RJL0028-INDR-M-CLSFI-DSTCD

      *    과목코드
           MOVE  WK-H-O-SBJCT-CD
             TO  RJL0028-SBJCT-CD

      *    통화코드
           MOVE  WK-H-O-CNCYCD
             TO  RJL0028-CNCYCD

      *    통화설정금액
           MOVE  WK-H-O-CRNCY-SETAMT
             TO  RJL0028-CRNCY-SETAMT

      *    원화환산금액
           MOVE  WK-H-O-WONC-AUC
             TO  RJL0028-WONC-AUC

      *    간접명목금액
           MOVE  WK-H-O-INDR-TTL-AMT
             TO  RJL0028-INDR-TTL-AMT

      *    간접익스포져금액
           MOVE  WK-H-O-INDR-EXPSR-AMT
             TO  RJL0028-INDR-EXPSR-AMT

      *    관련테이블명
           MOVE  WK-H-O-RELATD-TBL-NAME
             TO  RJL0028-RELATD-TBL-NAME

      *    담보계약식별자
           MOVE  WK-H-O-SCURTY-CTRC-IDNFR
             TO  RJL0028-SCURTY-CTRC-IDNFR

      *    담보계약계좌번호
           MOVE  WK-H-O-SCURTY-CTRC-ACNO
             TO  RJL0028-SCURTY-CTRC-ACNO

140527*    그룹내간접여부
           MOVE  WK-H-O-GROUP-WTIN-INDR-YN
             TO  RJL0028-GROUP-WTIN-INDR-YN

170120*    담보고객식별자
           MOVE  WK-H-O-SCURTY-CUST-IDNFR
             TO  RJL0028-SCURTY-CUST-IDNFR

      *    담보보증고객식별자
           MOVE  WK-H-O-SCURTY-G-CUSZ-IDNFR
             TO  RJL0028-SCURTY-G-CUSZ-IDNFR


           #DYDBIO  INSERT-CMD-Y TKJL0028-PK TRJL0028-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INSERT-CNT2
               WHEN  OTHER
                     MOVE 'KJL0028'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *    INSERT / UPDATE 10건 단위 COMMIT 처리
           INITIALIZE                      WK-AREA1
           MOVE  'KJL0028'             TO  WK-TBL-ID
           MOVE  'INSERT'              TO  WK-FUNC-CD
           MOVE   WK-AC-INSERT-CNT2    TO  WK-REC-CNT

           PERFORM  S8000-COMMIT-PROCESS-RTN
              THRU  S8000-COMMIT-PROCESS-EXT

                               .
       S4300-KJL0028-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S4400-KJL0027-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0027_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-SQL-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0027'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4400-KJL0027-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   월말영업일　산출
      *-----------------------------------------------------------------
       S5000-XCJIIL09-CALL-RTN.

           INITIALIZE    XCJIIL09-CA

      *   그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  XCJIIL09-I-GROUP-CO-CD

      *   구분코드
           MOVE  CO-CHA-1
             TO  XCJIIL09-I-DSTCD

      *   년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  XCJIIL09-I-YMD

      *   감산월
           MOVE  CO-NUM-0
             TO  XCJIIL09-I-PLS-SBTR-MN

           #DYCALL  CJIIL09  YCCOMMON-CA  XCJIIL09-CA

           IF  XCJIIL09-R-STAT NOT = CO-STAT-OK
               #ERROR  XCJIIL09-R-ERRCD
                       XCJIIL09-R-TREAT-CD
                       XCJIIL09-R-STAT
               #OKEXIT CO-CHA-08
           END-IF
           #USRLOG '* XCJIIL09-O-ENMN-BZOPR-YMD = '
                      XCJIIL09-O-ENMN-BZOPR-YMD
           .
       S5000-XCJIIL09-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  INSERT / UPDATE 10건 단위 COMMIT 처리
      *-----------------------------------------------------------------
       S8000-COMMIT-PROCESS-RTN.

150213*    1000 건　마다 USRLOG
           IF  (FUNCTION MOD(WK-REC-CNT, 1000) = CO-NUM-0)  OR
               (WK-FUNC-CD                     = 'LAST'  )

               #USRLOG  '*' WK-TBL-ID '-' WK-FUNC-CD '-' WK-REC-CNT
           END-IF

      *    10 건　마다　 COMMIT
           IF  (FUNCTION MOD(WK-REC-CNT, 10) = CO-NUM-0)  OR
               (WK-FUNC-CD                     = 'LAST'  )

               EXEC SQL
                    COMMIT
               END-EXEC

      * Commit 처리결과 SQL-CODE를 확인하여 정상/오류 처리
               EVALUATE  SQLCODE
                   WHEN  CO-SQL-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE  WK-TBL-ID   TO  XZUGEROR-I-TBL-ID
                         MOVE  WK-FUNC-CD  TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF
                               .
       S8000-COMMIT-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE  IN-FILE

           IF  WK-IN-F-ST NOT = CO-STAT-OK
               MOVE 'IN-FILE CLOSE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-IN-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST
               #OKEXIT CO-CHA-08
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* FILE READ       COUNT  = ' WK-AC-READ-CNT
           #USRLOG '* KJL0027 INSERT  COUNT  = ' WK-AC-INSERT-CNT1
           #USRLOG '*--------------------------------------*'
           IF  WK-SYSIN-BASE-YMD = XCJIIL09-O-ENMN-BZOPR-YMD
           #USRLOG '* THKJL0027_CUR   COUNT  = ' WK-AC-FETCH-CNT
           #USRLOG '* KJL0028 INSERT  COUNT  = ' WK-AC-INSERT-CNT2
           END-IF
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD274 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
