      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD25F (BT합성선물자료추출)
      *@처리유형  : BATCH
      *@처리개요  : 합성선물자료추출한다.
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090319: 신규작성
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **  차주일계좌명세 : THKJL0025                     : R
      **  계정코드목록   : THKJL0018                     : R
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD25F.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/03/19.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT  OT-FILE             ASSIGN       TO  OTFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  OT-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC.
           COPY  TRJL0025.
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호
      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD101'.
           03  CO-TBL-ID               PIC  X(009) VALUE 'THKJLR003'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-999              PIC  X(003) VALUE '999'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-KRW              PIC  X(003) VALUE 'KRW'.
           03  CO-CHA-HAP              PIC  X(003) VALUE 'HAP'.

           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-OT-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WT-CNT            PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *---금액계산용임시변수(익스포져금액계산용- BS용)
      *   금액계산용임시변수(익스포져금액계산용)
           03  WK-IMSI-BS-BAL          PIC S9(015)V9(3) COMP-3.
           03  WK-TMP-AMT              PIC S9(015)V9(3) COMP-3.
      *---처리구분(1:통화별환산2:외환매매익　역환산)
           03  WK-GBCD                 PIC  X(001).
      *   잔존만기일수
           03  WK-EXP-DAYS             PIC  9(005).
      *   중복일련번호
           03  WK-SEQ                  PIC  9(007) COMP.

           03  WK-TMP1                 PIC  9(015).
           03  WK-TMP2                 PIC  9(015).
           03  WK-TMP3                 PIC  9(015).
           03  WK-TMP4                 PIC  9(015).
           03  WK-TMP5                 PIC  9(015).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *    양일자간의 차이을 년수/월수/일수 산출PARAMETER
       01  XCJIIL01-CA.
           COPY    XCJIIL01.
       01  XBJLCUST-CA.
           COPY    XBJLCUST.
      *    통화별　환산율　적용PARAMETER
       01  XBJLTGEX-CA.
           COPY    XBJLTGEX.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 WK-H-I-BASE-YMD               PIC  X(00008).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).
      *       기준일
           03 WK-H-I-BASE-DD                PIC  X(00002).

       01  WK-HOST-OUT.
      *       외화상품유형구분
           03 WK-H-O-FC-PRDCT-PTRN-DSTCD    PIC  X(00003).
      *       외화거래번호
           03 WK-H-O-FC-TRAN-NO             PIC  X(00010).
      *       상품대분류코드
           03 WK-H-O-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 WK-H-O-PRDCT-NO               PIC  X(00005).
      *       신규년월일
           03 WK-H-O-NEW-YMD                PIC  X(00008).
      *       만기년월일
           03 WK-H-O-EXPIR-YMD              PIC  X(00008).
      *       현지통화코드
           03 WK-H-O-LCAL-CNCYCD            PIC  X(00003).
      *       현지통화대출금액
           03 WK-H-O-LCAL-C-LNAMT-AMT       PIC S9(00015)V9(3) COMP-3.
      *       외환매매익금액
           03 WK-H-O-FX-PFT-AMT             PIC S9(00015) COMP-3.
      *       CMBS과목중분류구분
           03 WK-H-O-CMBS-SM-CLSFI-DSTCD    PIC  X(00002).
      *       발행법인등록번호
           03 WK-H-O-ISSU-CPRNO             PIC  X(00013).
      *       관리부점코드
           03 WK-H-O-MGT-BRNCD              PIC  X(00004).
      *       매입매도구분
           03 WK-H-O-BUY-SELLZ-DSTCD        PIC  X(00001).
       EXEC  SQL  END    DECLARE       SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKJLR003_CUR     CURSOR FOR
             SELECT  A.외화상품유형구분
                  ,  A.외화거래번호
                  ,  B.상품대분류코드
                  ,  B.상품중분류코드
                  ,  B.상품템플릿코드
                  ,  B.상품번호
                  ,  A.신규년월일
                  ,  A.만기년월일
                  ,  A.현지통화코드
                  ,  A.현지통화대출금액
                  ,  A.외환매매익금액
                  ,  A."CMBS과목중분류구분"
                  ,  A.발행법인등록번호
                  ,  A.관리부점코드
                  ,  A.매입매도구분
               FROM  DB2DBA.THKJLR003  A
                  ,  DB2DBA.THKJL0018  B
              WHERE  A.그룹회사코드      = :WK-H-I-GROUP-CO-CD
                AND  A.기준년월일        = :WK-H-I-BASE-YMD
                AND  A."CMBS과목중분류구분" = '01'
                AND  A."CMBS세분류구분"     = '13'
                AND  A.상계처리등록여부 <> '1'
                AND  B.기준년월          = :WK-H-I-BASE-YM
                AND  A.그룹회사코드      =  B.그룹회사코드
                AND  A.통합계정과목코드  =  B.통합계정과목코드
           END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@WK-AREA PARAMETER 초기화
           INITIALIZE    WK-AREA
                         WK-SYSIN

      * JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD25F PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *    공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   CO-EBM01001 CO-UBM01001 CO-STAT-ERROR
               #OKEXIT  CO-CHA-09
           END-IF

           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

           OPEN OUTPUT OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE OPEN ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-16
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *   자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD

      *    기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *    기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

           PERFORM  S3100-TKJLR003-OPEN-RTN
              THRU  S3100-TKJLR003-OPEN-EXT

           PERFORM  S3200-TKJLR003-FETCH-RTN
              THRU  S3200-TKJLR003-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

                    PERFORM  S3300-DATA-MOVE-RTN
                       THRU  S3300-DATA-MOVE-EXT

                    PERFORM  S3400-DATA-WRITE-RTN
                       THRU  S3400-DATA-WRITE-EXT

                    PERFORM  S3200-TKJLR003-FETCH-RTN
                       THRU  S3200-TKJLR003-FETCH-EXT
           END-PERFORM

           PERFORM  S3400-TKJLR003-CLOSE-RTN
              THRU  S3400-TKJLR003-CLOSE-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-TKJLR003-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJLR003_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJLR003'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-TKJLR003-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-TKJLR003-FETCH-RTN.

           EXEC SQL
              FETCH  THKJLR003_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0025'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *   종료년월일
      *    #USRLOG '<< WK-H-O-EXPIR-YMD  >> ' WK-H-O-EXPIR-YMD
           .
       S3200-TKJLR003-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA MOVE
      *-----------------------------------------------------------------
       S3300-DATA-MOVE-RTN.

           INITIALIZE    OT-REC

      *          그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0025-GROUP-CO-CD

      *          계좌번호
           MOVE  WK-H-O-FC-PRDCT-PTRN-DSTCD
             TO  RJL0025-ACNO(1:3)
           MOVE  WK-H-O-FC-TRAN-NO
             TO  RJL0025-ACNO(4:13)

      *          기준일
           MOVE  WK-H-I-BASE-DD
             TO  RJL0025-BASE-DD

      *          기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0025-BASE-YM

      *          계좌중복일련번호
           ADD   CO-NUM-1              TO  WK-SEQ
           MOVE  WK-SEQ
             TO  RJL0025-ACN-DUP-SERNO

      *          고객식별자
           MOVE  WK-H-O-ISSU-CPRNO(1:10)
             TO  RJL0025-CUST-IDNFR

      *          고객관리번호
           MOVE  WK-H-O-ISSU-CPRNO(11:3)
             TO  RJL0025-CUST-MGT-NO

      *채무고객정보　추출　 SUB CALL
           PERFORM  S6000-SELECT-GOGAKEX-RTN
              THRU  S6000-SELECT-GOGAKEX-EXT
      *-----------------------------------------------------------
      * SUBPGM에서　차주번호／계좌적용구분／해외현지법인여부　추출
      *    차주번호
      *    MOVE  WK-H-O-ISSU-CPRNO
      *      TO  RJL0025-BRWR-NO
      *    계좌적용구분
      *    MOVE  SPACE
      *      TO  RJL0025-ACN-APLY-DSTCD
      *    해외현지법인여부
      *    MOVE  SPACE
      *      TO  RJL0025-OVSES-LCAL-COPR-YN
      *-----------------------------------------------------------

      *---관리부점코드
           MOVE  WK-H-O-MGT-BRNCD
             TO  RJL0025-MGT-BRNCD

      *---한도계좌여부
           MOVE  CO-CHA-0
             TO  RJL0025-LIMT-ACN-YN

      *    상품대분류코드
           MOVE  WK-H-O-PRDCT-LAG-CLSFI-CD
             TO  RJL0025-PRDCT-LAG-CLSFI-CD

      *    상품중분류코드
           MOVE  WK-H-O-PRDCT-MEDM-CLSFI-CD
             TO  RJL0025-PRDCT-MEDM-CLSFI-CD

      *    상품템플릿코드
           MOVE  WK-H-O-PRDCT-TMPLT-CD
             TO  RJL0025-PRDCT-TMPLT-CD

      *    상품번호
           MOVE  WK-H-O-PRDCT-NO
             TO  RJL0025-PRDCT-NO

      *    대출자격구분
           MOVE  SPACE
             TO  RJL0025-LN-QULFI-DSTCD

      *    시작년월일
           MOVE  WK-H-O-NEW-YMD
             TO  RJL0025-START-YMD

      *    만기년월일
           MOVE  WK-H-O-EXPIR-YMD
             TO  RJL0025-EXPIR-YMD

      *    종료년월일
           MOVE  SPACE
             TO  RJL0025-END-YMD

      *    상품계약상태구분
           MOVE  CO-CHA-3
             TO  RJL0025-PRDCT-C-STUS-DSTCD

      *------- 외화파생상품 CURRENT EXPOSURE 환산율　계산-----------
      *- 환산율적용해서　통화한도금액　산출한다．
      *- 외환매매익금액은　원화환산금액으로　들어있음．　
      *-----------------------------------------------------------------
      * WK-TMP-AMT --임시변수(외환매매익　역환산용　임시변수)
      *- 외환매매익금액이　외화통화이면　역환산율적용
      *- 외환매매익금액이　０보다　작으면　무조건　０으로적용
            MOVE WK-H-O-FX-PFT-AMT  TO WK-TMP1
      *    #USRLOG '<<WK-H-O-FX-PFT-AMT >>'  WK-TMP1
      *    #USRLOG '<<WK-H-O-LCAL-CNCYCD >>' WK-H-O-LCAL-CNCYCD

           IF WK-H-O-FX-PFT-AMT > 0    AND
              WK-H-O-LCAL-CNCYCD       NOT = CO-CHA-KRW

      *       외환매매익금액　해당통화　역환산
              INITIALIZE      WK-GBCD
                              WK-TMP-AMT

      *       --외환매매익　역환산할　금액
              MOVE  CO-CHA-2           TO  WK-GBCD
              MOVE  WK-H-O-FX-PFT-AMT  TO  WK-TMP-AMT

      *       #USRLOG '<< WK-GBCD >>' WK-GBCD
              MOVE WK-TMP-AMT          TO  WK-TMP1
      *       #USRLOG '<< WK-TMP-AMT >>' WK-TMP1

              PERFORM  S8000-BJLTGEX-CALL-RTN
                 THRU  S8000-BJLTGEX-CALL-EXT

      *       외환매매익　역환산　금액
              MOVE  RJL0025-BS-BASE-BAL
                TO  WK-H-O-FX-PFT-AMT
              MOVE  WK-H-O-FX-PFT-AMT
                TO  WK-TMP1
      *       #USRLOG '<<WK-H-O-FX-PFT-AMT >>' WK-TMP1
              MOVE  RJL0025-BS-BASE-BAL
                TO  WK-TMP1
      *       #USRLOG '<RJL0025-BS-BASE-BAL >>' WK-TMP1

           ELSE
              IF  WK-H-O-FX-PFT-AMT < 0
                  MOVE  ZERO           TO  WK-H-O-FX-PFT-AMT
              END-IF
           END-IF

      *-----------------------------------------------------------------
      *    -잔존만기일　추출
           PERFORM  S7000-CJIIL01-CALL-RTN
              THRU  S7000-CJIIL01-CALL-EXT
      *-----------------------------------------------------------------
      * WK-TMP-AMT --임시변수（CURRENT EXPOSURE환산용　임시변수)
           INITIALIZE                  WK-TMP-AMT
           MOVE  WK-H-O-LCAL-C-LNAMT-AMT
             TO  WK-TMP-AMT

           EVALUATE  TRUE
      *        -통화인　경우
               WHEN  WK-EXP-DAYS < 365
                          COMPUTE  WK-H-O-LCAL-C-LNAMT-AMT
                                =  WK-TMP-AMT * 0.01
                                +  WK-H-O-FX-PFT-AMT
               WHEN  (WK-EXP-DAYS >= 365   AND
                      WK-EXP-DAYS < 1825)
                          COMPUTE  WK-H-O-LCAL-C-LNAMT-AMT
                                =  WK-TMP-AMT * 0.05
                                +  WK-H-O-FX-PFT-AMT
               WHEN  WK-EXP-DAYS >= 1825
                          COMPUTE  WK-H-O-LCAL-C-LNAMT-AMT
                                =  WK-TMP-AMT * 0.75
                                +  WK-H-O-FX-PFT-AMT
               WHEN OTHER
                    CONTINUE
           END-EVALUATE
      *---------------------------------------------------------------
      *    통화코드
           MOVE  WK-H-O-LCAL-CNCYCD
             TO  RJL0025-CNCYCD

      *    통화한도
           MOVE  WK-H-O-LCAL-C-LNAMT-AMT
             TO  RJL0025-CRNCY-CLAM

      *    통화잔액
           MOVE  WK-H-O-LCAL-C-LNAMT-AMT
             TO  RJL0025-CRNCY-BAL

      *BS금액추출-합성선물환（해더）
           PERFORM  S3310-BS-AMT-RTN
              THRU  S3310-BS-AMT-EXT

      *-------------------------------------------------------------
      *- 원장의　현지통화대출금액을　그대로　사용하고,
      *- 그외는　환산율적용해서　통화한도금액　산출한다．
      *-------------------------------------------------------------
           IF  WK-H-O-LCAL-CNCYCD = CO-CHA-KRW

      *         명목액기준한도
                MOVE  WK-H-O-LCAL-C-LNAMT-AMT
                  TO  RJL0025-TTL-AMT-BASE-CLAM

      *         명목액기준잔액
                MOVE  WK-H-O-LCAL-C-LNAMT-AMT
                  TO  RJL0025-TTL-AMT-BASE-BAL

      *         BS기준잔액
                MOVE  WK-IMSI-BS-BAL
                  TO  RJL0025-BS-BASE-BAL
           ELSE
      *       통화별　원화환산금액CALCURATER
               INITIALIZE              WK-GBCD

               MOVE   CO-CHA-1         TO  WK-GBCD

               PERFORM  S8000-BJLTGEX-CALL-RTN
                  THRU  S8000-BJLTGEX-CALL-EXT

           END-IF

      *    TE한도환산금액
           MOVE  ZERO
             TO  RJL0025-TE-LIMT-AUC

      *    TE잔액환산금액
           MOVE  ZERO
             TO  RJL0025-TE-BAL-AUC

      *    CP한도환산금액
           MOVE  ZERO
             TO  RJL0025-INLS-GRCR-LIMT-AUC

      *    CP잔액환산금액
           MOVE  ZERO
             TO  RJL0025-INLS-GRCR-BAL-AUC

      *    CA담보제외금액
           MOVE  ZERO
             TO  RJL0025-CA-SCURTY-ECLUD-AMT

      *    CA담보환산금액
           MOVE  ZERO
             TO  RJL0025-CA-SCURTY-AUC

      *    관련테이블명
           MOVE  CO-TBL-ID
             TO  RJL0025-RELATD-TBL-NAME

      *    과목코드
           MOVE  CO-CHA-HAP
             TO  RJL0025-SBJCT-CD

      *    시스템최종처리일시
           MOVE  BICOM-TRAN-BASE-YMS
             TO  RJL0025-SYS-LAST-PRCSS-YMS

      *    시스템최종사용자번호
           MOVE  BICOM-USER-EMPID
             TO  RJL0025-SYS-LAST-UNO
           .
       S3300-DATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   합성선물환－해더（BS금액추출）
      *-----------------------------------------------------------------
       S3310-BS-AMT-RTN.

           INITIALIZE    WK-IMSI-BS-BAL

      *    #USRLOG ' <<  1>> ' WK-H-I-GROUP-CO-CD
      *    #USRLOG ' <<  2>> ' WK-H-I-BASE-YMD
      *    #USRLOG ' <<  3>> ' WK-H-O-FC-PRDCT-PTRN-DSTCD
      *    #USRLOG ' <<  4>> ' WK-H-O-FC-TRAN-NO

           EXEC SQL
             SELECT  VALUE(현지통화대출금액,0)
               INTO  :WK-IMSI-BS-BAL
               FROM  DB2DBA.THKJLR003
              WHERE  그룹회사코드       = :WK-H-I-GROUP-CO-CD
                AND  기준년월일         = :WK-H-I-BASE-YMD
                AND  외화상품유형구분   = :WK-H-O-FC-PRDCT-PTRN-DSTCD
                AND  외화거래번호       = :WK-H-O-FC-TRAN-NO
      *         AND  상품대분류코드     = :WK-H-O-PRDCT-LAG-CLSFI-CD
      *         AND  상품중분류코드     = :WK-H-O-PRDCT-MEDM-CLSFI-CD
      *         AND  상품템플릿코드     = :WK-H-O-PRDCT-TMPLT-CD
      *         AND  상품번호           = :WK-H-O-PRDCT-NO
      *         AND  통합계정과목코드   =
      *               SUBSTR(:WK-H-O-INTGRA-TIACC-CD,1,5) || '000'
-->   * '000'SOLAND  통합계정과목코드  = '000'해결
                AND  "CMBS과목중분류구분" = '01'
                AND  "CMBS세분류구분"     = '12'
                AND  상계처리등록여부    <> '1'
           END-EXEC.

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  CO-NOT-FOUND
                     MOVE  ZERO
                       TO  WK-IMSI-BS-BAL
               WHEN  OTHER
                     MOVE 'KJLR003'
                       TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'
                       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE
                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'BS금액　추출시　오류가 발생했습니다'
                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3310-BS-AMT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA WRITE
      *-----------------------------------------------------------------
       S3400-DATA-WRITE-RTN.

           WRITE OT-REC

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE WRITE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-16
           END-IF

           ADD   CO-NUM-1              TO  WK-AC-WT-CNT
           .
       S3400-DATA-WRITE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-TKJLR003-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJLR003_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0025'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CURSOR CLOSE'
                       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                       TO  XZUGEROR-I-MSG
      *에러메시지:종료 처리(Commit, Close 등)
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-TKJLR003-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   채무고객정보추출
      *-----------------------------------------------------------------
       S6000-SELECT-GOGAKEX-RTN.
----->*아래 항목정의 필요
      *입력항목:여신종류구분,계좌관리부실점,고객고유번호
      *출력항목:고객고유번호，모기업법인등록번호，계좌적용구분
      *           해외현지법인여부

           INITIALIZE    XBJLCUST-CA

      *--       그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  XBJLCUST-I-GROUP-CO-CD

      *--       여신종류구분　
           MOVE  '2'
             TO  XBJLCUST-I-YSGB

      *--       관리부실점코드
           MOVE  WK-H-O-MGT-BRNCD
             TO  XBJLCUST-I-BRCD

      *--       주민번호및법인등록번호
           MOVE  WK-H-O-ISSU-CPRNO
             TO  XBJLCUST-I-BRWR-NO

      *주민번호및법인등록번호가없으면＇기타＇로　적용
           IF  WK-H-O-ISSU-CPRNO = SPACES
           THEN
      *        계좌적용구분
               MOVE  '9'
                 TO  RJL0025-ACN-APLY-DSTCD

      *        해외현지법인여부
               MOVE  '0'
                 TO  RJL0025-OVSES-LCAL-COPR-YN

           ELSE

               #DYCALL  BJLCUST YCCOMMON-CA XBJLCUST-CA

               IF  NOT COND-XBJLCUST-OK
                   #ERROR  XBJLCUST-R-ERRCD
                           XBJLCUST-R-TREAT-CD
                           XBJLCUST-R-STAT
                   #OKEXIT CO-CHA-08
               END-IF

      *        차주번호
               MOVE  XBJLCUST-O-MAMA-CORPNO
                 TO  RJL0025-BRWR-NO

      *        계좌적용구분
               MOVE  XBJLCUST-O-GJGB
                 TO  RJL0025-ACN-APLY-DSTCD

      *        해외현지법인여부
               MOVE  XBJLCUST-O-HWGB
                 TO  RJL0025-OVSES-LCAL-COPR-YN
           END-IF
           .
       S6000-SELECT-GOGAKEX-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@ 양일자간의일수（잔존만기일）추출
      *-----------------------------------------------------------------
       S7000-CJIIL01-CALL-RTN.

           INITIALIZE    WK-EXP-DAYS
                         XCJIIL01-CA

      * 처리조건 데이터 MOVE
      *   그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  XCJIIL01-I-GROUP-CO-CD

      *   구분:일수/월수/윤년일수 산출
           MOVE  CO-CHA-1
             TO  XCJIIL01-I-DSTCD

      *   시작년월일
           MOVE  WK-H-I-BASE-YMD
             TO  XCJIIL01-I-START-YMD

      *   종료년월일
           MOVE  WK-H-O-EXPIR-YMD
             TO  XCJIIL01-I-END-YMD

      *    #USRLOG '<< XCJIIL01-I-START-YMD  >> ' XCJIIL01-I-START-YMD
      *    #USRLOG '<< XCJIIL01-I-END-YMD    >> ' XCJIIL01-I-END-YMD

      *   공통 UTILITY CALL
           #DYCALL  CJIIL01 YCCOMMON-CA XCJIIL01-CA.

      *    RETURN 정보 확인
           IF  XCJIIL01-R-STAT = CO-STAT-OK
      *        -잔존만기일수
               MOVE  XCJIIL01-O-NODAY  TO  WK-EXP-DAYS
           ELSE
               MOVE 'CJIIL01프로그램　호출　에러　발생: '
                 TO  XZUGEROR-I-MSG
               MOVE  XCJIIL01-R-ERRCD  TO  XZUGEROR-I-MSG(40:8)
      *에러메시지
               #ERROR  XCJIIL01-R-ERRCD
                       XCJIIL01-R-TREAT-CD
                       XCJIIL01-R-STAT

               #OKEXIT CO-CHA-08
           END-IF
           .
       S7000-CJIIL01-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@통화별　환산　및　외환매매익금액　통화별　역환산
      *-----------------------------------------------------------------
       S8000-BJLTGEX-CALL-RTN.

           INITIALIZE    XBJLTGEX-CA

      *@1.1.1 입력파라미터 조립
      *  처리구분(1:통화별환산2:외환매매익역환산)
           MOVE  WK-GBCD               TO  XBJLTGEX-I-GBCD
      *  기준년월일
           MOVE  WK-H-I-BASE-YMD       TO  XBJLTGEX-I-BASE-YMD

      *  통화코드
           MOVE  WK-H-O-LCAL-CNCYCD    TO  XBJLTGEX-I-CNCYCD

      *  명목액기준한도
           MOVE  WK-H-O-LCAL-C-LNAMT-AMT
             TO  XBJLTGEX-I-CRNCY-CLAM

      *  명목액기준잔액
           MOVE  WK-H-O-LCAL-C-LNAMT-AMT
             TO  XBJLTGEX-I-CRNCY-BAL

      *   BS기준잔액
           MOVE  WK-IMSI-BS-BAL        TO  XBJLTGEX-I-BS-BAL

      *@1.1.2 프로그램 호출
           #DYCALL  BJLTGEX YCCOMMON-CA XBJLTGEX-CA

      *    #USRLOG '<<  XBJLTGEX-R-ERRCD     >>' XBJLTGEX-R-ERRCD
      *    #USRLOG '<<  XBJLTGEX-R-TREAT-CD  >>' XBJLTGEX-R-TREAT-CD
      *    #USRLOG '<<  XBJLTGEX-R-STAT      >>' XBJLTGEX-R-STAT

      *@1.1.3 호출결과 확인
           IF  XBJLTGEX-R-STAT NOT = CO-STAT-OK
               MOVE 'BJLTGEX 프로그램　호출　에러　발생: '
                 TO  XZUGEROR-I-MSG
               MOVE  XBJLTGEX-R-ERRCD  TO XZUGEROR-I-MSG(40:8)
      *에러메시지
               #ERROR  XBJLTGEX-R-ERRCD
                       XBJLTGEX-R-TREAT-CD
                       XBJLTGEX-R-STAT
               #OKEXIT CO-CHA-08
           END-IF

      *@1.1.4 호출결과MOVE
      *    명목액기준한도
           MOVE  XBJLTGEX-O-TTL-AMT-BASE-CLAM
             TO  RJL0025-TTL-AMT-BASE-CLAM

      *    명목액기준잔액
           MOVE  XBJLTGEX-O-TTL-AMT-BASE-BAL
             TO  RJL0025-TTL-AMT-BASE-BAL

      *    BS기준잔액
           MOVE  XBJLTGEX-O-BS-BAL
             TO  RJL0025-BS-BASE-BAL
           .
       S8000-BJLTGEX-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE     OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE CLOSE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-16
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJLR003_CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD25F PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
