      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLD114 (BT 개별기업/그룹 TE현황조회)
      *@처리유형  : BATCH
      *@처리개요  :개별기업TE 및 그룹TE 조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *박정수:20230811: 신규작성
      *=================================================================
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLD114.
       AUTHOR.                        박정수.
       DATE-WRITTEN.                   23/08/11.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT  OT-FILE             ASSIGN       TO  OTFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  OT-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC.
      *       차주번호
           03 OT-BRWR-NO               PIC  X(00013).
           03 OT-FILLER1               PIC  X(00001).

      *       차주고객식별자
           03 OT-BRWR-CUST-IDNFR       PIC  X(00010).
           03 OT-FILLER2               PIC  X(00001).

      *       차주고객명
           03 OT-BRWR-CUSTNM           PIC  X(00052).
           03 OT-FILLER3               PIC  X(00001).

230823*       모기업법인번호
           03 OT-MAMA-BRWR-NO          PIC  X(00013).
           03 OT-FILLER4               PIC  X(00001).

      *       모기업고객식별자
           03 OT-MAMA-C-CUST-IDNFR     PIC  X(00010).
           03 OT-FILLER5               PIC  X(00001).

      *       모기업고객명
           03 OT-MAMA-CRCS-NAME        PIC  X(00052).
           03 OT-FILLER6               PIC  X(00001).

      *       자회사대주주구분
           03 OT-SBCO-L-SKHDR-DSTCD    PIC  X(00001).
           03 OT-FILLER7               PIC  X(00001).

      *       등록년월일
           03 OT-REGI-YMD              PIC  X(00008).
           03 OT-FILLER8               PIC  X(00001).

      *       해제년월일
           03 OT-REVOC-YMD             PIC  X(00008).
           03 OT-FILLER9               PIC  X(00001).

      *       예비
           03 OT-FILLER10              PIC  X(00100).

      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLD114'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-1                PIC  9(001) VALUE  1.
           03  CO-NUM-999              PIC  9(003) VALUE  999.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-OT-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-SKIP-CNT          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WT-CNT            PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *    차주번호
           03  WK-BRWR-NO              PIC  X(00013).
      *    차주고객명
           03  WK-BRWR-CUSTNM          PIC  X(00052).
      *    모기업차주번호
           03  WK-MAMA-BRWR-NO         PIC  X(00013).
      *    모기업고객명
           03  WK-MAMA-CRCS-NAME       PIC  X(00052).

      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업직원번호
           03  WK-JOB-EMPID            PIC  X(007).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------

      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *    IC고객번호검색
       01  XIAA0019-CA.
           COPY  XIAA0019.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 WK-H-I-BASE-YMD               PIC  X(00008).

       01  WK-HOST-OUT.
      *       차주고객식별자
           03 WK-H-O-BRWR-CUST-IDNFR        PIC  X(00010).
      *       모기업고객식별자
           03 WK-H-O-MAMA-C-CUST-IDNFR      PIC  X(00010).
      *       자회사대주주구분
           03 WK-H-O-SBCO-L-SKHDR-DSTCD     PIC  X(00001).
      *       등록년월일
           03 WK-H-O-REGI-YMD               PIC  X(00008).
      *       해제년월일
           03 WK-H-O-REVOC-YMD              PIC  X(00008).

       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
      *@
           EXEC SQL
            DECLARE  THKJL0042_CUR     CURSOR FOR
            SELECT A.고객식별자           AS 차주고객식별자
                  ,B.모기업법인고객식별자 AS 모기업고객식별자
                  ,A.자회사대주주구분
                  ,A.등록년월일
                  ,A.해제년월일
              FROM DB2DBA.THKJL0042 A
                  ,DB2DBA.THKJL0015 B
             WHERE A.그룹회사코드 = B.그룹회사코드
               AND A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
               AND A.고객식별자   = B.고객식별자
               AND A.기준년월     = SUBSTR(:WK-H-I-BASE-YMD,1,6)
           WITH UR
           END-EXEC.

      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@1 초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@1 입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@1  SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@1 업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@1 처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@    초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 WK-AREA PARAMETER 초기화
           INITIALIZE    WK-SYSIN

      *@1 JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD114 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *    그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *    구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *@1 프로그램호출:공통영역기준일자 SET
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *    RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *        정상처리
               CONTINUE
           ELSE
      *        에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
      *@1  OUTFILE OPEN
           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

      *    OUTFILE을   OPEN함
           OPEN OUTPUT OT-FILE

      *   리턴코드가 정상이 아니면 에러처리
           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE OPEN ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@1  그룹회사구분코드 미입력시 오류 처리
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1  작업실행일 미입력시 오류 처리
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1   작업명 미입력시 오류 처리
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1  처리회차 미입력시 오류 처리
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1   배치작업구분 미입력시 오류 처리
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1  작업자ID 미입력시 오류 처리
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1   자료기준년월일 미입력시 오류 처리
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1    작업직원번호 미입력시 오류 처리
           IF  WK-JOB-EMPID = SPACE
               MOVE '작업직원번호 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *    그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *    기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@1 SQL CURSOR OPEN
            PERFORM  S3100-KJL0042-OPEN-RTN
               THRU  S3100-KJL0042-OPEN-EXT

      *@1 SQL CURSOR FETCH
           PERFORM  S3200-KJL0042-FETCH-RTN
              THRU  S3200-KJL0042-FETCH-EXT

      *@1  END OF FILE일때까지 처리
           PERFORM  UNTIL  EOF-Y
      *@2           차주고객정보 조회
                    PERFORM  S3500-IAA0019-SELECT-RTN
                       THRU  S3500-IAA0019-SELECT-EXT

      *@2           모기업법인고객정보 조회
                    PERFORM  S3510-IAA0019-SELECT-RTN
                       THRU  S3510-IAA0019-SELECT-EXT

      *@2           OUTFILE DATA MOVE
                    PERFORM  S3600-DATA-MOVE-RTN
                       THRU  S3600-DATA-MOVE-EXT

      *@2           OUTFILE DATA WRITE
                    PERFORM  S3700-DATA-WRITE-RTN
                       THRU  S3700-DATA-WRITE-EXT

      *@1 SQL CURSOR FETCH
                    PERFORM  S3200-KJL0042-FETCH-RTN
                       THRU  S3200-KJL0042-FETCH-EXT

           END-PERFORM

      *@1 SQL CURSOR CLOSE
           PERFORM  S3800-KJL0042-CLOSE-RTN
              THRU  S3800-KJL0042-CLOSE-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0042-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKJL0042_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0042'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0042-OPEN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0042-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT

           EXEC SQL
              FETCH  THKJL0042_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0042'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
      *에러메시지:내부 본 처리
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0042-FETCH-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   차주고객정보 조회
      *-----------------------------------------------------------------
       S3500-IAA0019-SELECT-RTN.

            INITIALIZE       XIAA0019-CA

      *    고객식별자 조회
      *    영역구분'B':은행, 'C':CARD
           MOVE  'B'
             TO  XIAA0019-I-SCOP-DSTIC
      *    차주고객식별자
           MOVE  WK-H-O-BRWR-CUST-IDNFR
             TO  XIAA0019-I-CUST-IDNFR

      *@1  고객정보번호를　조회한다
           #DYCALL  IAA0019
                    YCCOMMON-CA
                    XIAA0019-CA

      *@1  호출결과 확인
           EVALUATE TRUE
               WHEN COND-XIAA0019-OK
      *             차주번호
                    MOVE  XIAA0019-O-CUNIQNO
                      TO  WK-BRWR-NO
      *             차주고객명
                    MOVE  XIAA0019-O-CUSTNM1
                      TO  WK-BRWR-CUSTNM
               WHEN OTHER
                    DISPLAY 'S3500 IAA0019 CALL ERROR  = '
                             WK-H-O-BRWR-CUST-IDNFR
           END-EVALUATE
           .
       S3500-IAA0019-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   모기업법인고객정보 조회
      *-----------------------------------------------------------------
       S3510-IAA0019-SELECT-RTN.

            INITIALIZE       XIAA0019-CA

      *    고객식별자 조회
      *    영역구분'B':은행, 'C':CARD
           MOVE  'B'
             TO  XIAA0019-I-SCOP-DSTIC
      *    모기업법인고객식별자
           MOVE  WK-H-O-MAMA-C-CUST-IDNFR
             TO  XIAA0019-I-CUST-IDNFR

      *@1  고객정보번호를　조회한다
           #DYCALL  IAA0019
                    YCCOMMON-CA
                    XIAA0019-CA

      *@1  호출결과 확인
           EVALUATE TRUE
               WHEN COND-XIAA0019-OK
      *             모기업법인번호
                    MOVE  XIAA0019-O-CUNIQNO
                      TO  WK-MAMA-BRWR-NO
      *             모기업고객명
                    MOVE  XIAA0019-O-CUSTNM1
                      TO  WK-MAMA-CRCS-NAME
               WHEN OTHER
                    DISPLAY 'S3510 IAA0019 CALL ERROR  = '
                             WK-H-O-MAMA-C-CUST-IDNFR
           END-EVALUATE
           .
       S3510-IAA0019-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA MOVE
      *-----------------------------------------------------------------
       S3600-DATA-MOVE-RTN.

           INITIALIZE                       OT-REC

      *   차주번호
           MOVE WK-BRWR-NO                  TO OT-BRWR-NO

      *   차주고객식별자
           MOVE WK-H-O-BRWR-CUST-IDNFR      TO OT-BRWR-CUST-IDNFR

      *   차주고객명
           MOVE WK-BRWR-CUSTNM              TO OT-BRWR-CUSTNM

      *   모기업법인번호
           MOVE WK-MAMA-BRWR-NO             TO OT-MAMA-BRWR-NO

      *   모기업고객식별자
           MOVE WK-H-O-MAMA-C-CUST-IDNFR    TO OT-MAMA-C-CUST-IDNFR

      *   모기업고객명
           MOVE WK-MAMA-CRCS-NAME           TO OT-MAMA-CRCS-NAME

      *   자회사대주주구분
           MOVE WK-H-O-SBCO-L-SKHDR-DSTCD   TO OT-SBCO-L-SKHDR-DSTCD

      *   등록년월일
           MOVE WK-H-O-REGI-YMD             TO OT-REGI-YMD

      *   해제년월일
           MOVE WK-H-O-REVOC-YMD            TO OT-REVOC-YMD


           MOVE '$'   TO  OT-FILLER1
                          OT-FILLER2
                          OT-FILLER3
                          OT-FILLER4
                          OT-FILLER5
                          OT-FILLER6
                          OT-FILLER7
                          OT-FILLER8
                          OT-FILLER9

               .
       S3600-DATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA WRITE
      *-----------------------------------------------------------------
       S3700-DATA-WRITE-RTN.

           WRITE OT-REC

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE WRITE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           ADD   CO-NUM-1              TO  WK-AC-WT-CNT
           .
       S3700-DATA-WRITE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3800-KJL0042-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKJL0042_CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0042'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3800-KJL0042-CLOSE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE     OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE CLOSE ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF


           #USRLOG '*--------------------------------------*'
           #USRLOG '* BASE YMD               = ' WK-SYSIN-BASE-YMD
           #USRLOG '* THKJL0042_CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLD114 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
