      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLG001 (지주사정보제공 암호화)
      *@처리유형  : BATCH
      *@처리개요  :
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *@YBH    :20141128: 신규작성
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM          : 테이블명              : 접근유형
      **  ----------------------   -------------------------------------
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLG001.
       AUTHOR.                         YBH.
       DATE-WRITTEN.                   14/11/28.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *    TE차주익스포져중간일집계(THKJL0127)
           SELECT IN-FILE01            ASSIGN       TO  INFILE01
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST01.

           SELECT OT-FILE01            ASSIGN       TO  OTFILE01
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST01.

      *    TE차주익스포져중간월집계(THKJL0128)
           SELECT IN-FILE02            ASSIGN       TO  INFILE02
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST02.

           SELECT OT-FILE02            ASSIGN       TO  OTFILE02
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST02.

      *    TE차주일집계(THKJL0129)
           SELECT IN-FILE03            ASSIGN       TO  INFILE03
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST03.

           SELECT OT-FILE03            ASSIGN       TO  OTFILE03
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST03.

      *    TE차주월집계(THKJL0130)
           SELECT IN-FILE04            ASSIGN       TO  INFILE04
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST04.

           SELECT OT-FILE04            ASSIGN       TO  OTFILE04
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST04.

      *    TE간접익스포져일집계(THKJL0031)
           SELECT IN-FILE05            ASSIGN       TO  INFILE05
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST05.

           SELECT OT-FILE05            ASSIGN       TO  OTFILE05
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST05.

      *    TE간접익스포져월집계(THKJL0032)
           SELECT IN-FILE06            ASSIGN       TO  INFILE06
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST06.

           SELECT OT-FILE06            ASSIGN       TO  OTFILE06
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST06.

      *    TE차주관리한도(THKJL0011)
           SELECT IN-FILE07            ASSIGN       TO  INFILE07
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST07.

           SELECT OT-FILE07            ASSIGN       TO  OTFILE07
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST07.

      *    TE국별일집계(THKJL0055)
           SELECT IN-FILE15            ASSIGN       TO  INFILE15
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST15.

           SELECT OT-FILE15            ASSIGN       TO  OTFILE15
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST15.

      *    TE국별월집계(THKJL0055)
           SELECT IN-FILE16            ASSIGN       TO  INFILE16
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST16.

           SELECT OT-FILE16            ASSIGN       TO  OTFILE16
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST16.

      *   채무자고객기본(THKJL0015)
           SELECT IN-FILE18            ASSIGN       TO  INFILE18
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST18.

           SELECT OT-FILE18            ASSIGN       TO  OTFILE18
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST18.

      *   계열사기본(THKJL0014)
           SELECT IN-FILE19            ASSIGN       TO  INFILE19
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-IN-F-ST19.

           SELECT OT-FILE19            ASSIGN       TO  OTFILE19
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST19.

      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  IN-FILE01 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE차주익스포져중간일집계(THKJL0127) - 267 BYTE
       01  IN-REC01.
      *       비암호화항목1
           03 IN01-FILLER-O1                PIC  X(0013).
      *       차주번호
           03 IN01-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN01-FILLER-02                PIC  X(0240).
      *       GARBAGE DATA
           03 IN01-FILLER-03                PIC  X(0001).

       FD  OT-FILE01 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC01                         PIC  X(0408).


       FD  IN-FILE02 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE차주익스포져중간월집계(THKJL0128) - 265 BYTE
       01  IN-REC02.
      *       비암호화항목1
           03 IN02-FILLER-O1                PIC  X(0011).
      *       차주번호
           03 IN02-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN02-FILLER-02                PIC  X(0240).
      *       GARBAGE DATA
           03 IN02-FILLER-03                PIC  X(0001).

       FD  OT-FILE02 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC02                         PIC  X(0408).


       FD  IN-FILE03 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE차주일집계(THKJL0129) - 118 BYTE
       01  IN-REC03.
      *       비암호화항목1
           03 IN03-FILLER-O1                PIC  X(0013).
      *       차주번호
           03 IN03-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN03-FILLER-02                PIC  X(0091).
      *       GARBAGE DATA
           03 IN03-FILLER-03                PIC  X(0001).

       FD  OT-FILE03 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC03                         PIC  X(0216).


       FD  IN-FILE04 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE차주월집계(THKJL0130) - 116 BYTE
       01  IN-REC04.
      *       비암호화항목1
           03 IN04-FILLER-O1                PIC  X(0011).
      *       차주번호
           03 IN04-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN04-FILLER-02                PIC  X(0091).
      *       GARBAGE DATA
           03 IN04-FILLER-03                PIC  X(0001).

       FD  OT-FILE04 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC04                         PIC  X(0216).


       FD  IN-FILE05 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE간접익스포져일집계(THKJL0031) - 89 BYTE
       01  IN-REC05.
      *       비암호화항목1
           03 IN05-FILLER-O1                PIC  X(0013).
      *       담보보증차주번호
           03 IN05-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN05-FILLER-02                PIC  X(0062).
      *       GARBAGE DATA
           03 IN05-FILLER-03                PIC  X(0001).

       FD  OT-FILE05 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC05                         PIC  X(0172).


       FD  IN-FILE06 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE간접익스포져월집계(THKJL0032) - 87 BYTE
       01  IN-REC06.
      *       비암호화항목1
           03 IN06-FILLER-O1                PIC  X(0011).
      *       담보보증차주번호
           03 IN06-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN06-FILLER-02                PIC  X(0062).
      *       GARBAGE DATA
           03 IN06-FILLER-03                PIC  X(0001).

       FD  OT-FILE06 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC06                         PIC  X(0172).


       FD  IN-FILE07 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE차주관리한도(THKJL0011) - 206 BYTE
       01  IN-REC07.
      *       비암호화항목1
           03 IN07-FILLER-O1                PIC  X(0011).
      *       차주번호
           03 IN07-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN07-FILLER-02                PIC  X(0181).
      *       GARBAGE DATA
           03 IN07-FILLER-03                PIC  X(0001).

       FD  OT-FILE07 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC07                         PIC  X(0320).


       FD  IN-FILE15 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE국별일집계(THKJL0055) - 226 BYTE
       01  IN-REC15.
      *       비암호화항목1
           03 IN15-FILLER-O1                PIC  X(0059).
      *       차주번호
           03 IN15-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN15-FILLER-02                PIC  X(0153).
      *       GARBAGE DATA
           03 IN15-FILLER-03                PIC  X(0001).

       FD  OT-FILE15 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC15                         PIC  X(0364).


       FD  IN-FILE16 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *    TE국별월집계(THKJL0055) - 224 BYTE
       01  IN-REC16.
      *       비암호화항목1
           03 IN16-FILLER-O1                PIC  X(0057).
      *       차주번호
           03 IN16-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN16-FILLER-02                PIC  X(0153).
      *       GARBAGE DATA
           03 IN16-FILLER-03                PIC  X(0001).

       FD  OT-FILE16 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC16                         PIC  X(0344).


       FD  IN-FILE18 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *   채무자고객기본(THKJL0015) - 355 BYTE
       01  IN-REC18.
      *       비암호화항목1
           03 IN18-FILLER-O1                PIC  X(0013).
      *       차주번호
           03 IN18-BRWR-NO                  PIC  X(0013).
      *       비암호화항목2
           03 IN18-FILLER-02                PIC  X(0328).
      *       GARBAGE DATA
           03 IN18-FILLER-03                PIC  X(0001).

       FD  OT-FILE18 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC18                         PIC  X(0536).


       FD  IN-FILE19 LABEL RECORD IS     STANDARD RECORDING MODE F.
      *   계열사기본(THKJL0014) - 119 BYTE
       01  IN-REC19.
      *       비암호화항목1
           03 IN19-FILLER-O1                PIC  X(0118).
      *       GARBAGE DATA
           03 IN19-FILLER-03                PIC  X(0001).

       FD  OT-FILE19 LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC19                         PIC  X(0172).

      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.

      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLG001'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-CHA-EOF              PIC  X(003) VALUE 'EOF'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.

      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
      *    TE차주익스포져중간일집계(THKJL0127)
           03  WK-IN-F-ST01            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST01            PIC  X(002) VALUE  SPACE.
      *    TE차주익스포져중간월집계(THKJL0128)
           03  WK-IN-F-ST02            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST02            PIC  X(002) VALUE  SPACE.
      *    TE차주일집계(THKJL0129)
           03  WK-IN-F-ST03            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST03            PIC  X(002) VALUE  SPACE.
      *    TE차주월집계(THKJL0130)
           03  WK-IN-F-ST04            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST04            PIC  X(002) VALUE  SPACE.
      *    TE간접익스포져일집계(THKJL0031)
           03  WK-IN-F-ST05            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST05            PIC  X(002) VALUE  SPACE.
      *    TE간접익스포져월집계(THKJL0032)
           03  WK-IN-F-ST06            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST06            PIC  X(002) VALUE  SPACE.
      *    TE차주관리한도(THKJL0011)
           03  WK-IN-F-ST07            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST07            PIC  X(002) VALUE  SPACE.
      *    TE차주국별일집계(THKJL0055)
           03  WK-IN-F-ST15            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST15            PIC  X(002) VALUE  SPACE.
      *    TE차주국별월집계(THKJL0055)
           03  WK-IN-F-ST16            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST16            PIC  X(002) VALUE  SPACE.
      *   채무자고객기본(THKJL0015)
           03  WK-IN-F-ST18            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST18            PIC  X(002) VALUE  SPACE.
      *   계열사기본(THKJL0014)
           03  WK-IN-F-ST19            PIC  X(002) VALUE  SPACE.
           03  WK-OT-F-ST19            PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-READ-CNT          PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WRITE-CNT         PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(003) VALUE  SPACE.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I-CODE               PIC S9(0008) COMP.
           03  WK-I-SRVID              PIC  X(0012).
           03  WK-I-DATALENG           PIC S9(0008) COMP.
           03  WK-I-DATA               PIC  X(8000).
           03  WK-IN-LENGTH            PIC S9(0008) COMP.
           03  WK-IN-DATA              PIC  X(4096).
           03  WK-O-DATA-ASCII-LEN     PIC S9(0008) COMP.
           03  WK-O-DATA-ASCII         PIC  X(8000).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *   코드변환 처리 모듈 Parameter
       01  XZUGCDCV-CA.
           COPY  XZUGCDCV.

      *   양방향 암호화 처리 모듈 Parameter
       01  XFAVSCPN-CA.
           COPY  XFAVSCPN.

      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * TABLE KEY COPYBOOK
      * TABLE RECORD COPYBOOK

      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * DBIO INTERFACE COPYBOOK

      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.

       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-OUT.
      *       일방향DA
           03 WK-H-O-SRVID-GD               PIC  X(00012).
      *       일방향PA
           03 WK-H-O-SRVID-GP               PIC  X(00012).
      *       양방향DA
           03 WK-H-O-SRVID-DA               PIC  X(00012).
      *       양방향BA
           03 WK-H-O-SRVID-BA               PIC  X(00012).
      *       양방향PA
           03 WK-H-O-SRVID-PA               PIC  X(00012).
       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@   초기화
           INITIALIZE  WK-AREA
                       WK-SYSIN
                       XZUGEROR-CA

      *@JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN  FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLG001 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *@   그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *@   작업실행일
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *@   FILE OPEN ROUTINE CALL
           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .

       S1000-INITIALIZE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

      *@   초기화
           INITIALIZE  WK-SWITCHES

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *        TE차주익스포져중간일집계(THKJL0127)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE01

      *@       오픈상태확인
               IF  WK-IN-F-ST01 NOT = CO-STAT-OK
                   MOVE 'IN-FILE01 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST01  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST01
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE01

      *@       오픈상태확인
               IF  WK-OT-F-ST01 NOT = CO-STAT-OK
                   MOVE 'OT-FILE01 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST01
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST01
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM12'
      *        TE차주익스포져중간월집계(THKJL0128)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE02

      *@       오픈상태확인
               IF  WK-IN-F-ST02 NOT = CO-STAT-OK
                   MOVE 'IN-FILE02 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST02  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST02
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE02

      *@       오픈상태확인
               IF  WK-OT-F-ST02 NOT = CO-STAT-OK
                   MOVE 'OT-FILE02 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST02
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST02
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD13'
      *        TE차주일집계(THKJL0129)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE03

      *@       오픈상태확인
               IF  WK-IN-F-ST03 NOT = CO-STAT-OK
                   MOVE 'IN-FILE03 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST03  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST03
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE03

      *@       오픈상태확인
               IF  WK-OT-F-ST03 NOT = CO-STAT-OK
                   MOVE 'OT-FILE03 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST03
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST03
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM13'
      *        TE차주월집계(THKJL0130)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE04

      *@       오픈상태확인
               IF  WK-IN-F-ST04 NOT = CO-STAT-OK
                   MOVE 'IN-FILE04 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST04  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST04
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE04

      *@       오픈상태확인
               IF  WK-OT-F-ST04 NOT = CO-STAT-OK
                   MOVE 'OT-FILE04 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST04
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST04
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD14'
      *        TE간접익스포져일집계(THKJL0031)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE05

      *@       오픈상태확인
               IF  WK-IN-F-ST05 NOT = CO-STAT-OK
                   MOVE 'IN-FILE05 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST05  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST05
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE05

      *@       오픈상태확인
               IF  WK-OT-F-ST05 NOT = CO-STAT-OK
                   MOVE 'OT-FILE05 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST05
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST05
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM14'
      *        TE간접익스포져월집계(THKJL0032)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE06

      *@       오픈상태확인
               IF  WK-IN-F-ST06 NOT = CO-STAT-OK
                   MOVE 'IN-FILE06 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST06  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST06
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE06

      *@       오픈상태확인
               IF  WK-OT-F-ST06 NOT = CO-STAT-OK
                   MOVE 'OT-FILE06 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST06
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST06
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM15'
      *        TE차주관리한도(THKJL0011)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE07

      *@       오픈상태확인
               IF  WK-IN-F-ST07 NOT = CO-STAT-OK
                   MOVE 'IN-FILE07 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST07  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST07
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE07

      *@       오픈상태확인
               IF  WK-OT-F-ST07 NOT = CO-STAT-OK
                   MOVE 'OT-FILE07 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST07
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST07
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD22'
      *        TE차주국별일집계(THKJL0055)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE15

      *@       오픈상태확인
               IF  WK-IN-F-ST15 NOT = CO-STAT-OK
                   MOVE 'IN-FILE15 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST15  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST15
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE15

      *@       오픈상태확인
               IF  WK-OT-F-ST15 NOT = CO-STAT-OK
                   MOVE 'OT-FILE15 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST15
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST15
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM22'
      *        TE차주국별월집계(THKJL0055)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE16

      *@       오픈상태확인
               IF  WK-IN-F-ST16 NOT = CO-STAT-OK
                   MOVE 'IN-FILE16 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST16  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST16
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE16

      *@       오픈상태확인
               IF  WK-OT-F-ST16 NOT = CO-STAT-OK
                   MOVE 'OT-FILE16 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST16
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST16
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD29'
      *       채무자고객기본(THKJL0015)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE18

      *@       오픈상태확인
               IF  WK-IN-F-ST18 NOT = CO-STAT-OK
                   MOVE 'IN-FILE18 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST18  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST18
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE18

      *@       오픈상태확인
               IF  WK-OT-F-ST18 NOT = CO-STAT-OK
                   MOVE 'OT-FILE18 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST18
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST18
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM27'
      *       계열사기본(THKJL0014)
      *@       INPUT FILE OPEN
               OPEN  INPUT  IN-FILE19

      *@       오픈상태확인
               IF  WK-IN-F-ST19 NOT = CO-STAT-OK
                   MOVE 'IN-FILE19 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST19  TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST19
                   #OKEXIT CO-CHA-08
               END-IF

      *@       OUTPUT FILE OPEN
               OPEN  OUTPUT  OT-FILE19

      *@       오픈상태확인
               IF  WK-OT-F-ST19 NOT = CO-STAT-OK
                   MOVE 'OT-FILE19 OPEN ERROR : FILE-ST IS '
                     TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST19
                     TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST19
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN OTHER
               #USRLOG '배치작업구분 값 오류입니다.'
                       WK-SYSIN-BATCH-GB
               #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S1100-FILE-OPEN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@  그룹회사구분코드
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업실행일
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업명
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  처리회차
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  배치작업구분
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업자ID
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  자료기준년월일
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                 TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .

       S2000-VALIDATION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *    서비스ID조회 처리
           PERFORM  S3100-THKJLLOG1-RTN
              THRU  S3100-THKJLLOG1-EXT


      *@   IN FILE READ ROUTINE CALL
           PERFORM  S3110-READ-FILE-RTN
              THRU  S3110-READ-FILE-EXT

      *@   FILE READ LOOP
           PERFORM  UNTIL  WK-SW-EOF = CO-CHA-EOF
               INITIALIZE              WK-O-DATA-ASCII
                                       WK-O-DATA-ASCII-LEN

      *        1. 평문 비암호화항목1 코드변환(EBCDIC==>ASCII)
               PERFORM  S3200-CODE-CONVERSION-RTN
                  THRU  S3200-CODE-CONVERSION-EXT

      *       데이터(비암호화항목1)
               MOVE  XZUGCDCV-OT-DATA(1:XZUGCDCV-OT-LENGTH)
                 TO  WK-O-DATA-ASCII
      *       데이터길이
               MOVE  XZUGCDCV-OT-LENGTH
                 TO  WK-O-DATA-ASCII-LEN

               EVALUATE WK-SYSIN-BATCH-GB
               WHEN 'EXPM27'
      *           계열사기본은 양방향암호화만 하면 됨
                   CONTINUE
               WHEN OTHER
      *            2. 평문 차주번호 코드변환(EBCDIC==>ASCII)
                   PERFORM  S3300-CODE-CONVERSION-RTN
                      THRU  S3300-CODE-CONVERSION-EXT

      *           암호화구분코드(03:일방향(솔트포함))
                   MOVE  03
                     TO  WK-I-CODE
      *           서비스ID(일방향)
                   EVALUATE WK-SYSIN-WORK-ID
                   WHEN 'KB ZADA'
                       MOVE  WK-H-O-SRVID-GD
                         TO  WK-I-SRVID
                   WHEN 'KB ZABA'
                   WHEN 'KB ZAPA'
                       MOVE  WK-H-O-SRVID-GP
                         TO  WK-I-SRVID
                   END-EVALUATE
      *           데이터(차주번호)
      *           코드변환에서 10 OR 13BYTE 가 나오지만
      *            20BYTE로 암호화하기 위해
      *            MOVE  XZUGCDCV-OT-DATA(1:XZUGCDCV-OT-LENGTH)
                   MOVE  XZUGCDCV-OT-DATA(1:20)
                     TO  WK-I-DATA
      *           데이터길이(차주번호는 20BYTE로 암호화)
      *            MOVE  XZUGCDCV-OT-LENGTH
                   MOVE  20
                     TO  WK-I-DATALENG

      *            3. 차주번호 암호화(ASCII==>EBCDIC)
                   PERFORM  S3130-FAVSCPN-CALL-RTN
                      THRU  S3130-FAVSCPN-CALL-EXT

                   IF WK-AC-WRITE-CNT = 0
                       #USRLOG '일방입력길이 :' %8
                               XFAVSCPN-I-DATALENG
                       #USRLOG '일방출력길이 :' %8
                               XFAVSCPN-O-DATALENG
                   END-IF

      *           차주번호 길이
                   MOVE XFAVSCPN-O-DATALENG
                     TO WK-IN-LENGTH
      *           차주번호
                   MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                     TO WK-IN-DATA

      *            4. 암호 차주번호 코드변환(EBCDIC==>ASCII)
                   PERFORM  S3120-ZUGCDCV-CALL-RTN
                      THRU  S3120-ZUGCDCV-CALL-EXT

      *           암호화데이터(차주번호)
                   MOVE  XZUGCDCV-OT-DATA(1:XZUGCDCV-OT-LENGTH)
                     TO  WK-O-DATA-ASCII(WK-O-DATA-ASCII-LEN + 1:
                                         XZUGCDCV-OT-LENGTH)
      *           데이터길이
                   ADD  XZUGCDCV-OT-LENGTH
                    TO  WK-O-DATA-ASCII-LEN

      *            5. 평문 비암호화항목2 코드변환(EBCDIC==>ASCII)
                   PERFORM  S3400-CODE-CONVERSION-RTN
                      THRU  S3400-CODE-CONVERSION-EXT

      *           데이터(비암호화항목2)
                   MOVE  XZUGCDCV-OT-DATA(1:XZUGCDCV-OT-LENGTH)
                     TO  WK-O-DATA-ASCII(WK-O-DATA-ASCII-LEN + 1:
                                         XZUGCDCV-OT-LENGTH)
      *           데이터길이
                   ADD  XZUGCDCV-OT-LENGTH
                    TO  WK-O-DATA-ASCII-LEN
               END-EVALUATE


      *       암호화구분코드(01:양방향)
               MOVE  01
                 TO  WK-I-CODE
      *       서비스ID(양방향)
               EVALUATE WK-SYSIN-WORK-ID
               WHEN 'KB ZADA'
                   MOVE  WK-H-O-SRVID-DA
                     TO  WK-I-SRVID
               WHEN 'KB ZABA'
                   MOVE  WK-H-O-SRVID-BA
                     TO  WK-I-SRVID
               WHEN 'KB ZAPA'
                   MOVE  WK-H-O-SRVID-PA
                     TO  WK-I-SRVID
               END-EVALUATE
      *       데이터(기타필드+암호화)
               MOVE  WK-O-DATA-ASCII
                 TO  WK-I-DATA
      *       데이터길이
               MOVE  WK-O-DATA-ASCII-LEN
                 TO  WK-I-DATALENG

      *        6. 암호화/평문필드 양방향 암호화(ASCII==>EBCDIC)
               PERFORM  S3130-FAVSCPN-CALL-RTN
                  THRU  S3130-FAVSCPN-CALL-EXT

               IF WK-AC-WRITE-CNT = 0
                   #USRLOG '양방입력길이 :' %8 XFAVSCPN-I-DATALENG
                   #USRLOG '양방출력길이 :' %8 XFAVSCPN-O-DATALENG
               END-IF

      *       출력처리
               PERFORM  S3500-FILE-WRITE-RTN
                  THRU  S3500-FILE-WRITE-EXT


      *@       FILE READ ROUTINE CALL
               PERFORM  S3110-READ-FILE-RTN
                  THRU  S3110-READ-FILE-EXT
           END-PERFORM
           .

       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
140728*@  서비스ID 조회
      *-----------------------------------------------------------------
       S3100-THKJLLOG1-RTN.

      *@  서비스ID 조회
           EXEC SQL
           SELECT SUBSTR(배치완료여부내용, 2,12) AS "일방향DA"
                 ,SUBSTR(배치완료여부내용,15,12) AS "일방향PA"
                 ,SUBSTR(배치완료여부내용,28,12) AS "양방향DA"
                 ,SUBSTR(배치완료여부내용,41,12) AS "양방향BA"
                 ,SUBSTR(배치완료여부내용,54,12) AS "양방향PA"
             INTO :WK-H-O-SRVID-GD
                 ,:WK-H-O-SRVID-GP
                 ,:WK-H-O-SRVID-DA
                 ,:WK-H-O-SRVID-BA
                 ,:WK-H-O-SRVID-PA
             FROM DB2DBA.THKJLLOG1
            WHERE 그룹회사코드         = 'KB0'
              AND 토탈익스포져업무구분 = '2'
             WITH UR
           END-EXEC

      *@   결과확인
           EVALUATE SQLCODE
               WHEN CO-OK
                    CONTINUE
               WHEN OTHER
                    MOVE 'KJLLOG1'    TO  XZUGEROR-I-TBL-ID
                    MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                    MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                    MOVE 'SELECT시 오류가 발생했습니다'
                      TO  XZUGEROR-I-MSG
                    #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                    #OKEXIT CO-CHA-08
           END-EVALUATE
           .

       S3100-THKJLLOG1-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ READ FILE 1
      *-----------------------------------------------------------------
       S3110-READ-FILE-RTN.

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *@       READ  FILE
               READ  IN-FILE01       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST01
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE01 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST01  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST01
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM12'
      *@       READ  FILE
               READ  IN-FILE02       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST02
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE02 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST02  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST02
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPD13'
      *@       READ  FILE
               READ  IN-FILE03       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST03
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE03 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST03  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST03
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM13'
      *@       READ  FILE
               READ  IN-FILE04       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST04
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE04 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST04  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST04
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPD14'
      *@       READ  FILE
               READ  IN-FILE05       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST05
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE05 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST05  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST05
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM14'
      *@       READ  FILE
               READ  IN-FILE06       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST06
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE06 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST06  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST06
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM15'
      *@       READ  FILE
               READ  IN-FILE07       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST07
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE07 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST07  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST07
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPD22'
      *@       READ  FILE
               READ  IN-FILE15       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST15
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE15 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST15  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST15
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM22'
      *@       READ  FILE
               READ  IN-FILE16       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST16
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE16 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST16  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST16
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPD29'
      *@       READ  FILE
               READ  IN-FILE18       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST18
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE18 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST18  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST18
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           WHEN 'EXPM27'
      *@       READ  FILE
               READ  IN-FILE19       AT  END
                     MOVE CO-CHA-EOF TO  WK-SW-EOF
               END-READ

      *@       파일상태확인
               EVALUATE  WK-IN-F-ST19
                   WHEN  ZERO
                   WHEN  CO-CHA-04
                         ADD   CO-NUM-1    TO  WK-AC-READ-CNT
                   WHEN  CO-CHA-10
                         MOVE CO-CHA-EOF   TO  WK-SW-EOF
                   WHEN  OTHER
                         MOVE 'IN-FILE19 READ ERROR : FILE-ST IS '
                           TO  XZUGEROR-I-MSG
                         MOVE  WK-IN-F-ST19  TO  XZUGEROR-I-MSG(34:2)
                         #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST19
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-EVALUATE

      *@1 만건마다 DISPLAY
           IF  FUNCTION MOD(WK-AC-READ-CNT,10000) = CO-NUM-0
               #USRLOG 'WK-AC-READ-CNT : ' WK-AC-READ-CNT
           END-IF
           .

       S3110-READ-FILE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 평문 비암호화항목1 코드변환(EBCDIC==>ASCII)
      *-----------------------------------------------------------------
       S3200-CODE-CONVERSION-RTN.

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN01-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN01-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM12'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN02-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN02-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPD13'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN03-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN03-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM13'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN04-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN04-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPD14'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN05-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN05-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM14'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN06-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN06-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM15'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN07-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN07-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPD22'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN15-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN15-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM22'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN16-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN16-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPD29'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN18-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN18-FILLER-O1
                 TO WK-IN-DATA
           WHEN 'EXPM27'
      *       비암호화항목1 길이
               MOVE LENGTH OF IN19-FILLER-O1
                 TO WK-IN-LENGTH
      *       비암호화항목1
               MOVE IN19-FILLER-O1
                 TO WK-IN-DATA
           END-EVALUATE

      *    1. 코드변환(EBCDIC==>ASCII)
           PERFORM  S3120-ZUGCDCV-CALL-RTN
              THRU  S3120-ZUGCDCV-CALL-EXT
           .

       S3200-CODE-CONVERSION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 평문 차주번호 코드변환(EBCDIC==>ASCII)
      *-----------------------------------------------------------------
       S3300-CODE-CONVERSION-RTN.

      *    (담보보증)차주번호 길이
      *   출력요구길이 만큼은 SPACE도 코드변환 되기때문에
      *    20BYTE로 길이를 지정한다.
           MOVE 20
             TO WK-IN-LENGTH

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *       차주번호
               MOVE IN01-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPM12'
      *       차주번호
               MOVE IN02-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPD13'
      *       차주번호
               MOVE IN03-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPM13'
      *       차주번호
               MOVE IN04-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPD14'
      *       담보보증차주번호
               MOVE IN05-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPM14'
      *       담보보증차주번호
               MOVE IN06-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPM15'
      *       차주번호
               MOVE IN07-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPD22'
      *       차주번호
               MOVE IN15-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPM22'
      *       차주번호
               MOVE IN16-BRWR-NO
                 TO WK-IN-DATA
           WHEN 'EXPD29'
      *       차주번호
               MOVE IN18-BRWR-NO
                 TO WK-IN-DATA
           END-EVALUATE

      *    2. 평문 차주번호 코드변환(EBCDIC==>ASCII)
           PERFORM  S3120-ZUGCDCV-CALL-RTN
              THRU  S3120-ZUGCDCV-CALL-EXT
           .

       S3300-CODE-CONVERSION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 평문 비암호화항목2 코드변환(EBCDIC==>ASCII)
      *-----------------------------------------------------------------
       S3400-CODE-CONVERSION-RTN.

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN01-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN01-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPM12'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN02-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN02-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPD13'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN03-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN03-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPM13'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN04-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN04-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPD14'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN05-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN05-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPM14'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN06-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN06-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPM15'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN07-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN07-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPD22'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN15-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN15-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPM22'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN16-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN16-FILLER-02
                 TO WK-IN-DATA
           WHEN 'EXPD29'
      *       비암호화항목2 길이
               MOVE LENGTH OF IN18-FILLER-02
                 TO WK-IN-LENGTH
      *       비암호화항목2
               MOVE IN18-FILLER-02
                 TO WK-IN-DATA
           END-EVALUATE

      *    5. 평문 비암호화항목2 코드변환(EBCDIC==>ASCII)
           PERFORM  S3120-ZUGCDCV-CALL-RTN
              THRU  S3120-ZUGCDCV-CALL-EXT
           .

       S3400-CODE-CONVERSION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 코드변환
      *-----------------------------------------------------------------
       S3120-ZUGCDCV-CALL-RTN.

      *   초기화
           INITIALIZE                  XZUGCDCV-IN

      *   코드변환 기능코드(EBCDIC==>ASCII)
           MOVE  'EMAM'
             TO  XZUGCDCV-IN-FLAG-CD
      *    SO/SI처리 옵션코드
           MOVE  'S'
             TO  XZUGCDCV-IN-SOSI-CD
      *   길이유지 옵션코드

      *   출력요구 데이터 길이(입력 길이와 같은 길이)
           MOVE  WK-IN-LENGTH
             TO  XZUGCDCV-IN-OUTLENG
      *@  입력 데이터 길이
           MOVE  WK-IN-LENGTH
             TO  XZUGCDCV-IN-LENGTH
      *   변환대상 입력데이터
           MOVE  WK-IN-DATA
             TO  XZUGCDCV-IN-DATA

      *@   유틸리티 호출
           #DYCALL ZUGCDCV YCCOMMON-CA XZUGCDCV-CA

      *@  결과체크
           EVALUATE  XZUGCDCV-R-STAT
           WHEN  CO-STAT-OK
               INITIALIZE              WK-IN-LENGTH
                                       WK-IN-DATA
           WHEN  OTHER
               #USRLOG '코드 변환전 데이터 :'
                       XZUGCDCV-IN-DATA(1:XZUGCDCV-IN-LENGTH)
               #USRLOG '코드변환 출력데이터 길이 :'
                       XZUGCDCV-OT-LENGTH
               #USRLOG '코드변환 출력데이터        :'
                       XZUGCDCV-OT-DATA(1:XZUGCDCV-OT-LENGTH)

               #ERROR   XZUGCDCV-R-ERRCD
                        XZUGCDCV-R-TREAT-CD
                        XZUGCDCV-R-STAT
           END-EVALUATE
           .

       S3120-ZUGCDCV-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 암호화
      *-----------------------------------------------------------------
       S3130-FAVSCPN-CALL-RTN.

      *    초기화
           INITIALIZE                  XFAVSCPN-IN

      *    암호화구분코드
           MOVE  WK-I-CODE
             TO  XFAVSCPN-I-CODE
      *    서비스ID
           MOVE  WK-I-SRVID
             TO  XFAVSCPN-I-SRVID
      *    데이터
           MOVE  WK-I-DATA
             TO  XFAVSCPN-I-DATA
      *    데이터길이
           MOVE  WK-I-DATALENG
             TO  XFAVSCPN-I-DATALENG

      *@   암호화 모듈 호출
           #CRYPTN

      *@  결과체크
           EVALUATE  XFAVSCPN-R-STAT
           WHEN  CO-STAT-OK
               INITIALIZE              WK-I-CODE
                                       WK-I-SRVID
                                       WK-I-DATA
                                       WK-I-DATALENG
           WHEN  OTHER
               #USRLOG '암호화 변환전 데이터 :'
                       XFAVSCPN-I-DATA(1:XFAVSCPN-I-DATALENG)
               #USRLOG '암호화 출력데이터 길이 :' %8
                       XFAVSCPN-O-DATALENG
               #USRLOG '암호화 출력데이터        :'
                        XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)

               #ERROR   XFAVSCPN-R-ERRCD
                        XFAVSCPN-R-TREAT-CD
                        XFAVSCPN-R-STAT
           END-EVALUATE
           .

       S3130-FAVSCPN-CALL-EXT.
           EXIT.


      *-----------------------------------------------------------------
      *@ 출력처리
      *-----------------------------------------------------------------
       S3500-FILE-WRITE-RTN.

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC01

               WRITE OT-REC01
           WHEN 'EXPM12'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC02

               WRITE OT-REC02
           WHEN 'EXPD13'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC03

               WRITE OT-REC03
           WHEN 'EXPM13'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC04

               WRITE OT-REC04
           WHEN 'EXPD14'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC05

               WRITE OT-REC05
           WHEN 'EXPM14'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC06

               WRITE OT-REC06
           WHEN 'EXPM15'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC07

               WRITE OT-REC07
           WHEN 'EXPD22'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC15

               WRITE OT-REC15
           WHEN 'EXPM22'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC16

               WRITE OT-REC16
           WHEN 'EXPD29'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC18

               WRITE OT-REC18
           WHEN 'EXPM27'
      *       출력DATA
               MOVE XFAVSCPN-O-DATA(1:XFAVSCPN-O-DATALENG)
                 TO OT-REC19

               WRITE OT-REC19
           END-EVALUATE

           ADD   CO-NUM-1
            TO   WK-AC-WRITE-CNT
           .

       S3500-FILE-WRITE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           EVALUATE WK-SYSIN-BATCH-GB
           WHEN 'EXPD12'
      *        TE차주익스포져중간일집계(THKJL0127)
      *@       CLOSE  FILE
               CLOSE  IN-FILE01

      *@       파일상태확인
               IF  WK-IN-F-ST01 NOT = CO-STAT-OK
                   MOVE 'IN-FILE01 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST01      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST01
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE01

      *@       파일상태확인
               IF  WK-OT-F-ST01 NOT = CO-STAT-OK
                   MOVE 'OT-FILE01 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST01      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST01
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM12'
      *        TE차주익스포져중간월집계(THKJL0128)
      *@       CLOSE  FILE
               CLOSE  IN-FILE02

      *@       파일상태확인
               IF  WK-IN-F-ST02 NOT = CO-STAT-OK
                   MOVE 'IN-FILE02 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST02      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST02
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE02

      *@       파일상태확인
               IF  WK-OT-F-ST02 NOT = CO-STAT-OK
                   MOVE 'OT-FILE02 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST02      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST02
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD13'
      *        TE차주일집계(THKJL0129)
      *@       CLOSE  FILE
               CLOSE  IN-FILE03

      *@       파일상태확인
               IF  WK-IN-F-ST03 NOT = CO-STAT-OK
                   MOVE 'IN-FILE03 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST03      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST03
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE03

      *@       파일상태확인
               IF  WK-OT-F-ST03 NOT = CO-STAT-OK
                   MOVE 'OT-FILE03 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST03      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST03
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM13'
      *        TE차주월집계(THKJL0130)
      *@       CLOSE  FILE
               CLOSE  IN-FILE04

      *@       파일상태확인
               IF  WK-IN-F-ST04 NOT = CO-STAT-OK
                   MOVE 'IN-FILE04 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST04      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST04
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE04

      *@       파일상태확인
               IF  WK-OT-F-ST04 NOT = CO-STAT-OK
                   MOVE 'OT-FILE04 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST04      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST04
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD14'
      *        TE간접익스포져일집계(THKJL0031)
      *@       CLOSE  FILE
               CLOSE  IN-FILE05

      *@       파일상태확인
               IF  WK-IN-F-ST05 NOT = CO-STAT-OK
                   MOVE 'IN-FILE05 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST05      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST05
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE05

      *@       파일상태확인
               IF  WK-OT-F-ST05 NOT = CO-STAT-OK
                   MOVE 'OT-FILE05 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST05      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST05
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM14'
      *        TE간접익스포져월집계(THKJL0032)
      *@       CLOSE  FILE
               CLOSE  IN-FILE06

      *@       파일상태확인
               IF  WK-IN-F-ST06 NOT = CO-STAT-OK
                   MOVE 'IN-FILE06 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST06      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST06
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE06

      *@       파일상태확인
               IF  WK-OT-F-ST06 NOT = CO-STAT-OK
                   MOVE 'OT-FILE06 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST06      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST06
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM15'
      *        TE차주관리한도(THKJL0011)
      *@       CLOSE  FILE
               CLOSE  IN-FILE07

      *@       파일상태확인
               IF  WK-IN-F-ST07 NOT = CO-STAT-OK
                   MOVE 'IN-FILE07 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST07      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST07
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE07

      *@       파일상태확인
               IF  WK-OT-F-ST07 NOT = CO-STAT-OK
                   MOVE 'OT-FILE07 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST07      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST07
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD22'
      *        TE차주국별일집계(THKJL0055)
      *@       CLOSE  FILE
               CLOSE  IN-FILE15

      *@       파일상태확인
               IF  WK-IN-F-ST15 NOT = CO-STAT-OK
                   MOVE 'IN-FILE15 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST15      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST15
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE15

      *@       파일상태확인
               IF  WK-OT-F-ST15 NOT = CO-STAT-OK
                   MOVE 'OT-FILE15 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST15      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST15
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM22'
      *        TE차주국별월집계(THKJL0055)
      *@       CLOSE  FILE
               CLOSE  IN-FILE16

      *@       파일상태확인
               IF  WK-IN-F-ST16 NOT = CO-STAT-OK
                   MOVE 'IN-FILE16 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST16      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST16
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE16

      *@       파일상태확인
               IF  WK-OT-F-ST16 NOT = CO-STAT-OK
                   MOVE 'OT-FILE16 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST16      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST16
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPD29'
      *       채무자고객기본(THKJL0015)
      *@       CLOSE  FILE
               CLOSE  IN-FILE18

      *@       파일상태확인
               IF  WK-IN-F-ST18 NOT = CO-STAT-OK
                   MOVE 'IN-FILE18 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST18      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST18
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE18

      *@       파일상태확인
               IF  WK-OT-F-ST18 NOT = CO-STAT-OK
                   MOVE 'OT-FILE18 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST18      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST18
                   #OKEXIT CO-CHA-08
               END-IF
           WHEN 'EXPM29'
      *       계열사기본(THKJL0014)
      *@       CLOSE  FILE
               CLOSE  IN-FILE19

      *@       파일상태확인
               IF  WK-IN-F-ST19 NOT = CO-STAT-OK
                   MOVE 'IN-FILE19 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-IN-F-ST19      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-F-ST19
                   #OKEXIT CO-CHA-08
               END-IF

140728         CLOSE  OT-FILE19

      *@       파일상태확인
               IF  WK-OT-F-ST19 NOT = CO-STAT-OK
                   MOVE 'OT-FILE19 CLOSE ERROR : FILE-ST IS '
                                           TO  XZUGEROR-I-MSG
                   MOVE  WK-OT-F-ST19      TO  XZUGEROR-I-MSG(34:2)
                   #ERROR  CO-EBM02001 CO-UBM02001 WK-OT-F-ST19
                   #OKEXIT CO-CHA-08
               END-IF
           END-EVALUATE

           #USRLOG '*--------------------------------------*'
           #USRLOG '* READ            COUNT  = ' WK-AC-READ-CNT
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WRITE-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLG001 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
