      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLI255 (BT매출채권계좌추출) - EAD기준
      *@처리유형  : BATCH
      *@처리개요  : 매출채권계좌추출- EAD기준
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090414: 신규작성
      *백현정:20100630: 외상매출채권　명목액잔액＝한도사용금액　적용
      *백현정:20101031:  EAD기준자료　추출
      *백현정:20101031: 구한도　제외함
      * HYH    :20170224:  KB-PIN 전환
      * HYH    :20170224: BS기준한도 = 통화한도 * 1회차매매기준율
      * HYH    :20170609: 부점하드코딩 ==> FJL0001 변경
      * HYH    :20170609: 2539M8400001(KB상생결제론) 추가
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **  여신계약기본   : THKHC0401                     : R
      **  부점기본       : THKJIBR01                     : R
      **  고객기본       : THKAABPCB                     : R
      **  법인사업자     : THKAABPCO                     : R
      **
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLI255.
       AUTHOR.                         백현정.
       DATE-WRITTEN.                   10/10/31.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *-----------------------------------------------------------------
       INPUT-OUTPUT                    SECTION.
      *-----------------------------------------------------------------
       FILE-CONTROL.
           SELECT  OT-FILE             ASSIGN       TO  OTFILE
                                       ORGANIZATION IS  SEQUENTIAL
                                       FILE STATUS  IS  WK-OT-F-ST.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                            SECTION.
      *-----------------------------------------------------------------
       FD  OT-FILE LABEL RECORD IS     STANDARD RECORDING MODE F.
       01  OT-REC.
           COPY  TRJL0125.
      *       공백
           03  FILLER                        PIC  X(018).
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      * CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(007) VALUE 'BJLI255'.
           03  CO-TBL-ID               PIC  X(009) VALUE 'THKHC0401'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-7                PIC  X(001) VALUE '7'.
           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-11               PIC  X(002) VALUE '11'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-999              PIC  X(003) VALUE '999'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.
           03  CO-CHA-KRW              PIC  X(003) VALUE 'KRW'.
           03  CO-CHA-MAE              PIC  X(003) VALUE 'MAE'.
           03  CO-CHA-0000             PIC  X(004) VALUE '0000'.

           03  CO-NUM-0                PIC  9(001) VALUE  0.
           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * FILE STATUS
      *-----------------------------------------------------------------
       01  WK-FILE-STATUS.
           03  WK-OT-F-ST              PIC  X(002) VALUE  SPACE.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-WT-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-TMPLT-CD-M84-CNT     PIC  9(013) VALUE  ZEROS.
           03  WK-TMPLT-CD-EXT-CNT     PIC  9(013) VALUE  ZEROS.
      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *세부고객유형분류구분
           03  WK-DTALS-CPC-DSTCD      PIC  X(002).
           03  WK-CNT                  PIC S9(018) COMP-3.
      *법인고객식별자
           03  WK-COPR-CUST-IDNFR      PIC  X(010).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *자료기준년월일
           03  WK-SYSIN-BASE-YMD       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
       01  XBJLTGEX-CA.
           COPY    XBJLTGEX.
170609* FC COPYBOOK
       01  XFJL0001-CA.
           COPY  XFJL0001.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRAABPCB-REC.
           COPY    TRAABPCB.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준일
           03 WK-H-I-BASE-DD                PIC  X(00002).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).
      *       기준년월일
           03 WK-H-I-BASE-YMD               PIC  X(00008).
      *       유동화부점
           03 WK-H-I-BRNCD                  PIC  X(00004).

       01  WK-HOST-OUT.
      *       계좌번호
           03 WK-H-O-ACNO                   PIC  X(00020).
      *       통화코드
           03 WK-H-O-CNCYCD                 PIC  X(00003).
      *       상품대분류코드
           03 WK-H-O-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 WK-H-O-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 WK-H-O-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 WK-H-O-PRDCT-NO               PIC  X(00005).
      *       계약자고객식별자
           03 WK-H-O-CTCR-CUST-ID           PIC  X(00010).
      *       계약자고객관리번호
           03 WK-H-O-CTCR-CUST-MGT-NO       PIC  X(00005).
      *       관리부점코드
           03 WK-H-O-MGT-BRNCD              PIC  X(00004).
      *       상품계약상태구분
           03 WK-H-O-PRDCT-C-STUS-DSTCD     PIC  X(00001).
      *       상품계약약정년월일
           03 WK-H-O-PRDCT-C-CRETN-YMD      PIC  X(00008).
      *       상품계약만기년월일
           03 WK-H-O-PRDCT-C-EXPIR-YMD      PIC  X(00008).
      *       상품계약폐기년월일
           03 WK-H-O-PRDCT-C-DSCRD-YMD      PIC  X(00008).
      *       한도계좌여부
           03 WK-H-O-LIMT-ACN-YN            PIC  X(00001).
      *       한도사용금액
           03 WK-H-O-LIMT-AMUS              PIC S9(00015)V9(3) COMP-3.
      *       계약금액
           03 WK-H-O-CNPR                   PIC S9(00015)V9(3) COMP-3.
       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC SQL
            DECLARE  THKHC0401-CUR     CURSOR FOR
             SELECT  A.계좌번호
                  ,  A.통화코드
                  ,  A.상품대분류코드
                  ,  A.상품중분류코드
                  ,  A.상품템플릿코드
                  ,  CASE A.상품번호
                       WHEN '00001' THEN 'A0001'
                       WHEN '00002' THEN 'A0002'
                       WHEN '00003' THEN 'A0003'
                       WHEN '00004' THEN 'A0004'
                       ELSE A.상품번호
                     END
                  ,  A.계약자고객식별자
                  ,  A.계약자고객관리번호
                  ,  A.관리부점코드
                  ,  A.상품계약상태구분
                  ,  A.상품계약약정년월일
                  ,  A.상품계약만기년월일
                  ,  A.상품계약폐기년월일
                  ,  A.한도계좌여부
                  ,  A.한도사용금액
                  ,  A.계약금액
               FROM  DB2DBA.THKHC0401 A
              WHERE  A.그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  A.한도계좌여부 = '1'
                AND  A.관리부점코드   <> :WK-H-I-BRNCD
                AND  A.재약정한도계좌구분 <> '2'
                AND  A.상품계약상태구분    = '1'
                AND  A.상품대분류코드 ||
                     A.상품중분류코드 ||
                     A.상품템플릿코드 ||
                     A.상품번호
                        IN ('2539M7100002',
                            '2539M7100003',
                            '2539M7100004',
                            '2539M7700001',
                            '2539M8400001')
                AND  A.계약금액> 0
               WITH  UR
           END-EXEC.

      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@   SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@  업무처리
           PERFORM  S3000-PROCESS-RTN
              THRU  S3000-PROCESS-EXT

      *@  처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@WK-AREA PARAMETER 초기화
           INITIALIZE    WK-AREA
                         WK-SYSIN

      *@JCL SYSIN ACCEPT  처리기준
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLI255 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *@   그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *@   구분코드
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *@   공통 UTILITY CALL
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA
      *@   RETURN 정보 확인
           IF  XBJISTDT-R-STAT = ZEROS
      *@      정상처리
              CONTINUE
           ELSE
      *@      에러처리
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
              #OKEXIT  CO-CHA-08
           END-IF

           PERFORM  S1100-FILE-OPEN-RTN
              THRU  S1100-FILE-OPEN-EXT
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *    사용하는 File을 OPEN 함
      *-----------------------------------------------------------------
       S1100-FILE-OPEN-RTN.

           OPEN OUTPUT OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE OPEN ERROR : FILE-ST IS '
                                      TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST       TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S1100-FILE-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@  그룹회사구분코드　입력값검증
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업실행일　입력값검증
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업명　입력값검증
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  처리회차　입력값검증
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  배치작업구분　입력값검증
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  작업자ID 입력값검증
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@  자료기준년월일　입력값검증
           IF  WK-SYSIN-BASE-YMD = SPACE
               MOVE '자료기준년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

           INITIALIZE    WK-HOST-IN

      *@   그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *@   기준일
           MOVE  WK-SYSIN-BASE-YMD(7:2)
             TO  WK-H-I-BASE-DD

      *@   기준년월
           MOVE  WK-SYSIN-BASE-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *@   기준년월일
           MOVE  WK-SYSIN-BASE-YMD
             TO  WK-H-I-BASE-YMD
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

170609*@   조회부점확인
           PERFORM  S4000-FJL0001-CALL-RTN
              THRU  S4000-FJL0001-CALL-EXT

           PERFORM  S3100-KHC0401-OPEN-RTN
              THRU  S3100-KHC0401-OPEN-EXT

           PERFORM  S3200-KHC0401-FETCH-RTN
              THRU  S3200-KHC0401-FETCH-EXT

           PERFORM  UNTIL  EOF-Y

                    PERFORM  S3400-DATA-MOVE-RTN
                       THRU  S3400-DATA-MOVE-EXT

                    PERFORM  S3500-DATA-WRITE-RTN
                       THRU  S3500-DATA-WRITE-EXT

                    PERFORM  S3200-KHC0401-FETCH-RTN
                       THRU  S3200-KHC0401-FETCH-EXT
           END-PERFORM

           PERFORM  S3600-KHC0401-CLOSE-RTN
              THRU  S3600-KHC0401-CLOSE-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KHC0401-OPEN-RTN.

           INITIALIZE    WK-SWITCHES

           EXEC SQL
               OPEN  THKHC0401-CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
            END-EVALUATE
           .
       S3100-KHC0401-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KHC0401-FETCH-RTN.

           INITIALIZE    WK-HOST-OUT

           EXEC SQL
              FETCH  THKHC0401-CUR
               INTO  :WK-HOST-OUT
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KHC0401-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA MOVE
      *-----------------------------------------------------------------
       S3400-DATA-MOVE-RTN.

           INITIALIZE    OT-REC

      *@   그룹회사코드
           MOVE  WK-H-I-GROUP-CO-CD
             TO  RJL0125-GROUP-CO-CD

      *@   계좌번호
           MOVE  WK-H-O-ACNO
             TO  RJL0125-ACNO

      *@   계좌중복일련번호
           MOVE  CO-NUM-1
             TO  RJL0125-ACN-DUP-SERNO

      *@   기준일
           MOVE  WK-H-I-BASE-DD
             TO  RJL0125-BASE-DD

      *@   기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0125-BASE-YM

      *@   고객식별자
           MOVE  WK-H-O-CTCR-CUST-ID
             TO  RJL0125-CUST-IDNFR

      *@   고객관리번호
           MOVE  WK-H-O-CTCR-CUST-MGT-NO
             TO  RJL0125-CUST-MGT-NO

      *@   해외현지법인여부
           MOVE  SPACE
             TO  RJL0125-OVSES-LCAL-COPR-YN

      *@  고객식별자로　법인고객식별자(차주고객식별자) 조회
           PERFORM  S3310-KAABPCB-SELECT-RTN
              THRU  S3310-KAABPCB-SELECT-EXT

      *@   차주고객식별자
           MOVE  WK-COPR-CUST-IDNFR
             TO  RJL0125-BRWR-CUST-IDNFR

      *@   관리부점코드
           MOVE  WK-H-O-MGT-BRNCD
             TO  RJL0125-MGT-BRNCD

      *@   TE계좌고객구분세팅（순수개인이면TE계좌고객구분＝＇７＇）
           PERFORM  S3310-KAABPDC-SELECT-RTN
              THRU  S3310-KAABPDC-SELECT-EXT

      *@   한도계좌여부
           MOVE  CO-CHA-1
             TO  RJL0125-LIMT-ACN-YN

      *@    TE계좌구분＝＇１＇（한도）
           MOVE  CO-CHA-1
             TO  RJL0125-TE-ACN-DSTCD

      *@   상품대분류코드
           MOVE  WK-H-O-PRDCT-LAG-CLSFI-CD
             TO  RJL0125-PRDCT-LAG-CLSFI-CD

      *@   상품중분류코드
           MOVE  WK-H-O-PRDCT-MEDM-CLSFI-CD
             TO  RJL0125-PRDCT-MEDM-CLSFI-CD

      *@   상품템플릿코드
           MOVE  WK-H-O-PRDCT-TMPLT-CD
             TO  RJL0125-PRDCT-TMPLT-CD

           IF  WK-H-O-PRDCT-TMPLT-CD =  'M84'
               ADD  CO-NUM-1  TO  WK-TMPLT-CD-M84-CNT
           ELSE
               ADD  CO-NUM-1  TO  WK-TMPLT-CD-EXT-CNT
           END-IF

      *@   상품번호
           MOVE  WK-H-O-PRDCT-NO
             TO  RJL0125-PRDCT-NO

      *@   시작년월일
           MOVE  WK-H-O-PRDCT-C-CRETN-YMD
             TO  RJL0125-START-YMD

      *@   만기년월일
           MOVE  WK-H-O-PRDCT-C-EXPIR-YMD
             TO  RJL0125-EXPIR-YMD

      *@   종료년월일
           MOVE  WK-H-O-PRDCT-C-DSCRD-YMD
             TO  RJL0125-END-YMD

      *@   상품계약상태구분
           MOVE  SPACE
             TO  RJL0125-PRDCT-C-STUS-DSTCD

      *@   통화코드
           MOVE  WK-H-O-CNCYCD
             TO  RJL0125-CNCYCD

      *@   통화한도
           MOVE  WK-H-O-CNPR
             TO  RJL0125-CRNCY-CLAM

      *@   통화잔액
           MOVE  WK-H-O-LIMT-AMUS
             TO  RJL0125-CRNCY-BAL

      *@통화코드가　원화일때
           IF  WK-H-O-CNCYCD = CO-CHA-KRW

      *@       BS기준잔액
               MOVE  WK-H-O-LIMT-AMUS
                 TO  RJL0125-BS-BASE-BAL

      *@       명목액기준한도
               MOVE  WK-H-O-CNPR
                 TO  RJL0125-TTL-AMT-BASE-CLAM

      *@백현정:20100630:외상매출채권　명목액잔액＝한도사용금액적용
      *@       명목액기준잔액
               MOVE  WK-H-O-LIMT-AMUS
                 TO  RJL0125-TTL-AMT-BASE-BAL

170224*@       BS기준한도 = 통화한도
               MOVE  RJL0125-CRNCY-CLAM
                 TO  RJL0125-BS-BASE-CLAM

           ELSE
      *@통화별　원화환산금액 CALCURATER
               PERFORM  S3420-BJLTGEX-CALL-RTN
                  THRU  S3420-BJLTGEX-CALL-EXT
           END-IF

      *@   CCF명목잔액환산금액
           MOVE  ZERO
             TO  RJL0125-CCF-TTL-BAL-AUC

      *@  배분내부회복가치
           MOVE  ZERO
             TO  RJL0125-DTRB-I-RECVY-VAL

      *@   CA담보제외금액
           MOVE  ZERO
             TO  RJL0125-CA-SCURTY-ECLUD-AMT

      *@   CA담보환산금액
           MOVE  ZERO
             TO  RJL0125-CA-SCURTY-AUC

      *@  한도계좌번호
           MOVE  RJL0125-ACNO
             TO  RJL0125-LIMT-ACNO

      *@  한도상품대분류코드
           MOVE  RJL0125-PRDCT-LAG-CLSFI-CD
             TO  RJL0125-LIMT-P-LAG-CLSFI-CD

      *@  한도상품중분류코드
           MOVE  RJL0125-PRDCT-MEDM-CLSFI-CD
             TO  RJL0125-LIMT-PM-CLSFI-CD

      *@  한도상품템플릿코드
           MOVE  RJL0125-PRDCT-TMPLT-CD
             TO  RJL0125-LIMT-PRDCT-TMPLT-CD

      *@  한도상품번호
           MOVE  RJL0125-PRDCT-NO
             TO  RJL0125-LIMT-PRDCT-NO

      *@   관련테이블명
           MOVE  CO-TBL-ID
             TO  RJL0125-RELATD-TBL-NAME

      *@   과목코드
           MOVE  CO-CHA-MAE
             TO  RJL0125-SBJCT-CD

      *@   시스템최종처리일시
           MOVE  BICOM-TRAN-BASE-YMS
             TO  RJL0125-SYS-LAST-PRCSS-YMS

      *@   시스템최종사용자번호
           MOVE  BICOM-USER-EMPID
             TO  RJL0125-SYS-LAST-UNO
           .
       S3400-DATA-MOVE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  계좌적용구분－순수개인　구분
      *@  - BJLD25H에서　순수개인을　분류　할수　없어서　여기서　처리
      *@  - WHY? : THKJL0015에는　순수개인정보가　없어서　처리　못함
      *-----------------------------------------------------------------
       S3310-KAABPDC-SELECT-RTN.

      *@거래자구분＝＇０１＇－－＞　개인　AS-IS그대로이행
      *@세부고객유형분류구분＝＇１１＇－－＞　개인　TO-BE기준
      *@세부고객유형분류구분으로　개인구분이　더　정확함

           INITIALIZE    WK-DTALS-CPC-DSTCD

           EXEC SQL
             SELECT  VALUE(세부고객유형분류구분,'00')
               INTO  :WK-DTALS-CPC-DSTCD
               FROM  DB2DBA.THKAABPDC
              WHERE  그룹회사코드    = :WK-H-I-GROUP-CO-CD
                AND  고객식별자      = :WK-H-O-CTCR-CUST-ID
                AND  고객관리번호    = :WK-H-O-CTCR-CUST-MGT-NO
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *@세부고객유형분류구분＝＇１１＇－－＞　개인
                     IF  WK-DTALS-CPC-DSTCD = CO-CHA-11
                     THEN
      *@ TE계좌고객구분＝７
                         MOVE  CO-CHA-7
                           TO  RJL0125-TE-ACN-CUST-DSTCD
                     ELSE
      *@ TE계좌고객구분＝０
                         MOVE  CO-CHA-0
                           TO  RJL0125-TE-ACN-CUST-DSTCD
                     END-IF
               WHEN  CO-NOT-FOUND
      *@ TE계좌고객구분＝０
                         MOVE  CO-CHA-0
                           TO  RJL0125-TE-ACN-CUST-DSTCD

               WHEN  OTHER
                     MOVE 'KAABPDC'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT S3310시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3310-KAABPDC-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  여신이개인으로분류된것중개인사업자정보가있는지확인
      *@  고객식별자로　법인고객식별자(차주고객식별자) 조회
      *-----------------------------------------------------------------
       S3310-KAABPCB-SELECT-RTN.

      *@   고객정보 초기화
           INITIALIZE    WK-COPR-CUST-IDNFR

      *@   고객고유번호구분= 02:사업자등록번호의
      *@                      법인고객식별자조회
           EXEC SQL
             SELECT  B.법인고객식별자
               INTO :WK-COPR-CUST-IDNFR
               FROM  DB2DBA.THKAABPCB A
                    ,DB2DBA.THKAABPCO B
              WHERE  A.그룹회사코드     = B.그룹회사코드
                AND  A.고객식별자       = B.고객식별자
                AND  A.그룹회사코드     = :WK-H-I-GROUP-CO-CD
                AND  A.고객식별자       = :WK-H-O-CTCR-CUST-ID
                AND  A.고객고유번호구분 = '02'
               WITH  UR
           END-EXEC

      *@   SQLCODE CHECK

           EVALUATE  SQLCODE
               WHEN  CO-OK
      *@법인사업자(THKAABPCO) 법인고객식별자조회
                     CONTINUE
               WHEN  CO-NOT-FOUND
      *@법인사업자(THKAABPCB)외의　고객고유번호조회
                     MOVE  WK-H-O-CTCR-CUST-ID
                       TO  WK-COPR-CUST-IDNFR
               WHEN  OTHER
                     MOVE 'KAABPCB'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'SELECT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'SELECT S3310시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3310-KAABPCB-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  통화별원화환산금액 CALCURATER
      *-----------------------------------------------------------------
       S3420-BJLTGEX-CALL-RTN.

           INITIALIZE    XBJLTGEX-CA

      *@   처리구분(1:통화별환산2:외환매매익　역환산)
           MOVE  CO-CHA-1
             TO  XBJLTGEX-I-GBCD

      *@   유효년월일－기준년월일
           MOVE  WK-H-I-BASE-YMD
             TO  XBJLTGEX-I-BASE-YMD

      *@   통화코드
           MOVE  RJL0125-CNCYCD
             TO  XBJLTGEX-I-CNCYCD

      *@   통화한도금액
           MOVE  RJL0125-CRNCY-CLAM
             TO  XBJLTGEX-I-CRNCY-CLAM

      *@   통화기준잔액
           MOVE  RJL0125-CRNCY-BAL
             TO  XBJLTGEX-I-CRNCY-BAL

      *@   통화기준잔액- 파생상품BS금액용
           MOVE  ZERO
             TO  XBJLTGEX-I-BS-BAL

           #DYCALL  BJLTGEX YCCOMMON-CA XBJLTGEX-CA

           IF  XBJLTGEX-R-STAT = CO-STAT-OK

      *@       BS기준잔액
               MOVE  XBJLTGEX-O-BS-BASE-BAL
                 TO  RJL0125-BS-BASE-BAL

      *@       명목액기준한도
               MOVE  XBJLTGEX-O-TTL-AMT-BASE-CLAM
                 TO  RJL0125-TTL-AMT-BASE-CLAM

      *@백현정:20100630: 외상매출채권　명목액잔액＝한도사용금액적용
      *@       명목액기준잔액
               MOVE  XBJLTGEX-O-TTL-AMT-BASE-BAL
                 TO  RJL0125-TTL-AMT-BASE-BAL

170224*@       BS기준한도
               MOVE  XBJLTGEX-O-BS-BASE-CLAM
                 TO  RJL0125-BS-BASE-CLAM

           ELSE

      *@       BS기준잔액
               MOVE  ZERO
                 TO  RJL0125-BS-BASE-BAL

      *@       명목액기준한도
               MOVE  ZERO
                 TO  RJL0125-TTL-AMT-BASE-CLAM

      *@       명목액기준잔액
               MOVE  ZERO
                 TO  RJL0125-TTL-AMT-BASE-BAL

170224*@       BS기준한도
               MOVE  ZERO
                 TO  RJL0125-BS-BASE-CLAM

           END-IF
           .
       S3420-BJLTGEX-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DATA WRITE
      *-----------------------------------------------------------------
       S3500-DATA-WRITE-RTN.

           WRITE  OT-REC

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE WRITE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           ADD   CO-NUM-1              TO  WK-AC-WT-CNT
           .
       S3500-DATA-WRITE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3600-KHC0401-CLOSE-RTN.

           EXEC SQL
              CLOSE  THKHC0401-CUR
           END-EXEC

           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KHC0401'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3600-KHC0401-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
170609*@  부점정보 추출
      *-----------------------------------------------------------------
       S4000-FJL0001-CALL-RTN.

      *@   변수초기화
           INITIALIZE                      XFJL0001-IN

      *@   조회구분
           MOVE  CO-CHA-02             TO  XFJL0001-I-INQURY-DSTCD

      *@   FC CALL
           #DYCALL  FJL0001  YCCOMMON-CA  XFJL0001-CA

      *@   처리결과확인
           IF  XFJL0001-R-STAT  =  CO-STAT-OK
               CONTINUE
           ELSE
               MOVE  CO-CHA-0000       TO  XFJL0001-O-BRNCD(1)
           END-IF

           MOVE  XFJL0001-O-BRNCD(1)   TO   WK-H-I-BRNCD

           #USRLOG '* XFJL0001-O-BRNCD  = ' WK-H-I-BRNCD

           .
       S4000-FJL0001-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           CLOSE     OT-FILE

           IF  WK-OT-F-ST NOT = CO-STAT-OK
               MOVE 'OT-FILE CLOSE ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
               MOVE  WK-OT-F-ST        TO  XZUGEROR-I-MSG(34:2)
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKHC0401-CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* M84             COUNT  = ' WK-TMPLT-CD-M84-CNT
           #USRLOG '*그외           COUNT  = ' WK-TMPLT-CD-EXT-CNT
           #USRLOG '* WRITE           COUNT  = ' WK-AC-WT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLI255 PGM END                      *'
           #USRLOG '*--------------------------------------*'
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
