      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: BJLM561 (BT국별／부점별한도원장생성작업)
      *@처리유형  : BATCH
      *@처리개요  : 전월의국별부점별한도원장자료익월로이월함
      *               국가지역별한도관리 익월 이월
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090228: 신규작성
      * HYH    :20200228: THKJL0053 국가지역별한도관리 추가
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM              : 테이블          : 접근유형
      **  --------------------------   ---------------------------------
      ** 국별부점별한도기본        : THKJL0056         : CRD
      ** 국가지역별한도관리        : THKJL0053         : CRD
      ******************************************************************
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     BJLM561.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/02/28.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                   SECTION.
      *-----------------------------------------------------------------
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *항목:코드구분(1)+오류 발생 PGM(2)+오류발생 루틴+
      *식별번호

      *01 : 초기화 처리(C/A 조립,Open 등)
           03  CO-EBM01001             PIC  X(008) VALUE 'EBM01001'.
           03  CO-UBM01001             PIC  X(008) VALUE 'UBM01001'.
      *02 : INPUT File/DB 입력 처리
           03  CO-EBM02001             PIC  X(008) VALUE 'EBM02001'.
           03  CO-UBM02001             PIC  X(008) VALUE 'UBM02001'.
      *03 : 내부 본 처리
           03  CO-EBM03001             PIC  X(008) VALUE 'EBM03001'.
           03  CO-UBM03001             PIC  X(008) VALUE 'UBM03001'.
      *04 : OUTPUT File/DB 출력 처리
           03  CO-EBM04001             PIC  X(008) VALUE 'EBM04001'.
           03  CO-UBM04001             PIC  X(008) VALUE 'UBM04001'.
      *05 : 종료 처리(Commit, Close 등)
           03  CO-EBM05001             PIC  X(008) VALUE 'EBM05001'.
           03  CO-UBM05001             PIC  X(008) VALUE 'UBM05001'.
      *09 : 기타
           03  CO-EBM09001             PIC  X(008) VALUE 'EBM09001'.
           03  CO-UBM09001             PIC  X(008) VALUE 'UBM09001'.
      *91 : Batch 초기화 유틸리티 호출
           03  CO-EBM91001             PIC  X(008) VALUE 'EBM91001'.
           03  CO-UBM91001             PIC  X(008) VALUE 'UBM91001'.
      *92 : Batch 진행관리 유틸리티 호출
           03  CO-EBM92001             PIC  X(008) VALUE 'EBM92001'.
           03  CO-UBM92001             PIC  X(008) VALUE 'UBM92001'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'BJLM561'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-OK                   PIC  9(003) VALUE  000.
           03  CO-NOT-FOUND            PIC  9(003) VALUE  100.

           03  CO-CHA-00               PIC  X(002) VALUE '00'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-08               PIC  X(002) VALUE '08'.
           03  CO-CHA-09               PIC  X(002) VALUE '09'.
           03  CO-CHA-10               PIC  X(002) VALUE '10'.
           03  CO-CHA-12               PIC  X(002) VALUE '12'.
           03  CO-CHA-16               PIC  X(002) VALUE '16'.
           03  CO-CHA-KB0              PIC  X(003) VALUE 'KB0'.

           03  CO-NUM-1                PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      * ACCUMULATORS
      *-----------------------------------------------------------------
       01  WK-ACCUMULATORS.
           03  WK-AC-FE-CNT            PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-FE-CNT1           PIC  9(013) VALUE  ZEROS.
           03  WK-AC-INT-CNT1          PIC  9(013) VALUE  ZEROS.

      *-----------------------------------------------------------------
      * SWITCHES
      *-----------------------------------------------------------------
       01  WK-SWITCHES.
           03  WK-SW-EOF               PIC  X(001) VALUE  SPACE.
               88  EOF-Y                           VALUE 'Y'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * ACCEPT AREA
      *-----------------------------------------------------------------
       01  WK-SYSIN.
      *그룹회사코드
           03  WK-SYSIN-GROUP-CD       PIC  X(003).
           03  FILLER                  PIC  X(001).
      *작업실행일
           03  WK-SYSIN-JOB-YMD        PIC  X(008).
           03  FILLER                  PIC  X(001).
      *작업명
           03  WK-SYSIN-JOB-NAME       PIC  X(008).
           03  FILLER                  PIC  X(001).
      *처리회차
           03  WK-SYSIN-JOB-SEQ        PIC  9(003).
           03  FILLER                  PIC  X(001).
      *배치작업구분
           03  WK-SYSIN-BATCH-GB       PIC  X(006).
           03  FILLER                  PIC  X(001).
      *작업자ID
           03  WK-SYSIN-WORK-ID        PIC  X(007).
           03  FILLER                  PIC  X(001).
      *당월말년월일
           03  WK-SYSIN-TTMM-END-YMD   PIC  X(008).
           03  FILLER                  PIC  X(001).
      *익월초년월일
           03  WK-SYSIN-NXMN-THBG-YMD  PIC  X(008).
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *공통영역 기준일자 Set Parameter
       01  XBJISTDT-CA.
           COPY    XBJISTDT.
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY    YCCOMMON.
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *THKJL0056(국별부점별한도기본)
       01  TRJL0056-REC.
           COPY    TRJL0056.
      *THKJL0056(국별부점별한도기본)
       01  TKJL0056-KEY.
           COPY    TKJL0056.
200228*THKJL0053(국가지역별한도관리)
       01  TRJL0053-REC.
           COPY    TRJL0053.
200228*THKJL0053(국가지역별한도관리)
       01  TKJL0053-KEY.
           COPY    TKJL0053.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY    YCDBIOCA.
      *-----------------------------------------------------------------
      * DB2 SQL QUERY STATUS 관련 COPYBOOK
      *-----------------------------------------------------------------
       EXEC  SQL  INCLUDE  SQLCA            END-EXEC.
       EXEC  SQL  BEGIN  DECLARE            SECTION  END-EXEC.
       01  WK-HOST-IN.
      *       그룹회사코드
           03 WK-H-I-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 WK-H-I-BASE-YM                PIC  X(00006).
      *       당월말년월
           03 WK-H-I-TTMM-END-YM            PIC  X(00006).

       01  WK-HOST-OUT.
      *       그룹회사코드
           03 WK-H-O-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 WK-H-O-BASE-YM                PIC  X(00006).
      *        ISO국가코드
           03 WK-H-O-ISO-NATNL-CD           PIC  X(00002).
      *       영문국가명
           03 WK-H-O-ENG-NATNL-NAME         PIC  X(00052).
      *       한도관리지역구분
           03 WK-H-O-LIMT-MGT-AREA-DSTCD    PIC  X(00001).
      *       한도국가체질구분
           03 WK-H-O-LIMT-N-CNSN-DSTCD      PIC  X(00001).
      *       경보발령여부
           03 WK-H-O-ALAM-OFODR-YN          PIC  X(00001).
      *       경보발령등록년월일
           03 WK-H-O-ALAM-OFODR-REGI-YMD    PIC  X(00008).
      *       모니터링여부
           03 WK-H-O-MONI-YN                PIC  X(00001).
      *       모니터링등록년월일
           03 WK-H-O-MONI-REGI-YMD          PIC  X(00008).
      *       SNP등급구분
           03 WK-H-O-SNP-GRD-DSTCD          PIC  X(00002).
      *       무디스등급구분
           03 WK-H-O-MODYS-GRD-DSTCD        PIC  X(00002).
      *       피치등급구분
           03 WK-H-O-FITCH-GRD-DSTCD        PIC  X(00002).
      *       전체관리한도
           03 WK-H-O-WHOL-MGT-CLAM          PIC S9(00015)V9(3) COMP-3.
200228*       당행국가신용등급구분
           03 WK-H-O-OWBNK-NC-GRD-DSTCD     PIC  X(00004).
200228*       국가전체공통한도여부
           03 WK-H-O-NATNL-W-CMN-LIMT-YN    PIC  X(00001).
200228*       국가위험수준구분
           03 WK-H-O-NATNL-R-LVEL-DSTCD     PIC  X(00001).


       01  WK-HOST-OUT1.
      *       그룹회사코드
           03 WK-H-O-GROUP-CO-CD1           PIC  X(00003).
      *       기준년월
           03 WK-H-O-BASE-YM1               PIC  X(00006).
      *       한도관리지역구분
           03 WK-H-O-LIMT-MGT-AREA-DSTCD1   PIC  X(00001).
      *       지역관리한도금액
           03 WK-H-O-AREA-MGT-CLAM1         PIC S9(00015)V9(3) COMP-3.



       EXEC  SQL  END    DECLARE            SECTION  END-EXEC.
      *-----------------------------------------------------------------
      * SQL CURSOR DECLARE
      *-----------------------------------------------------------------
           EXEC  SQL
            DECLARE  THKJL0056_CUR     CURSOR FOR
             SELECT  그룹회사코드
                  ,   '' AS기준년월
                  ,   "ISO국가코드"
                  ,  영문국가명
                  ,  한도관리지역구분
                  ,  한도국가체질구분
                  ,  경보발령여부
                  ,  경보발령등록년월일
                  ,  모니터링여부
                  ,  모니터링등록년월일
                  ,  "SNP등급구분"
                  ,  무디스등급구분
                  ,  피치등급구분
                  ,  전체관리한도
200228            ,  당행국가신용등급구분
200228            ,  국가전체공통한도여부
200228            ,  국가위험수준구분
               FROM  DB2DBA.THKJL0056
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-TTMM-END-YM
           END-EXEC.


           EXEC  SQL
            DECLARE  THKJL0053_CUR     CURSOR FOR
             SELECT  그룹회사코드
                  ,   '' AS기준년월
                  ,  한도관리지역구분
                  ,  지역관리한도금액
               FROM  DB2DBA.THKJL0053
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-TTMM-END-YM
           END-EXEC.

      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@1 초기화
           PERFORM  S1000-INITIALIZE-RTN
              THRU  S1000-INITIALIZE-EXT

      *@1 입력값 CHECK(SYSIN)
           PERFORM  S2000-VALIDATION-RTN
              THRU  S2000-VALIDATION-EXT

      *@1  SYSIN GET MOVE
           PERFORM  S3000-SYSDATA-MOVE-RTN
              THRU  S3000-SYSDATA-MOVE-EXT

      *@1 국별부점별한도기본(THKJL0056)삭제
           PERFORM  S3000-KJL0056-DELETE-RTN
              THRU  S3000-KJL0056-DELETE-EXT

      *@1 국별부점별한도기본(THKJL0056) 업무처리
           PERFORM  S3000-KJL0056-PROCESS-RTN
              THRU  S3000-KJL0056-PROCESS-EXT


      *@1 국가지역별한도기본(THKJL0053)삭제
           PERFORM  S4000-KJL0053-DELETE-RTN
              THRU  S4000-KJL0053-DELETE-EXT

      *@1 국가지역별한도기본(THKJL0053)업무처리
           PERFORM  S4000-KJL0053-PROCESS-RTN
              THRU  S4000-KJL0053-PROCESS-EXT

      *@1 처리종료
           PERFORM  S9000-FINAL-RTN
              THRU  S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *   초기화
           INITIALIZE    WK-AREA
                         WK-SYSIN
                         YCDBIOCA-CA
                         XZUGEROR-CA

      *@1  JCL SYSIN ACCEPT
           ACCEPT  WK-SYSIN            FROM  SYSIN
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLM561 PGM START                    *'
           #USRLOG '*--------------------------------------*'
           #USRLOG '* WK-SYSIN = ' WK-SYSIN

      *-----------------------------------------------------------------
      *@1  공통영역기준일자 SET
      *-----------------------------------------------------------------
      *@2 입력파라미터 조립
      *    (그룹회사코드,작업실행일)
      *   그룹회사코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  BICOM-GROUP-CO-CD

      *   작업실행일
           MOVE  WK-SYSIN-JOB-YMD
             TO  BICOM-TRAN-BASE-YMD

      *@2 프로그램호출:공통영역기준일자 SET
           #DYCALL  BJISTDT  YCCOMMON-CA  XBJISTDT-CA

      *   리턴코드가 정상이 아니면 에러처리
           IF  XBJISTDT-R-STAT = ZEROS
           THEN
               CONTINUE
           ELSE
               #ERROR   XBJISTDT-R-ERRCD
                        XBJISTDT-R-TREAT-CD
                        XBJISTDT-R-STAT
               #OKEXIT  CO-CHA-08
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값 CHECK(SYSIN)
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@1 그룹회사구분코드 미입력시 에러
           IF  WK-SYSIN-GROUP-CD NOT = CO-CHA-KB0
               MOVE '그룹회사구분코드 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 작업실행일 미입력시 에러
           IF  WK-SYSIN-JOB-YMD = SPACE
               MOVE '작업실행일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 작업명 미입력시 에러
           IF  WK-SYSIN-JOB-NAME = SPACE
               MOVE '작업명 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 처리회차 미입력시 에러
           IF  WK-SYSIN-JOB-SEQ = SPACE
               MOVE '처리회차 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 배치작업구분 미입력시 에러
           IF  WK-SYSIN-BATCH-GB = SPACE
               MOVE '배치작업구분 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 작업자ID 미입력시 에러
           IF  WK-SYSIN-WORK-ID = SPACE
               MOVE '작업자ID 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 당월말년월일 미입력시 에러
           IF  WK-SYSIN-TTMM-END-YMD = SPACE
               MOVE '당월말년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF

      *@1 익월초년월일 미입력시 에러
           IF  WK-SYSIN-NXMN-THBG-YMD = SPACE
               MOVE '익월초년월일 미입력 오류입니다.'
                                       TO  XZUGEROR-I-MSG
               #ERROR  CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
               #OKEXIT CO-CHA-08
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SYSIN GET MOVE
      *-----------------------------------------------------------------
       S3000-SYSDATA-MOVE-RTN.

      *   초기화
           INITIALIZE    WK-HOST-IN

      *@1  HOST INPUT에 값 SET

      *   그룹회사구분코드
           MOVE  WK-SYSIN-GROUP-CD
             TO  WK-H-I-GROUP-CO-CD

      *   기준년월
           MOVE  WK-SYSIN-NXMN-THBG-YMD(1:6)
             TO  WK-H-I-BASE-YM

      *   당월말년월일
           MOVE  WK-SYSIN-TTMM-END-YMD(1:6)
             TO  WK-H-I-TTMM-END-YM
           .
       S3000-SYSDATA-MOVE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  국별부점별한도기본(THKJL0056)삭제
      *-----------------------------------------------------------------
       S3000-KJL0056-DELETE-RTN.

      *@1 국별부점별한도기본(THKJL0056) LOCK처리
           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0056 IN EXCLUSIVE MODE
           END-EXEC

      *@1 국별부점별한도기본(THKJL0056) 삭제처리
           EXEC SQL
             DELETE  FROM DB2DBA.THKJL0056
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  COMMIT처리
           EXEC SQL
             COMMIT
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit시오류가발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3000-KJL0056-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  국가지역별한도관리(THKJL0053)삭제
      *-----------------------------------------------------------------
       S4000-KJL0053-DELETE-RTN.

      *@1 국가지역별한도관리(THKJL0053) LOCK처리
           EXEC SQL
               LOCK TABLE DB2DBA.THKJL0053 IN EXCLUSIVE MODE
           END-EXEC

      *@1 국가지역별한도관리(THKJL0053) 삭제처리
           EXEC SQL
             DELETE  FROM DB2DBA.THKJL0053
              WHERE  그룹회사코드 = :WK-H-I-GROUP-CO-CD
                AND  기준년월     = :WK-H-I-BASE-YM
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
               WHEN  CO-NOT-FOUND
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'DELETE'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DELETE시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  COMMIT처리
           EXEC SQL
             COMMIT
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'DB  Commit시오류가발생했습니다 '
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4000-KJL0053-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-KJL0056-PROCESS-RTN.

      *@1  CURSOR OPEN
           PERFORM  S3100-KJL0056-OPEN-RTN
              THRU  S3100-KJL0056-OPEN-EXT

      *@1  CURSOR FETCH
           PERFORM  S3200-KJL0056-FETCH-RTN
              THRU  S3200-KJL0056-FETCH-EXT

      *@1  NOT FOUND일때까지 처리
           PERFORM  UNTIL EOF-Y
      *@2          국별부점별한도기본(THKJL0056)등록
                    PERFORM  S3300-KJL0056-INSERT-RTN
                       THRU  S3300-KJL0056-INSERT-EXT

      *@2           CURSOR FETCH
                    PERFORM  S3200-KJL0056-FETCH-RTN
                       THRU  S3200-KJL0056-FETCH-EXT
           END-PERFORM

      *@1  CURSOR CLOSE
           PERFORM  S3400-KJL0056-CLOSE-RTN
              THRU  S3400-KJL0056-CLOSE-EXT
           .
       S3000-KJL0056-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S3100-KJL0056-OPEN-RTN.

      *   초기화
           INITIALIZE    WK-SWITCHES

      *@1  CURSOR OPEN
           EXEC SQL
               OPEN  THKJL0056_CUR
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3100-KJL0056-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S3200-KJL0056-FETCH-RTN.

      *   초기화
           INITIALIZE    WK-HOST-OUT

      *@1  CURSOR CLOSE
           EXEC SQL
              FETCH  THKJL0056_CUR
               INTO  :WK-HOST-OUT
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3200-KJL0056-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@    국별부점별한도기본(THKJL0056)등록
      *-----------------------------------------------------------------
       S3300-KJL0056-INSERT-RTN.

      *   초기화
           INITIALIZE    TKJL0056-KEY
                         TRJL0056-REC

      *@1 입력파라미터조립:그룹회사코드,기준년월,ISO국가코드,
      *@영문국가명,한도관리지역구분,한도국가체질구분,
      *@경보발령여부,경보발령등록년월일,
      *@모니터링여부,모니터링등록년월일,
      *@ SNP등급구분,무디스등급구분,
      *@피치등급구분,전체관리한도

      *   그룹회사코드
           MOVE  WK-H-O-GROUP-CO-CD
             TO  RJL0056-GROUP-CO-CD

      *   기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0056-BASE-YM

      *    ISO국가코드
           MOVE  WK-H-O-ISO-NATNL-CD
             TO  RJL0056-ISO-NATNL-CD

      *   영문국가명
           MOVE  WK-H-O-ENG-NATNL-NAME
             TO  RJL0056-ENG-NATNL-NAME

      *   한도관리지역구분
           MOVE  WK-H-O-LIMT-MGT-AREA-DSTCD
             TO  RJL0056-LIMT-MGT-AREA-DSTCD

      *   한도국가체질구분
           MOVE  WK-H-O-LIMT-N-CNSN-DSTCD
             TO  RJL0056-LIMT-N-CNSN-DSTCD

      *   경보발령여부
           MOVE  WK-H-O-ALAM-OFODR-YN
             TO  RJL0056-ALAM-OFODR-YN

      *   경보발령등록년월일
           MOVE  WK-H-O-ALAM-OFODR-REGI-YMD
             TO  RJL0056-ALAM-OFODR-REGI-YMD

      *   모니터링여부
           MOVE  WK-H-O-MONI-YN
             TO  RJL0056-MONI-YN

      *   모니터링등록년월일
           MOVE  WK-H-O-MONI-REGI-YMD
             TO  RJL0056-MONI-REGI-YMD

      *    SNP등급구분
           MOVE  WK-H-O-SNP-GRD-DSTCD
             TO  RJL0056-SNP-GRD-DSTCD

      *   무디스등급구분
           MOVE  WK-H-O-MODYS-GRD-DSTCD
             TO  RJL0056-MODYS-GRD-DSTCD

      *   피치등급구분
           MOVE  WK-H-O-FITCH-GRD-DSTCD
             TO  RJL0056-FITCH-GRD-DSTCD

      *   전체관리한도
           MOVE  WK-H-O-WHOL-MGT-CLAM
             TO  RJL0056-WHOL-MGT-CLAM

200228*   당행국가신용등급구분
           MOVE  WK-H-O-OWBNK-NC-GRD-DSTCD
             TO  RJL0056-OWBNK-NC-GRD-DSTCD

200228*   국가전체공통한도여부
           MOVE  WK-H-O-NATNL-W-CMN-LIMT-YN
             TO  RJL0056-NATNL-W-CMN-LIMT-YN

200228*   국가위험수준구분
           MOVE  WK-H-O-NATNL-R-LVEL-DSTCD
             TO  RJL0056-NATNL-R-LVEL-DSTCD

      *@1 국별부점별한도기본 INSERT
           #DYDBIO  INSERT-CMD-Y TKJL0056-PK TRJL0056-REC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3300-KJL0056-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S3400-KJL0056-CLOSE-RTN.

      *@1  CURSOR CLOSE
           EXEC SQL
              CLOSE  THKJL0056_CUR
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0056'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S3400-KJL0056-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  국가지역별한도기본(THKJL0053)업무처리
      *-----------------------------------------------------------------
       S4000-KJL0053-PROCESS-RTN.

      *@1  CURSOR OPEN
           PERFORM  S4100-KJL0053-OPEN-RTN
              THRU  S4100-KJL0053-OPEN-EXT

      *@1  CURSOR FETCH
           PERFORM  S4200-KJL0053-FETCH-RTN
              THRU  S4200-KJL0053-FETCH-EXT

      *@1  NOT FOUND일때까지 처리
           PERFORM  UNTIL EOF-Y
      *@2           국가지역별한도기본(THKJL0053)등록
                    PERFORM  S4300-KJL0053-INSERT-RTN
                       THRU  S4300-KJL0053-INSERT-EXT

      *@2           CURSOR FETCH
                    PERFORM  S4200-KJL0053-FETCH-RTN
                       THRU  S4200-KJL0053-FETCH-EXT
           END-PERFORM

      *@1  CURSOR CLOSE
           PERFORM  S4400-KJL0053-CLOSE-RTN
              THRU  S4400-KJL0053-CLOSE-EXT
           .
       S4000-KJL0053-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR OPEN
      *-----------------------------------------------------------------
       S4100-KJL0053-OPEN-RTN.

      *   초기화
           INITIALIZE    WK-SWITCHES

      *@1  CURSOR OPEN
           EXEC SQL
               OPEN  THKJL0053_CUR
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'OPEN'       TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR OPEN시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4100-KJL0053-OPEN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR FETCH
      *-----------------------------------------------------------------
       S4200-KJL0053-FETCH-RTN.

      *   초기화
           INITIALIZE    WK-HOST-OUT1

      *@1  CURSOR CLOSE
           EXEC SQL
              FETCH  THKJL0053_CUR
               INTO  :WK-HOST-OUT1
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     ADD   CO-NUM-1    TO  WK-AC-FE-CNT1
               WHEN  CO-NOT-FOUND
                     SET   EOF-Y       TO  TRUE
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'FETCH'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR FETCH시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM03001 CO-UBM03001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4200-KJL0053-FETCH-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@    국가지역별한도기본(THKJL0053)등록
      *-----------------------------------------------------------------
       S4300-KJL0053-INSERT-RTN.

      *   초기화
           INITIALIZE    TKJL0053-KEY
                         TRJL0053-REC

      *   그룹회사코드
           MOVE  WK-H-O-GROUP-CO-CD1
             TO  RJL0053-GROUP-CO-CD

      *   기준년월
           MOVE  WK-H-I-BASE-YM
             TO  RJL0053-BASE-YM

      *   한도관리지역구분
           MOVE  WK-H-O-LIMT-MGT-AREA-DSTCD1
             TO  RJL0053-LIMT-MGT-AREA-DSTCD

      *   지역관리한도금액
           MOVE  WK-H-O-AREA-MGT-CLAM1
             TO  RJL0053-AREA-MGT-CLAM


      *@1 국가지역별한도기본 INSERT
           #DYDBIO  INSERT-CMD-Y TKJL0053-PK TRJL0053-REC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-AC-INT-CNT1
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 DBIO-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4300-KJL0053-INSERT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   CURSOR CLOSE
      *-----------------------------------------------------------------
       S4400-KJL0053-CLOSE-RTN.

      *@1  CURSOR CLOSE
           EXEC SQL
              CLOSE  THKJL0053_CUR
           END-EXEC

      *   리턴코드가 정상이 아니면 에러처리
           EVALUATE  SQLCODE
               WHEN  CO-OK
                     CONTINUE
               WHEN  OTHER
                     MOVE 'KJL0053'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'CLOSE'      TO  XZUGEROR-I-FUNC-CD
                     MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                     MOVE 'CURSOR CLOSE시오류가발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                     #OKEXIT CO-CHA-08
           END-EVALUATE
           .
       S4400-KJL0053-CLOSE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

      *@1 처리결과DISPLAY
           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0056_CUR   COUNT  = ' WK-AC-FE-CNT
           #USRLOG '* KJL0056 INSERT  COUNT  = ' WK-AC-INT-CNT
           #USRLOG '*--------------------------------------*'
           #USRLOG '* THKJL0053_CUR   COUNT  = ' WK-AC-FE-CNT1
           #USRLOG '* KJL0053 INSERT  COUNT  = ' WK-AC-INT-CNT1
           #USRLOG '*--------------------------------------*'
           #USRLOG '* BJLM561 PGM END                      *'
           #USRLOG '*--------------------------------------*'
      *@1 정상종료
           #OKEXIT  CO-CHA-00
           .
       S9000-FINAL-EXT.
           EXIT.
