      *=================================================================
      *@업무명    : KJL     (토탈익스포져)
      *@프로그램명: BJLT152 (연도말 대상 보관- THKJL0015)
      *@처리유형  : BATCH
      *@처리개요  :연도말 대상 INSERT
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *@HYH    :20160324: 신규작성
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **                   : THKJL0152                     : I
      ******************************************************************
      *=================================================================
       IDENTIFICATION                   DIVISION.
      *=================================================================
       PROGRAM-ID.                      BJLT152.
       AUTHOR.                          HYH
       DATE-WRITTEN.                    16/03/24.

      *===============================================================
       ENVIRONMENT                      DIVISION.
      *===============================================================
       CONFIGURATION                    SECTION.
       SOURCE-COMPUTER.                 IBM-Z10.
       OBJECT-COMPUTER.                 IBM-Z10.
      *---------------------------------------------------------------
       INPUT-OUTPUT                     SECTION.
      *---------------------------------------------------------------
       FILE-CONTROL.
           SELECT IN-FILE  ASSIGN       TO INFILE
                           ORGANIZATION IS SEQUENTIAL
                           FILE STATUS  IS WK-IN-FILE-STAT.

      *===============================================================
       DATA                             DIVISION.
      *===============================================================
      *---------------------------------------------------------------
       FILE                             SECTION.
      *---------------------------------------------------------------
       FD  IN-FILE          RECORDING   MODE       IS  F
                            LABEL       RECORD     IS  STANDARD.

       01  IT-REC.
      *       기준년월
           03 IT-BASE-YM                    PIC  X(00006).
      *       그룹회사코드
           03 IT-GROUP-CO-CD                PIC  X(00003).
           03 FILLER                        PIC  X(00001).
      *       차주번호
           03 IT-BRWR-NO                    PIC  X(00013).
      *       차주번호구분
           03 IT-BRWR-NO-DSTIC              PIC  X(00001).
           03 FILLER                        PIC  X(00003).
      *       고객식별자
           03 IT-CUST-IDNFR                 PIC  X(00010).
      *       신표준산업분류코드
           03 IT-NEW-SI-CLSFI-CD            PIC  X(00005).
      *       내부신용평가등급
           03 IT-INTNL-CV-GRD-DSTCD         PIC  X(00004).
      *       신용평가년월일
           03 IT-CRDT-VALUA-YMD             PIC  X(00008).
      *       신용평가유효년월일
           03 IT-CRDT-VALUA-VALD-YMD        PIC  X(00008).
      *       고객관리부점코드
           03 IT-CUST-MGT-BRNCD             PIC  X(00004).
      *       TE기업규모구분
           03 IT-TE-CORP-SCAL-DSTCD         PIC  X(00001).
           03 FILLER                        PIC  X(00003).
      *       TEPEER구분
           03 IT-TE-PEER-DSTCD              PIC  X(00005).
      *       대분류업종코드
           03 IT-LAG-CLSFI-BZTYP-CD         PIC  X(00003).
           03 FILLER                        PIC  X(00001).
      *       산업평가등급
           03 IT-IDSTRY-VALUA-GRD           PIC  X(00004).
      *       계열기업군코드
           03 IT-AFFLT-CORP-GROUP-CD        PIC  X(00006).
      *       대표사업자번호
           03 IT-RPSNT-BZNO                 PIC  X(00010).
           03 FILLER                        PIC  X(00002).
      *       매출액
           03 IT-SALEPR                     PIC  9(00015).
           03 FILLER                        PIC  X(00002).
      *       총자산
           03 IT-TOTAL-ASST                 PIC  9(00015).
      *       한도고객구분
           03 IT-LIMT-CUST-DSTCD            PIC  X(00001).
           03 FILLER                        PIC  X(00003).
      *       모기업법인등록번호
           03 IT-MAMA-CORP-CPRNO            PIC  X(00013).
      *       모기업ISO국가코드
           03 IT-MAMA-C-ISO-NATNL-CD        PIC  X(00002).
           03 FILLER                        PIC  X(00002).
      *       연합회차주번호(SPACE)
           03 IT-FDRT-BRWR-NO               PIC  X(00006).
      *       고객ID구분
           03 IT-CUST-ID-DSTCD              PIC  X(00002).
           03 FILLER                        PIC  X(00002).
      *       한도그룹번호(SPACE)
           03 IT-LIMT-GROUP-NO              PIC  X(00006).
      *       그룹사신용등급구분
           03 IT-CMGR-CRTDSCD               PIC  X(00003).
           03 FILLER                        PIC  X(00001).
      *       시스템최종처리일시
           03 IT-SYS-LAST-PRCSS-YMS         PIC  X(00020).
      *       시스템최종사용자번호
           03 IT-SYS-LAST-UNO               PIC  X(00007).
      *       ETL기준년월일
           03 IT-ETL-BASE-YMD               PIC  X(00008).
      *       EDW최종변경일시
           03 IT-EDW-LAST-MODFI-YMS         PIC  X(00023).
      *       채무자명+계열기업군명+차주대표자명
           03 IT-DBTRZ-NAME                 PIC  X(00268).

      *-----------------------------------------------------------------
       WORKING-STORAGE                  SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID                PIC  X(008) VALUE 'BJLT152'.
           03  CO-STAT-OK               PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR            PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL         PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR         PIC  X(002) VALUE '99'.

           03  CO-SQL-OK                PIC  9(003) VALUE  000.

           03  CO-CY                    PIC  X(001) VALUE 'Y'.
           03  CO-CHA-04                PIC  X(002) VALUE '04'.
           03  CO-CHA-08                PIC  X(002) VALUE '08'.
           03  CO-CHA-10                PIC  X(002) VALUE '10'.

           03  CO-NUM-0                 PIC  9(001) VALUE  0.
           03  CO-NUM-1                 PIC  9(001) VALUE  1.
      *-----------------------------------------------------------------
      *    CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-EBM01001              PIC  X(008) VALUE 'EBM01001'.
           03  CO-EBM02001              PIC  X(008) VALUE 'EBM02001'.
           03  CO-EBM03001              PIC  X(008) VALUE 'EBM03001'.
           03  CO-EBM04001              PIC  X(008) VALUE 'EBM04001'.
           03  CO-EBM05001              PIC  X(008) VALUE 'EBM05001'.

           03  CO-UBM01001              PIC  X(008) VALUE 'UBM01001'.
           03  CO-UBM02001              PIC  X(008) VALUE 'UBM02001'.
           03  CO-UBM03001              PIC  X(008) VALUE 'UBM03001'.
           03  CO-UBM04001              PIC  X(008) VALUE 'UBM04001'.
           03  CO-UBM05001              PIC  X(008) VALUE 'UBM05001'.

      *-----------------------------------------------------------------
      *    FILE STATUS
      *-----------------------------------------------------------------
       01  WK-IN-FILE-STAT              PIC  X(002).

      *-----------------------------------------------------------------
      *    WORKING AREA
      *-----------------------------------------------------------------
      *@   BATCH 수행기본정의
       01  WK-SYSIN.
      *   그룹회사구분코드
           03  WK-SYSIN-GROUP-CD        PIC  X(003).
           03  FILLER                   PIC  X(001).
      *   작업실행일
           03  WK-SYSIN-JOB-YMD         PIC  X(008).
           03  FILLER                   PIC  X(001).
      *   작업명(JOB NAME)
           03  WK-SYSIN-JOB-NAME        PIC  X(008).
           03  FILLER                   PIC  X(001).
      *   처리회차
           03  WK-SYSIN-JOB-SEQ         PIC  9(003).
           03  FILLER                   PIC  X(001).
      *   배치작업구분
           03  WK-SYSIN-BATCH-KN        PIC  X(006).
           03  FILLER                   PIC  X(001).
      *   자료기준년월일
           03  WK-SYSIN-BASE-YMD        PIC  X(008).
           03  FILLER                   PIC  X(001).

       01  WK-AREA.
      *--  FETCH OF END
           03  WK-SW-EOF                PIC  X(001) VALUE  SPACE.
               88  IN-EOF-Y                         VALUE 'Y'.

       01  WK-CNT.
           03  WK-READ-CNT              PIC  9(009).
           03  WK-WRITE-CNT             PIC  9(009).
           03  WK-INSERT-CNT            PIC  9(009).

       01  WK-DIS.
           03  WK-EDIT-CNT1             PIC  ZZZ,ZZZ,ZZ9.
           03  WK-EDIT-CNT2             PIC  ZZZ,ZZZ,ZZ9.
           03  WK-EDIT-CNT3             PIC  ZZZ,ZZZ,ZZ9.
           03  WK-EDIT-CNT4             PIC  ZZZ,ZZZ,ZZ9.

      *-----------------------------------------------------------------
      *    PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      *-----------------------------------------------------------------
      *    TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TKJL0152-KEY.
           COPY    TKJL0152.
       01  TRJL0152-REC.
           COPY    TRJL0152.

      *-----------------------------------------------------------------
      *   테이블(호스트변수)영역
      *-----------------------------------------------------------------
           EXEC  SQL  INCLUDE  SQLCA            END-EXEC.

      ******************************************************************
      *    SQL CURSOR DECLARE                                          *
      ******************************************************************

      *-----------------------------------------------------------------
      *    DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY    YCDBIOCA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------

      *=================================================================
       PROCEDURE                       DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값 CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .

       S0000-MAIN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

           INITIALIZE        WK-AREA
                             WK-SYSIN
                             WK-CNT

      *    JCL SYSIN ACCEPT
           ACCEPT  WK-SYSIN  FROM    SYSIN

           DISPLAY '*------------------------------------------*'
           DISPLAY '* BJLT152 PGM START                        *'
           DISPLAY '*------------------------------------------*'
           DISPLAY '* WK-SYSIN      = ' WK-SYSIN

      *    FILE OPEN
           OPEN  INPUT  IN-FILE

      *    FILE CHECK OUTDATA
           IF WK-IN-FILE-STAT   NOT = CO-STAT-OK
              DISPLAY 'BJLT152:S1000 OT-F OPEN ERROR.'
                       WK-IN-FILE-STAT
              #ERROR CO-EBM01001 CO-UBM01001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

           .
       S1000-INITIALIZE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *   작업일자　확인
           IF WK-SYSIN-BASE-YMD    =  SPACE
              DISPLAY 'BJLT152:S2000작업기준일자　오류.'
                       WK-SYSIN-BASE-YMD
              #ERROR CO-EBM02001 CO-UBM02001 CO-STAT-ERROR
              #OKEXIT CO-CHA-08
           END-IF

           .
       S2000-VALIDATION-EXT.
           EXIT.

      *---------------------------------------------------------------
      *      MAIN PROCESS
      *---------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@   INPUT FILE READ
           PERFORM  S3100-READ-FILE-RTN
              THRU  S3100-READ-FILE-EXT

      *----LOOPING START
           PERFORM UNTIL IN-EOF-Y
      *        TABLE INSERT
               PERFORM  S3320-KJL0152-INSERT-RTN
                  THRU  S3320-KJL0152-INSERT-EXT

      *        READ 계속
               PERFORM S3100-READ-FILE-RTN
                  THRU S3100-READ-FILE-EXT

           END-PERFORM
      *----LOOPING END
           .

       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@    READ FILE
      *-----------------------------------------------------------------
       S3100-READ-FILE-RTN.

           READ  IN-FILE     AT  END
            SET  IN-EOF-Y    TO  TRUE
           END-READ

           EVALUATE  WK-IN-FILE-STAT
               WHEN  ZERO
               WHEN  CO-CHA-04
                     ADD   CO-NUM-1    TO  WK-READ-CNT
               WHEN  CO-CHA-10
                     SET   IN-EOF-Y    TO  TRUE
               WHEN  OTHER
                     MOVE 'IN-FILE READ ERROR : FILE-ST IS '
                                       TO  XZUGEROR-I-MSG
                     MOVE  WK-IN-FILE-STAT
                                       TO  XZUGEROR-I-MSG(34:2)
                     #ERROR  CO-EBM02001 CO-UBM02001 WK-IN-FILE-STAT
                     #OKEXIT CO-CHA-08
           END-EVALUATE

      *@1  10000건마다 DISPLAY
           IF  FUNCTION MOD(WK-READ-CNT, 100000) = CO-NUM-0
               #USRLOG 'WK-READ-CNT : ' WK-READ-CNT
           END-IF

150226*@1  100건마다 COMMIT처리
           IF  FUNCTION MOD(WK-READ-CNT, 100) = CO-NUM-0
               EXEC SQL
                    COMMIT
               END-EXEC

      *       리턴코드가 정상이 아니면 에러처리
               EVALUATE  SQLCODE
                   WHEN  CO-SQL-OK
                         CONTINUE
                   WHEN  OTHER
                         MOVE 'KJL0152'    TO  XZUGEROR-I-TBL-ID
                         MOVE 'COMMIT'     TO  XZUGEROR-I-FUNC-CD
                         MOVE  SQLCODE     TO  XZUGEROR-I-SQL-CD
                         MOVE 'DBCommit시오류가발생했습니다 '
                                           TO  XZUGEROR-I-MSG
                         #ERROR  CO-EBM05001 CO-UBM05001 CO-STAT-ERROR
                         #OKEXIT CO-CHA-08
               END-EVALUATE
           END-IF

                          .
       S3100-READ-FILE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   (THKJL0152)등록
      *-----------------------------------------------------------------
       S3320-KJL0152-INSERT-RTN.

      *   그룹회사코드
           MOVE IT-GROUP-CO-CD
             TO RJL0152-GROUP-CO-CD
      *   기준년월
           MOVE IT-BASE-YM
             TO RJL0152-BASE-YM
      *   차주번호
           MOVE IT-BRWR-NO
             TO RJL0152-BRWR-NO
      *   차주번호구분
           MOVE IT-BRWR-NO-DSTIC
             TO RJL0152-BRWR-NO-DSTCD
      *   고객식별자
           MOVE IT-CUST-IDNFR
             TO RJL0152-CUST-IDNFR
      *   신표준산업분류코드
           MOVE IT-NEW-SI-CLSFI-CD
             TO RJL0152-NEW-SI-CLSFI-CD
      *   내부신용평가등급구분
           MOVE IT-INTNL-CV-GRD-DSTCD
             TO RJL0152-INTNL-CV-GRD-DSTCD
      *   신용평가년월일
           MOVE IT-CRDT-VALUA-YMD
             TO RJL0152-CRDT-VALUA-YMD
      *   신용평가유효년월일
           MOVE IT-CRDT-VALUA-VALD-YMD
             TO RJL0152-CRDT-VALUA-VALD-YMD
      *   고객관리부점코드
           MOVE IT-CUST-MGT-BRNCD
             TO RJL0152-CUST-MGT-BRNCD
      *   TE기업규모구분
           MOVE IT-TE-CORP-SCAL-DSTCD
             TO RJL0152-TE-CORP-SCAL-DSTCD
      *   TEPEER구분
           MOVE IT-TE-PEER-DSTCD
             TO RJL0152-TE-PEER-DSTCD
      *   대분류업종코드
           MOVE IT-LAG-CLSFI-BZTYP-CD
             TO RJL0152-LAG-CLSFI-BZTYP-CD
      *   산업평가등급구분
           MOVE IT-IDSTRY-VALUA-GRD
             TO RJL0152-IDSTRY-V-GRD-DSTCD
      *   채무자명
           MOVE IT-DBTRZ-NAME(1:52)
             TO RJL0152-DBTRZ-NAME
      *   계열기업군코드
           MOVE IT-AFFLT-CORP-GROUP-CD
             TO RJL0152-AFFLT-CORP-GROUP-CD
      *   계열기업군명
           MOVE IT-DBTRZ-NAME(53:42)
             TO RJL0152-AFFLT-C-GROUP-NAME
      *   대표사업자번호
           MOVE IT-RPSNT-BZNO
             TO RJL0152-RPSNT-BZNO
      *   매출액
           MOVE IT-SALEPR
             TO RJL0152-SALEPR
      *   총자산
           MOVE IT-TOTAL-ASST
             TO RJL0152-TOTAL-ASST
      *   한도고객구분
           MOVE IT-LIMT-CUST-DSTCD
             TO RJL0152-LIMT-CUST-DSTCD
      *   모기업법인등록번호
           MOVE IT-MAMA-CORP-CPRNO
             TO RJL0152-MAMA-CORP-CPRNO
      *   모기업ISO국가코드
           MOVE IT-MAMA-C-ISO-NATNL-CD
             TO RJL0152-MAMA-C-ISO-NATNL-CD
      *   연합회차주번호
           MOVE IT-FDRT-BRWR-NO
             TO RJL0152-KFB-BRWR-NO
      *   고객ID구분
           MOVE IT-CUST-ID-DSTCD
             TO RJL0152-CUST-ID-DSTCD
      *   한도그룹번호
           MOVE IT-LIMT-GROUP-NO
             TO RJL0152-LIMT-GROUP-NO
      *   그룹사신용등급구분
           MOVE IT-CMGR-CRTDSCD
             TO RJL0152-CMGR-CRTDSCD
      *   차주대표자명
           MOVE IT-DBTRZ-NAME(96:52)
             TO RJL0152-BRWR-RPRS-NAME

           #DYDBIO  INSERT-CMD-Y TKJL0152-PK TRJL0152-REC

           EVALUATE  TRUE
               WHEN  COND-DBIO-OK
                     ADD   CO-NUM-1    TO  WK-INSERT-CNT
               WHEN  OTHER
                     DISPLAY '차주번호 : ' IT-BRWR-NO
                     MOVE 'KJL0152'    TO  XZUGEROR-I-TBL-ID
                     MOVE 'INSERT'     TO  XZUGEROR-I-FUNC-CD
                     MOVE  DBIO-SQLCODE
                                       TO  XZUGEROR-I-SQL-CD
                     MOVE 'INSERT시 오류가 발생했습니다'
                                       TO  XZUGEROR-I-MSG
                     #ERROR  CO-EBM02001 CO-UBM02001 DBIO-STAT
                     #OKEXIT CO-CHA-08
            END-EVALUATE
           .
       S3320-KJL0152-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           MOVE  WK-READ-CNT             TO  WK-EDIT-CNT1
           MOVE  WK-INSERT-CNT           TO  WK-EDIT-CNT4

           DISPLAY '************************************'
           DISPLAY ' BJLT152 PGM  END                   '
           DISPLAY '************************************'
           DISPLAY '$$ ================================='
           DISPLAY '$$ --  READ-CNT    : ' WK-EDIT-CNT1
           DISPLAY '$$ ================================='
           DISPLAY '$$ --  INSERT-CNT  : ' WK-EDIT-CNT4
           DISPLAY '$$ ================================='

           CLOSE    IN-FILE

           #OKEXIT  CO-STAT-OK
           .

       S9000-FINAL-EXT.
           EXIT.
