//TKIPSTAT JOB REGION=0M,NOTIFY=&SYSUID,CLASS=A,MSGCLASS=X,
//             MSGLEVEL=(1,1)
//*--------------------*
//*      RUNSTATS      *
//*--------------------*
//STEP01   EXEC DSNUPROC,PARM='DATG,RUNSTATS'
//SYSUT1   DD UNIT=3390,SPACE=(CYL,(100,10),,,ROUND)
//SORTOUT  DD UNIT=3390,SPACE=(CYL,(100,10),,,ROUND)
//SYSIN    DD *
RUNSTATS TABLESPACE DBKIPB11.SKIPB116 INDEX(ALL KEYCARD) TABLE(ALL)
         SHRLEVEL CHANGE
