//TKIPRINC JOB (GP1BEN,BP1A),CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*INC301   EXEC JZBDBIOC,MBR=RINC301,PROJ=KIN,OPT=N
//INC301   EXEC JZBDBIOC,MBR=RIPB110,PROJ=KIP,OPT=N
//*INC301   EXEC JZBDBIOC,MBR=RIPB119,PROJ=KIP,OPT=N