//TKII953C JOB (GP1BEN,BP1A),CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*--------------------------------------------------------------------
//*             JZBDONLC  ONLINE NORMAL COMPILE
//*             JZBDONLD  ONLINE DEBUG  COMPILE
//*                       OPT=N  <- DISPLAY COMMAND ON
//*                       OPT=Y  <- DISPLAY COMMAND DELETE
//*--------------------------------------------------------------------
//COBOL1   EXEC JZBDONLC,MBR=DIIKA11,PROJ=KII,OPT=N