//TKIP165B JOB (GP1BEN,BP1A),CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID          JOB04934
//*-------------------------------------------------------------------- 00020100
//*             JZBDONLC  ONLINE NORMAL COMPILE                         00020200
//*             JZBDONLD  ONLINE DEBUG  COMPILE                         00020300
//*                       OPT=N  <- DISPLAY COMMAND ON                  00020600
//*                       OPT=Y  <- DISPLAY COMMAND DELETE              00020700
//*-------------------------------------------------------------------- 00020800
//COBOL1   EXEC JZBDBATC,MBR=BIP0021,PROJ=KIP,OPT=N                     00020900