      *================================================================*
      *@ NAME : NJL04026                                               *
      *@ DESC : 포괄신용공여한도신청및승인결과조회                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-29 19:02:17                          *
      *  생성일시     : 2009-06-29 19:02:25                          *
      *================================================================*
      *--     처리구분
           07  NJL04026-PRCSS-DSTIC              PIC  X(002).
      *--     부점코드
           07  NJL04026-BRNCD                    PIC  X(004).
      *--     한도진행상태구분코드
           07  NJL04026-LIMT-P-STUS-DSTCD        PIC  X(001).
      *--     차주번호
           07  NJL04026-BRWR-NO                  PIC  X(013).
      *--     신청년월일1
           07  NJL04026-APLCN-YMD1               PIC  X(008).
      *--     신청년월일2
           07  NJL04026-APLCN-YMD2               PIC  X(008).
      *================================================================*
      *        N  J  L  0  4  0  2  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04026-PRCSS-DSTIC          ;처리구분
      *X  NJL04026-BRNCD                ;부점코드
      *X  NJL04026-LIMT-P-STUS-DSTCD    ;한도진행상태구분코드
      *X  NJL04026-BRWR-NO              ;차주번호
      *X  NJL04026-APLCN-YMD1           ;신청년월일1
      *X  NJL04026-APLCN-YMD2           ;신청년월일2
