      *================================================================*
      *@ NAME : NJL0409D                                               *
      *@ DESC : 기업및그룹한도신청및승인조회(승인서출력)           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-13 19:56:12                          *
      *  생성일시     : 2009-07-13 19:56:19                          *
      *================================================================*
      *--     처리구분
           07  NJL0409D-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL0409D-CUST-DSTIC               PIC  X(001).
      *--     차주번호
           07  NJL0409D-BRWR-NO                  PIC  X(013).
      *--     신청번호
           07  NJL0409D-APLCN-NO                 PIC  X(010).
      *--     한도신청구분
           07  NJL0409D-LIMT-APLCN-DSTIC         PIC  X(001).
      *================================================================*
      *        N  J  L  0  4  0  9  D    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL0409D-PRCSS-DSTIC          ;처리구분
      *X  NJL0409D-CUST-DSTIC           ;고객구분
      *X  NJL0409D-BRWR-NO              ;차주번호
      *X  NJL0409D-APLCN-NO             ;신청번호
      *X  NJL0409D-LIMT-APLCN-DSTIC     ;한도신청구분
