      *================================================================*
      *@ NAME : NJL04013                                               *
      *@ DESC : 과목별TE현황조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-15 10:47:58                          *
      *  생성일시     : 2009-07-15 10:48:07                          *
      *================================================================*
      *--     처리구분
           07  NJL04013-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  NJL04013-BRWR-NO                  PIC  X(013).
      *--     기준년월일
           07  NJL04013-BASE-YMD                 PIC  X(008).
      *================================================================*
      *        N  J  L  0  4  0  1  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04013-PRCSS-DSTIC          ;처리구분
      *X  NJL04013-BRWR-NO              ;차주번호
      *X  NJL04013-BASE-YMD             ;기준년월일
