      *================================================================*
      *@ NAME : NJL04033                                               *
      *@ DESC : 동일차주별신용공여조회                               *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-10-07 17:01:35                          *
      *  생성일시     : 2009-10-07 17:01:48                          *
      *================================================================*
      *--     처리구분
           07  NJL04033-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  NJL04033-BASE-YM                  PIC  X(006).
      *--     조회구분
           07  NJL04033-INQURY-DSTIC             PIC  X(001).
      *================================================================*
      *        N  J  L  0  4  0  3  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04033-PRCSS-DSTIC          ;처리구분
      *X  NJL04033-BASE-YM              ;기준년월
      *X  NJL04033-INQURY-DSTIC         ;조회구분
