      *================================================================*
      *@ NAME : NJL0409E                                               *
      *@ DESC : 기업및그룹한도신청및승인조회(결의록조회)           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-06-18 22:24:56                          *
      *  생성일시     : 2020-06-18 22:25:02                          *
      *  전체길이     : 00000023 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL0409E-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL0409E-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  NJL0409E-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  NJL0409E-APLCN-NO                 PIC  X(010).
      *================================================================*
      *        N  J  L  0  4  0  9  E    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL0409E-PRCSS-DSTIC          ;처리구분
      *X  NJL0409E-CUST-DSTIC           ;고객구분
      *X  NJL0409E-KB-PIN               ;KB-PIN
      *X  NJL0409E-APLCN-NO             ;신청번호
