      *================================================================*
      *@ NAME : NJL04093                                               *
      *@ DESC : 기업및그룹한도신청및승인(개별그룹기준한도산출)     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2021-11-26 17:19:15                          *
      *  생성일시     : 2021-11-26 17:19:20                          *
      *  전체길이     : 00000578 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL04093-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL04093-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  NJL04093-KB-PIN                   PIC  X(010).
      *--     수정신용등급
           07  NJL04093-AMND-CRDRAT              PIC  X(004).
      *--     수정TE산업분류코드
           07  NJL04093-AMND-TI-CLSFI-CD         PIC  X(003).
      *--     수정신용등급별지원비율
           07  NJL04093-AMND-CP-SPORT-RATO       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년영업이익
           07  NJL04093-AMND-BF-PYY-OPRFT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년영업이익
           07  NJL04093-AMND-PYY-OPRFT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정영업이익
           07  NJL04093-AMND-OPRFT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전전년수입이자
           07  NJL04093-AMND-BP-IMPRT-INT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년수입이자
           07  NJL04093-AMND-PYY-IMPRT-INT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정수입이자
           07  NJL04093-AMND-IMPRT-INT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전전년감가상각비
           07  NJL04093-AMND-B-PYY-DPRC-CST      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년감가상각비
           07  NJL04093-AMND-PYY-DPRC-CST        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정감가상각비
           07  NJL04093-AMND-DPRC-CST            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전전년금융비용
           07  NJL04093-AMND-BF-PYY-FNCS         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년금융비용
           07  NJL04093-AMND-PYY-FNCS            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정금융비용
           07  NJL04093-AMND-FNCS                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전전년단기차입금
           07  NJL04093-AMND-BP-SHTRM-AMBR       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년단기차입금
           07  NJL04093-AMND-PYY-SHTRM-AMBR      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정단기차입금
           07  NJL04093-AMND-SHTRM-AMBR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정가중평균이자율
           07  NJL04093-AMND-WGHTG-AVG-IRT       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년금융총비용비율
           07  NJL04093-AMND-BPFT-CST-RATO       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전년금융총비용비율
           07  NJL04093-AMND-PFT-CST-RATO        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정금융총비용비율
           07  NJL04093-AMND-FTZ-CST-RATO        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년자기자본금
           07  NJL04093-AMND-B-PYY-ONCP-AMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년자기자본금
           07  NJL04093-AMND-PYY-ONCP-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정자기자본
           07  NJL04093-AMND-ONCP                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정자기자본산업적용비율
           07  NJL04093-AMND-OI-APLY-RATO        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정차입금자기자본율
           07  NJL04093-AMND-AMBR-ONCP-RT        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년업체총차입금
           07  NJL04093-AMND-BPE-TOTAL-AMBR      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년업체총차입금
           07  NJL04093-AMND-PE-TOTAL-AMBR       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정총차입금
           07  NJL04093-AMND-TOTAL-AMBR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전전년매출액
           07  NJL04093-AMND-BF-PYY-SALEPR       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년매출액
           07  NJL04093-AMND-PYY-SALEPR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정매출액
           07  NJL04093-AMND-SALEPR              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정매출액산업적용비율
           07  NJL04093-AMND-SI-APLY-RATO        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년매출채권회전률
           07  NJL04093-AMND-BPAB-ROTAT-RT       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전년매출채권회전비율
           07  NJL04093-AMND-PAB-ROTAT-RATO      PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정매출채권회전비율
           07  NJL04093-AMND-AB-ROTAT-RATO       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정기준전전년총자산
           07  NJL04093-AMND-BBP-TOTAL-ASST      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정기준전년총자산
           07  NJL04093-AMND-BP-TOTAL-ASST       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정총자산
           07  NJL04093-AMND-TOTAL-ASST          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정총자산산업적용비율
           07  NJL04093-AMND-TAI-APLY-RATO       PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정차입금총자산비율
           07  NJL04093-AMND-AT-ASST-RATO        PIC S9(003)V9(02)
                                                 LEADING  SEPARATE.
      *--     수정전전년현금성자산금액
           07  NJL04093-AMND-BPCI-ASAM           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정전년현금성자산금액
           07  NJL04093-AMND-PC-INCLIN-ASAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정현금성자산금액
           07  NJL04093-AMND-C-INCLIN-ASAM       PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        N  J  L  0  4  0  9  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04093-PRCSS-DSTIC          ;처리구분
      *X  NJL04093-CUST-DSTIC           ;고객구분
      *X  NJL04093-KB-PIN               ;KB-PIN
      *X  NJL04093-AMND-CRDRAT          ;수정신용등급
      *X  NJL04093-AMND-TI-CLSFI-CD     ;수정TE산업분류코드
      *S  NJL04093-AMND-CP-SPORT-RATO   ;수정신용등급별지원비율
      *S  NJL04093-AMND-BF-PYY-OPRFT    ;수정전전년영업이익
      *S  NJL04093-AMND-PYY-OPRFT       ;수정전년영업이익
      *S  NJL04093-AMND-OPRFT           ;수정영업이익
      *S  NJL04093-AMND-BP-IMPRT-INT    ;수정전전년수입이자
      *S  NJL04093-AMND-PYY-IMPRT-INT   ;수정전년수입이자
      *S  NJL04093-AMND-IMPRT-INT       ;수정수입이자
      *S  NJL04093-AMND-B-PYY-DPRC-CST  ;수정전전년감가상각비
      *S  NJL04093-AMND-PYY-DPRC-CST    ;수정전년감가상각비
      *S  NJL04093-AMND-DPRC-CST        ;수정감가상각비
      *S  NJL04093-AMND-BF-PYY-FNCS     ;수정전전년금융비용
      *S  NJL04093-AMND-PYY-FNCS        ;수정전년금융비용
      *S  NJL04093-AMND-FNCS            ;수정금융비용
      *S  NJL04093-AMND-BP-SHTRM-AMBR   ;수정전전년단기차입금
      *S  NJL04093-AMND-PYY-SHTRM-AMBR  ;수정전년단기차입금
      *S  NJL04093-AMND-SHTRM-AMBR      ;수정단기차입금
      *S  NJL04093-AMND-WGHTG-AVG-IRT   ;수정가중평균이자율
      *S  NJL04093-AMND-BPFT-CST-RATO
      * 수정전전년금융총비용비율
      *S  NJL04093-AMND-PFT-CST-RATO    ;수정전년금융총비용비율
      *S  NJL04093-AMND-FTZ-CST-RATO    ;수정금융총비용비율
      *S  NJL04093-AMND-B-PYY-ONCP-AMT  ;수정전전년자기자본금
      *S  NJL04093-AMND-PYY-ONCP-AMT    ;수정전년자기자본금
      *S  NJL04093-AMND-ONCP            ;수정자기자본
      *S  NJL04093-AMND-OI-APLY-RATO
      * 수정자기자본산업적용비율
      *S  NJL04093-AMND-AMBR-ONCP-RT    ;수정차입금자기자본율
      *S  NJL04093-AMND-BPE-TOTAL-AMBR
      * 수정전전년업체총차입금
      *S  NJL04093-AMND-PE-TOTAL-AMBR   ;수정전년업체총차입금
      *S  NJL04093-AMND-TOTAL-AMBR      ;수정총차입금
      *S  NJL04093-AMND-BF-PYY-SALEPR   ;수정전전년매출액
      *S  NJL04093-AMND-PYY-SALEPR      ;수정전년매출액
      *S  NJL04093-AMND-SALEPR          ;수정매출액
      *S  NJL04093-AMND-SI-APLY-RATO    ;수정매출액산업적용비율
      *S  NJL04093-AMND-BPAB-ROTAT-RT
      * 수정전전년매출채권회전률
      *S  NJL04093-AMND-PAB-ROTAT-RATO
      * 수정전년매출채권회전비율
      *S  NJL04093-AMND-AB-ROTAT-RATO   ;수정매출채권회전비율
      *S  NJL04093-AMND-BBP-TOTAL-ASST  ;수정기준전전년총자산
      *S  NJL04093-AMND-BP-TOTAL-ASST   ;수정기준전년총자산
      *S  NJL04093-AMND-TOTAL-ASST      ;수정총자산
      *S  NJL04093-AMND-TAI-APLY-RATO   ;수정총자산산업적용비율
      *S  NJL04093-AMND-AT-ASST-RATO    ;수정차입금총자산비율
      *S  NJL04093-AMND-BPCI-ASAM       ;수정전전년현금성자산금액
      *S  NJL04093-AMND-PC-INCLIN-ASAM
      * 수정전년현금성자산금액
      *S  NJL04093-AMND-C-INCLIN-ASAM   ;수정현금성자산금액
