      *================================================================*
      *@ NAME : NJL04006                                               *
      *@ DESC : Exposure총괄조회                                     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-09 13:27:26                          *
      *  생성일시     : 2009-04-09 13:27:32                          *
      *================================================================*
      *--     처리구분
           07  NJL04006-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  NJL04006-BRWR-NO                  PIC  X(013).
      *--     기준년월일
           07  NJL04006-BASE-YMD                 PIC  X(008).
      *================================================================*
      *        N  J  L  0  4  0  0  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04006-PRCSS-DSTIC          ;처리구분
      *X  NJL04006-BRWR-NO              ;차주번호
      *X  NJL04006-BASE-YMD             ;기준년월일
