      *================================================================*
      *@ NAME : NJL04015                                               *
      *@ DESC : 그룹별TE현황조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-09-17 14:33:31                          *
      *  생성일시     : 2009-09-17 14:33:36                          *
      *================================================================*
      *--     처리구분
           07  NJL04015-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월일
           07  NJL04015-BASE-YMD                 PIC  X(008).
      *--     그룹등급
           07  NJL04015-GROUP-GRD                PIC  X(003).
      *--     그룹순위1
           07  NJL04015-GROUP-RANKG1             PIC  9(003).
      *--     그룹순위2
           07  NJL04015-GROUP-RANKG2             PIC  9(003).
      *--     관리한도금액1
           07  NJL04015-MGT-CLAM1                PIC  9(007).
      *--     관리한도금액2
           07  NJL04015-MGT-CLAM2                PIC  9(007).
      *================================================================*
      *        N  J  L  0  4  0  1  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04015-PRCSS-DSTIC          ;처리구분
      *X  NJL04015-BASE-YMD             ;기준년월일
      *X  NJL04015-GROUP-GRD            ;그룹등급
      *N  NJL04015-GROUP-RANKG1         ;그룹순위1
      *N  NJL04015-GROUP-RANKG2         ;그룹순위2
      *N  NJL04015-MGT-CLAM1            ;관리한도금액1
      *N  NJL04015-MGT-CLAM2            ;관리한도금액2
