      *================================================================*
      *@ NAME : NJL04091                                               *
      *@ DESC : 기업및그룹한도신청및승인조회(최종설정현황조회)     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-23 11:18:56                          *
      *  생성일시     : 2009-04-23 11:19:01                          *
      *================================================================*
      *--     처리구분
           07  NJL04091-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL04091-CUST-DSTIC               PIC  X(001).
      *--     차주번호
           07  NJL04091-BRWR-NO                  PIC  X(013).
      *--     신청번호
           07  NJL04091-APLCN-NO                 PIC  X(010).
      *================================================================*
      *        N  J  L  0  4  0  9  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04091-PRCSS-DSTIC          ;처리구분
      *X  NJL04091-CUST-DSTIC           ;고객구분
      *X  NJL04091-BRWR-NO              ;차주번호
      *X  NJL04091-APLCN-NO             ;신청번호
