      *================================================================*
      *@ NAME : NJL04115                                               *
      *@ DESC : EAD개별그룹TotalExposure현황조회                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-11-06 15:15:39                          *
      *  생성일시     : 2024-11-06 15:15:41                          *
      *  전체길이     : 00000049 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL04115-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월일
           07  NJL04115-BASE-YMD                 PIC  X(008).
      *--     그룹순위1
           07  NJL04115-GROUP-RANKG1             PIC  9(003).
      *--     그룹순위2
           07  NJL04115-GROUP-RANKG2             PIC  9(003).
      *--     그룹등급
           07  NJL04115-GROUP-GRD                PIC  X(003).
      *--     관리한도1
           07  NJL04115-MGT-CLAM1                PIC  9(015).
      *--     관리한도2
           07  NJL04115-MGT-CLAM2                PIC  9(015).
      *================================================================*
      *        N  J  L  0  4  1  1  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04115-PRCSS-DSTIC          ;처리구분
      *X  NJL04115-BASE-YMD             ;기준년월일
      *N  NJL04115-GROUP-RANKG1         ;그룹순위1
      *N  NJL04115-GROUP-RANKG2         ;그룹순위2
      *X  NJL04115-GROUP-GRD            ;그룹등급
      *N  NJL04115-MGT-CLAM1            ;관리한도1
      *N  NJL04115-MGT-CLAM2            ;관리한도2
