      *================================================================*
      *@ NAME : NJL04031                                               *
      *@ DESC : 한도초과대상조회                                     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-16 16:56:50                          *
      *  생성일시     : 2009-04-16 16:56:55                          *
      *================================================================*
      *--     처리구분
           07  NJL04031-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월일
           07  NJL04031-BASE-YMD                 PIC  X(008).
      *--     한도구분코드
           07  NJL04031-LIMT-DSTCD               PIC  X(001).
      *================================================================*
      *        N  J  L  0  4  0  3  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04031-PRCSS-DSTIC          ;처리구분
      *X  NJL04031-BASE-YMD             ;기준년월일
      *X  NJL04031-LIMT-DSTCD           ;한도구분코드
