      *================================================================*
      *@ NAME : NJL0409A                                               *
      *@ DESC : 기업및그룹한도신청및승인조회(설정신청조회)         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-07-16 11:29:41                          *
      *  생성일시     : 2020-07-16 11:29:45                          *
      *  전체길이     : 00000024 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL0409A-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL0409A-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  NJL0409A-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  NJL0409A-APLCN-NO                 PIC  X(010).
      *--     한도신청구분
           07  NJL0409A-LIMT-APLCN-DSTIC         PIC  X(001).
      *================================================================*
      *        N  J  L  0  4  0  9  A    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL0409A-PRCSS-DSTIC          ;처리구분
      *X  NJL0409A-CUST-DSTIC           ;고객구분
      *X  NJL0409A-KB-PIN               ;KB-PIN
      *X  NJL0409A-APLCN-NO             ;신청번호
      *X  NJL0409A-LIMT-APLCN-DSTIC     ;한도신청구분
