      *================================================================*
      *@ NAME : NJL04002                                               *
      *@ DESC : 그룹코드및그룹명조회                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-08 18:14:44                          *
      *  생성일시     : 2009-06-08 18:14:49                          *
      *================================================================*
      *--     처리구분
           07  NJL04002-PRCSS-DSTIC              PIC  X(002).
      *--     계열적용구분코드
           07  NJL04002-AFFLT-APLY-DSTCD         PIC  X(001).
      *--     계열기업군코드
           07  NJL04002-AFFLT-CORP-GROUP-CD      PIC  X(006).
      *--     계열기업군명
           07  NJL04002-AFFLT-C-GROUP-NAME       PIC  X(042).
      *================================================================*
      *        N  J  L  0  4  0  0  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04002-PRCSS-DSTIC          ;처리구분
      *X  NJL04002-AFFLT-APLY-DSTCD     ;계열적용구분코드
      *X  NJL04002-AFFLT-CORP-GROUP-CD  ;계열기업군코드
      *X  NJL04002-AFFLT-C-GROUP-NAME   ;계열기업군명
