      *================================================================*
      *@ NAME : NJL04012                                               *
      *@ DESC : 계좌별TE현황조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-26 14:44:42                          *
      *  생성일시     : 2009-11-26 14:44:50                          *
      *================================================================*
      *--     처리구분
           07  NJL04012-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  NJL04012-BRWR-NO                  PIC  X(013).
      *--     기준년월일
           07  NJL04012-BASE-YMD                 PIC  X(008).
      *================================================================*
      *        N  J  L  0  4  0  1  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL04012-PRCSS-DSTIC          ;처리구분
      *X  NJL04012-BRWR-NO              ;차주번호
      *X  NJL04012-BASE-YMD             ;기준년월일
