      *================================================================*
      *@ NAME : NJL11093                                               *
      *@ DESC : 기업및그룹한도신청및승인(설정신청저장)             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-07-16 09:20:03                          *
      *  생성일시     : 2020-07-16 09:20:08                          *
      *  전체길이     : 00001872 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11093-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  NJL11093-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  NJL11093-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  NJL11093-APLCN-NO                 PIC  X(010).
      *--     한도신청구분
           07  NJL11093-LIMT-APLCN-DSTIC         PIC  X(001).
      *--     대표자명
           07  NJL11093-RPRS-NAME                PIC  X(052).
      *--     기업신용등급
           07  NJL11093-CORP-CRDRAT              PIC  X(004).
      *--     표준산업분류코드
           07  NJL11093-STND-I-CLSFI-CD          PIC  X(005).
      *--     그룹명
           07  NJL11093-GROUP-NAME               PIC  X(042).
      *--     그룹등급
           07  NJL11093-GROUP-GRD                PIC  X(004).
      *--     영업점코드
           07  NJL11093-BBRN-CD                  PIC  X(004).
      *--     직원번호
           07  NJL11093-EMPID                    PIC  X(007).
      *--     개별기업관리한도
           07  NJL11093-IDIVI-CORP-MGT-LIMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     개별기업익스포져
           07  NJL11093-IDIVI-CORP-EXPSR         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그룹관리한도
           07  NJL11093-GROUP-MGT-LIMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그룹익스포져
           07  NJL11093-GROUP-EXPSR              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     변경전여신성관리한도
           07  NJL11093-MODFI-BLI-MGT-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     변경전시장성관리한도
           07  NJL11093-MODFI-BM-MGT-LIMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     변경후여신성관리한도
           07  NJL11093-MODFI-ALI-MGT-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     변경후시장성관리한도
           07  NJL11093-MODFI-AM-MGT-LIMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     신청사유
           07  NJL11093-APLCN-RESN               PIC  X(0001602).
      *================================================================*
      *        N  J  L  1  1  0  9  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11093-PRCSS-DSTIC          ;처리구분
      *X  NJL11093-CUST-DSTIC           ;고객구분
      *X  NJL11093-KB-PIN               ;KB-PIN
      *X  NJL11093-APLCN-NO             ;신청번호
      *X  NJL11093-LIMT-APLCN-DSTIC     ;한도신청구분
      *X  NJL11093-RPRS-NAME            ;대표자명
      *X  NJL11093-CORP-CRDRAT          ;기업신용등급
      *X  NJL11093-STND-I-CLSFI-CD      ;표준산업분류코드
      *X  NJL11093-GROUP-NAME           ;그룹명
      *X  NJL11093-GROUP-GRD            ;그룹등급
      *X  NJL11093-BBRN-CD              ;영업점코드
      *X  NJL11093-EMPID                ;직원번호
      *S  NJL11093-IDIVI-CORP-MGT-LIMT  ;개별기업관리한도
      *S  NJL11093-IDIVI-CORP-EXPSR     ;개별기업익스포져
      *S  NJL11093-GROUP-MGT-LIMT       ;그룹관리한도
      *S  NJL11093-GROUP-EXPSR          ;그룹익스포져
      *S  NJL11093-MODFI-BLI-MGT-LIMT   ;변경전여신성관리한도
      *S  NJL11093-MODFI-BM-MGT-LIMT    ;변경전시장성관리한도
      *S  NJL11093-MODFI-ALI-MGT-LIMT   ;변경후여신성관리한도
      *S  NJL11093-MODFI-AM-MGT-LIMT    ;변경후시장성관리한도
      *X  NJL11093-APLCN-RESN           ;신청사유
