      *================================================================*
      *@ NAME : NJL11130                                               *
      *@ DESC : 간접상품정보원장조회                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-10-11 15:50:58                          *
      *  생성일시     : 2019-10-11 15:51:07                          *
      *  전체길이     : 00000231 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11130-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  NJL11130-BASE-YM                  PIC  X(006).
      *--     상품코드
           07  NJL11130-PRDCT-CD                 PIC  X(012).
      *--     상품대분류코드
           07  NJL11130-PRDCT-LAG-CLSFI-CD       PIC  X(002).
      *--     상품중분류코드
           07  NJL11130-PRDCT-MEDM-CLSFI-CD      PIC  X(002).
      *--     상품템플릿코드
           07  NJL11130-PRDCT-TMPLT-CD           PIC  X(003).
      *--     상품번호
           07  NJL11130-PRDCT-NO                 PIC  X(005).
      *--     간접중분류구분
           07  NJL11130-INDR-M-CLSFI-DSTCD       PIC  X(002).
      *--     간접중분류구분명
           07  NJL11130-INDR-MC-DSTCD-NAME       PIC  X(042).
      *--     간접상품명
           07  NJL11130-INDR-PRDCT-NAME          PIC  X(152).
      *--     간접TE환산율
           07  NJL11130-INDR-TE-UTCRT            PIC  9(003).
      *================================================================*
      *        N  J  L  1  1  1  3  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11130-PRCSS-DSTIC          ;처리구분
      *X  NJL11130-BASE-YM              ;기준년월
      *X  NJL11130-PRDCT-CD             ;상품코드
      *X  NJL11130-PRDCT-LAG-CLSFI-CD   ;상품대분류코드
      *X  NJL11130-PRDCT-MEDM-CLSFI-CD  ;상품중분류코드
      *X  NJL11130-PRDCT-TMPLT-CD       ;상품템플릿코드
      *X  NJL11130-PRDCT-NO             ;상품번호
      *X  NJL11130-INDR-M-CLSFI-DSTCD   ;간접중분류구분
      *X  NJL11130-INDR-MC-DSTCD-NAME   ;간접중분류구분명
      *X  NJL11130-INDR-PRDCT-NAME      ;간접상품명
      *N  NJL11130-INDR-TE-UTCRT        ;간접TE환산율
