      *================================================================*
      *@ NAME : NJL11064                                               *
      *@ DESC : TE변경고객정보관리                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2018-04-10 14:20:37                          *
      *  생성일시     : 2018-04-10 14:20:41                          *
      *  전체길이     : 00000019 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11064-PRCSS-DSTIC              PIC  X(002).
      *--     KB-PIN
           07  NJL11064-KB-PIN                   PIC  X(010).
      *--     신표준산업분류코드
           07  NJL11064-NEW-SI-CLSFI-CD          PIC  X(005).
      *--     한신평재무업종구분코드
           07  NJL11064-KIS-F-BZTYP-DSTCD        PIC  X(002).
      *================================================================*
      *        N  J  L  1  1  0  6  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11064-PRCSS-DSTIC          ;처리구분
      *X  NJL11064-KB-PIN               ;KB-PIN
      *X  NJL11064-NEW-SI-CLSFI-CD      ;신표준산업분류코드
      *X  NJL11064-KIS-F-BZTYP-DSTCD    ;한신평재무업종구분코드
