      *================================================================*
      *@ NAME : NJL11274                                               *
      *@ DESC : 포괄신용공여한도승인저장                             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2023-09-19 15:26:43                          *
      *  생성일시     : 2023-09-19 15:26:46                          *
      *  전체길이     : 00000753 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11274-PRCSS-DSTIC              PIC  X(002).
      *--     KB-PIN
           07  NJL11274-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  NJL11274-APLCN-NO                 PIC  X(010).
      *--     신청직원번호
           07  NJL11274-APLCN-EMPID              PIC  X(007).
      *--     승인년월일
           07  NJL11274-ATHOR-YMD                PIC  X(008).
      *--     한도승인금액
           07  NJL11274-LIMT-ATHOR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도승인권자구분
           07  NJL11274-LIMT-ATRZ-DSTCD          PIC  X(001).
      *--     한도설정유효년월일
           07  NJL11274-LIMT-STUP-VALD-YMD       PIC  X(008).
      *--     한도승인구분코드
           07  NJL11274-LIMT-ATHOR-DSTCD         PIC  X(001).
      *--     승인사유내용
           07  NJL11274-ATHOR-RESN-CTNT          PIC  X(302).
      *--     한도신청종류구분
           07  NJL11274-LIMT-A-KND-DSTCD         PIC  X(001).
      *--     첨부파일일련번호
           07  NJL11274-APNDX-FILE-SERNO         PIC  9(003).
      *--     첨부파일식별자
           07  NJL11274-APNDX-FILE-IDNFR         PIC  X(040).
      *--     첨부파일내용
           07  NJL11274-APNDX-FILE-CTNT          PIC  X(172).
      *--     첨부파일명
           07  NJL11274-APNDX-FILE-NAME          PIC  X(172).
      *================================================================*
      *        N  J  L  1  1  2  7  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11274-PRCSS-DSTIC          ;처리구분
      *X  NJL11274-KB-PIN               ;KB-PIN
      *X  NJL11274-APLCN-NO             ;신청번호
      *X  NJL11274-APLCN-EMPID          ;신청직원번호
      *X  NJL11274-ATHOR-YMD            ;승인년월일
      *S  NJL11274-LIMT-ATHOR-AMT       ;한도승인금액
      *X  NJL11274-LIMT-ATRZ-DSTCD      ;한도승인권자구분
      *X  NJL11274-LIMT-STUP-VALD-YMD   ;한도설정유효년월일
      *X  NJL11274-LIMT-ATHOR-DSTCD     ;한도승인구분코드
      *X  NJL11274-ATHOR-RESN-CTNT      ;승인사유내용
      *X  NJL11274-LIMT-A-KND-DSTCD     ;한도신청종류구분
      *N  NJL11274-APNDX-FILE-SERNO     ;첨부파일일련번호
      *X  NJL11274-APNDX-FILE-IDNFR     ;첨부파일식별자
      *X  NJL11274-APNDX-FILE-CTNT      ;첨부파일내용
      *X  NJL11274-APNDX-FILE-NAME      ;첨부파일명
