      *================================================================*
      *@ NAME : NJL11038                                               *
      *@ DESC : 자회사및대주주등록                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-17 20:24:48                          *
      *  생성일시     : 2009-07-17 20:25:02                          *
      *================================================================*
      *--     처리구분
           07  NJL11038-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  NJL11038-BRWR-NO                  PIC  X(013).
      *--     자회사대주주구분코드
           07  NJL11038-SBCO-L-SKHDR-DSTCD       PIC  X(001).
      *--     대주주출자금액
           07  NJL11038-LAG-SKHDR-AMFN           PIC  9(015).
      *================================================================*
      *        N  J  L  1  1  0  3  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11038-PRCSS-DSTIC          ;처리구분
      *X  NJL11038-BRWR-NO              ;차주번호
      *X  NJL11038-SBCO-L-SKHDR-DSTCD   ;자회사대주주구분코드
      *N  NJL11038-LAG-SKHDR-AMFN       ;대주주출자금액
