      *================================================================*
      *@ NAME : NJL11081                                               *
      *@ DESC : AS신용공여이사회승인내역등록                         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-04-16 14:43:32                          *
      *  생성일시     : 2024-04-16 14:43:35                          *
      *  전체길이     : 00000212 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11081-PRCSS-DSTIC              PIC  X(002).
      *--     고객식별자
           07  NJL11081-CUST-IDNFR               PIC  X(010).
      *--     신용공여중분류코드
           07  NJL11081-GRCR-MIDL-CLSFI-CD       PIC  X(003).
      *--     통화코드
           07  NJL11081-CNCYCD                   PIC  X(003).
      *--     이사회승인금액
           07  NJL11081-BRDC-ATHOR-AMT           PIC  9(018).
      *--     소관부점코드
           07  NJL11081-JRSDZ-BRNCD              PIC  X(004).
      *--     이사회승인년월일
           07  NJL11081-BRDC-ATHOR-YMD           PIC  X(008).
      *--     이사회승인유효년월일
           07  NJL11081-BRDC-ATHOR-VALD-YMD      PIC  X(008).
      *--     비고
           07  NJL11081-RMARK                    PIC  X(102).
      *--     이사회승인번호
           07  NJL11081-BRDC-ATHOR-NO            PIC  X(010).
      *--     이사회승인금리내용
           07  NJL11081-BRDC-ATHOR-IRT-CTNT      PIC  X(044).
      *================================================================*
      *        N  J  L  1  1  0  8  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11081-PRCSS-DSTIC          ;처리구분
      *X  NJL11081-CUST-IDNFR           ;고객식별자
      *X  NJL11081-GRCR-MIDL-CLSFI-CD   ;신용공여중분류코드
      *X  NJL11081-CNCYCD               ;통화코드
      *N  NJL11081-BRDC-ATHOR-AMT       ;이사회승인금액
      *X  NJL11081-JRSDZ-BRNCD          ;소관부점코드
      *X  NJL11081-BRDC-ATHOR-YMD       ;이사회승인년월일
      *X  NJL11081-BRDC-ATHOR-VALD-YMD  ;이사회승인유효년월일
      *X  NJL11081-RMARK                ;비고
      *X  NJL11081-BRDC-ATHOR-NO        ;이사회승인번호
      *X  NJL11081-BRDC-ATHOR-IRT-CTNT  ;이사회승인금리내용
