      *================================================================*
      *@ NAME : NJL11020                                               *
      *@ DESC : 상품정보원장                                         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-12-04 14:34:39                          *
      *  생성일시     : 2009-12-04 14:34:45                          *
      *================================================================*
      *--     처리구분
           07  NJL11020-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  NJL11020-BASE-YM                  PIC  X(006).
      *--     회계구분코드
           07  NJL11020-ACCTG-DSTCD              PIC  X(001).
      *--     상품대분류코드
           07  NJL11020-PRDCT-LAG-CLSFI-CD       PIC  X(002).
      *--     상품중분류코드
           07  NJL11020-PRDCT-MEDM-CLSFI-CD      PIC  X(002).
      *--     상품템플릿코드
           07  NJL11020-PRDCT-TMPLT-CD           PIC  X(003).
      *--     상품번호
           07  NJL11020-PRDCT-NO                 PIC  X(005).
      *--     상품명
           07  NJL11020-PRDCT-NAME               PIC  X(042).
      *--     토탈익스포져자산구분코드
           07  NJL11020-TE-ASST-DSTCD            PIC  X(001).
      *--     토탈익스포져환산율
           07  NJL11020-TE-UTCRT                 PIC  9(003).
      *--     토탈익스포져금융환산율
           07  NJL11020-TE-FINAC-UTCRT           PIC  9(003).
      *--     토탈익스포져중분류코드
           07  NJL11020-TE-MEDM-CLSFI-CD         PIC  X(003).
      *--     토탈익스포져중분류명
           07  NJL11020-TE-MEDM-CLSFI-NAME       PIC  X(042).
      *--     CA대상계정여부
           07  NJL11020-CA-TAGET-ACITM-YN        PIC  X(001).
      *--     CA중분류코드
           07  NJL11020-CA-MEDM-CLSFI-CD         PIC  X(003).
      *--     CA중분류명
           07  NJL11020-CA-MEDM-CLSFI-NAME       PIC  X(042).
      *--     신용공여한도환산율
           07  NJL11020-GRCR-LIMT-UTCRT          PIC  9(003).
      *--     포괄신용공여대상계정여부
           07  NJL11020-INLS-GT-ACITM-YN         PIC  X(001).
      *--     포괄신용공여환산율
           07  NJL11020-INLS-GRCR-UTCRT          PIC  9(003).
      *--     통합계정과목코드
           07  NJL11020-INTGRA-TIACC-CD          PIC  X(013).
      *================================================================*
      *        N  J  L  1  1  0  2  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11020-PRCSS-DSTIC          ;처리구분
      *X  NJL11020-BASE-YM              ;기준년월
      *X  NJL11020-ACCTG-DSTCD          ;회계구분코드
      *X  NJL11020-PRDCT-LAG-CLSFI-CD   ;상품대분류코드
      *X  NJL11020-PRDCT-MEDM-CLSFI-CD  ;상품중분류코드
      *X  NJL11020-PRDCT-TMPLT-CD       ;상품템플릿코드
      *X  NJL11020-PRDCT-NO             ;상품번호
      *X  NJL11020-PRDCT-NAME           ;상품명
      *X  NJL11020-TE-ASST-DSTCD        ;토탈익스포져자산구분코드
      *N  NJL11020-TE-UTCRT             ;토탈익스포져환산율
      *N  NJL11020-TE-FINAC-UTCRT       ;토탈익스포져금융환산율
      *X  NJL11020-TE-MEDM-CLSFI-CD     ;토탈익스포져중분류코드
      *X  NJL11020-TE-MEDM-CLSFI-NAME   ;토탈익스포져중분류명
      *X  NJL11020-CA-TAGET-ACITM-YN    ;CA대상계정여부
      *X  NJL11020-CA-MEDM-CLSFI-CD     ;CA중분류코드
      *X  NJL11020-CA-MEDM-CLSFI-NAME   ;CA중분류명
      *N  NJL11020-GRCR-LIMT-UTCRT      ;신용공여한도환산율
      *X  NJL11020-INLS-GT-ACITM-YN     ;포괄신용공여대상계정여부
      *N  NJL11020-INLS-GRCR-UTCRT      ;포괄신용공여환산율
      *X  NJL11020-INTGRA-TIACC-CD      ;통합계정과목코드
