      *================================================================*
      *@ NAME : NJL11028                                               *
      *@ DESC : 계열사등록                                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-03-18 19:48:34                          *
      *  생성일시     : 2009-03-18 19:48:39                          *
      *================================================================*
      *--     처리구분
           07  NJL11028-PRCSS-DSTIC              PIC  X(002).
      *--     계열적용구분코드
           07  NJL11028-AFFLT-APLY-DSTCD         PIC  X(001).
      *--     계열기업군코드
           07  NJL11028-AFFLT-C-GROUP-CD         PIC  X(006).
      *--     차주번호
           07  NJL11028-BRWR-NO                  PIC  X(013).
      *--     채무자명
           07  NJL11028-DBTR-NAME                PIC  X(042).
      *--     기업규모
           07  NJL11028-CORP-SCAL                PIC  X(001).
      *--     변경여부
           07  NJL11028-MODFI-YN                 PIC  X(001).
      *================================================================*
      *        N  J  L  1  1  0  2  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11028-PRCSS-DSTIC          ;처리구분
      *X  NJL11028-AFFLT-APLY-DSTCD     ;계열적용구분코드
      *X  NJL11028-AFFLT-C-GROUP-CD     ;계열기업군코드
      *X  NJL11028-BRWR-NO              ;차주번호
      *X  NJL11028-DBTR-NAME            ;채무자명
      *X  NJL11028-CORP-SCAL            ;기업규모
      *X  NJL11028-MODFI-YN             ;변경여부
