      *================================================================*
      *@ NAME : NJL11030                                               *
      *@ DESC : 계열그룹관리                                         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-30 10:24:53                          *
      *  생성일시     : 2009-06-30 10:25:03                          *
      *================================================================*
      *--     처리구분
           07  NJL11030-PRCSS-DSTIC              PIC  X(002).
      *--     계열적용구분코드
           07  NJL11030-AFFLT-APLY-DSTCD         PIC  X(001).
      *--     계열기업군코드
           07  NJL11030-AFFLT-CORP-GROUP-CD      PIC  X(006).
      *--     계열기업순위
           07  NJL11030-AFFLT-CORP-RANKG         PIC  9(003).
      *--     주채권은행코드
           07  NJL11030-MAIN-BND-BNK-CD          PIC  X(003).
      *--     계열기업군명
           07  NJL11030-AFFLT-C-GROUP-NAME       PIC  X(042).
      *--     내부신용평가등급구분코드
           07  NJL11030-INTNL-CV-GRD-DSTCD       PIC  X(004).
      *================================================================*
      *        N  J  L  1  1  0  3  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11030-PRCSS-DSTIC          ;처리구분
      *X  NJL11030-AFFLT-APLY-DSTCD     ;계열적용구분코드
      *X  NJL11030-AFFLT-CORP-GROUP-CD  ;계열기업군코드
      *N  NJL11030-AFFLT-CORP-RANKG     ;계열기업순위
      *X  NJL11030-MAIN-BND-BNK-CD      ;주채권은행코드
      *X  NJL11030-AFFLT-C-GROUP-NAME   ;계열기업군명
      *X  NJL11030-INTNL-CV-GRD-DSTCD
      * 내부신용평가등급구분코드
