      *================================================================*
      *@ NAME : NJL11041                                               *
      *@ DESC : 국가별정보관리                                       *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-02-14 15:25:50                          *
      *  생성일시     : 2020-02-14 15:25:54                          *
      *  전체길이     : 00000091 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11041-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  NJL11041-BASE-YM                  PIC  X(006).
      *--     ISO국가코드
           07  NJL11041-ISO-NATNL-CD             PIC  X(002).
      *--     영문국가명
           07  NJL11041-ENG-NATNL-NAME           PIC  X(052).
      *--     전체관리한도금액
           07  NJL11041-WHOL-MGT-CLAM            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     SNP등급구분코드
           07  NJL11041-SNP-GRD-DSTCD            PIC  X(002).
      *--     무디스등급구분코드
           07  NJL11041-MODYS-GRD-DSTCD          PIC  X(002).
      *--     피치등급구분코드
           07  NJL11041-FITCH-GRD-DSTCD          PIC  X(002).
      *--     당행국가신용등급구분
           07  NJL11041-OWBNK-NC-GRD-DSTCD       PIC  X(004).
      *--     한도관리지역구분
           07  NJL11041-LIMT-MGT-AREA-DSTCD      PIC  X(001).
      *--     국가전체공통한도여부
           07  NJL11041-NATNL-W-CMN-LIMT-YN      PIC  X(001).
      *--     국가위험수준구분
           07  NJL11041-NATNL-R-LVEL-DSTCD       PIC  X(001).
      *================================================================*
      *        N  J  L  1  1  0  4  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11041-PRCSS-DSTIC          ;처리구분
      *X  NJL11041-BASE-YM              ;기준년월
      *X  NJL11041-ISO-NATNL-CD         ;ISO국가코드
      *X  NJL11041-ENG-NATNL-NAME       ;영문국가명
      *S  NJL11041-WHOL-MGT-CLAM        ;전체관리한도금액
      *X  NJL11041-SNP-GRD-DSTCD        ;SNP등급구분코드
      *X  NJL11041-MODYS-GRD-DSTCD      ;무디스등급구분코드
      *X  NJL11041-FITCH-GRD-DSTCD      ;피치등급구분코드
      *X  NJL11041-OWBNK-NC-GRD-DSTCD   ;당행국가신용등급구분
      *X  NJL11041-LIMT-MGT-AREA-DSTCD  ;한도관리지역구분
      *X  NJL11041-NATNL-W-CMN-LIMT-YN  ;국가전체공통한도여부
      *X  NJL11041-NATNL-R-LVEL-DSTCD   ;국가위험수준구분
