      *================================================================*
      *@ NAME : NJL11087                                               *
      *@ DESC : AS외화타점예치Depo별대주주등록                     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-08-19 15:37:55                          *
      *  생성일시     : 2024-08-19 15:37:58                          *
      *  전체길이     : 00010207 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11087-PRCSS-DSTIC              PIC  X(002).
      *--     현재건수1
ROWCNT     07  NJL11087-PRSNT-NOITM1             PIC  9(005).
      *--     그리드1
           07  NJL11087-GRID1                    OCCURS 0 TO 000100
               DEPENDING ON NJL11087-PRSNT-NOITM1.
      *--       기준년월일
             09  NJL11087-BASE-YMD               PIC  X(008).
      *--       통화코드
             09  NJL11087-CNCYCD                 PIC  X(003).
      *--       거래은행BIC코드
             09  NJL11087-TRAN-BNK-BIC           PIC  X(011).
      *--       통합계정과목코드
             09  NJL11087-INTGRA-TIACC-CD        PIC  X(013).
      *--       외화잔액
             09  NJL11087-FC-BAL                 PIC  9(015)V9(03).
      *--       원화환산금액
             09  NJL11087-WONC-AUC               PIC  9(015)V9(03).
      *--       고객식별자
             09  NJL11087-CUST-IDNFR             PIC  X(010).
      *--       등록직원번호
             09  NJL11087-REGI-EMPID             PIC  X(007).
      *--       등록일시
             09  NJL11087-REGI-YMS               PIC  X(014).
      *================================================================*
      *        N  J  L  1  1  0  8  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11087-PRCSS-DSTIC          ;처리구분
      *L  NJL11087-PRSNT-NOITM1         ;현재건수1
      *A  NJL11087-GRID1                ;그리드1
      *X  NJL11087-BASE-YMD             ;기준년월일
      *X  NJL11087-CNCYCD               ;통화코드
      *X  NJL11087-TRAN-BNK-BIC         ;거래은행BIC코드
      *X  NJL11087-INTGRA-TIACC-CD      ;통합계정과목코드
      *N  NJL11087-FC-BAL               ;외화잔액
      *N  NJL11087-WONC-AUC             ;원화환산금액
      *X  NJL11087-CUST-IDNFR           ;고객식별자
      *X  NJL11087-REGI-EMPID           ;등록직원번호
      *X  NJL11087-REGI-YMS             ;등록일시
