      *================================================================*
      *@ NAME : NJL11140                                               *
      *@ DESC : 국별한도제외대상관리                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2021-01-28 13:45:12                          *
      *  생성일시     : 2021-01-28 13:45:15                          *
      *  전체길이     : 00000066 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11140-PRCSS-DSTIC              PIC  X(002).
      *--     고객식별자
           07  NJL11140-CUST-IDNFR               PIC  X(010).
      *--     제외사유
           07  NJL11140-ECLUD-RESN               PIC  X(002).
      *--     기타사유내용
           07  NJL11140-ETC-RESN-CTNT            PIC  X(052).
      *================================================================*
      *        N  J  L  1  1  1  4  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11140-PRCSS-DSTIC          ;처리구분
      *X  NJL11140-CUST-IDNFR           ;고객식별자
      *X  NJL11140-ECLUD-RESN           ;제외사유
      *X  NJL11140-ETC-RESN-CTNT        ;기타사유내용
