      *================================================================*
      *@ NAME : NJL11054                                               *
      *@ DESC : 산업별규모별SUB한도관리                            *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-12-20 14:31:43                          *
      *  생성일시     : 2019-12-20 14:31:47                          *
      *  전체길이     : 00000069 BYTES                               *
      *================================================================*
      *--     처리구분
           07  NJL11054-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  NJL11054-BASE-YM                  PIC  X(006).
      *--     대분류업종코드
           07  NJL11054-LAG-CLSFI-BZTYP-CD       PIC  X(003).
      *--     산업TE기업규모구분
           07  NJL11054-IDSTRY-TCS-DSTCD         PIC  X(001).
      *--     산업별규모별SUB한도
           07  NJL11054-IDSTRY-PSP-SUB-LIMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     국외산업규모한도
           07  NJL11054-ABRD-I-SCAL-LIMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     취급중단년월일
           07  NJL11054-HNDLN-DSCN-YMD           PIC  X(008).
      *--     취급기준1적용년월일
           07  NJL11054-HNDLN-B-1-APLY-YMD       PIC  X(008).
      *--     취급기준2적용년월일
           07  NJL11054-HNDLN-B-2-APLY-YMD       PIC  X(008).
      *--     조회여부
           07  NJL11054-INQURY-YN                PIC  X(001).
      *================================================================*
      *        N  J  L  1  1  0  5  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  NJL11054-PRCSS-DSTIC          ;처리구분
      *X  NJL11054-BASE-YM              ;기준년월
      *X  NJL11054-LAG-CLSFI-BZTYP-CD   ;대분류업종코드
      *X  NJL11054-IDSTRY-TCS-DSTCD     ;산업TE기업규모구분
      *S  NJL11054-IDSTRY-PSP-SUB-LIMT  ;산업별규모별SUB한도
      *S  NJL11054-ABRD-I-SCAL-LIMT     ;국외산업규모한도
      *X  NJL11054-HNDLN-DSCN-YMD       ;취급중단년월일
      *X  NJL11054-HNDLN-B-1-APLY-YMD   ;취급기준1적용년월일
      *X  NJL11054-HNDLN-B-2-APLY-YMD   ;취급기준2적용년월일
      *X  NJL11054-INQURY-YN            ;조회여부
