      *=================================================================
      *  테이블명      : THKJL0022(카드여신수보명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0022
      *  사용예        : 01  TKJL0022-KEY.
      *                      COPY  TKJL0022.
      *  최종변경일시  : 2010년01월23일17시05분55초
      *=================================================================
           03  TKJL0022-PK.
      *         그룹회사코드
            05 KJL0022-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준일
            05 KJL0022-PK-BASE-DD             PIC  X(00002).
      *         기준년월
            05 KJL0022-PK-BASE-YM             PIC  X(00006).
      *         차주번호
            05 KJL0022-PK-BRWR-NO             PIC  X(00013).
      *         차주번호구분
            05 KJL0022-PK-BRWR-NO-DSTCD       PIC  X(00001).
      *         카드여신식별자
            05 KJL0022-PK-CARD-LNBZ-IDNFR     PIC  X(00020).
      *         통합계정과목코드
            05 KJL0022-PK-INTGRA-TIACC-CD     PIC  X(00013).
      *=================================================================
      *  TKJL0022   C O P Y B O O K   E N D
      *=================================================================
