      *=================================================================
      *  테이블명      : THKJL0084(이사회승인내역월별현황 기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0084
      *  사용예        : 01  TKJL0084-KEY.
      *                      COPY  TKJL0084.
      *  최종변경일시  : 2024년04월29일16시29분28초
      *=================================================================
           03  TKJL0084-PK.
      *         그룹회사코드
            05 KJL0084-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0084-PK-BASE-YM             PIC  X(00006).
      *         이사회승인번호
            05 KJL0084-PK-BRDC-ATHOR-NO       PIC  X(00010).
      *=================================================================
      *  TKJL0084   C O P Y B O O K   E N D
      *=================================================================
