      *=================================================================
      *  테이블명      : THKJL0040(CA한도초과명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0040
      *  사용예        : 01  TKJL0040-KEY.
      *                      COPY  TKJL0040.
      *  최종변경일시  : 2017년02월03일13시55분58초
      *=================================================================
           03  TKJL0040-PK.
      *         그룹회사코드
            05 KJL0040-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0040-PK-BASE-YMD            PIC  X(00008).
      *         한도구분
            05 KJL0040-PK-LIMT-DSTCD          PIC  X(00001).
      *         고객식별자
            05 KJL0040-PK-CUST-IDNFR          PIC  X(00010).
      *=================================================================
      *  TKJL0040   C O P Y B O O K   E N D
      *=================================================================
