      *=================================================================
      *  테이블명      : THKJL0014(계열사기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0014
      *  사용예        : 01  TKJL0014-KEY.
      *                      COPY  TKJL0014.
      *  최종변경일시  : 2017년02월03일10시47분34초
      *=================================================================
           03  TKJL0014-PK.
      *         그룹회사코드
            05 KJL0014-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0014-PK-BASE-YM             PIC  X(00006).
      *         고객식별자
            05 KJL0014-PK-CUST-IDNFR          PIC  X(00010).
      *         계열적용구분
            05 KJL0014-PK-AFFLT-APLY-DSTCD    PIC  X(00001).
      *=================================================================
      *  TKJL0014   C O P Y B O O K   E N D
      *=================================================================
