      *=================================================================
      *  테이블명      : THKJL0049(TE자기자본기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0049
      *  사용예        : 01  TKJL0049-KEY.
      *                      COPY  TKJL0049.
      *  최종변경일시  : 2010년01월23일17시07분55초
      *=================================================================
           03  TKJL0049-PK.
      *         그룹회사코드
            05 KJL0049-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0049-PK-BASE-YM             PIC  X(00006).
      *         자기자본구분
            05 KJL0049-PK-ONCP-DSTCD          PIC  X(00001).
      *=================================================================
      *  TKJL0049   C O P Y B O O K   E N D
      *=================================================================
