      *=================================================================
      *  테이블명      : THKJL0048(기준한도업종별적용배수이력)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0048
      *  사용예        : 01  TKJL0048-KEY.
      *                      COPY  TKJL0048.
      *  최종변경일시  : 2010년01월23일17시07분50초
      *=================================================================
           03  TKJL0048-PK.
      *         그룹회사코드
            05 KJL0048-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준한도업종구분
            05 KJL0048-PK-BASE-L-BZTYP-DSTCD  PIC  X(00001).
      *         등록년월일
            05 KJL0048-PK-REGI-YMD            PIC  X(00008).
      *=================================================================
      *  TKJL0048   C O P Y B O O K   E N D
      *=================================================================
