      *=================================================================
      *  테이블명      : THKJL0152(토탈익스포져 고객기본 월정보관
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0152
      *  사용예        : 01  TKJL0152-KEY.
      *                      COPY  TKJL0152.
      *  최종변경일시  : 2017년02월03일15시53분13초
      *=================================================================
           03  TKJL0152-PK.
      *         그룹회사코드
            05 KJL0152-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0152-PK-BASE-YM             PIC  X(00006).
      *         고객식별자
            05 KJL0152-PK-CUST-IDNFR          PIC  X(00010).
      *=================================================================
      *  TKJL0152   C O P Y B O O K   E N D
      *=================================================================
