      *=================================================================
      *  테이블명      : THKJL0125(EAD차주일계좌명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0125
      *  사용예        : 01  TKJL0125-KEY.
      *                      COPY  TKJL0125.
      *  최종변경일시  : 2010년09월13일09시56분25초
      *=================================================================
           03  TKJL0125-PK.
      *         그룹회사코드
            05 KJL0125-PK-GROUP-CO-CD         PIC  X(00003).
      *         계좌번호
            05 KJL0125-PK-ACNO                PIC  X(00020).
      *         계좌중복일련번호
            05 KJL0125-PK-ACN-DUP-SERNO       PIC S9(00007) COMP-3.
      *         기준일
            05 KJL0125-PK-BASE-DD             PIC  X(00002).
      *         기준년월
            05 KJL0125-PK-BASE-YM             PIC  X(00006).
      *=================================================================
      *  TKJL0125   C O P Y B O O K   E N D
      *=================================================================
