      *=================================================================
      *  테이블명      : THKJL0065(산업별규모별SUB한도관리)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TKJL0065
      *  사용예        : 01  TKJL0065-KEY.
      *                      COPY  TKJL0065.
      *  최종변경일시  : 2011년06월16일17시08분06초
      *=================================================================
           03  TKJL0065-PK.
      *         그룹회사코드
            05 KJL0065-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0065-PK-BASE-YM             PIC  X(00006).
      *         대분류업종코드
            05 KJL0065-PK-LAG-CLSFI-BZTYP-CD  PIC  X(00003).
      *         산업TE기업규모구분
            05 KJL0065-PK-IDSTRY-TCS-DSTCD    PIC  X(00001).
      *=================================================================
      *  TKJL0065   C O P Y B O O K   E N D
      *=================================================================
