      *=================================================================
      *  테이블명      : THKJLR003(심사 미기표 여신현황 수보)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJLR003
      *  사용예        : 01  TKJLR003-KEY.
      *                      COPY  TKJLR003.
      *  최종변경일시  : 2017년11월23일14시23분33초
      *=================================================================
           03  TKJLR003-PK.
      *         그룹회사코드
            05 KJLR003-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJLR003-PK-BASE-YMD            PIC  X(00008).
      *         심사고객식별자
            05 KJLR003-PK-EXMTN-CUST-IDNFR    PIC  X(00010).
      *         여신승인신청번호
            05 KJLR003-PK-LNBZ-ATHOR-APLCN-NO PIC  X(00013).
      *         여신승인신청일련번호
            05 KJLR003-PK-LNBZ-A-APLCN-SERNO  PIC S9(00003) COMP-3.
      *=================================================================
      *  TKJLR003   C O P Y B O O K   E N D
      *=================================================================
