      *=================================================================
      *  테이블명      : THKJL0005(한도승인결의록관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0005
      *  사용예        : 01  TKJL0005-KEY.
      *                      COPY  TKJL0005.
      *  최종변경일시  : 2020년05월28일16시40분12초
      *=================================================================
           03  TKJL0005-PK.
      *         그룹회사코드
            05 KJL0005-PK-GROUP-CO-CD         PIC  X(00003).
      *         한도신청번호
            05 KJL0005-PK-LIMT-APLCN-NO       PIC  X(00010).
      *         승인위원직원번호
            05 KJL0005-PK-ATHOR-CMMB-EMPID    PIC  X(00007).
           03  TKJL0005-A1.
      *         그룹회사코드
            05 KJL0005-A1-GROUP-CO-CD         PIC  X(00003).
      *         한도신청번호
            05 KJL0005-A1-LIMT-APLCN-NO       PIC  X(00010).
      *=================================================================
      *  TKJL0005   C O P Y B O O K   E N D
      *=================================================================
