      *=================================================================
      *  테이블명      : THKJL0057(국별부점별신용공여집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0057
      *  사용예        : 01  TKJL0057-KEY.
      *                      COPY  TKJL0057.
      *  최종변경일시  : 2010년01월23일17시08분29초
      *=================================================================
           03  TKJL0057-PK.
      *         그룹회사코드
            05 KJL0057-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0057-PK-BASE-YMD            PIC  X(00008).
      *         관리부점코드
            05 KJL0057-PK-MGT-BRNCD           PIC  X(00004).
      *         ISO국가코드
            05 KJL0057-PK-ISO-NATNL-CD        PIC  X(00002).
      *=================================================================
      *  TKJL0057   C O P Y B O O K   E N D
      *=================================================================
