      *=================================================================
      *  테이블명      : THKJL0012(그룹관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0012
      *  사용예        : 01  TKJL0012-KEY.
      *                      COPY  TKJL0012.
      *  최종변경일시  : 2010년01월23일17시05분09초
      *=================================================================
           03  TKJL0012-PK.
      *         그룹회사코드
            05 KJL0012-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0012-PK-BASE-YM             PIC  X(00006).
      *         계열기업군코드
            05 KJL0012-PK-AFFLT-CORP-GROUP-CD PIC  X(00006).
      *=================================================================
      *  TKJL0012   C O P Y B O O K   E N D
      *=================================================================
