      *=================================================================
      *  테이블명      : THKJL0050(금융기관자기자본비율)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0050
      *  사용예        : 01  TKJL0050-KEY.
      *                      COPY  TKJL0050.
      *  최종변경일시  : 2010년01월23일17시07분59초
      *=================================================================
           03  TKJL0050-PK.
      *         그룹회사코드
            05 KJL0050-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0050-PK-BASE-YM             PIC  X(00006).
      *         한신평재무업종구분
            05 KJL0050-PK-KIS-F-BZTYP-DSTCD   PIC  X(00002).
      *=================================================================
      *  TKJL0050   C O P Y B O O K   E N D
      *=================================================================
