      *=================================================================
      *  테이블명      : THKJL0023(차주파생상품네팅비용)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0023
      *  사용예        : 01  TKJL0023-KEY.
      *                      COPY  TKJL0023.
      *  최종변경일시  : 2010년01월23일17시05분59초
      *=================================================================
           03  TKJL0023-PK.
      *         그룹회사코드
            05 KJL0023-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0023-PK-BASE-YMD            PIC  X(00008).
      *         차주번호
            05 KJL0023-PK-BRWR-NO             PIC  X(00013).
      *=================================================================
      *  TKJL0023   C O P Y B O O K   E N D
      *=================================================================
