      *=================================================================
      *  테이블명      : THKJL0073(신용공여월계좌정보)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TKJL0073
      *  사용예        : 01  TKJL0073-KEY.
      *                      COPY  TKJL0073.
      *  최종변경일시  : 2012년08월24일18시19분52초
      *=================================================================
           03  TKJL0073-PK.
      *         그룹회사코드
            05 KJL0073-PK-GROUP-CO-CD         PIC  X(00003).
      *         계좌번호
            05 KJL0073-PK-ACNO                PIC  X(00020).
      *         계좌중복일련번호
            05 KJL0073-PK-ACN-DUP-SERNO       PIC S9(00007) COMP-3.
      *         기준년월
            05 KJL0073-PK-BASE-YM             PIC  X(00006).
      *=================================================================
      *  TKJL0073   C O P Y B O O K   E N D
      *=================================================================
