      *=================================================================
      *  테이블명      : THKJLG001(그룹사고객정보제공통지)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TKJLG001
      *  사용예        : 01  TKJLG001-KEY.
      *                      COPY  TKJLG001.
      *  최종변경일시  : 2015년05월26일13시52분36초
      *=================================================================
           03  TKJLG001-PK.
      *         그룹회사코드
            05 KJLG001-PK-GROUP-CO-CD         PIC  X(00003).
      *         이용그룹회사코드
            05 KJLG001-PK-UTZN-GROUP-CO-CD    PIC  X(00003).
      *         고객식별자
            05 KJLG001-PK-CUST-IDNFR          PIC  X(00010).
      *         고객관리번호
            05 KJLG001-PK-CUST-MGT-NO         PIC  X(00005).
      *         제공번호
            05 KJLG001-PK-OFER-NO             PIC  X(00003).
      *         담당자번호
            05 KJLG001-PK-RSPBL-PSN-NO        PIC  X(00002).
      *         정보제공목적구분
            05 KJLG001-PK-INFO-O-OBJCTV-DSTCD PIC  X(00003).
      *         통지년월일
            05 KJLG001-PK-NOTI-YMD            PIC  X(00008).
      *=================================================================
      *  TKJLG001   C O P Y B O O K   E N D
      *=================================================================
