      *=================================================================
      *  테이블명      : THKJL0027(간접보증인일계좌명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0027
      *  사용예        : 01  TKJL0027-KEY.
      *                      COPY  TKJL0027.
      *  최종변경일시  : 2017년02월03일12시49분20초
      *=================================================================
           03  TKJL0027-PK.
      *         그룹회사코드
            05 KJL0027-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준일
            05 KJL0027-PK-BASE-DD             PIC  X(00002).
      *         기준년월
            05 KJL0027-PK-BASE-YM             PIC  X(00006).
      *         담보보증고객식별자
            05 KJL0027-PK-SCURTY-G-CUSZ-IDNFR PIC  X(00010).
      *         계약식별자
            05 KJL0027-PK-CTRC-IDNFR          PIC  X(00025).
      *=================================================================
      *  TKJL0027   C O P Y B O O K   E N D
      *=================================================================
