      *=================================================================
      *  테이블명      : THKJL0010(CP차주관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0010
      *  사용예        : 01  TKJL0010-KEY.
      *                      COPY  TKJL0010.
      *  최종변경일시  : 2017년02월03일10시41분58초
      *=================================================================
           03  TKJL0010-PK.
      *         그룹회사코드
            05 KJL0010-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0010-PK-BASE-YMD            PIC  X(00008).
      *         고객식별자
            05 KJL0010-PK-CUST-IDNFR          PIC  X(00010).
      *=================================================================
      *  TKJL0010   C O P Y B O O K   E N D
      *=================================================================
