      *=================================================================
      *  테이블명      : THKJL0126(EAD차주월계좌명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0126
      *  사용예        : 01  TKJL0126-KEY.
      *                      COPY  TKJL0126.
      *  최종변경일시  : 2010년09월13일09시57분03초
      *=================================================================
           03  TKJL0126-PK.
      *         그룹회사코드
            05 KJL0126-PK-GROUP-CO-CD         PIC  X(00003).
      *         계좌번호
            05 KJL0126-PK-ACNO                PIC  X(00020).
      *         계좌중복일련번호
            05 KJL0126-PK-ACN-DUP-SERNO       PIC S9(00007) COMP-3.
      *         기준년월
            05 KJL0126-PK-BASE-YM             PIC  X(00006).
      *=================================================================
      *  TKJL0126   C O P Y B O O K   E N D
      *=================================================================
