      *=================================================================
      *  테이블명      : THKJLR008(파생상품 거래건별 평가금액 
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJLR008
      *  사용예        : 01  TKJLR008-KEY.
      *                      COPY  TKJLR008.
      *  최종변경일시  : 2010년01월23일17시09분35초
      *=================================================================
           03  TKJLR008-PK.
      *         그룹회사코드
            05 KJLR008-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJLR008-PK-BASE-YMD            PIC  X(00008).
      *         외화거래번호
            05 KJLR008-PK-FC-TRAN-NO          PIC  X(00010).
      *         파생상품구분
            05 KJLR008-PK-DRVT-PRDCT-DSTCD    PIC  X(00006).
      *         일련번호
            05 KJLR008-PK-SERNO               PIC S9(00007) COMP-3.
      *=================================================================
      *  TKJLR008   C O P Y B O O K   E N D
      *=================================================================
