      *=================================================================
      *  테이블명      : THKJL0024(토탈익스포져 계열사 관리 제
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0024
      *  사용예        : 01  TKJL0024-KEY.
      *                      COPY  TKJL0024.
      *  최종변경일시  : 2017년08월08일16시22분46초
      *=================================================================
           03  TKJL0024-PK.
      *         그룹회사코드
            05 KJL0024-PK-GROUP-CO-CD         PIC  X(00003).
      *         고객식별자
            05 KJL0024-PK-CUST-IDNFR          PIC  X(00010).
      *         계열적용구분
            05 KJL0024-PK-AFFLT-APLY-DSTCD    PIC  X(00001).
      *=================================================================
      *  TKJL0024   C O P Y B O O K   E N D
      *=================================================================
