      *=================================================================
      *  테이블명      : THKJL0064(SUB한도집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0064
      *  사용예        : 01  TKJL0064-KEY.
      *                      COPY  TKJL0064.
      *  최종변경일시  : 2011년02월14일10시46분47초
      *=================================================================
           03  TKJL0064-PK.
      *         그룹회사코드
            05 KJL0064-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0064-PK-BASE-YMD            PIC  X(00008).
      *         SUB한도구분
            05 KJL0064-PK-SUB-LIMT-DSTCD      PIC  X(00001).
      *=================================================================
      *  TKJL0064   C O P Y B O O K   E N D
      *=================================================================
