      *=================================================================
      *  테이블명      : THKJLRM05(해외점포월계좌내역)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJLRM05
      *  사용예        : 01  TKJLRM05-KEY.
      *                      COPY  TKJLRM05.
      *  최종변경일시  : 2024년08월30일17시35분53초
      *=================================================================
           03  TKJLRM05-PK.
      *         그룹회사코드
            05 KJLRM05-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJLRM05-PK-BASE-YM             PIC  X(00006).
      *         관리부점코드
            05 KJLRM05-PK-MGT-BRNCD           PIC  X(00004).
      *         계좌번호
            05 KJLRM05-PK-ACNO                PIC  X(00020).
      *=================================================================
      *  TKJLRM05   C O P Y B O O K   E N D
      *=================================================================
