      *=================================================================
      *  테이블명      : THKJL0044(표준산업코드목록)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0044
      *  사용예        : 01  TKJL0044-KEY.
      *                      COPY  TKJL0044.
      *  최종변경일시  : 2010년01월23일17시07분35초
      *=================================================================
           03  TKJL0044-PK.
      *         그룹회사코드
            05 KJL0044-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0044-PK-BASE-YM             PIC  X(00006).
      *         신표준산업분류코드
            05 KJL0044-PK-NEW-SI-CLSFI-CD     PIC  X(00005).
      *=================================================================
      *  TKJL0044   C O P Y B O O K   E N D
      *=================================================================
