      *=================================================================
      *  테이블명      : THKJL0067(산업별규모별익스포져일집계)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TKJL0067
      *  사용예        : 01  TKJL0067-KEY.
      *                      COPY  TKJL0067.
      *  최종변경일시  : 2011년06월16일17시13분53초
      *=================================================================
           03  TKJL0067-PK.
      *         그룹회사코드
            05 KJL0067-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0067-PK-BASE-YMD            PIC  X(00008).
      *         대분류업종코드
            05 KJL0067-PK-LAG-CLSFI-BZTYP-CD  PIC  X(00003).
      *         산업TE기업규모구분
            05 KJL0067-PK-IDSTRY-TCS-DSTCD    PIC  X(00001).
      *=================================================================
      *  TKJL0067   C O P Y B O O K   E N D
      *=================================================================
