      *=================================================================
      *  테이블명      : THKJL0083(이사회승인관련월별계좌현황 기본
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0083
      *  사용예        : 01  TKJL0083-KEY.
      *                      COPY  TKJL0083.
      *  최종변경일시  : 2024년04월09일15시44분21초
      *=================================================================
           03  TKJL0083-PK.
      *         그룹회사코드
            05 KJL0083-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0083-PK-BASE-YM             PIC  X(00006).
      *         이사회승인번호
            05 KJL0083-PK-BRDC-ATHOR-NO       PIC  X(00010).
      *         관련여신일련번호
            05 KJL0083-PK-RELATD-LNBZ-SERNO   PIC S9(00003) COMP-3.
      *=================================================================
      *  TKJL0083   C O P Y B O O K   E N D
      *=================================================================
