      *=================================================================
      *  테이블명      : THKJLR001(외화주식잔고현황)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJLR001
      *  사용예        : 01  TKJLR001-KEY.
      *                      COPY  TKJLR001.
      *  최종변경일시  : 2010년01월23일17시08분56초
      *=================================================================
           03  TKJLR001-PK.
      *         그룹회사코드
            05 KJLR001-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJLR001-PK-BASE-YMD            PIC  X(00008).
      *         외화거래번호
            05 KJLR001-PK-FC-TRAN-NO          PIC  X(00010).
      *=================================================================
      *  TKJLR001   C O P Y B O O K   E N D
      *=================================================================
