      *=================================================================
      *  테이블명      : THKJL0082(이사회승인관련계좌현황 기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0082
      *  사용예        : 01  TKJL0082-KEY.
      *                      COPY  TKJL0082.
      *  최종변경일시  : 2024년04월22일14시25분43초
      *=================================================================
           03  TKJL0082-PK.
      *         그룹회사코드
            05 KJL0082-PK-GROUP-CO-CD         PIC  X(00003).
      *         이사회승인번호
            05 KJL0082-PK-BRDC-ATHOR-NO       PIC  X(00010).
      *         관련여신일련번호
            05 KJL0082-PK-RELATD-LNBZ-SERNO   PIC S9(00003) COMP-3.
      *=================================================================
      *  TKJL0082   C O P Y B O O K   E N D
      *=================================================================
