      *=================================================================
      *  테이블명      : THKJLR009(유가증권매입약정명세)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TKJLR009
      *  사용예        : 01  TKJLR009-KEY.
      *                      COPY  TKJLR009.
      *  최종변경일시  : 2015년02월04일14시36분22초
      *=================================================================
           03  TKJLR009-PK.
      *         그룹회사코드
            05 KJLR009-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJLR009-PK-BASE-YMD            PIC  X(00008).
      *         통합트레이드번호
            05 KJLR009-PK-INTGRA-TRD-NO       PIC  X(00014).
      *=================================================================
      *  TKJLR009   C O P Y B O O K   E N D
      *=================================================================
