      *=================================================================
      *  테이블명      : THKJL0054(국별계정과목코드목록)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0054
      *  사용예        : 01  TKJL0054-KEY.
      *                      COPY  TKJL0054.
      *  최종변경일시  : 2010년01월23일17시08분15초
      *=================================================================
           03  TKJL0054-PK.
      *         그룹회사코드
            05 KJL0054-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0054-PK-BASE-YM             PIC  X(00006).
      *         상품대분류코드
            05 KJL0054-PK-PRDCT-LAG-CLSFI-CD  PIC  X(00002).
      *         상품중분류코드
            05 KJL0054-PK-PRDCT-MEDM-CLSFI-CD PIC  X(00002).
      *         상품템플릿코드
            05 KJL0054-PK-PRDCT-TMPLT-CD      PIC  X(00003).
      *         상품번호
            05 KJL0054-PK-PRDCT-NO            PIC  X(00005).
      *=================================================================
      *  TKJL0054   C O P Y B O O K   E N D
      *=================================================================
