      *=================================================================
      *  테이블명      : THKJL0055(국별익스포져계좌명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0055
      *  사용예        : 01  TKJL0055-KEY.
      *                      COPY  TKJL0055.
      *  최종변경일시  : 2010년01월23일17시08분20초
      *=================================================================
           03  TKJL0055-PK.
      *         그룹회사코드
            05 KJL0055-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0055-PK-BASE-YMD            PIC  X(00008).
      *         계좌번호
            05 KJL0055-PK-ACNO                PIC  X(00020).
      *         계좌중복일련번호
            05 KJL0055-PK-ACN-DUP-SERNO       PIC S9(00007) COMP-3.
      *=================================================================
      *  TKJL0055   C O P Y B O O K   E N D
      *=================================================================
