      *=================================================================
      *  테이블명      : THKJL0008(CP기준한도기초자료)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0008
      *  사용예        : 01  TKJL0008-KEY.
      *                      COPY  TKJL0008.
      *  최종변경일시  : 2017년02월03일10시40분15초
      *=================================================================
           03  TKJL0008-PK.
      *         그룹회사코드
            05 KJL0008-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0008-PK-BASE-YMD            PIC  X(00008).
      *         고객식별자
            05 KJL0008-PK-CUST-IDNFR          PIC  X(00010).
      *=================================================================
      *  TKJL0008   C O P Y B O O K   E N D
      *=================================================================
