      *=================================================================
      *  테이블명      : THKJL0051(산업별관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0051
      *  사용예        : 01  TKJL0051-KEY.
      *                      COPY  TKJL0051.
      *  최종변경일시  : 2010년01월23일17시08분04초
      *=================================================================
           03  TKJL0051-PK.
      *         그룹회사코드
            05 KJL0051-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월
            05 KJL0051-PK-BASE-YM             PIC  X(00006).
      *         TEPEER구분
            05 KJL0051-PK-TE-PEER-DSTCD       PIC  X(00005).
      *=================================================================
      *  TKJL0051   C O P Y B O O K   E N D
      *=================================================================
