      *=================================================================
      *  테이블명      : THKJL0070(지역본부별 SUB-LIMIT관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJL0070
      *  사용예        : 01  TKJL0070-KEY.
      *                      COPY  TKJL0070.
      *  최종변경일시  : 2015년12월18일17시59분03초
      *=================================================================
           03  TKJL0070-PK.
      *         그룹회사코드
            05 KJL0070-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJL0070-PK-BASE-YMD            PIC  X(00008).
      *         대분류업종코드
            05 KJL0070-PK-LAG-CLSFI-BZTYP-CD  PIC  X(00003).
      *         지역본부코드
            05 KJL0070-PK-AREA-HQ-CD          PIC  X(00004).
      *=================================================================
      *  TKJL0070   C O P Y B O O K   E N D
      *=================================================================
