      *=================================================================
      *  테이블명      : THKJLR002(외화채권잔고현황)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TKJLR002
      *  사용예        : 01  TKJLR002-KEY.
      *                      COPY  TKJLR002.
      *  최종변경일시  : 2010년01월23일17시09분02초
      *=================================================================
           03  TKJLR002-PK.
      *         그룹회사코드
            05 KJLR002-PK-GROUP-CO-CD         PIC  X(00003).
      *         기준년월일
            05 KJLR002-PK-BASE-YMD            PIC  X(00008).
      *         외화상품유형구분
            05 KJLR002-PK-FC-PRDCT-PTRN-DSTCD PIC  X(00003).
      *         외화거래번호
            05 KJLR002-PK-FC-TRAN-NO          PIC  X(00010).
      *=================================================================
      *  TKJLR002   C O P Y B O O K   E N D
      *=================================================================
