      *=================================================================
      *  테이블명      : THKJL0066(산업별규모별등급별익스포져일집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0066
      *  사용예        : 01  TRJL0066-REC.
      *                      COPY  TRJL0066.
      *  최종변경일시  : 2019년12월19일18시04분44초
      *=================================================================
      *       그룹회사코드
           03 RJL0066-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0066-BASE-YMD               PIC  X(00008).
      *       대분류업종코드
           03 RJL0066-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       산업TE기업규모구분
           03 RJL0066-IDSTRY-TCS-DSTCD       PIC  X(00001).
      *       내부신용평가등급구분
           03 RJL0066-INTNL-CV-GRD-DSTCD     PIC  X(00004).
      *       산업별규모별TE금액
           03 RJL0066-IDSTRY-PSP-TE-AMT      PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0066-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0066-SYS-LAST-UNO           PIC  X(00007).
      *       국외산업규모TE금액
           03 RJL0066-ABRD-I-SCAL-T-E-AMT    PIC S9(00015) COMP-3.
      *=================================================================
      *  TRJL0066   C O P Y B O O K   E N D
      *=================================================================
