      *=================================================================
      *  테이블명      : THKJLR004(토탈익스포져 CRM섭외정보 관리
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR004
      *  사용예        : 01  TRJLR004-REC.
      *                      COPY  TRJLR004.
      *  최종변경일시  : 2017년10월23일15시00분16초
      *=================================================================
      *       그룹회사코드
           03 RJLR004-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR004-BASE-YMD               PIC  X(00008).
      *       고객식별자
           03 RJLR004-CUST-IDNFR             PIC  X(00010).
      *       섭외년월일
           03 RJLR004-CNEGO-YMD              PIC  X(00008).
      *       유치계획건수
           03 RJLR004-ATRC-PLAN-NOITM        PIC S9(00005) COMP-3.
      *       유치계획금액
           03 RJLR004-ATRC-PLAN-AMT          PIC S9(00015) COMP-3.
      *       섭외2진행단계구분
           03 RJLR004-CNEGO-2P-STGE-DSTCD    PIC  X(00002).
      *       최초등록일시
           03 RJLR004-FRST-REGI-YMS          PIC  X(00014).
      *       섭외1일련번호
           03 RJLR004-CNEGO-1-SERNO          PIC S9(00012) COMP-3.
      *       섭외2일련번호
           03 RJLR004-CNEGO-2-SERNO          PIC S9(00005) COMP-3.
      *       시스템최종처리일시
           03 RJLR004-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR004-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR004   C O P Y B O O K   E N D
      *=================================================================
