      *=================================================================
      *  테이블명      : THKJL0070(지역본부별 SUB-LIMIT관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0070
      *  사용예        : 01  TRJL0070-REC.
      *                      COPY  TRJL0070.
      *  최종변경일시  : 2015년12월18일17시59분03초
      *=================================================================
      *       그룹회사코드
           03 RJL0070-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0070-BASE-YMD               PIC  X(00008).
      *       대분류업종코드
           03 RJL0070-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       지역본부코드
           03 RJL0070-AREA-HQ-CD             PIC  X(00004).
      *       전년도말익스포져금액
           03 RJL0070-PYY-X-END-EXPSR-AMT    PIC S9(00015) COMP-3.
      *       지역본부SUB한도
           03 RJL0070-AREA-HQ-SUB-CLAM       PIC S9(00015) COMP-3.
      *       지역본부순증SUB한도
           03 RJL0070-AREA-HN-SUB-CLAM       PIC S9(00015) COMP-3.
      *       지역본부익스포져금액
           03 RJL0070-AREA-HQ-EXPSR-AMT      PIC S9(00015) COMP-3.
      *       지역본부한도여유금액
           03 RJL0070-AREA-HQ-LIMT-EXAN      PIC S9(00015) COMP-3.
      *       지역본부SUB소진율
           03 RJL0070-AREA-HQ-SUB-EXHS-RT    PIC S9(00003)V9(2) COMP-3.
      *       지역본부예외승인한도
           03 RJL0070-AREA-HE-ATHOR-CLAM     PIC S9(00015) COMP-3.
      *       지역본부예외승인금액
           03 RJL0070-AREA-HE-ATHOR-AMT      PIC S9(00015) COMP-3.
      *       지역예외승인여유금액
           03 RJL0070-AREA-E-ATHOR-EXAN      PIC S9(00015) COMP-3.
      *       지역예외승인소진율
           03 RJL0070-AREA-EA-EXHS-RT        PIC S9(00003)V9(2) COMP-3.
      *       지역본부기준소진율
           03 RJL0070-AREA-HE-BASE           PIC S9(00003)V9(2) COMP-3.
      *       시스템최종처리일시
           03 RJL0070-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0070-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0070   C O P Y B O O K   E N D
      *=================================================================
