      *=================================================================
      *  테이블명      : THKJL0073(신용공여월계좌정보)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TRJL0073
      *  사용예        : 01  TRJL0073-REC.
      *                      COPY  TRJL0073.
      *  최종변경일시  : 2012년08월24일18시19분52초
      *=================================================================
      *       그룹회사코드
           03 RJL0073-GROUP-CO-CD            PIC  X(00003).
      *       계좌번호
           03 RJL0073-ACNO                   PIC  X(00020).
      *       계좌중복일련번호
           03 RJL0073-ACN-DUP-SERNO          PIC S9(00007) COMP-3.
      *       기준년월
           03 RJL0073-BASE-YM                PIC  X(00006).
      *       통합계정과목코드
           03 RJL0073-INTGRA-TIACC-CD        PIC  X(00013).
      *       신용공여대상구분
           03 RJL0073-GRCR-TAGET-DSTCD       PIC  X(00001).
      *       원만기구분
           03 RJL0073-ORGL-EXPIR-DSTCD       PIC  X(00001).
      *       잔존만기구분
           03 RJL0073-RMAIN-EXPIR-DSTCD      PIC  X(00001).
      *       BS기준한도
           03 RJL0073-BS-BASE-CLAM           PIC S9(00015) COMP-3.
      *       기준환율
           03 RJL0073-BASE-EXRT              PIC S9(00005)V9(4) COMP-3.
      *       신용공여보증비율
           03 RJL0073-GRCR-GRNTY-RATO        PIC S9(00003) COMP-3.
      *       신용공여담보비율
           03 RJL0073-GRCR-SCURTY-RATO       PIC S9(00003) COMP-3.
      *       계정과목CCF환산율
           03 RJL0073-TIACC-CCF-UTCRT        PIC S9(00003) COMP-3.
      *       신용공여금액
           03 RJL0073-GRCR-AMT               PIC S9(00015) COMP-3.
      *       신용공여제외금액
           03 RJL0073-GRCR-ECLUD-AMT         PIC S9(00015) COMP-3.
      *       CA보증담보합산액
           03 RJL0073-CA-G-SCURTY-SUM-AMT    PIC S9(00015) COMP-3.
      *       CA보증담보금액1
           03 RJL0073-CA-G-SCURTY-AMT1       PIC S9(00015) COMP-3.
      *       CA보증담보금액2
           03 RJL0073-CA-G-SCURTY-AMT2       PIC S9(00015) COMP-3.
      *       CA보증담보금액3
           03 RJL0073-CA-G-SCURTY-AMT3       PIC S9(00015) COMP-3.
      *       CA보증담보금액4
           03 RJL0073-CA-G-SCURTY-AMT4       PIC S9(00015) COMP-3.
      *       CA보증담보금액5
           03 RJL0073-CA-G-SCURTY-AMT5       PIC S9(00015) COMP-3.
      *       CA보증담보금액6
           03 RJL0073-CA-G-SCURTY-AMT6       PIC S9(00015) COMP-3.
      *       CA보증담보금액7
           03 RJL0073-CA-G-SCURTY-AMT7       PIC S9(00015) COMP-3.
      *       CA보증담보금액8
           03 RJL0073-CA-G-SCURTY-AMT8       PIC S9(00015) COMP-3.
      *       CA보증담보금액9
           03 RJL0073-CA-G-SCURTY-AMT9       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액1
           03 RJL0073-CA-G-SCURTY-AUC1       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액2
           03 RJL0073-CA-G-SCURTY-AUC2       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액3
           03 RJL0073-CA-G-SCURTY-AUC3       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액4
           03 RJL0073-CA-G-SCURTY-AUC4       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액5
           03 RJL0073-CA-G-SCURTY-AUC5       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액6
           03 RJL0073-CA-G-SCURTY-AUC6       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액7
           03 RJL0073-CA-G-SCURTY-AUC7       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액8
           03 RJL0073-CA-G-SCURTY-AUC8       PIC S9(00015) COMP-3.
      *       CA보증담보환산금액9
           03 RJL0073-CA-G-SCURTY-AUC9       PIC S9(00015) COMP-3.
      *       신용공여기관구분
           03 RJL0073-GRCR-INSTI-DSTCD       PIC  X(00001).
      *       시스템최종처리일시
           03 RJL0073-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0073-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0073   C O P Y B O O K   E N D
      *=================================================================
