      *=================================================================
      *  테이블명      : THKJL0024(토탈익스포져 계열사 관리 제
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0024
      *  사용예        : 01  TRJL0024-REC.
      *                      COPY  TRJL0024.
      *  최종변경일시  : 2017년08월08일16시22분46초
      *=================================================================
      *       그룹회사코드
           03 RJL0024-GROUP-CO-CD            PIC  X(00003).
      *       고객식별자
           03 RJL0024-CUST-IDNFR             PIC  X(00010).
      *       계열적용구분
           03 RJL0024-AFFLT-APLY-DSTCD       PIC  X(00001).
      *       계열기업군코드
           03 RJL0024-AFFLT-CORP-GROUP-CD    PIC  X(00006).
      *       등록직원번호
           03 RJL0024-REGI-EMPID             PIC  X(00007).
      *       등록년월일
           03 RJL0024-REGI-YMD               PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0024-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0024-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0024   C O P Y B O O K   E N D
      *=================================================================
