      *=================================================================
      *  테이블명      : THKJL0128(TE차주익스포져중간월집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0128
      *  사용예        : 01  TRJL0128-REC.
      *                      COPY  TRJL0128.
      *  최종변경일시  : 2017년02월03일15시49분18초
      *=================================================================
      *       그룹회사코드
           03 RJL0128-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0128-BASE-YM                PIC  X(00006).
      *       차주고객식별자
           03 RJL0128-BRWR-CUST-IDNFR        PIC  X(00010).
      *       한도계좌번호
           03 RJL0128-LIMT-ACNO              PIC  X(00020).
      *       한도상품대분류코드
           03 RJL0128-LIMT-P-LAG-CLSFI-CD    PIC  X(00002).
      *       한도상품중분류코드
           03 RJL0128-LIMT-PM-CLSFI-CD       PIC  X(00002).
      *       한도상품템플릿코드
           03 RJL0128-LIMT-PRDCT-TMPLT-CD    PIC  X(00003).
      *       한도상품번호
           03 RJL0128-LIMT-PRDCT-NO          PIC  X(00005).
      *       차주번호
           03 RJL0128-BRWR-NO                PIC  X(00013).
      *       BS기준잔액
           03 RJL0128-BS-BASE-BAL            PIC S9(00015) COMP-3.
      *       명목액기준한도
           03 RJL0128-TTL-AMT-BASE-CLAM      PIC S9(00015) COMP-3.
      *       명목액기준잔액
           03 RJL0128-TTL-AMT-BASE-BAL       PIC S9(00015) COMP-3.
      *       EAD한도
           03 RJL0128-EAD-CLAM               PIC S9(00015) COMP-3.
      *       명목잔액CCF환산금액
           03 RJL0128-TTL-BAL-CCF-AUC        PIC S9(00015) COMP-3.
      *       EAD한도CCF환산금액
           03 RJL0128-EAD-LIMT-CCF-AUC       PIC S9(00015) COMP-3.
      *       한도기준TE금액
           03 RJL0128-LIMT-BASE-TE-AMT       PIC S9(00015) COMP-3.
      *       잔액기준TE금액
           03 RJL0128-BAL-BASE-TE-AMT        PIC S9(00015) COMP-3.
      *       CA담보제외금액
           03 RJL0128-CA-SCURTY-ECLUD-AMT    PIC S9(00015) COMP-3.
      *       CA담보환산금액
           03 RJL0128-CA-SCURTY-AUC          PIC S9(00015) COMP-3.
      *       신용공여한도
           03 RJL0128-GRCR-CLAM              PIC S9(00015) COMP-3.
      *       외화신용공여한도
           03 RJL0128-FC-GRCR-CLAM           PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0128-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0128-SYS-LAST-UNO           PIC  X(00007).
      *       BS기준한도
           03 RJL0128-BS-BASE-CLAM           PIC S9(00015) COMP-3.
      *=================================================================
      *  TRJL0128   C O P Y B O O K   E N D
      *=================================================================
