      *=================================================================
      *  테이블명      : THKJL0090(국외영업점산업별관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0090
      *  사용예        : 01  TRJL0090-REC.
      *                      COPY  TRJL0090.
      *  최종변경일시  : 2020년03월17일16시01분04초
      *=================================================================
      *       그룹회사코드
           03 RJL0090-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0090-BASE-YM                PIC  X(00006).
      *       관리부점코드
           03 RJL0090-MGT-BRNCD              PIC  X(00004).
      *       대분류업종코드
           03 RJL0090-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       편중관리비율
           03 RJL0090-LNUP-MGT-CST-RT        PIC S9(00003)V9(2) COMP-3.
      *       합산관리여부
           03 RJL0090-SUM-MGT-YN             PIC  X(00001).
      *       시스템최종처리일시
           03 RJL0090-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0090-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0090   C O P Y B O O K   E N D
      *=================================================================
