      *=================================================================
      *  테이블명      : THKJL0063(SUB한도관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0063
      *  사용예        : 01  TRJL0063-REC.
      *                      COPY  TRJL0063.
      *  최종변경일시  : 2011년02월14일10시45분22초
      *=================================================================
      *       그룹회사코드
           03 RJL0063-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0063-BASE-YM                PIC  X(00006).
      *       SUB한도구분
           03 RJL0063-SUB-LIMT-DSTCD         PIC  X(00001).
      *       SUB한도
           03 RJL0063-SUB-CLAM               PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0063-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0063-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0063   C O P Y B O O K   E N D
      *=================================================================
