      *=================================================================
      *  테이블명      : THKJLR019(외화타점예치계좌기본수보)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR019
      *  사용예        : 01  TRJLR019-REC.
      *                      COPY  TRJLR019.
      *  최종변경일시  : 2024년08월14일10시48분25초
      *=================================================================
      *       그룹회사코드
           03 RJLR019-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR019-BASE-YMD               PIC  X(00008).
      *       통화코드
           03 RJLR019-CNCYCD                 PIC  X(00003).
      *       거래은행BIC코드
           03 RJLR019-TRAN-BNK-BIC           PIC  X(00011).
      *       통합계정과목코드
           03 RJLR019-INTGRA-TIACC-CD        PIC  X(00013).
      *       외화잔액
           03 RJLR019-FC-BAL                 PIC S9(00015)V9(3) COMP-3.
      *       원화환산금액
           03 RJLR019-WONC-AUC               PIC S9(00015)V9(3) COMP-3.
      *       고객식별자
           03 RJLR019-CUST-IDNFR             PIC  X(00010).
      *       등록직원번호
           03 RJLR019-REGI-EMPID             PIC  X(00007).
      *       등록일시
           03 RJLR019-REGI-YMS               PIC  X(00014).
      *       시스템최종처리일시
           03 RJLR019-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR019-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR019   C O P Y B O O K   E N D
      *=================================================================
