      *=================================================================
      *  테이블명      : THKJL0056(국가별한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0056
      *  사용예        : 01  TRJL0056-REC.
      *                      COPY  TRJL0056.
      *  최종변경일시  : 2020년02월11일13시19분45초
      *=================================================================
      *       그룹회사코드
           03 RJL0056-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0056-BASE-YM                PIC  X(00006).
      *       ISO국가코드
           03 RJL0056-ISO-NATNL-CD           PIC  X(00002).
      *       영문국가명
           03 RJL0056-ENG-NATNL-NAME         PIC  X(00052).
      *       한도관리지역구분
           03 RJL0056-LIMT-MGT-AREA-DSTCD    PIC  X(00001).
      *       한도국가체질구분
           03 RJL0056-LIMT-N-CNSN-DSTCD      PIC  X(00001).
      *       경보발령여부
           03 RJL0056-ALAM-OFODR-YN          PIC  X(00001).
      *       경보발령등록년월일
           03 RJL0056-ALAM-OFODR-REGI-YMD    PIC  X(00008).
      *       모니터링여부
           03 RJL0056-MONI-YN                PIC  X(00001).
      *       모니터링등록년월일
           03 RJL0056-MONI-REGI-YMD          PIC  X(00008).
      *       SNP등급구분
           03 RJL0056-SNP-GRD-DSTCD          PIC  X(00002).
      *       무디스등급구분
           03 RJL0056-MODYS-GRD-DSTCD        PIC  X(00002).
      *       피치등급구분
           03 RJL0056-FITCH-GRD-DSTCD        PIC  X(00002).
      *       전체관리한도
           03 RJL0056-WHOL-MGT-CLAM          PIC S9(00015)V9(3) COMP-3.
      *       시스템최종처리일시
           03 RJL0056-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0056-SYS-LAST-UNO           PIC  X(00007).
      *       당행국가신용등급구분
           03 RJL0056-OWBNK-NC-GRD-DSTCD     PIC  X(00004).
      *       국가전체공통한도여부
           03 RJL0056-NATNL-W-CMN-LIMT-YN    PIC  X(00001).
      *       국가위험수준구분
           03 RJL0056-NATNL-R-LVEL-DSTCD     PIC  X(00001).
      *=================================================================
      *  TRJL0056   C O P Y B O O K   E N D
      *=================================================================
