      *=================================================================
      *  테이블명      : THKJL0005(한도승인결의록관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0005
      *  사용예        : 01  TRJL0005-REC.
      *                      COPY  TRJL0005.
      *  최종변경일시  : 2020년05월28일16시40분12초
      *=================================================================
      *       그룹회사코드
           03 RJL0005-GROUP-CO-CD            PIC  X(00003).
      *       한도신청번호
           03 RJL0005-LIMT-APLCN-NO          PIC  X(00010).
      *       승인위원직원번호
           03 RJL0005-ATHOR-CMMB-EMPID       PIC  X(00007).
      *       승인위원구분
           03 RJL0005-ATHOR-CMMB-DSTCD       PIC  X(00001).
      *       한도승인구분
           03 RJL0005-LIMT-ATHOR-DSTCD       PIC  X(00001).
      *       승인의견내용
           03 RJL0005-ATHOR-OPIN-CTNT        PIC  X(00302).
      *       시스템최종처리일시
           03 RJL0005-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0005-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0005   C O P Y B O O K   E N D
      *=================================================================
