      *=================================================================
      *  테이블명      : THKJL0054(국별계정과목코드목록)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0054
      *  사용예        : 01  TRJL0054-REC.
      *                      COPY  TRJL0054.
      *  최종변경일시  : 2010년01월23일17시08분15초
      *=================================================================
      *       그룹회사코드
           03 RJL0054-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0054-BASE-YM                PIC  X(00006).
      *       상품대분류코드
           03 RJL0054-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJL0054-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJL0054-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJL0054-PRDCT-NO               PIC  X(00005).
      *       통합계정과목코드
           03 RJL0054-INTGRA-TIACC-CD        PIC  X(00013).
      *       TE중분류구분
           03 RJL0054-TE-MIDL-CLSFI-DSTCD    PIC  X(00003).
      *       TE중분류명
           03 RJL0054-TE-MEDM-CLSFI-NAME     PIC  X(00042).
      *       시스템최종처리일시
           03 RJL0054-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0054-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0054   C O P Y B O O K   E N D
      *=================================================================
