      *=================================================================
      *  테이블명      : THKJL0012(그룹관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0012
      *  사용예        : 01  TRJL0012-REC.
      *                      COPY  TRJL0012.
      *  최종변경일시  : 2010년01월23일17시05분09초
      *=================================================================
      *       그룹회사코드
           03 RJL0012-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0012-BASE-YM                PIC  X(00006).
      *       계열기업군코드
           03 RJL0012-AFFLT-CORP-GROUP-CD    PIC  X(00006).
      *       그룹사신용등급구분
           03 RJL0012-CMGR-CRTDSCD           PIC  X(00003).
      *       신용평가년월일
           03 RJL0012-CRDT-VALUA-YMD         PIC  X(00008).
      *       기준한도
           03 RJL0012-BASE-CLAM              PIC S9(00015) COMP-3.
      *       기준한도산출년월일
           03 RJL0012-BASE-LIMT-CMPTN-YMD    PIC  X(00008).
      *       관리한도
           03 RJL0012-MGT-CLAM               PIC S9(00015) COMP-3.
      *       관리한도설정년월일
           03 RJL0012-MGT-LIMT-STUP-YMD      PIC  X(00008).
      *       관리한도유효년월일
           03 RJL0012-MGT-LIMT-VALD-YMD      PIC  X(00008).
      *       여신성관리한도
           03 RJL0012-LNBZ-I-MGT-CLAM        PIC S9(00015) COMP-3.
      *       시장성관리한도
           03 RJL0012-MRKTY-MGT-CLAM         PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0012-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0012-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0012   C O P Y B O O K   E N D
      *=================================================================
