      *=================================================================
      *  테이블명      : THKJL0068(산업별TE한도초과기준일관리)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TRJL0068
      *  사용예        : 01  TRJL0068-REC.
      *                      COPY  TRJL0068.
      *  최종변경일시  : 2011년09월21일13시52분04초
      *=================================================================
      *       그룹회사코드
           03 RJL0068-GROUP-CO-CD            PIC  X(00003).
      *       대분류업종코드
           03 RJL0068-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       취급중단년월일
           03 RJL0068-HNDLN-DSCN-YMD         PIC  X(00008).
      *       예외적용년월일
           03 RJL0068-ECEPT-APLY-YMD         PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0068-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0068-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0068   C O P Y B O O K   E N D
      *=================================================================
