      *=================================================================
      *  테이블명      : THKJL0058(국별수기계좌관리)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0058
      *  사용예        : 01  TRJL0058-REC.
      *                      COPY  TRJL0058.
      *  최종변경일시  : 2020년12월02일17시08분16초
      *=================================================================
      *       그룹회사코드
           03 RJL0058-GROUP-CO-CD            PIC  X(00003).
      *       계좌번호
           03 RJL0058-ACNO                   PIC  X(00020).
      *       고객식별자
           03 RJL0058-CUST-IDNFR             PIC  X(00010).
      *       거래상대방명
           03 RJL0058-TRAN-CNPRT-NAME        PIC  X(00082).
      *       상품대분류코드
           03 RJL0058-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJL0058-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJL0058-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJL0058-PRDCT-NO               PIC  X(00005).
      *       ISO국가코드
           03 RJL0058-ISO-NATNL-CD           PIC  X(00002).
      *       관리부점코드
           03 RJL0058-MGT-BRNCD              PIC  X(00004).
      *       시작년월일
           03 RJL0058-START-YMD              PIC  X(00008).
      *       만기년월일
           03 RJL0058-EXPIR-YMD              PIC  X(00008).
      *       통화코드
           03 RJL0058-CNCYCD                 PIC  X(00003).
      *       통화한도
           03 RJL0058-CRNCY-CLAM             PIC S9(00015)V9(3) COMP-3.
      *       통화잔액
           03 RJL0058-CRNCY-BAL              PIC S9(00015)V9(3) COMP-3.
      *       등록년월일
           03 RJL0058-REGI-YMD               PIC  X(00008).
      *       등록직원번호
           03 RJL0058-REGI-EMPID             PIC  X(00007).
      *       등록부점코드
           03 RJL0058-REGI-BRNCD             PIC  X(00004).
      *       시스템최종처리일시
           03 RJL0058-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0058-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0058   C O P Y B O O K   E N D
      *=================================================================
