      *=================================================================
      *  테이블명      : THKJLR013(여신계약상세일현황)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TRJLR013
      *  사용예        : 01  TRJLR013-REC.
      *                      COPY  TRJLR013.
      *  최종변경일시  : 2012년08월24일16시00분35초
      *=================================================================
      *       그룹회사코드
           03 RJLR013-GROUP-CO-CD            PIC  X(00003).
      *       계좌번호
           03 RJLR013-ACNO                   PIC  X(00020).
      *       상품계약회차
           03 RJLR013-PRDCT-CTRC-NTH         PIC S9(00007) COMP-3.
      *       상품코드
           03 RJLR013-PRDCT-CD               PIC  X(00012).
      *       상품대분류코드
           03 RJLR013-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJLR013-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJLR013-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJLR013-PRDCT-NO               PIC  X(00005).
      *       대출자격구분
           03 RJLR013-LN-QULFI-DSTCD         PIC  X(00003).
      *       개별코드
           03 RJLR013-IDIVI-CD               PIC  X(00003).
      *       통화코드
           03 RJLR013-CNCYCD                 PIC  X(00003).
      *       계약자고객식별자
           03 RJLR013-CTCR-CUST-IDNFR        PIC  X(00010).
      *       계약자고객관리번호
           03 RJLR013-CTCR-CUST-MGT-NO       PIC  X(00005).
      *       상품계약회차상태구분
           03 RJLR013-PCON-NTH-STUS-DSTCD    PIC  X(00001).
      *       계약회차생성사유구분
           03 RJLR013-PCON-NC-RESN-DSTCD     PIC  X(00003).
      *       계약회차약정년월일
           03 RJLR013-PRDCT-CN-AGRE-YMD      PIC  X(00008).
      *       계약회차생성년월일
           03 RJLR013-PRDCT-CN-CRETN-YMD     PIC  X(00008).
      *       계약회차폐기사유구분
           03 RJLR013-PCON-ND-RESN-DSTCD     PIC  X(00003).
      *       계약회차폐기년월일
           03 RJLR013-PRDCT-CN-DSCRD-YMD     PIC  X(00008).
      *       계약회차만기년월일
           03 RJLR013-PRDCT-CN-EXPIR-YMD     PIC  X(00008).
      *       과목코드
           03 RJLR013-SBJCT-CD               PIC  X(00003).
      *       통합계정과목코드
           03 RJLR013-INTGRA-TIACC-CD        PIC  X(00013).
      *       잔액
           03 RJLR013-BAL                    PIC S9(00015)V9(3) COMP-3.
      *       원장잔액
           03 RJLR013-LEDGR-BAL              PIC S9(00015)V9(3) COMP-3.
      *       계약한도구분
           03 RJLR013-CTRC-LIMT-DSTCD        PIC  X(00002).
      *       계리신탁합동구분
           03 RJLR013-GNLDR-T-CMBN-DSTCD     PIC  X(00003).
      *       계리신탁펀드코드
           03 RJLR013-GNLDR-TST-FUND-CD      PIC  X(00003).
      *       신규시거래자구분
           03 RJLR013-NEW-P-TRANR-DSTCD      PIC  X(00002).
      *       신규표준산업분류코드
           03 RJLR013-NEW-SIZ-CLSFI-CD       PIC  X(00005).
      *       신규시기업규모구분
           03 RJLR013-NEW-PC-SCAL-DSTCD      PIC  X(00001).
      *       관리부점코드
           03 RJLR013-MGT-BRNCD              PIC  X(00004).
      *       계약금액
           03 RJLR013-CNPR                   PIC S9(00015)V9(3) COMP-3.
      *       대출실행누계금액
           03 RJLR013-LN-EXE-CUTAMT          PIC S9(00015)V9(3) COMP-3.
      *       유동화자산구분
           03 RJLR013-SCRT-ASST-DSTCD        PIC  X(00003).
      *       유동화차수
           03 RJLR013-SCRT-DGRE              PIC S9(00003) COMP-3.
      *       한도계좌여부
           03 RJLR013-LIMT-ACN-YN            PIC  X(00001).
      *       한도계좌관리구분
           03 RJLR013-LIMT-ACN-MGT-DSTCD     PIC  X(00001).
      *       여신한도운용구분
           03 RJLR013-LNLMT-MGIVST-DSTCD     PIC  X(00001).
      *       주담보종류구분
           03 RJLR013-MAIN-S-KND-DSTCD       PIC  X(00001).
      *       주담보구분
           03 RJLR013-MAIN-SCURTY-DSTCD      PIC  X(00003).
      *       한도계좌번호
           03 RJLR013-LIMT-ACNO              PIC  X(00020).
      *       투자금융관리번호
           03 RJLR013-INFC-MGT-NO            PIC  X(00009).
      *       투자트렌치번호
           03 RJLR013-INVST-TRNH-NO          PIC  X(00003).
      *       투자금융회차
           03 RJLR013-INFC-NTH               PIC S9(00005) COMP-3.
      *       시스템최종처리일시
           03 RJLR013-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR013-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR013   C O P Y B O O K   E N D
      *=================================================================
