      *=================================================================
      *  테이블명      : THKJL0038(그룹신용공여월집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0038
      *  사용예        : 01  TRJL0038-REC.
      *                      COPY  TRJL0038.
      *  최종변경일시  : 2010년01월23일17시07분07초
      *=================================================================
      *       그룹회사코드
           03 RJL0038-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0038-BASE-YM                PIC  X(00006).
      *       계열기업군코드
           03 RJL0038-AFFLT-CORP-GROUP-CD    PIC  X(00006).
      *       상품대분류코드
           03 RJL0038-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJL0038-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJL0038-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJL0038-PRDCT-NO               PIC  X(00005).
      *       BS기준잔액
           03 RJL0038-BS-BASE-BAL            PIC S9(00015) COMP-3.
      *       CA담보환산금액
           03 RJL0038-CA-SCURTY-AUC          PIC S9(00015) COMP-3.
      *       제외자산금액
           03 RJL0038-ECLUD-ASAM             PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0038-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0038-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0038   C O P Y B O O K   E N D
      *=================================================================
