      *=================================================================
      *  테이블명      : THKJLR001(외화주식잔고현황)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR001
      *  사용예        : 01  TRJLR001-REC.
      *                      COPY  TRJLR001.
      *  최종변경일시  : 2010년01월23일17시08분56초
      *=================================================================
      *       그룹회사코드
           03 RJLR001-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR001-BASE-YMD               PIC  X(00008).
      *       외화거래번호
           03 RJLR001-FC-TRAN-NO             PIC  X(00010).
      *       고객식별자
           03 RJLR001-CUST-IDNFR             PIC  X(00010).
      *       고객관리번호
           03 RJLR001-CUST-MGT-NO            PIC  X(00005).
      *       고객고유번호
           03 RJLR001-CUNIQNO                PIC  X(00020).
      *       법인등록번호
           03 RJLR001-CPRNO                  PIC  X(00013).
      *       통화코드
           03 RJLR001-CNCYCD                 PIC  X(00003).
      *       외화장부금액
           03 RJLR001-FC-ACBK-AMT            PIC S9(00015)V9(3) COMP-3.
      *       관리부점코드
           03 RJLR001-MGT-BRNCD              PIC  X(00004).
      *       계정과목코드
           03 RJLR001-TIACC-CD               PIC  X(00005).
      *       계정세과목코드
           03 RJLR001-DACITM                 PIC  X(00003).
      *       통합계정과목코드
           03 RJLR001-INTGRA-TIACC-CD        PIC  X(00013).
      *       원화환산장부가
           03 RJLR001-WONC-UTCNG-BKVAL       PIC S9(00015) COMP-3.
      *       매입년월일
           03 RJLR001-BUY-YMD                PIC  X(00008).
      *       대미환산장부금액
           03 RJLR001-USD-ACBK-AMT           PIC S9(00015)V9(3) COMP-3.
      *       ISO국가코드
           03 RJLR001-ISO-NATNL-CD           PIC  X(00002).
      *       시스템최종처리일시
           03 RJLR001-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR001-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR001   C O P Y B O O K   E N D
      *=================================================================
