      *=================================================================
      *  테이블명      : THKJL0044(표준산업코드목록)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0044
      *  사용예        : 01  TRJL0044-REC.
      *                      COPY  TRJL0044.
      *  최종변경일시  : 2021년10월15일10시28분02초
      *=================================================================
      *       그룹회사코드
           03 RJL0044-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0044-BASE-YM                PIC  X(00006).
      *       신표준산업분류코드
           03 RJL0044-NEW-SI-CLSFI-CD        PIC  X(00005).
      *       TEPEER구분
           03 RJL0044-TE-PEER-DSTCD          PIC  X(00005).
      *       대분류업종코드
           03 RJL0044-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       산업평가등급구분
           03 RJL0044-IDSTRY-V-GRD-DSTCD     PIC  X(00004).
      *       IR등급평가년월일
           03 RJL0044-INRT-GRD-VALUA-YMD     PIC  X(00008).
      *       한은매칭코드
           03 RJL0044-BOK-MTCN-CD            PIC  X(00006).
      *       표준산업코드명
           03 RJL0044-STND-IDSTRY-CD-NAME    PIC  X(00042).
      *       PEER코드명
           03 RJL0044-PEER-CD-NAME           PIC  X(00102).
      *       대분류업종코드명
           03 RJL0044-LAG-C-BZTYP-CD-NAME    PIC  X(00032).
      *       시스템최종처리일시
           03 RJL0044-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0044-SYS-LAST-UNO           PIC  X(00007).
      *       SUB업종코드
           03 RJL0044-SUB-BZTYP-CD           PIC  X(00003).
      *       SUB업종코드명
           03 RJL0044-SUB-BZTYP-CD-NAME      PIC  X(00042).
      *       TE산업분류코드
           03 RJL0044-TE-IDSTRY-CLSFI-CD     PIC  X(00003).
      *=================================================================
      *  TRJL0044   C O P Y B O O K   E N D
      *=================================================================
