      *=================================================================
      *  테이블명      : THKJL0161(TE한도초과업체명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0161
      *  사용예        : 01  TRJL0161-REC.
      *                      COPY  TRJL0161.
      *  최종변경일시  : 2017년02월03일15시53분58초
      *=================================================================
      *       그룹회사코드
           03 RJL0161-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0161-BASE-YMD               PIC  X(00008).
      *       고객식별자
           03 RJL0161-CUST-IDNFR             PIC  X(00010).
      *       차주번호
           03 RJL0161-BRWR-NO                PIC  X(00013).
      *       기업상호명
           03 RJL0161-CORP-CONM-NAME         PIC  X(00052).
      *       고객관리부점코드
           03 RJL0161-CUST-MGT-BRNCD         PIC  X(00004).
      *       TE기업규모구분
           03 RJL0161-TE-CORP-SCAL-DSTCD     PIC  X(00001).
      *       명목액기준한도
           03 RJL0161-TTL-AMT-BASE-CLAM      PIC S9(00015) COMP-3.
      *       명목액기준잔액
           03 RJL0161-TTL-AMT-BASE-BAL       PIC S9(00015) COMP-3.
      *       TE관리한도
           03 RJL0161-TE-MGT-CLAM            PIC S9(00015) COMP-3.
      *       한도기준TE금액
           03 RJL0161-LIMT-BASE-TE-AMT       PIC S9(00015) COMP-3.
      *       잔액기준TE금액
           03 RJL0161-BAL-BASE-TE-AMT        PIC S9(00015) COMP-3.
      *       여신성관리한도
           03 RJL0161-LNBZ-I-MGT-CLAM        PIC S9(00015) COMP-3.
      *       여신성한도기준TE금액
           03 RJL0161-LNBZ-ILB-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       여신성잔액기준TE금액
           03 RJL0161-LNBZ-IBB-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       시장성관리한도
           03 RJL0161-MRKTY-MGT-CLAM         PIC S9(00015) COMP-3.
      *       시장성한도기준TE금액
           03 RJL0161-MRKTY-LB-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       시장성잔액기준TE금액
           03 RJL0161-MRKTY-BB-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0161-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0161-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0161   C O P Y B O O K   E N D
      *=================================================================
