      *=================================================================
      *  테이블명      : THKJL0046(산업분류가중치기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0046
      *  사용예        : 01  TRJL0046-REC.
      *                      COPY  TRJL0046.
      *  최종변경일시  : 2021년08월31일14시56분03초
      *=================================================================
      *       그룹회사코드
           03 RJL0046-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0046-BASE-YM                PIC  X(00006).
      *       TE산업분류코드
           03 RJL0046-TE-IDSTRY-CLSFI-CD     PIC  X(00003).
      *       TE자기자본비율
           03 RJL0046-TE-ONCP-RATO           PIC S9(00003)V9(2) COMP-3.
      *       TE매출액비율
           03 RJL0046-TE-SALEPR-RATO         PIC S9(00003)V9(2) COMP-3.
      *       TE총자산비율
           03 RJL0046-TE-TOTAL-ASST-RATO     PIC S9(00003)V9(2) COMP-3.
      *       TE산업분류코드명
           03 RJL0046-TE-I-CLSFI-CD-NAME     PIC  X(00052).
      *       시스템최종처리일시
           03 RJL0046-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0046-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0046   C O P Y B O O K   E N D
      *=================================================================
