      *=================================================================
      *  테이블명      : THKJLR003(심사 미기표 여신현황 수보)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR003
      *  사용예        : 01  TRJLR003-REC.
      *                      COPY  TRJLR003.
      *  최종변경일시  : 2017년11월23일14시23분33초
      *=================================================================
      *       그룹회사코드
           03 RJLR003-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR003-BASE-YMD               PIC  X(00008).
      *       심사고객식별자
           03 RJLR003-EXMTN-CUST-IDNFR       PIC  X(00010).
      *       여신승인신청번호
           03 RJLR003-LNBZ-ATHOR-APLCN-NO    PIC  X(00013).
      *       여신승인신청일련번호
           03 RJLR003-LNBZ-A-APLCN-SERNO     PIC S9(00003) COMP-3.
      *       표준산업분류코드
           03 RJLR003-STND-I-CLSFI-CD        PIC  X(00005).
      *       기업규모구분
           03 RJLR003-CORP-SCAL-DSTCD        PIC  X(00001).
      *       담보연결여신계좌번호
           03 RJLR003-SCURTY-L-LNBZ-ACNO     PIC  X(00020).
      *       소호기업신용등급
           03 RJLR003-SOHO-C-CRDRAT-DSTCD    PIC  X(00004).
      *       대출금액
           03 RJLR003-LN-AMT                 PIC S9(00018) COMP-3.
      *       배분담보비율
           03 RJLR003-DTRB-SCURTY-RATO       PIC S9(00003)V9(2) COMP-3.
      *       차감후위험조정이익률
           03 RJLR003-SUBTR-ARA-PRFT-RT      PIC S9(00008)V9(5) COMP-3.
      *       금리가이드라인준수율
           03 RJLR003-IRT-GD-LINE-OBSV-RT    PIC S9(00004)V9(5) COMP-3.
      *       여신승인년월일
           03 RJLR003-LNBZ-ATHOR-YMD         PIC  X(00008).
      *       적용차주신용등급구분
           03 RJLR003-APLY-BRWR-CRTDSCD      PIC  X(00004).
      *       상품대분류코드
           03 RJLR003-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJLR003-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJLR003-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJLR003-PRDCT-NO               PIC  X(00005).
      *       신청부점코드
           03 RJLR003-APLCN-BRNCD            PIC  X(00004).
      *       전결권자구분
           03 RJLR003-APVOF-DSTCD            PIC  X(00002).
      *       시스템최종처리일시
           03 RJLR003-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR003-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR003   C O P Y B O O K   E N D
      *=================================================================
