      *=================================================================
      *  테이블명      : THKJL0003(TE관리한도신청이력)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0003
      *  사용예        : 01  TRJL0003-REC.
      *                      COPY  TRJL0003.
      *  최종변경일시  : 2020년06월03일15시51분50초
      *=================================================================
      *       그룹회사코드
           03 RJL0003-GROUP-CO-CD            PIC  X(00003).
      *       한도신청번호
           03 RJL0003-LIMT-APLCN-NO          PIC  X(00010).
      *       차주번호
           03 RJL0003-BRWR-NO                PIC  X(00013).
      *       신청년월일
           03 RJL0003-APLCN-YMD              PIC  X(00008).
      *       한도신청종류구분
           03 RJL0003-LIMT-A-KND-DSTCD       PIC  X(00001).
      *       한도진행상태구분
           03 RJL0003-LIMT-P-STUS-DSTCD      PIC  X(00001).
      *       신청부점코드
           03 RJL0003-APLCN-BRNCD            PIC  X(00004).
      *       신청직원번호
           03 RJL0003-APLCN-EMPID            PIC  X(00007).
      *       신표준산업분류코드
           03 RJL0003-NEW-SI-CLSFI-CD        PIC  X(00005).
      *       내부신용평가등급구분
           03 RJL0003-INTNL-CV-GRD-DSTCD     PIC  X(00004).
      *       그룹사신용등급구분
           03 RJL0003-CMGR-CRTDSCD           PIC  X(00003).
      *       기업TE관리한도
           03 RJL0003-CORP-TE-MGT-CLAM       PIC S9(00015) COMP-3.
      *       그룹TE관리한도
           03 RJL0003-GROUP-TE-MGT-CLAM      PIC S9(00015) COMP-3.
      *       기업토탈익스포져금액
           03 RJL0003-CORP-TE-AMT            PIC S9(00015) COMP-3.
      *       그룹토탈익스포져금액
           03 RJL0003-GROUP-TE-AMT           PIC S9(00015) COMP-3.
      *       전여신성자산
           03 RJL0003-BF-LNBZ-INCLIN-ASST    PIC S9(00015) COMP-3.
      *       전시장성자산
           03 RJL0003-BF-MRKTY-ASST          PIC S9(00015) COMP-3.
      *       후여신성자산
           03 RJL0003-AF-LNBZ-INCLIN-ASST    PIC S9(00015) COMP-3.
      *       후시장성자산
           03 RJL0003-AF-MRKTY-ASST          PIC S9(00015) COMP-3.
      *       승인년월일
           03 RJL0003-ATHOR-YMD              PIC  X(00008).
      *       승인직원번호
           03 RJL0003-ATHOR-EMPID            PIC  X(00007).
      *       한도설정유효년월일
           03 RJL0003-LIMT-STUP-VALD-YMD     PIC  X(00008).
      *       한도신청구분
           03 RJL0003-LIMT-APLCN-DSTCD       PIC  X(00001).
      *       한도승인권자구분
           03 RJL0003-LIMT-ATRZ-DSTCD        PIC  X(00001).
      *       한도승인조건구분
           03 RJL0003-LIMT-A-CNDN-DSTCD      PIC  X(00001).
      *       한도승인구분
           03 RJL0003-LIMT-ATHOR-DSTCD       PIC  X(00001).
      *       대표자명
           03 RJL0003-RPRS-NAME              PIC  X(00052).
      *       한글그룹명
           03 RJL0003-HANGL-GROUP-NAME       PIC  X(00042).
      *       시스템최종처리일시
           03 RJL0003-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0003-SYS-LAST-UNO           PIC  X(00007).
      *       관리한도
           03 RJL0003-MGT-CLAM               PIC S9(00015) COMP-3.
      *       여신성관리한도
           03 RJL0003-LNBZ-I-MGT-CLAM        PIC S9(00015) COMP-3.
      *       시장성관리한도
           03 RJL0003-MRKTY-MGT-CLAM         PIC S9(00015) COMP-3.
      *       최종승인직원번호
           03 RJL0003-LAST-ATHOR-EMPID       PIC  X(00007).
      *       전신용평가유효년월일
           03 RJL0003-BF-C-VALUA-VALD-YMD    PIC  X(00008).
      *       후신용평가유효년월일
           03 RJL0003-AF-C-VALUA-VALD-YMD    PIC  X(00008).
      *       기준한도초과여부
           03 RJL0003-BASE-LIMT-EXCS-YN      PIC  X(00001).
      *       한도승인사유구분
           03 RJL0003-LIMT-A-RESN-DSTCD      PIC  X(00003).
      *       고객식별자
           03 RJL0003-CUST-IDNFR             PIC  X(00010).
      *       승인부점코드
           03 RJL0003-ATHOR-BRNCD            PIC  X(00004).
      *=================================================================
      *  TRJL0003   C O P Y B O O K   E N D
      *=================================================================
