      *=================================================================
      *  테이블명      : THKJLR008(파생상품 거래건별 평가금액 
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR008
      *  사용예        : 01  TRJLR008-REC.
      *                      COPY  TRJLR008.
      *  최종변경일시  : 2010년01월23일17시09분35초
      *=================================================================
      *       그룹회사코드
           03 RJLR008-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR008-BASE-YMD               PIC  X(00008).
      *       외화거래번호
           03 RJLR008-FC-TRAN-NO             PIC  X(00010).
      *       파생상품구분
           03 RJLR008-DRVT-PRDCT-DSTCD       PIC  X(00006).
      *       일련번호
           03 RJLR008-SERNO                  PIC S9(00007) COMP-3.
      *       차주번호
           03 RJLR008-BRWR-NO                PIC  X(00013).
      *       외화고객고유번호
           03 RJLR008-FC-CUNIQNO             PIC  X(00020).
      *       고객식별자
           03 RJLR008-CUST-IDNFR             PIC  X(00010).
      *       고객관리번호
           03 RJLR008-CUST-MGT-NO            PIC  X(00005).
      *       네팅여부
           03 RJLR008-NTNG-YN                PIC  X(00001).
      *       외화상품유형구분
           03 RJLR008-FC-PRDCT-PTRN-DSTCD    PIC  X(00003).
      *       매입매도구분
           03 RJLR008-BUY-SELLZ-DSTCD        PIC  X(00001).
      *       거래년월일
           03 RJLR008-TRAN-YMD               PIC  X(00008).
      *       만기년월일
           03 RJLR008-EXPIR-YMD              PIC  X(00008).
      *       거래통화코드
           03 RJLR008-TRAN-CNCYCD            PIC  X(00003).
      *       거래통화금액
           03 RJLR008-TRAN-CRNCY-AMT         PIC S9(00015)V9(3) COMP-3.
      *       상대통화코드
           03 RJLR008-CNPRT-CNCYCD           PIC  X(00003).
      *       상대통화금액
           03 RJLR008-CNPRT-CRNCY-AMT        PIC S9(00015)V9(3) COMP-3.
      *       평가금액
           03 RJLR008-VALPR                  PIC S9(00015) COMP-3.
      *       추가항목금액
           03 RJLR008-SUPPL-ITEM-AMT         PIC S9(00015) COMP-3.
      *       영업부점코드
           03 RJLR008-BZOPR-BRNCD            PIC  X(00004).
      *       ISO국가코드
           03 RJLR008-ISO-NATNL-CD           PIC  X(00002).
      *       시스템최종처리일시
           03 RJLR008-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR008-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR008   C O P Y B O O K   E N D
      *=================================================================
