      *=================================================================
      *  테이블명      : THKJL0083(이사회승인관련월별계좌현황 기본
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0083
      *  사용예        : 01  TRJL0083-REC.
      *                      COPY  TRJL0083.
      *  최종변경일시  : 2024년09월02일16시38분51초
      *=================================================================
      *       그룹회사코드
           03 RJL0083-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0083-BASE-YM                PIC  X(00006).
      *       이사회승인번호
           03 RJL0083-BRDC-ATHOR-NO          PIC  X(00010).
      *       관련여신일련번호
           03 RJL0083-RELATD-LNBZ-SERNO      PIC S9(00003) COMP-3.
      *       고객식별자
           03 RJL0083-CUST-IDNFR             PIC  X(00010).
      *       계좌번호
           03 RJL0083-ACNO                   PIC  X(00020).
      *       약정계좌번호
           03 RJL0083-AGRE-ACNO              PIC  X(00020).
      *       통합계정과목코드
           03 RJL0083-INTGRA-TIACC-CD        PIC  X(00013).
      *       시작년월일
           03 RJL0083-START-YMD              PIC  X(00008).
      *       만기년월일
           03 RJL0083-EXPIR-YMD              PIC  X(00008).
      *       통화코드
           03 RJL0083-CNCYCD                 PIC  X(00003).
      *       통화한도
           03 RJL0083-CRNCY-CLAM             PIC S9(00015)V9(3) COMP-3.
      *       통화잔액
           03 RJL0083-CRNCY-BAL              PIC S9(00015)V9(3) COMP-3.
      *       신용공여익스포져금액
           03 RJL0083-GRCR-EXPSR-AMT         PIC S9(00015) COMP-3.
      *       금리내용
           03 RJL0083-IRTZ-CTNT              PIC  X(00042).
      *       담보형태구분
           03 RJL0083-SCURTY-FORM-DSTCD      PIC  X(00001).
      *       담보설정금액
           03 RJL0083-SCURTY-SETAMT          PIC S9(00015) COMP-3.
      *       수기계좌여부
           03 RJL0083-HWRT-ACN-YN            PIC  X(00001).
      *       시스템최종처리일시
           03 RJL0083-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0083-SYS-LAST-UNO           PIC  X(00007).
      *       취급부점코드
           03 RJL0083-HNDLN-BRNCD            PIC  X(00004).
      *       대출취급형태구분
           03 RJL0083-LN-HNDLN-FORM-DSTCD    PIC  X(00001).
      *=================================================================
      *  TRJL0083   C O P Y B O O K   E N D
      *=================================================================
