      *=================================================================
      *  테이블명      : THKJL0034(차주신용공여월집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0034
      *  사용예        : 01  TRJL0034-REC.
      *                      COPY  TRJL0034.
      *  최종변경일시  : 2017년02월03일13시44분02초
      *=================================================================
      *       그룹회사코드
           03 RJL0034-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0034-BASE-YM                PIC  X(00006).
      *       고객식별자
           03 RJL0034-CUST-IDNFR             PIC  X(00010).
      *       상품대분류코드
           03 RJL0034-PRDCT-LAG-CLSFI-CD     PIC  X(00002).
      *       상품중분류코드
           03 RJL0034-PRDCT-MEDM-CLSFI-CD    PIC  X(00002).
      *       상품템플릿코드
           03 RJL0034-PRDCT-TMPLT-CD         PIC  X(00003).
      *       상품번호
           03 RJL0034-PRDCT-NO               PIC  X(00005).
      *       차주번호
           03 RJL0034-BRWR-NO                PIC  X(00013).
      *       BS기준잔액
           03 RJL0034-BS-BASE-BAL            PIC S9(00015) COMP-3.
      *       CA담보환산금액
           03 RJL0034-CA-SCURTY-AUC          PIC S9(00015) COMP-3.
      *       제외자산금액
           03 RJL0034-ECLUD-ASAM             PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0034-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0034-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0034   C O P Y B O O K   E N D
      *=================================================================
