      *=================================================================
      *  테이블명      : THKJL0042(자회사대주주기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0042
      *  사용예        : 01  TRJL0042-REC.
      *                      COPY  TRJL0042.
      *  최종변경일시  : 2017년01월31일14시38분08초
      *=================================================================
      *       그룹회사코드
           03 RJL0042-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0042-BASE-YM                PIC  X(00006).
      *       고객식별자
           03 RJL0042-CUST-IDNFR             PIC  X(00010).
      *       자회사대주주구분
           03 RJL0042-SBCO-L-SKHDR-DSTCD     PIC  X(00001).
      *       차주번호
           03 RJL0042-BRWR-NO                PIC  X(00013).
      *       등록년월일
           03 RJL0042-REGI-YMD               PIC  X(00008).
      *       등록직원번호
           03 RJL0042-REGI-EMPID             PIC  X(00007).
      *       대주주출자금액
           03 RJL0042-LAG-SKHDR-AMFN         PIC S9(00015) COMP-3.
      *       해제년월일
           03 RJL0042-REVOC-YMD              PIC  X(00008).
      *       해제직원번호
           03 RJL0042-REVOC-EMPID            PIC  X(00007).
      *       시스템최종처리일시
           03 RJL0042-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0042-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0042   C O P Y B O O K   E N D
      *=================================================================
