      *=================================================================
      *  테이블명      : THKJL0067(산업별규모별익스포져일집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0067
      *  사용예        : 01  TRJL0067-REC.
      *                      COPY  TRJL0067.
      *  최종변경일시  : 2019년12월20일10시33분17초
      *=================================================================
      *       그룹회사코드
           03 RJL0067-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0067-BASE-YMD               PIC  X(00008).
      *       대분류업종코드
           03 RJL0067-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       산업TE기업규모구분
           03 RJL0067-IDSTRY-TCS-DSTCD       PIC  X(00001).
      *       대상업체건수
           03 RJL0067-TAGET-ENTP-NOITM       PIC S9(00005) COMP-3.
      *       산업별규모별SUB한도
           03 RJL0067-IDSTRY-PSP-SUB-CLAM    PIC S9(00015) COMP-3.
      *       산업별규모별TE금액
           03 RJL0067-IDSTRY-PSP-TE-AMT      PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0067-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0067-SYS-LAST-UNO           PIC  X(00007).
      *       한도초과년월일
           03 RJL0067-LIMT-EXCS-YMD          PIC  X(00008).
      *       예외적용년월일
           03 RJL0067-ECEPT-APLY-YMD         PIC  X(00008).
      *       취급중단년월일
           03 RJL0067-HNDLN-DSCN-YMD         PIC  X(00008).
      *       취급기준1적용년월일
           03 RJL0067-HNDLN-B-1-APLY-YMD     PIC  X(00008).
      *       취급기준2적용년월일
           03 RJL0067-HNDLN-B-2-APLY-YMD     PIC  X(00008).
      *       전년도말익스포져금액
           03 RJL0067-PYY-X-END-EXPSR-AMT    PIC S9(00015) COMP-3.
      *       조회여부
           03 RJL0067-INQURY-YN              PIC  X(00001).
      *       대출금액
           03 RJL0067-LN-AMT                 PIC S9(00018) COMP-3.
      *       국외대상업체건수
           03 RJL0067-ABRD-T-ENTP-NOITM      PIC S9(00005) COMP-3.
      *       국외산업규모한도금액
           03 RJL0067-ABRD-IS-SUB-CLAM       PIC S9(00015) COMP-3.
      *       국외산업규모TE금액
           03 RJL0067-ABRD-I-SCAL-T-E-AMT    PIC S9(00015) COMP-3.
      *       국외전년말TE금액
           03 RJL0067-ABRD-PXE-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       전체대상업체건수
           03 RJL0067-WHOL-T-ENTP-NOITM      PIC S9(00005) COMP-3.
      *=================================================================
      *  TRJL0067   C O P Y B O O K   E N D
      *=================================================================
