      *=================================================================
      *  테이블명      : THKJL0011(차주관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0011
      *  사용예        : 01  TRJL0011-REC.
      *                      COPY  TRJL0011.
      *  최종변경일시  : 2017년02월03일10시46분46초
      *=================================================================
      *       그룹회사코드
           03 RJL0011-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0011-BASE-YM                PIC  X(00006).
      *       고객식별자
           03 RJL0011-CUST-IDNFR             PIC  X(00010).
      *       차주번호
           03 RJL0011-BRWR-NO                PIC  X(00013).
      *       한도고객구분
           03 RJL0011-LIMT-CUST-DSTCD        PIC  X(00001).
      *       TE기업규모구분
           03 RJL0011-TE-CORP-SCAL-DSTCD     PIC  X(00001).
      *       고객관리부점코드
           03 RJL0011-CUST-MGT-BRNCD         PIC  X(00004).
      *       내부신용평가등급구분
           03 RJL0011-INTNL-CV-GRD-DSTCD     PIC  X(00004).
      *       신용평가년월일
           03 RJL0011-CRDT-VALUA-YMD         PIC  X(00008).
      *       신표준산업분류코드
           03 RJL0011-NEW-SI-CLSFI-CD        PIC  X(00005).
      *       기준한도
           03 RJL0011-BASE-CLAM              PIC S9(00015) COMP-3.
      *       기준한도산출년월일
           03 RJL0011-BASE-LIMT-CMPTN-YMD    PIC  X(00008).
      *       관리한도
           03 RJL0011-MGT-CLAM               PIC S9(00015) COMP-3.
      *       관리한도설정년월일
           03 RJL0011-MGT-LIMT-STUP-YMD      PIC  X(00008).
      *       관리한도유효년월일
           03 RJL0011-MGT-LIMT-VALD-YMD      PIC  X(00008).
      *       여신성관리한도
           03 RJL0011-LNBZ-I-MGT-CLAM        PIC S9(00015) COMP-3.
      *       시장성관리한도
           03 RJL0011-MRKTY-MGT-CLAM         PIC S9(00015) COMP-3.
      *       외화기준한도
           03 RJL0011-FC-BASE-CLAM           PIC S9(00015) COMP-3.
      *       외화신용공여한도
           03 RJL0011-FC-GRCR-CLAM           PIC S9(00015) COMP-3.
      *       외화한도설정년월일
           03 RJL0011-FC-LIMT-STUP-YMD       PIC  X(00008).
      *       외화한도유효년월일
           03 RJL0011-FC-LIMT-VALD-YMD       PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0011-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0011-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0011   C O P Y B O O K   E N D
      *=================================================================
