      *=================================================================
      *  테이블명      : THKJL0059(최고한도관리 제외대상 차주)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0059
      *  사용예        : 01  TRJL0059-REC.
      *                      COPY  TRJL0059.
      *  최종변경일시  : 2017년01월31일14시38분58초
      *=================================================================
      *       그룹회사코드
           03 RJL0059-GROUP-CO-CD            PIC  X(00003).
      *       고객식별자
           03 RJL0059-CUST-IDNFR             PIC  X(00010).
      *       차주번호
           03 RJL0059-BRWR-NO                PIC  X(00013).
      *       한도관리제외구분
           03 RJL0059-LIMT-M-ECLUD-DSTCD     PIC  X(00001).
      *       채무자명
           03 RJL0059-DBTRZ-NAME             PIC  X(00052).
      *       등록년월일
           03 RJL0059-REGI-YMD               PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0059-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0059-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0059   C O P Y B O O K   E N D
      *=================================================================
