      *=================================================================
      *  테이블명      : THKJL0039(산업등급별익스포져일집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0039
      *  사용예        : 01  TRJL0039-REC.
      *                      COPY  TRJL0039.
      *  최종변경일시  : 2019년12월18일14시15분36초
      *=================================================================
      *       그룹회사코드
           03 RJL0039-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0039-BASE-YMD               PIC  X(00008).
      *       산업평가등급구분
           03 RJL0039-IDSTRY-V-GRD-DSTCD     PIC  X(00004).
      *       대분류업종코드
           03 RJL0039-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       TEPEER구분
           03 RJL0039-TE-PEER-DSTCD          PIC  X(00005).
      *       대상업체건수
           03 RJL0039-TAGET-ENTP-NOITM       PIC S9(00005) COMP-3.
      *       산업관리한도
           03 RJL0039-IDSTRY-MGT-CLAM        PIC S9(00015) COMP-3.
      *       명목액기준한도
           03 RJL0039-TTL-AMT-BASE-CLAM      PIC S9(00015) COMP-3.
      *       명목액기준잔액
           03 RJL0039-TTL-AMT-BASE-BAL       PIC S9(00015) COMP-3.
      *       TE한도환산금액
           03 RJL0039-TE-LIMT-AUC            PIC S9(00015) COMP-3.
      *       TE잔액환산금액
           03 RJL0039-TE-BAL-AUC             PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0039-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0039-SYS-LAST-UNO           PIC  X(00007).
      *       전년도말익스포져금액
           03 RJL0039-PYY-X-END-EXPSR-AMT    PIC S9(00015) COMP-3.
      *       국외대상업체건수
           03 RJL0039-ABRD-T-ENTP-NOITM      PIC S9(00005) COMP-3.
      *       국외산업관리한도금액
           03 RJL0039-ABRD-I-MGT-CLAM        PIC S9(00015) COMP-3.
      *       국외명목기준한도금액
           03 RJL0039-ABRD-TA-BASE-CLAM      PIC S9(00015) COMP-3.
      *       국외명목액기준잔액
           03 RJL0039-ABRD-T-AMT-BASE-BAL    PIC S9(00015) COMP-3.
      *       국외TE한도환산금액
           03 RJL0039-ABRD-TE-LIMT-AUC       PIC S9(00015) COMP-3.
      *       국외TE잔액환산금액
           03 RJL0039-ABRD-TE-BAL-AUC        PIC S9(00015) COMP-3.
      *       국외전년말TE금액
           03 RJL0039-ABRD-PXE-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       전체대상업체건수
           03 RJL0039-WHOL-T-ENTP-NOITM      PIC S9(00005) COMP-3.
      *=================================================================
      *  TRJL0039   C O P Y B O O K   E N D
      *=================================================================
