      *=================================================================
      *  테이블명      : THKJL0001(기준한도기초자료)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0001
      *  사용예        : 01  TRJL0001-REC.
      *                      COPY  TRJL0001.
      *  최종변경일시  : 2021년11월02일10시32분39초
      *=================================================================
      *       그룹회사코드
           03 RJL0001-GROUP-CO-CD            PIC  X(00003).
      *       고객식별자
           03 RJL0001-CUST-IDNFR             PIC  X(00010).
      *       기준년월
           03 RJL0001-BASE-YM                PIC  X(00006).
      *       차주번호
           03 RJL0001-BRWR-NO                PIC  X(00013).
      *       신표준산업분류코드
           03 RJL0001-NEW-SI-CLSFI-CD        PIC  X(00005).
      *       한신평재무업종구분
           03 RJL0001-KIS-F-BZTYP-DSTCD      PIC  X(00002).
      *       결산년월
           03 RJL0001-STLACC-YM              PIC  X(00006).
      *       업종평균적용년
           03 RJL0001-BZTYP-AVG-APLY-YR      PIC  X(00004).
      *       내부신용평가등급구분
           03 RJL0001-INTNL-CV-GRD-DSTCD     PIC  X(00004).
      *       신용평가년월일
           03 RJL0001-CRDT-VALUA-YMD         PIC  X(00008).
      *       신용평가유효년월일
           03 RJL0001-CRDT-VALUA-VALD-YMD    PIC  X(00008).
      *       신용등급지원비율
           03 RJL0001-CRDRAT-SPORT-RATO      PIC S9(00003)V9(2) COMP-3.
      *       전전년사업이익
           03 RJL0001-BF-PYY-BIZ-PRFT        PIC S9(00015) COMP-3.
      *       전년사업이익
           03 RJL0001-PYY-BIZ-PRFT           PIC S9(00015) COMP-3.
      *       기준년사업이익
           03 RJL0001-BASE-YR-BIZ-PRFT       PIC S9(00015) COMP-3.
      *       영업이익
           03 RJL0001-OPRFT                  PIC S9(00015) COMP-3.
      *       이자수익
           03 RJL0001-INT-ERN                PIC S9(00015) COMP-3.
      *       감가상각비
           03 RJL0001-DPRC-CST               PIC S9(00015) COMP-3.
      *       금융비용
           03 RJL0001-FNCS                   PIC S9(00015) COMP-3.
      *       단기차입금
           03 RJL0001-SHTRM-AMBR             PIC S9(00015) COMP-3.
      *       단기차입금상환금액
           03 RJL0001-SHTRM-AMBR-RPAYAMT     PIC S9(00015) COMP-3.
      *       업종가중평균율
           03 RJL0001-BZTYP-WGHTG-AVG-RT     PIC S9(00003)V9(2) COMP-3.
      *       업체총차입금
           03 RJL0001-ENTP-TOTAL-AMBR        PIC S9(00015) COMP-3.
      *       총자산
           03 RJL0001-TOTAL-ASST             PIC S9(00015) COMP-3.
      *       매출액
           03 RJL0001-SALEPR                 PIC S9(00015) COMP-3.
      *       현금흐름기준금액
           03 RJL0001-CSFW-BSAMT             PIC S9(00015) COMP-3.
      *       전전년자기자본금
           03 RJL0001-BF-PYY-ONCP-AMT        PIC S9(00015) COMP-3.
      *       전년자기자본금
           03 RJL0001-PYY-ONCP-AMT           PIC S9(00015) COMP-3.
      *       기준년자기자본금
           03 RJL0001-BASE-YR-ONCP-AMT       PIC S9(00015) COMP-3.
      *       금융자기자본비율
           03 RJL0001-FINAC-ONCP-RATO        PIC S9(00003)V9(2) COMP-3.
      *       차입금자기자본율
           03 RJL0001-AMBR-ONCP-RT           PIC S9(00003)V9(2) COMP-3.
      *       자기자본기준금액
           03 RJL0001-ONCP-BSAMT             PIC S9(00015) COMP-3.
      *       상환능력기준한도
           03 RJL0001-SOLVN-BASE-CLAM        PIC S9(00015) COMP-3.
      *       차입금매출액비율
           03 RJL0001-AMBR-SALEPR-RATO       PIC S9(00003)V9(2) COMP-3.
      *       차입금총자산비율
           03 RJL0001-AMBR-T-ASST-RATO       PIC S9(00003)V9(2) COMP-3.
      *       규모기준한도
           03 RJL0001-SCAL-BASE-CLAM         PIC S9(00015) COMP-3.
      *       기준한도
           03 RJL0001-BASE-CLAM              PIC S9(00015) COMP-3.
      *       외화기준한도
           03 RJL0001-FC-BASE-CLAM           PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0001-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0001-SYS-LAST-UNO           PIC  X(00007).
      *       전전년영업이익
           03 RJL0001-BF-PYY-OPRFT           PIC S9(00015) COMP-3.
      *       전년영업이익
           03 RJL0001-PYY-OPRFT              PIC S9(00015) COMP-3.
      *       전전년이자수익
           03 RJL0001-BF-PYY-INT-ERN         PIC S9(00015) COMP-3.
      *       전년이자수익
           03 RJL0001-PYY-INT-ERN            PIC S9(00015) COMP-3.
      *       전전년감가상각비
           03 RJL0001-BF-PYY-DPRC-CST        PIC S9(00015) COMP-3.
      *       전년감가상각비
           03 RJL0001-PYY-DPRC-CST           PIC S9(00015) COMP-3.
      *       전전년금융비용
           03 RJL0001-BF-PYY-FNCS            PIC S9(00015) COMP-3.
      *       전년금융비용
           03 RJL0001-PYY-FNCS               PIC S9(00015) COMP-3.
      *       전전년단기차입금
           03 RJL0001-BF-PYY-SHTRM-AMBR      PIC S9(00015) COMP-3.
      *       전년단기차입금
           03 RJL0001-PYY-SHTRM-AMBR         PIC S9(00015) COMP-3.
      *       Y3단기차입금상환금액
           03 RJL0001-Y-3S-AMBR-RPAYAMT      PIC S9(00015) COMP-3.
      *       전전년업체총차입금
           03 RJL0001-BF-PE-TOTAL-AMBR       PIC S9(00015) COMP-3.
      *       전년업체총차입금
           03 RJL0001-PYY-ENTP-TOTAL-AMBR    PIC S9(00015) COMP-3.
      *       전전년매출액
           03 RJL0001-BF-PYY-SALEPR          PIC S9(00015) COMP-3.
      *       전년매출액
           03 RJL0001-PYY-SALEPR             PIC S9(00015) COMP-3.
      *       Y3현금흐름기준금액
           03 RJL0001-Y-3-CSFW-BSAMT         PIC S9(00015) COMP-3.
      *       Y3자기자본기준금액
           03 RJL0001-Y-3-ONCP-BSAMT         PIC S9(00015) COMP-3.
      *       Y3상환능력기준한도
           03 RJL0001-Y-3-SOLVN-BASE-CLAM    PIC S9(00015) COMP-3.
      *       기준전전년총자산
           03 RJL0001-BASE-BP-TOTAL-ASST     PIC S9(00015) COMP-3.
      *       기준전년총자산
           03 RJL0001-BASE-PYY-TOTAL-ASST    PIC S9(00015) COMP-3.
      *       Y3규모기준한도금액
           03 RJL0001-Y-3-SCAL-BASE-CLAM     PIC S9(00015) COMP-3.
      *       Y3기준한도금액
           03 RJL0001-Y-3-BASE-CLAM          PIC S9(00015) COMP-3.
      *       TE산업분류코드
           03 RJL0001-TE-IDSTRY-CLSFI-CD     PIC  X(00003).
      *       전전년금융총비용비율
           03 RJL0001-BF-PFT-CST-RATO        PIC S9(00004)V9(5) COMP-3.
      *       전년금융총비용비율
           03 RJL0001-PYY-FT-CST-RATO        PIC S9(00004)V9(5) COMP-3.
      *       금융총비용비율
           03 RJL0001-FINAC-T-CST-RATO       PIC S9(00004)V9(5) COMP-3.
      *       금융비용가중치값
           03 RJL0001-FNCS-WGHT-VAL          PIC S9(00003)V9(2) COMP-3.
      *       Y3금융비용가중치값
           03 RJL0001-Y-3-FNCS-WGHT-VAL      PIC S9(00003)V9(2) COMP-3.
      *       자기자본산업적용비율
           03 RJL0001-ONCP-I-APLY-RATO       PIC S9(00004)V9(5) COMP-3.
      *       차입금자본가중치값
           03 RJL0001-AMBR-CAPTL-WGHT-VAL    PIC S9(00003)V9(2) COMP-3.
      *       Y3차입자본가중치값
           03 RJL0001-Y-3A-CAPTL-WGHT-VAL    PIC S9(00003)V9(2) COMP-3.
      *       매출액산업적용비율
           03 RJL0001-SALEPR-I-APLY-RATO     PIC S9(00004)V9(5) COMP-3.
      *       Y3평균매출금액
           03 RJL0001-Y-3-AVG-ASALE-AMT      PIC S9(00015) COMP-3.
      *       Y3평균매출액비율
           03 RJL0001-Y-3-AVG-SALEPR-RATO    PIC S9(00004)V9(5) COMP-3.
      *       매출가중치값
           03 RJL0001-ASALE-WGHT-VAL         PIC S9(00003)V9(2) COMP-3.
      *       전전년매출채권회전률
           03 RJL0001-BF-PAB-ROTAT-RATO      PIC S9(00004)V9(5) COMP-3.
      *       전년매출채권회전비율
           03 RJL0001-PYY-AB-ROTAT-RATO      PIC S9(00004)V9(5) COMP-3.
      *       매출채권회전비율
           03 RJL0001-ASALE-B-ROTAT-RATO     PIC S9(00004)V9(5) COMP-3.
      *       매출채권회전가중치값
           03 RJL0001-ASALE-BRR-WGHT-VAL     PIC S9(00003)V9(2) COMP-3.
      *       Y3매출채권회전가중값
           03 RJL0001-Y-3ABRR-WGHT-VAL       PIC S9(00003)V9(2) COMP-3.
      *       매출기준금액
           03 RJL0001-ASALE-BSAMT            PIC S9(00015) COMP-3.
      *       Y3매출기준금액
           03 RJL0001-Y-3-ASALE-BSAMT        PIC S9(00015) COMP-3.
      *       총자산산업적용비율
           03 RJL0001-TOTAL-AI-APLY-RATO     PIC S9(00004)V9(5) COMP-3.
      *       전전년현금성자산금액
           03 RJL0001-BF-PC-INCLIN-ASAM      PIC S9(00015) COMP-3.
      *       전년현금성자산금액
           03 RJL0001-PYY-CSH-INCLIN-ASAM    PIC S9(00015) COMP-3.
      *       현금성자산금액
           03 RJL0001-CSH-INCLIN-ASAM        PIC S9(00015) COMP-3.
      *       평균현금성자산금액
           03 RJL0001-AVG-CSH-INCLIN-ASAM    PIC S9(00015) COMP-3.
      *       평균총자산금액
           03 RJL0001-AVG-TOTAL-ASAM         PIC S9(00015) COMP-3.
      *       평균현금성자산비율
           03 RJL0001-AVG-CI-ASST-RATO       PIC S9(00004)V9(5) COMP-3.
      *       차입자산비율가중치값
           03 RJL0001-BRRW-AR-WGHT-VAL       PIC S9(00003)V9(2) COMP-3.
      *       Y3차입자산비율가중값
           03 RJL0001-Y-3BA-RATO-WGHT-VAL    PIC S9(00003)V9(2) COMP-3.
      *       현금성자산가중치값
           03 RJL0001-CSH-IAR-WGHT-VAL       PIC S9(00003)V9(2) COMP-3.
      *       자산기준금액
           03 RJL0001-ASST-BSAMT             PIC S9(00015) COMP-3.
      *       Y3자산기준금액
           03 RJL0001-Y-3-ASST-BSAMT         PIC S9(00015) COMP-3.
      *       이익가중치값
           03 RJL0001-PRFT-WGHT-VAL          PIC S9(00003)V9(2) COMP-3.
      *       자본가중치값
           03 RJL0001-CAPTL-WGHT-VAL         PIC S9(00003)V9(2) COMP-3.
      *       신차입금자기자본비율
           03 RJL0001-NEW-AMBR-ONCP-RATO     PIC S9(00004)V9(5) COMP-3.
      *       Y3신차입금자기자본율
           03 RJL0001-Y-3N-AMBR-ONCP-RATO    PIC S9(00004)V9(5) COMP-3.
      *       신차입금총자산비율
           03 RJL0001-NEW-AT-ASST-RATO       PIC S9(00004)V9(5) COMP-3.
      *       Y3신차입금총자산비율
           03 RJL0001-Y-3NAT-ASST-RATO       PIC S9(00004)V9(5) COMP-3.
      *=================================================================
      *  TRJL0001   C O P Y B O O K   E N D
      *=================================================================
