      *=================================================================
      *  테이블명      : THKJLR009(유가증권매입약정명세)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TRJLR009
      *  사용예        : 01  TRJLR009-REC.
      *                      COPY  TRJLR009.
      *  최종변경일시  : 2015년02월04일14시36분22초
      *=================================================================
      *       그룹회사코드
           03 RJLR009-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR009-BASE-YMD               PIC  X(00008).
      *       통합트레이드번호
           03 RJLR009-INTGRA-TRD-NO          PIC  X(00014).
      *       통합인스트루먼트번호
           03 RJLR009-INTGRA-INSRT-NO        PIC  X(00012).
      *       통합계정과목코드
           03 RJLR009-INTGRA-TIACC-CD        PIC  X(00013).
      *       종목번호
           03 RJLR009-ITEMS-NO               PIC  X(00012).
      *       종목명
           03 RJLR009-ITEMS-NAME             PIC  X(00042).
      *       계약금액
           03 RJLR009-CNPR                   PIC S9(00018) COMP-3.
      *       매입약정금액
           03 RJLR009-BUY-AGRE-AMT           PIC S9(00018) COMP-3.
      *       인출금액
           03 RJLR009-WDMNY-AMT              PIC S9(00018) COMP-3.
      *       미인출금액
           03 RJLR009-NOT-WDMNY-AMT          PIC S9(00018) COMP-3.
      *       난외금액
           03 RJLR009-OFBL-AMT               PIC S9(00018) COMP-3.
      *       신규년월일
           03 RJLR009-NEW-YMD                PIC  X(00008).
      *       만기년월일
           03 RJLR009-EXPIR-YMD              PIC  X(00008).
      *       종료년월일
           03 RJLR009-END-YMD                PIC  X(00008).
      *       관리부점코드
           03 RJLR009-MGT-BRNCD              PIC  X(00004).
      *       매입약정거래번호
           03 RJLR009-BUY-AGRE-TRAN-NO       PIC  X(00014).
      *       CMBS북번호
           03 RJLR009-CMBS-BK-NO             PIC  X(00011).
      *       CMBS딜러명
           03 RJLR009-CMBS-DLER-NAME         PIC  X(00042).
      *       고객식별자
           03 RJLR009-CUST-IDNFR             PIC  X(00010).
      *       법인등록번호
           03 RJLR009-CPRNO                  PIC  X(00013).
      *       시스템최종처리일시
           03 RJLR009-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR009-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR009   C O P Y B O O K   E N D
      *=================================================================
