      *=================================================================
      *  테이블명      : THKJLG001(그룹사고객정보제공통지)
      *  파일 디렉토리 : KJL.TBDB2.DBCOPY
      *  MEMBER NAME   : TRJLG001
      *  사용예        : 01  TRJLG001-REC.
      *                      COPY  TRJLG001.
      *  최종변경일시  : 2015년05월26일13시52분36초
      *=================================================================
      *       그룹회사코드
           03 RJLG001-GROUP-CO-CD            PIC  X(00003).
      *       이용그룹회사코드
           03 RJLG001-UTZN-GROUP-CO-CD       PIC  X(00003).
      *       고객식별자
           03 RJLG001-CUST-IDNFR             PIC  X(00010).
      *       고객관리번호
           03 RJLG001-CUST-MGT-NO            PIC  X(00005).
      *       제공번호
           03 RJLG001-OFER-NO                PIC  X(00003).
      *       담당자번호
           03 RJLG001-RSPBL-PSN-NO           PIC  X(00002).
      *       정보제공목적구분
           03 RJLG001-INFO-O-OBJCTV-DSTCD    PIC  X(00003).
      *       통지년월일
           03 RJLG001-NOTI-YMD               PIC  X(00008).
      *       정보제공년월일
           03 RJLG001-INFO-OFER-YMD          PIC  X(00008).
      *       정보제공항목
           03 RJLG001-INFO-OFER-ITEM-CTNT    PIC  X(00102).
      *       시스템최종사용자번호
           03 RJLG001-SYS-LAST-UNO           PIC  X(00007).
      *       시스템최종처리일시
           03 RJLG001-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *=================================================================
      *  TRJLG001   C O P Y B O O K   E N D
      *=================================================================
