      *=================================================================
      *  테이블명      : THKJL0013(그룹사기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0013
      *  사용예        : 01  TRJL0013-REC.
      *                      COPY  TRJL0013.
      *  최종변경일시  : 2010년01월23일17시05분13초
      *=================================================================
      *       그룹회사코드
           03 RJL0013-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0013-BASE-YM                PIC  X(00006).
      *       계열적용구분
           03 RJL0013-AFFLT-APLY-DSTCD       PIC  X(00001).
      *       계열기업군코드
           03 RJL0013-AFFLT-CORP-GROUP-CD    PIC  X(00006).
      *       계열기업순위
           03 RJL0013-AFFLT-CORP-RANKG       PIC S9(00003) COMP-3.
      *       주채권은행코드
           03 RJL0013-MAIN-BND-BNK-CD        PIC  X(00003).
      *       계열기업군명
           03 RJL0013-AFFLT-C-GROUP-NAME     PIC  X(00042).
      *       그룹사신용등급구분
           03 RJL0013-CMGR-CRTDSCD           PIC  X(00003).
      *       등록직원번호
           03 RJL0013-REGI-EMPID             PIC  X(00007).
      *       등록년월일
           03 RJL0013-REGI-YMD               PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0013-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0013-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0013   C O P Y B O O K   E N D
      *=================================================================
