      *=================================================================
      *  테이블명      : THKJLR007(파생상품 차주별 Current Exposur
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJLR007
      *  사용예        : 01  TRJLR007-REC.
      *                      COPY  TRJLR007.
      *  최종변경일시  : 2017년02월04일16시43분48초
      *=================================================================
      *       그룹회사코드
           03 RJLR007-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJLR007-BASE-YMD               PIC  X(00008).
      *       고객식별자
           03 RJLR007-CUST-IDNFR             PIC  X(00010).
      *       고객관리번호
           03 RJLR007-CUST-MGT-NO            PIC  X(00005).
      *       차주번호
           03 RJLR007-BRWR-NO                PIC  X(00013).
      *       차주명
           03 RJLR007-BRWR-NAME              PIC  X(00042).
      *       네팅여부
           03 RJLR007-NTNG-YN                PIC  X(00001).
      *       총거래한도
           03 RJLR007-TOTAL-TRAN-CLAM        PIC S9(00015) COMP-3.
      *       담보거래한도
           03 RJLR007-SCURTY-TRAN-CLAM       PIC S9(00015) COMP-3.
      *       신용거래한도
           03 RJLR007-CRDT-TRAN-CLAM         PIC S9(00015) COMP-3.
      *       한도유효년월일
           03 RJLR007-LIMT-VALD-YMD          PIC  X(00008).
      *       면제여부
           03 RJLR007-EXPTM-YN               PIC  X(00001).
      *       거래건수
           03 RJLR007-TRAN-NOITM             PIC S9(00009) COMP-3.
      *       위험가중자산금액
           03 RJLR007-RISK-WGHTG-ASAM        PIC S9(00015) COMP-3.
      *       담보평가금액
           03 RJLR007-SCURTY-VALPR           PIC S9(00015) COMP-3.
      *       외환총한도소진율
           03 RJLR007-FX-T-LIMT-EXHS-RT      PIC S9(00007)V9(2) COMP-3.
      *       신용한도소진율
           03 RJLR007-CDLN-EXHS-RT           PIC S9(00007)V9(2) COMP-3.
      *       담보소진율
           03 RJLR007-SCURTY-EXHS-RT         PIC S9(00007)V9(2) COMP-3.
      *       최근신규년월일
           03 RJLR007-LA-NEW-YMD             PIC  X(00008).
      *       최근한도년월일
           03 RJLR007-LA-LIMT-YMD            PIC  X(00008).
      *       초과신규여부1
           03 RJLR007-EXCS-NEW-YN1           PIC  X(00001).
      *       초과신규여부2
           03 RJLR007-EXCS-NEW-YN2           PIC  X(00001).
      *       초과신규여부3
           03 RJLR007-EXCS-NEW-YN3           PIC  X(00001).
      *       관련부점코드
           03 RJLR007-RELATD-BRNCD           PIC  X(00004).
      *       ISO국가코드
           03 RJLR007-ISO-NATNL-CD           PIC  X(00002).
      *       시스템최종처리일시
           03 RJLR007-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJLR007-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJLR007   C O P Y B O O K   E N D
      *=================================================================
