      *=================================================================
      *  테이블명      : THKJL0091(국외영업점산업별TE현황)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0091
      *  사용예        : 01  TRJL0091-REC.
      *                      COPY  TRJL0091.
      *  최종변경일시  : 2020년03월19일16시52분00초
      *=================================================================
      *       그룹회사코드
           03 RJL0091-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0091-BASE-YMD               PIC  X(00008).
      *       관리부점코드
           03 RJL0091-MGT-BRNCD              PIC  X(00004).
      *       대분류업종코드
           03 RJL0091-LAG-CLSFI-BZTYP-CD     PIC  X(00003).
      *       익스포져금액
           03 RJL0091-EXPSR-AMT              PIC S9(00015) COMP-3.
      *       편중관리비율
           03 RJL0091-LNUP-MGT-CST-RT        PIC S9(00003)V9(2) COMP-3.
      *       합산관리여부
           03 RJL0091-SUM-MGT-YN             PIC  X(00001).
      *       편중관리익스포져금액
           03 RJL0091-LNUP-MGT-EXPSR-AMT     PIC S9(00015) COMP-3.
      *       시스템최종처리일시
           03 RJL0091-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0091-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0091   C O P Y B O O K   E N D
      *=================================================================
