      *=================================================================
      *  테이블명      : THKJL0048(기준한도업종별적용배수이력)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0048
      *  사용예        : 01  TRJL0048-REC.
      *                      COPY  TRJL0048.
      *  최종변경일시  : 2010년01월23일17시07분50초
      *=================================================================
      *       그룹회사코드
           03 RJL0048-GROUP-CO-CD            PIC  X(00003).
      *       기준한도업종구분
           03 RJL0048-BASE-L-BZTYP-DSTCD     PIC  X(00001).
      *       등록년월일
           03 RJL0048-REGI-YMD               PIC  X(00008).
      *       기준한도적용배수율
           03 RJL0048-BASE-L-APLY-MLPL-RT    PIC S9(00003)V9(2) COMP-3.
      *       시스템최종처리일시
           03 RJL0048-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0048-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0048   C O P Y B O O K   E N D
      *=================================================================
