      *=================================================================
      *  테이블명      : THKJL0057(국별부점별신용공여집계)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0057
      *  사용예        : 01  TRJL0057-REC.
      *                      COPY  TRJL0057.
      *  최종변경일시  : 2020년02월14일15시13분58초
      *=================================================================
      *       그룹회사코드
           03 RJL0057-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0057-BASE-YMD               PIC  X(00008).
      *       관리부점코드
           03 RJL0057-MGT-BRNCD              PIC  X(00004).
      *       ISO국가코드
           03 RJL0057-ISO-NATNL-CD           PIC  X(00002).
      *       영문국가명
           03 RJL0057-ENG-NATNL-NAME         PIC  X(00052).
      *       국가별관리한도
           03 RJL0057-NATNL-PER-MGT-CLAM     PIC S9(00015)V9(3) COMP-3.
      *       대출잔액
           03 RJL0057-LN-BAL                 PIC S9(00015)V9(3) COMP-3.
      *       지급보증잔액
           03 RJL0057-PYGRNT-BAL             PIC S9(00015)V9(3) COMP-3.
      *       회사채잔액
           03 RJL0057-COBND-BAL              PIC S9(00015)V9(3) COMP-3.
      *       주식잔액
           03 RJL0057-STCK-BAL               PIC S9(00015)V9(3) COMP-3.
      *       유가증권잔액
           03 RJL0057-SECTS-BAL              PIC S9(00015)V9(3) COMP-3.
      *       예치금잔액
           03 RJL0057-DTMN-BAL               PIC S9(00015)V9(3) COMP-3.
      *       파생상품잔액
           03 RJL0057-DRVT-PRDCT-BAL         PIC S9(00015)V9(3) COMP-3.
      *       기타잔액
           03 RJL0057-ETC-BAL                PIC S9(00015)V9(3) COMP-3.
      *       합계잔액
           03 RJL0057-BALSUM                 PIC S9(00015)V9(3) COMP-3.
      *       시스템최종처리일시
           03 RJL0057-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0057-SYS-LAST-UNO           PIC  X(00007).
      *       지역관리한도금액
           03 RJL0057-AREA-MGT-CLAM          PIC S9(00015)V9(3) COMP-3.
      *       당행국가신용등급구분
           03 RJL0057-OWBNK-NC-GRD-DSTCD     PIC  X(00004).
      *       국가전체공통한도여부
           03 RJL0057-NATNL-W-CMN-LIMT-YN    PIC  X(00001).
      *       국가전체공통한도금액
           03 RJL0057-NATNL-WHOL-CMN-CLAM    PIC S9(00015)V9(3) COMP-3.
      *       국가위험수준구분
           03 RJL0057-NATNL-R-LVEL-DSTCD     PIC  X(00001).
      *       한도관리지역구분
           03 RJL0057-LIMT-MGT-AREA-DSTCD    PIC  X(00001).
      *=================================================================
      *  TRJL0057   C O P Y B O O K   E N D
      *=================================================================
