      *=================================================================
      *  테이블명      : THKJL0010(CP차주관리한도기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0010
      *  사용예        : 01  TRJL0010-REC.
      *                      COPY  TRJL0010.
      *  최종변경일시  : 2023년09월05일15시39분30초
      *=================================================================
      *       그룹회사코드
           03 RJL0010-GROUP-CO-CD            PIC  X(00003).
      *       기준년월일
           03 RJL0010-BASE-YMD               PIC  X(00008).
      *       고객식별자
           03 RJL0010-CUST-IDNFR             PIC  X(00010).
      *       차주번호
           03 RJL0010-BRWR-NO                PIC  X(00013).
      *       기업규모구분
           03 RJL0010-CORP-SCAL-DSTCD        PIC  X(00001).
      *       고객관리부점코드
           03 RJL0010-CUST-MGT-BRNCD         PIC  X(00004).
      *       내부신용평가등급구분
           03 RJL0010-INTNL-CV-GRD-DSTCD     PIC  X(00004).
      *       신용평가년월일
           03 RJL0010-CRDT-VALUA-YMD         PIC  X(00008).
      *       신표준산업분류코드
           03 RJL0010-NEW-SI-CLSFI-CD        PIC  X(00005).
      *       기준한도
           03 RJL0010-BASE-CLAM              PIC S9(00015) COMP-3.
      *       기준한도산출년월일
           03 RJL0010-BASE-LIMT-CMPTN-YMD    PIC  X(00008).
      *       관리한도
           03 RJL0010-MGT-CLAM               PIC S9(00015) COMP-3.
      *       관리한도설정년월일
           03 RJL0010-MGT-LIMT-STUP-YMD      PIC  X(00008).
      *       관리한도유효년월일
           03 RJL0010-MGT-LIMT-VALD-YMD      PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0010-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0010-SYS-LAST-UNO           PIC  X(00007).
      *       한도신청번호
           03 RJL0010-LIMT-APLCN-NO          PIC  X(00010).
      *=================================================================
      *  TRJL0010   C O P Y B O O K   E N D
      *=================================================================
