      *=================================================================
      *  테이블명      : THKJL0014(계열사기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0014
      *  사용예        : 01  TRJL0014-REC.
      *                      COPY  TRJL0014.
      *  최종변경일시  : 2017년02월03일10시47분34초
      *=================================================================
      *       그룹회사코드
           03 RJL0014-GROUP-CO-CD            PIC  X(00003).
      *       기준년월
           03 RJL0014-BASE-YM                PIC  X(00006).
      *       고객식별자
           03 RJL0014-CUST-IDNFR             PIC  X(00010).
      *       계열적용구분
           03 RJL0014-AFFLT-APLY-DSTCD       PIC  X(00001).
      *       차주번호
           03 RJL0014-BRWR-NO                PIC  X(00013).
      *       계열기업군코드
           03 RJL0014-AFFLT-CORP-GROUP-CD    PIC  X(00006).
      *       기업규모구분
           03 RJL0014-CORP-SCAL-DSTCD        PIC  X(00001).
      *       등록직원번호
           03 RJL0014-REGI-EMPID             PIC  X(00007).
      *       등록년월일
           03 RJL0014-REGI-YMD               PIC  X(00008).
      *       변경여부
           03 RJL0014-MODFI-YN               PIC  X(00001).
      *       채무자명
           03 RJL0014-DBTRZ-NAME             PIC  X(00052).
      *       시스템최종처리일시
           03 RJL0014-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0014-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0014   C O P Y B O O K   E N D
      *=================================================================
