      *=================================================================
      *  테이블명      : THKJL0081(이사회승인내역 기본)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0081
      *  사용예        : 01  TRJL0081-REC.
      *                      COPY  TRJL0081.
      *  최종변경일시  : 2024년04월22일14시25분21초
      *=================================================================
      *       그룹회사코드
           03 RJL0081-GROUP-CO-CD            PIC  X(00003).
      *       이사회승인번호
           03 RJL0081-BRDC-ATHOR-NO          PIC  X(00010).
      *       고객식별자
           03 RJL0081-CUST-IDNFR             PIC  X(00010).
      *       소관부점코드
           03 RJL0081-JRSDZ-BRNCD            PIC  X(00004).
      *       신용공여중분류코드
           03 RJL0081-GRCR-MIDL-CLSFI-CD     PIC  X(00003).
      *       통화코드
           03 RJL0081-CNCYCD                 PIC  X(00003).
      *       이사회승인금액
           03 RJL0081-BRDC-ATHOR-AMT         PIC S9(00016)V9(2) COMP-3.
      *       이사회승인년월일
           03 RJL0081-BRDC-ATHOR-YMD         PIC  X(00008).
      *       이사회승인유효년월일
           03 RJL0081-BRDC-ATHOR-VALD-YMD    PIC  X(00008).
      *       이사회승인금리내용
           03 RJL0081-BRDC-ATHOR-IRT-CTNT    PIC  X(00044).
      *       등록직원번호
           03 RJL0081-REGI-EMPID             PIC  X(00007).
      *       등록년월일
           03 RJL0081-REGI-YMD               PIC  X(00008).
      *       비고
           03 RJL0081-RMARK                  PIC  X(00102).
      *       시스템최종처리일시
           03 RJL0081-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0081-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0081   C O P Y B O O K   E N D
      *=================================================================
