      *=================================================================
      *  테이블명      : THKJL0017(한도관리제외대상차주명세)
      *  파일 디렉토리 : KJL.DDB2.DBCOPY
      *  MEMBER NAME   : TRJL0017
      *  사용예        : 01  TRJL0017-REC.
      *                      COPY  TRJL0017.
      *  최종변경일시  : 2017년01월31일14시37분01초
      *=================================================================
      *       그룹회사코드
           03 RJL0017-GROUP-CO-CD            PIC  X(00003).
      *       고객식별자
           03 RJL0017-CUST-IDNFR             PIC  X(00010).
      *       차주번호
           03 RJL0017-BRWR-NO                PIC  X(00013).
      *       채무자명
           03 RJL0017-DBTRZ-NAME             PIC  X(00052).
      *       한도관리제외구분
           03 RJL0017-LIMT-M-ECLUD-DSTCD     PIC  X(00001).
      *       등록년월일
           03 RJL0017-REGI-YMD               PIC  X(00008).
      *       시스템최종처리일시
           03 RJL0017-SYS-LAST-PRCSS-YMS     PIC  X(00020).
      *       시스템최종사용자번호
           03 RJL0017-SYS-LAST-UNO           PIC  X(00007).
      *=================================================================
      *  TRJL0017   C O P Y B O O K   E N D
      *=================================================================
