      *================================================================*
      *@ NAME : V1JL4011                                               *
      *@ DESC : 한도초과업체명세조회                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-25 20:05:03                          *
      *  생성일시     : 2009-11-25 20:05:11                          *
      *================================================================*
      *--     출력라인수1
ROWCNT     07  V1JL4011-OUTPT-LINE-CNT1          PIC  9(005).
      *--     출력라인수2
ROWCNT     07  V1JL4011-OUTPT-LINE-CNT2          PIC  9(005).
      *--     그리드1
           07  V1JL4011-GRID1                    OCCURS 0 TO 001500
               DEPENDING ON V1JL4011-OUTPT-LINE-CNT1.
      *--       차주번호
             09  V1JL4011-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  V1JL4011-DBTR-NAME              PIC  X(052).
      *--       부점명
             09  V1JL4011-BRN-NAME               PIC  X(062).
      *--       관리한도
             09  V1JL4011-MGT-LIMT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       익스포져
             09  V1JL4011-EXPSR                  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율1
             09  V1JL4011-EXHS-RT1               PIC  9(003)V9(02).
      *--       여신성관리한도
             09  V1JL4011-LNBZ-I-MGT-LIMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       여신성익스포져
             09  V1JL4011-LNBZ-INCLIN-EXPSR      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율2
             09  V1JL4011-EXHS-RT2               PIC  9(003)V9(02).
      *--       시장성관리한도
             09  V1JL4011-MRKTY-MGT-LIMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       시장성익스포져
             09  V1JL4011-MRKTY-EXPSR            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율3
             09  V1JL4011-EXHS-RT3               PIC  9(003)V9(02).
      *--       비고
             09  V1JL4011-RMARK                  PIC  X(052).
      *--     그리드2
           07  V1JL4011-GRID2                    OCCURS 0 TO 001500
               DEPENDING ON V1JL4011-OUTPT-LINE-CNT2.
      *--       차주번호2
             09  V1JL4011-BRWR-NO2               PIC  X(013).
      *--       채무자명2
             09  V1JL4011-DBTR-NAME2             PIC  X(052).
      *--       부점명2
             09  V1JL4011-BRN-NAME2              PIC  X(062).
      *--       동일외화한도2
             09  V1JL4011-SAME-FC-LIMT2          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       동일인외화액2
             09  V1JL4011-SMPSN-FC-AMT2          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도소진율2
             09  V1JL4011-LIMT-EXHS-RT2          PIC  9(003)V9(02).
      *================================================================*
      *        V  1  J  L  4  0  1  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *L  V1JL4011-OUTPT-LINE-CNT1      ;출력라인수1
      *L  V1JL4011-OUTPT-LINE-CNT2      ;출력라인수2
      *A  V1JL4011-GRID1                ;그리드1
      *X  V1JL4011-BRWR-NO              ;차주번호
      *X  V1JL4011-DBTR-NAME            ;채무자명
      *X  V1JL4011-BRN-NAME             ;부점명
      *S  V1JL4011-MGT-LIMT             ;관리한도
      *S  V1JL4011-EXPSR                ;익스포져
      *N  V1JL4011-EXHS-RT1             ;소진율1
      *S  V1JL4011-LNBZ-I-MGT-LIMT      ;여신성관리한도
      *S  V1JL4011-LNBZ-INCLIN-EXPSR    ;여신성익스포져
      *N  V1JL4011-EXHS-RT2             ;소진율2
      *S  V1JL4011-MRKTY-MGT-LIMT       ;시장성관리한도
      *S  V1JL4011-MRKTY-EXPSR          ;시장성익스포져
      *N  V1JL4011-EXHS-RT3             ;소진율3
      *X  V1JL4011-RMARK                ;비고
      *A  V1JL4011-GRID2                ;그리드2
      *X  V1JL4011-BRWR-NO2             ;차주번호2
      *X  V1JL4011-DBTR-NAME2           ;채무자명2
      *X  V1JL4011-BRN-NAME2            ;부점명2
      *S  V1JL4011-SAME-FC-LIMT2        ;동일외화한도2
      *S  V1JL4011-SMPSN-FC-AMT2        ;동일인외화액2
      *N  V1JL4011-LIMT-EXHS-RT2        ;한도소진율2
