      *================================================================*
      *@ NAME : V1JL4046                                               *
      *@ DESC : 최고한도관리제외대상차주조회                         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2015-04-16 14:43:07                          *
      *  생성일시     : 2015-04-16 14:43:13                          *
      *  전체길이     : 00113005 BYTES                               *
      *================================================================*
      *--     출력라인수1
ROWCNT     07  V1JL4046-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4046-GRID1                    OCCURS 0 TO 001000
               DEPENDING ON V1JL4046-OUTPT-LINE-CNT1.
      *--       차주번호
             09  V1JL4046-BRWR-NO                PIC  X(013).
      *--       KB-PIN
             09  V1JL4046-KB-PIN                 PIC  X(010).
      *--       채무자명
             09  V1JL4046-DBTRZ-NAME             PIC  X(052).
      *--       제외사유
             09  V1JL4046-ECLUD-RESN             PIC  X(030).
      *--       등록년월일
             09  V1JL4046-REGI-YMD               PIC  X(008).
      *================================================================*
      *        V  1  J  L  4  0  4  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *L  V1JL4046-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4046-GRID1                ;그리드1
      *X  V1JL4046-BRWR-NO              ;차주번호
      *X  V1JL4046-KB-PIN               ;KB-PIN
      *X  V1JL4046-DBTRZ-NAME           ;채무자명
      *X  V1JL4046-ECLUD-RESN           ;제외사유
      *X  V1JL4046-REGI-YMD             ;등록년월일
