      *================================================================*
      *@ NAME : V1JL4019                                               *
      *@ DESC : 산업등급(IR)별TE현황                             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-08 13:47:35                          *
      *  생성일시     : 2009-07-08 13:47:42                          *
      *================================================================*
      *--     출력라인수1
ROWCNT     07  V1JL4019-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4019-GRID1                    OCCURS 0 TO 000030
               DEPENDING ON V1JL4019-OUTPT-LINE-CNT1.
      *--       산업평가등급구분코드
             09  V1JL4019-IDSTRY-V-GRD-DSTCD     PIC  X(006).
      *--       PEER그룹수
             09  V1JL4019-PEER-GROUP-CNT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       대상업체건수
             09  V1JL4019-TAGET-ENTP-NOITM       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업관리한도금액
             09  V1JL4019-IDSTRY-MGT-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준한도금액
             09  V1JL4019-TTL-AMT-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  V1JL4019-TTL-AMT-BASE-BAL       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져한도환산금액
             09  V1JL4019-TE-LIMT-AUC            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져잔액환산금액
             09  V1JL4019-TE-BAL-AUC             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도여유액
             09  V1JL4019-LIMT-SEXTR-AMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율
             09  V1JL4019-EXHS-RT                PIC  9(003)V9(02).
      *================================================================*
      *        V  1  J  L  4  0  1  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *L  V1JL4019-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4019-GRID1                ;그리드1
      *X  V1JL4019-IDSTRY-V-GRD-DSTCD   ;산업평가등급구분코드
      *S  V1JL4019-PEER-GROUP-CNT       ;PEER그룹수
      *S  V1JL4019-TAGET-ENTP-NOITM     ;대상업체건수
      *S  V1JL4019-IDSTRY-MGT-CLAM      ;산업관리한도금액
      *S  V1JL4019-TTL-AMT-BASE-CLAM    ;명목액기준한도금액
      *S  V1JL4019-TTL-AMT-BASE-BAL     ;명목액기준잔액
      *S  V1JL4019-TE-LIMT-AUC          ;토탈익스포져한도환산금액
      *S  V1JL4019-TE-BAL-AUC           ;토탈익스포져잔액환산금액
      *S  V1JL4019-LIMT-SEXTR-AMT       ;한도여유액
      *N  V1JL4019-EXHS-RT              ;소진율
