      *================================================================*
      *@ NAME : V1JL4013                                               *
      *@ DESC : 과목별TE현황조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-15 10:47:58                          *
      *  생성일시     : 2009-07-15 10:48:11                          *
      *================================================================*
      *--     출력라인수1
ROWCNT     07  V1JL4013-OUTPT-LINE-CNT1          PIC  9(005).
      *--     출력라인수2
ROWCNT     07  V1JL4013-OUTPT-LINE-CNT2          PIC  9(005).
      *--     채무자명
           07  V1JL4013-DBTRZ-NAME               PIC  X(052).
      *--     기준한도금액
           07  V1JL4013-BASE-CLAM                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     기준한도산출년월일
           07  V1JL4013-BASE-LIMT-CMPTN-YMD      PIC  X(008).
      *--     관리한도유효년월일
           07  V1JL4013-MGT-LIMT-VALD-YMD        PIC  X(008).
      *--     관리한도금액
           07  V1JL4013-MGT-CLAM                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     토탈익스포져
           07  V1JL4013-TE                       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  V1JL4013-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성한도
           07  V1JL4013-LNBZ-INCLIN-LIMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성익스포져
           07  V1JL4013-LNBZ-INCLIN-EXPSR        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성한도여유액
           07  V1JL4013-LNBZ-IL-SEXTR-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성한도
           07  V1JL4013-MRKTY-LIMT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성익스포져
           07  V1JL4013-MRKTY-EXPSR              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성한도여유액
           07  V1JL4013-MRKTY-L-SEXTR-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     파생상품총거래한도
           07  V1JL4013-DRVT-PT-TRAN-LIMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     파생상품익스포져
           07  V1JL4013-DRVT-PRDCT-EXPSR         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그리드1
           07  V1JL4013-GRID1                    OCCURS 0 TO 001000
               DEPENDING ON V1JL4013-OUTPT-LINE-CNT1.
      *--       토탈익스포져항목구분1
             09  V1JL4013-TE-ITEM-DSTIC1         PIC  X(025).
      *--       상품코드1
             09  V1JL4013-PRDCT-CD1              PIC  X(012).
      *--       상품명1
             09  V1JL4013-PRDCT-NAME1            PIC  X(262).
      *--       토탈익스포져자산구분코드1
             09  V1JL4013-TE-ASST-DSTCD1         PIC  X(010).
      *--       명목액기준한도금액1
             09  V1JL4013-TTL-AMT-BASE-CLAM1     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액1
             09  V1JL4013-TTL-AMT-BASE-BAL1      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져한도환산금액1
             09  V1JL4013-TE-LIMT-AUC1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져잔액환산금액1
             09  V1JL4013-TE-BAL-AUC1            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그리드2
           07  V1JL4013-GRID2                    OCCURS 0 TO 001000
               DEPENDING ON V1JL4013-OUTPT-LINE-CNT2.
      *--       토탈익스포져항목구분2
             09  V1JL4013-TE-ITEM-DSTIC2         PIC  X(025).
      *--       상품코드2
             09  V1JL4013-PRDCT-CD2              PIC  X(012).
      *--       상품명2
             09  V1JL4013-PRDCT-NAME2            PIC  X(262).
      *--       토탈익스포져자산구분코드2
             09  V1JL4013-TE-ASST-DSTCD2         PIC  X(010).
      *--       명목액기준한도금액2
             09  V1JL4013-TTL-AMT-BASE-CLAM2     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액2
             09  V1JL4013-TTL-AMT-BASE-BAL2      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져한도환산금액2
             09  V1JL4013-TE-LIMT-AUC2           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져잔액환산금액2
             09  V1JL4013-TE-BAL-AUC2            PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        V  1  J  L  4  0  1  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *L  V1JL4013-OUTPT-LINE-CNT1      ;출력라인수1
      *L  V1JL4013-OUTPT-LINE-CNT2      ;출력라인수2
      *X  V1JL4013-DBTRZ-NAME           ;채무자명
      *S  V1JL4013-BASE-CLAM            ;기준한도금액
      *X  V1JL4013-BASE-LIMT-CMPTN-YMD  ;기준한도산출년월일
      *X  V1JL4013-MGT-LIMT-VALD-YMD    ;관리한도유효년월일
      *S  V1JL4013-MGT-CLAM             ;관리한도금액
      *S  V1JL4013-TE                   ;토탈익스포져
      *S  V1JL4013-LIMT-SEXTR-AMT       ;한도여유액
      *S  V1JL4013-LNBZ-INCLIN-LIMT     ;여신성한도
      *S  V1JL4013-LNBZ-INCLIN-EXPSR    ;여신성익스포져
      *S  V1JL4013-LNBZ-IL-SEXTR-AMT    ;여신성한도여유액
      *S  V1JL4013-MRKTY-LIMT           ;시장성한도
      *S  V1JL4013-MRKTY-EXPSR          ;시장성익스포져
      *S  V1JL4013-MRKTY-L-SEXTR-AMT    ;시장성한도여유액
      *S  V1JL4013-DRVT-PT-TRAN-LIMT    ;파생상품총거래한도
      *S  V1JL4013-DRVT-PRDCT-EXPSR     ;파생상품익스포져
      *A  V1JL4013-GRID1                ;그리드1
      *X  V1JL4013-TE-ITEM-DSTIC1       ;토탈익스포져항목구분1
      *X  V1JL4013-PRDCT-CD1            ;상품코드1
      *X  V1JL4013-PRDCT-NAME1          ;상품명1
      *X  V1JL4013-TE-ASST-DSTCD1       ;토탈익스포져자산구분코드1
      *S  V1JL4013-TTL-AMT-BASE-CLAM1   ;명목액기준한도금액1
      *S  V1JL4013-TTL-AMT-BASE-BAL1    ;명목액기준잔액1
      *S  V1JL4013-TE-LIMT-AUC1         ;토탈익스포져한도환산금액1
      *S  V1JL4013-TE-BAL-AUC1          ;토탈익스포져잔액환산금액1
      *A  V1JL4013-GRID2                ;그리드2
      *X  V1JL4013-TE-ITEM-DSTIC2       ;토탈익스포져항목구분2
      *X  V1JL4013-PRDCT-CD2            ;상품코드2
      *X  V1JL4013-PRDCT-NAME2          ;상품명2
      *X  V1JL4013-TE-ASST-DSTCD2       ;토탈익스포져자산구분코드2
      *S  V1JL4013-TTL-AMT-BASE-CLAM2   ;명목액기준한도금액2
      *S  V1JL4013-TTL-AMT-BASE-BAL2    ;명목액기준잔액2
      *S  V1JL4013-TE-LIMT-AUC2         ;토탈익스포져한도환산금액2
      *S  V1JL4013-TE-BAL-AUC2          ;토탈익스포져잔액환산금액2
