      *================================================================*
      *@ NAME : V1JL4036                                               *
      *@ DESC : 자회사신용공여조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-09 11:06:36                          *
      *  생성일시     : 2009-07-09 11:06:49                          *
      *================================================================*
      *--     신용공여한도
           07  V1JL4036-GRCR-LIMT                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     신용공여잔액
           07  V1JL4036-GRCR-BAL                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  V1JL4036-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     업무규제자기자본
           07  V1JL4036-BZWK-REGUL-ONCP          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     자기자본기준년월
           07  V1JL4036-ONCP-BASE-YM             PIC  X(006).
      *--     출력라인수1
ROWCNT     07  V1JL4036-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4036-GRID1                    OCCURS 0 TO 000100
               DEPENDING ON V1JL4036-OUTPT-LINE-CNT1.
      *--       차주번호1
             09  V1JL4036-BRWR-NO1               PIC  X(013).
      *--       채무자명1
             09  V1JL4036-DBTR-NAME1             PIC  X(052).
      *--       CA금액1
             09  V1JL4036-CA-AMT1                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       BS기준잔액1
             09  V1JL4036-BS-BASE-BAL1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       CA담보환산금액1
             09  V1JL4036-CA-SCURTY-AUC1         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       제외자산금액1
             09  V1JL4036-ECLUD-ASAM1            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       공여비율1
             09  V1JL4036-GVNG-RATO1             PIC  9(003)V9(02).
      *================================================================*
      *        V  1  J  L  4  0  3  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *S  V1JL4036-GRCR-LIMT            ;신용공여한도
      *S  V1JL4036-GRCR-BAL             ;신용공여잔액
      *S  V1JL4036-LIMT-SEXTR-AMT       ;한도여유액
      *S  V1JL4036-BZWK-REGUL-ONCP      ;업무규제자기자본
      *X  V1JL4036-ONCP-BASE-YM         ;자기자본기준년월
      *L  V1JL4036-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4036-GRID1                ;그리드1
      *X  V1JL4036-BRWR-NO1             ;차주번호1
      *X  V1JL4036-DBTR-NAME1           ;채무자명1
      *S  V1JL4036-CA-AMT1              ;CA금액1
      *S  V1JL4036-BS-BASE-BAL1         ;BS기준잔액1
      *S  V1JL4036-CA-SCURTY-AUC1       ;CA담보환산금액1
      *S  V1JL4036-ECLUD-ASAM1          ;제외자산금액1
      *N  V1JL4036-GVNG-RATO1           ;공여비율1
