      *================================================================*
      *@ NAME : V1JL4041                                               *
      *@ DESC : 국가별정보조회                                       *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-02-11 16:34:26                          *
      *  생성일시     : 2020-02-11 16:34:33                          *
      *  전체길이     : 00034557 BYTES                               *
      *================================================================*
      *--     영문국가명
           07  V1JL4041-ENG-NATNL-NAME           PIC  X(052).
      *--     출력라인수1
ROWCNT     07  V1JL4041-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4041-GRID1                    OCCURS 0 TO 000300
               DEPENDING ON V1JL4041-OUTPT-LINE-CNT1.
      *--       ISO국가코드
             09  V1JL4041-ISO-NATNL-CD           PIC  X(002).
      *--       영문국가명1
             09  V1JL4041-ENG-NATNL-NAME1        PIC  X(052).
      *--       전체관리한도금액
             09  V1JL4041-WHOL-MGT-CLAM          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       SNP등급구분코드
             09  V1JL4041-SNP-GRD-DSTCD          PIC  X(002).
      *--       무디스등급구분코드
             09  V1JL4041-MODYS-GRD-DSTCD        PIC  X(002).
      *--       피치등급구분코드
             09  V1JL4041-FITCH-GRD-DSTCD        PIC  X(002).
      *--       당행국가신용등급구분코드
             09  V1JL4041-OWBNK-NC-GRD-DSTCD     PIC  X(004).
      *--       한도관리지역구분코드
             09  V1JL4041-LIMT-MGT-AREA-DSTCD    PIC  X(001).
      *--       지역관리한도금액
             09  V1JL4041-AREA-MGT-CLAM          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       국가전체공통한도여부
             09  V1JL4041-NATNL-W-CMN-LIMT-YN    PIC  X(001).
      *--       공통관리한도금액
             09  V1JL4041-CMN-MGT-CLAM           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       국가위험수준구분코드
             09  V1JL4041-NATNL-R-LVEL-DSTCD     PIC  X(001).
      *================================================================*
      *        V  1  J  L  4  0  4  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JL4041-ENG-NATNL-NAME       ;영문국가명
      *L  V1JL4041-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4041-GRID1                ;그리드1
      *X  V1JL4041-ISO-NATNL-CD         ;ISO국가코드
      *X  V1JL4041-ENG-NATNL-NAME1      ;영문국가명1
      *S  V1JL4041-WHOL-MGT-CLAM        ;전체관리한도금액
      *X  V1JL4041-SNP-GRD-DSTCD        ;SNP등급구분코드
      *X  V1JL4041-MODYS-GRD-DSTCD      ;무디스등급구분코드
      *X  V1JL4041-FITCH-GRD-DSTCD      ;피치등급구분코드
      *X  V1JL4041-OWBNK-NC-GRD-DSTCD
      * 당행국가신용등급구분코드
      *X  V1JL4041-LIMT-MGT-AREA-DSTCD  ;한도관리지역구분코드
      *S  V1JL4041-AREA-MGT-CLAM        ;지역관리한도금액
      *X  V1JL4041-NATNL-W-CMN-LIMT-YN  ;국가전체공통한도여부
      *S  V1JL4041-CMN-MGT-CLAM         ;공통관리한도금액
      *X  V1JL4041-NATNL-R-LVEL-DSTCD   ;국가위험수준구분코드
