      *================================================================*
      *@ NAME : V1JL4028                                               *
      *@ DESC : 계열사조회                                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-30 15:01:01                          *
      *  생성일시     : 2009-06-30 15:01:14                          *
      *================================================================*
      *--     계열기업군명
           07  V1JL4028-AFFLT-C-GROUP-NAME       PIC  X(052).
      *--     출력라인수1
ROWCNT     07  V1JL4028-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4028-GRID1                    OCCURS 0 TO 001000
               DEPENDING ON V1JL4028-OUTPT-LINE-CNT1.
      *--       계열기업군코드
             09  V1JL4028-AFFLT-CORP-GROUP-CD    PIC  X(006).
      *--       차주번호
             09  V1JL4028-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  V1JL4028-DBTRZ-NAME             PIC  X(052).
      *--       기업규모
             09  V1JL4028-CORP-SCAL              PIC  X(020).
      *--       변경여부
             09  V1JL4028-MODFI-YN               PIC  X(010).
      *================================================================*
      *        V  1  J  L  4  0  2  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JL4028-AFFLT-C-GROUP-NAME   ;계열기업군명
      *L  V1JL4028-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4028-GRID1                ;그리드1
      *X  V1JL4028-AFFLT-CORP-GROUP-CD  ;계열기업군코드
      *X  V1JL4028-BRWR-NO              ;차주번호
      *X  V1JL4028-DBTRZ-NAME           ;채무자명
      *X  V1JL4028-CORP-SCAL            ;기업규모
      *X  V1JL4028-MODFI-YN             ;변경여부
