      *================================================================*
      *@ NAME : V1JL4007                                               *
      *@ DESC : TE한도관리대상조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-09 13:16:38                          *
      *  생성일시     : 2009-06-09 13:16:46                          *
      *================================================================*
      *--     부점명
           07  V1JL4007-BRN-NAME                 PIC  X(062).
      *--     출력라인수1
ROWCNT     07  V1JL4007-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4007-GRID1                    OCCURS 0 TO 005000
               DEPENDING ON V1JL4007-OUTPT-LINE-CNT1.
      *--       차주번호
             09  V1JL4007-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  V1JL4007-DBTRZ-NAME             PIC  X(042).
      *--       기업규모
             09  V1JL4007-CORP-SCAL              PIC  X(020).
      *--       관리한도금액
             09  V1JL4007-MGT-CLAM               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준한도
             09  V1JL4007-TTL-AMT-BASE-LIMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져금액
             09  V1JL4007-TE-AMT                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도소진율
             09  V1JL4007-LIMT-EXHS-RT           PIC  9(003)V9(02).
      *--       동일인외화신용공여한도액
             09  V1JL4007-SMPSN-FG-LIMT-AMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       동일인외화신용공여액
             09  V1JL4007-SMPSN-FC-GRCR-AMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        V  1  J  L  4  0  0  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JL4007-BRN-NAME             ;부점명
      *L  V1JL4007-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4007-GRID1                ;그리드1
      *X  V1JL4007-BRWR-NO              ;차주번호
      *X  V1JL4007-DBTRZ-NAME           ;채무자명
      *X  V1JL4007-CORP-SCAL            ;기업규모
      *S  V1JL4007-MGT-CLAM             ;관리한도금액
      *S  V1JL4007-TTL-AMT-BASE-LIMT    ;명목액기준한도
      *S  V1JL4007-TE-AMT               ;토탈익스포져금액
      *N  V1JL4007-LIMT-EXHS-RT         ;한도소진율
      *S  V1JL4007-SMPSN-FG-LIMT-AMT
      * 동일인외화신용공여한도액
      *S  V1JL4007-SMPSN-FC-GRCR-AMT    ;동일인외화신용공여액
