      *================================================================*
      *@ NAME : V1JLB027                                               *
      *@ DESC : 포괄신용공여한도신청및승인                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-03-03 17:12:25                          *
      *  생성일시     : 2009-03-03 17:12:39                          *
      *================================================================*
      *--     처리결과
           07  V1JLB027-PRCSS-RSULT              PIC  X(002).
      *--     수정여신성자산한도금액
           07  V1JLB027-AMND-LI-ASST-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정자기자본기준금액
           07  V1JLB027-AMND-O-CAPTL-BSAMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정영업활동기준한도금액
           07  V1JLB027-AMND-BA-BASE-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정포괄설정가능금액
           07  V1JLB027-AMND-I-STUP-ABLAMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도신청번호
           07  V1JLB027-LIMT-APLCN-NO            PIC  X(010).
      *================================================================*
      *        V  1  J  L  B  0  2  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JLB027-PRCSS-RSULT          ;처리결과
      *S  V1JLB027-AMND-LI-ASST-CLAM    ;수정여신성자산한도금액
      *S  V1JLB027-AMND-O-CAPTL-BSAMT   ;수정자기자본기준금액
      *S  V1JLB027-AMND-BA-BASE-CLAM
      * 수정영업활동기준한도금액
      *S  V1JLB027-AMND-I-STUP-ABLAMT   ;수정포괄설정가능금액
      *X  V1JLB027-LIMT-APLCN-NO        ;한도신청번호
