      *================================================================*
      *@ NAME : V1JL4035                                               *
      *@ DESC : 거액신용공여총액조회                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-13 16:02:32                          *
      *  생성일시     : 2009-07-13 16:02:41                          *
      *================================================================*
      *--     자기자본기준금액
           07  V1JL4035-ONCP-BSAMT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     FS신용공여금액
           07  V1JL4035-FS-GRCR-AMT              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  V1JL4035-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     자기자본기준금액1
           07  V1JL4035-ONCP-BSAMT1              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     기준년월
           07  V1JL4035-BASE-YM                  PIC  X(006).
      *--     출력라인수1
ROWCNT     07  V1JL4035-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4035-GRID1                    OCCURS 0 TO 000300
               DEPENDING ON V1JL4035-OUTPT-LINE-CNT1.
      *--       차주번호1
             09  V1JL4035-BRWR-NO1               PIC  X(013).
      *--       계열기업군명1
             09  V1JL4035-AFFLT-C-GROUP-NAME1    PIC  X(052).
      *--       KB신용공여금액1
             09  V1JL4035-KB-GRCR-AMT1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       FS신용공여금액1
             09  V1JL4035-FS-GRCR-AMT1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       제외대상금액1
             09  V1JL4035-ECLUD-TAGET-AMT1       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       공여비율1
             09  V1JL4035-GVNG-RATO1             PIC  9(003)V9(02).
      *================================================================*
      *        V  1  J  L  4  0  3  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *S  V1JL4035-ONCP-BSAMT           ;자기자본기준금액
      *S  V1JL4035-FS-GRCR-AMT          ;FS신용공여금액
      *S  V1JL4035-LIMT-SEXTR-AMT       ;한도여유액
      *S  V1JL4035-ONCP-BSAMT1          ;자기자본기준금액1
      *X  V1JL4035-BASE-YM              ;기준년월
      *L  V1JL4035-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4035-GRID1                ;그리드1
      *X  V1JL4035-BRWR-NO1             ;차주번호1
      *X  V1JL4035-AFFLT-C-GROUP-NAME1  ;계열기업군명1
      *S  V1JL4035-KB-GRCR-AMT1         ;KB신용공여금액1
      *S  V1JL4035-FS-GRCR-AMT1         ;FS신용공여금액1
      *S  V1JL4035-ECLUD-TAGET-AMT1     ;제외대상금액1
      *N  V1JL4035-GVNG-RATO1           ;공여비율1
