      *================================================================*
      *@ NAME : V1JL4045                                               *
      *@ DESC : 최고한도관리조회                                     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-27 17:19:11                          *
      *  생성일시     : 2009-07-27 17:19:19                          *
      *================================================================*
      *--     출력라인수1
ROWCNT     07  V1JL4045-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JL4045-GRID1                    OCCURS 0 TO 000100
               DEPENDING ON V1JL4045-OUTPT-LINE-CNT1.
      *--       대분류업종코드명
             09  V1JL4045-LAG-C-BZTYP-CD-NAME    PIC  X(052).
      *--       산업관리한도금액
             09  V1JL4045-IDSTRY-MGT-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준한도금액
             09  V1JL4045-TTL-AMT-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  V1JL4045-TTL-AMT-BASE-BAL       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져한도환산금액
             09  V1JL4045-TE-LIMT-AUC            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져잔액환산금액
             09  V1JL4045-TE-BAL-AUC             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도여유액
             09  V1JL4045-LIMT-SEXTR-AMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율
             09  V1JL4045-EXHS-RT                PIC  9(003)V9(02).
      *================================================================*
      *        V  1  J  L  4  0  4  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *L  V1JL4045-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JL4045-GRID1                ;그리드1
      *X  V1JL4045-LAG-C-BZTYP-CD-NAME  ;대분류업종코드명
      *S  V1JL4045-IDSTRY-MGT-CLAM      ;산업관리한도금액
      *S  V1JL4045-TTL-AMT-BASE-CLAM    ;명목액기준한도금액
      *S  V1JL4045-TTL-AMT-BASE-BAL     ;명목액기준잔액
      *S  V1JL4045-TE-LIMT-AUC          ;토탈익스포져한도환산금액
      *S  V1JL4045-TE-BAL-AUC           ;토탈익스포져잔액환산금액
      *S  V1JL4045-LIMT-SEXTR-AMT       ;한도여유액
      *N  V1JL4045-EXHS-RT              ;소진율
