      *================================================================*
      *@ NAME : V1JLB140                                               *
      *@ DESC : 국별한도제외대상관리                                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2021-01-28 13:45:12                          *
      *  생성일시     : 2021-01-28 13:45:16                          *
      *  전체길이     : 00013107 BYTES                               *
      *================================================================*
      *--     처리결과
           07  V1JLB140-PRCSS-RSULT              PIC  X(002).
      *--     출력라인수1
ROWCNT     07  V1JLB140-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  V1JLB140-GRID1                    OCCURS 0 TO 000100
               DEPENDING ON V1JLB140-OUTPT-LINE-CNT1.
      *--       고객식별자
             09  V1JLB140-CUST-IDNFR             PIC  X(010).
      *--       채무자명
             09  V1JLB140-DBTRZ-NAME             PIC  X(052).
      *--       제외사유
             09  V1JLB140-ECLUD-RESN             PIC  X(002).
      *--       등록년월일
             09  V1JLB140-REGI-YMD               PIC  X(008).
      *--       등록직원번호
             09  V1JLB140-REGI-EMPID             PIC  X(007).
      *--       기타사유내용
             09  V1JLB140-ETC-RESN-CTNT          PIC  X(052).
      *================================================================*
      *        V  1  J  L  B  1  4  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JLB140-PRCSS-RSULT          ;처리결과
      *L  V1JLB140-OUTPT-LINE-CNT1      ;출력라인수1
      *A  V1JLB140-GRID1                ;그리드1
      *X  V1JLB140-CUST-IDNFR           ;고객식별자
      *X  V1JLB140-DBTRZ-NAME           ;채무자명
      *X  V1JLB140-ECLUD-RESN           ;제외사유
      *X  V1JLB140-REGI-YMD             ;등록년월일
      *X  V1JLB140-REGI-EMPID           ;등록직원번호
      *X  V1JLB140-ETC-RESN-CTNT        ;기타사유내용
