      *================================================================*
      *@ NAME : V1JLB271                                               *
      *@ DESC : 포괄신용공여한도산출조회                             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-03-10 20:11:16                          *
      *  생성일시     : 2009-03-10 20:11:25                          *
      *================================================================*
      *--     처리결과
           07  V1JLB271-PRCSS-RSULT              PIC  X(002).
      *--     수정여신성자산한도금액
           07  V1JLB271-AMND-LI-ASST-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정자기자본기준금액
           07  V1JLB271-AMND-O-CAPTL-BSAMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정영업활동기준한도금액
           07  V1JLB271-AMND-BA-BASE-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     수정포괄설정가능금액
           07  V1JLB271-AMND-I-STUP-ABLAMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        V  1  J  L  B  2  7  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JLB271-PRCSS-RSULT          ;처리결과
      *S  V1JLB271-AMND-LI-ASST-CLAM    ;수정여신성자산한도금액
      *S  V1JLB271-AMND-O-CAPTL-BSAMT   ;수정자기자본기준금액
      *S  V1JLB271-AMND-BA-BASE-CLAM
      * 수정영업활동기준한도금액
      *S  V1JLB271-AMND-I-STUP-ABLAMT   ;수정포괄설정가능금액
