      *================================================================*
      *@ NAME : V1JLB056                                               *
      *@ DESC : AS신용공여계정과목관리                               *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-04-15 17:06:11                          *
      *  생성일시     : 2024-04-15 17:06:14                          *
      *  전체길이     : 00010607 BYTES                               *
      *================================================================*
      *--     처리결과
           07  V1JLB056-PRCSS-RSULT              PIC  X(002).
      *--     그리드
           07  V1JLB056-GRID.
      *--       총라인수
ROWCNT       09  V1JLB056-TOTAL-LINE-CNT         PIC  9(005).
      *--       데이터부
             09  V1JLB056-DATA-BOOK              OCCURS 0 TO 000100
                 DEPENDING ON V1JLB056-TOTAL-LINE-CNT.
      *--         통합계정과목코드
               11  V1JLB056-INTGRA-TIACC-CD      PIC  X(013).
      *--         계정과목명
               11  V1JLB056-TIACC-NAME           PIC  X(042).
      *--         계정과목CCF환산율
               11  V1JLB056-TIACC-CCF-UTCRT      PIC  9(003).
      *--         신용공여계정구분
               11  V1JLB056-GRCR-ACITM-DSTCD     PIC  X(002).
      *--         신용공여대상구분
               11  V1JLB056-GRCR-TAGET-DSTCD     PIC  X(001).
      *--         신용공여중분류코드
               11  V1JLB056-GRCR-MIDL-CLSFI-CD   PIC  X(003).
      *--         신용공여중분류코드명
               11  V1JLB056-GRCR-MC-CD-NAME      PIC  X(042).
      *================================================================*
      *        V  1  J  L  B  0  5  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  V1JLB056-PRCSS-RSULT          ;처리결과
      *G  V1JLB056-GRID                 ;그리드
      *L  V1JLB056-TOTAL-LINE-CNT       ;총라인수
      *A  V1JLB056-DATA-BOOK            ;데이터부
      *X  V1JLB056-INTGRA-TIACC-CD      ;통합계정과목코드
      *X  V1JLB056-TIACC-NAME           ;계정과목명
      *N  V1JLB056-TIACC-CCF-UTCRT      ;계정과목CCF환산율
      *X  V1JLB056-GRCR-ACITM-DSTCD     ;신용공여계정구분
      *X  V1JLB056-GRCR-TAGET-DSTCD     ;신용공여대상구분
      *X  V1JLB056-GRCR-MIDL-CLSFI-CD   ;신용공여중분류코드
      *X  V1JLB056-GRCR-MC-CD-NAME      ;신용공여중분류코드명
