      *================================================================*
      *@ NAME : XDJL409C                                               *
      *@ DESC : DC기업및그룹한도신청및승인조회(신청서출력) COP     *
      *@        YBOOK                                                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-07-16 14:44:29                          *
      *  생성일시     : 2020-07-16 14:44:31                          *
      *  전체길이     : 00000024 BYTES                               *
      *================================================================*
           03  XDJL409C-RETURN.
             05  XDJL409C-R-STAT                 PIC  X(002).
                 88  COND-XDJL409C-OK            VALUE  '00'.
                 88  COND-XDJL409C-KEYDUP        VALUE  '01'.
                 88  COND-XDJL409C-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL409C-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL409C-ERROR         VALUE  '09'.
                 88  COND-XDJL409C-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL409C-SYSERROR      VALUE  '99'.
             05  XDJL409C-R-LINE                 PIC  9(006).
             05  XDJL409C-R-ERRCD                PIC  X(008).
             05  XDJL409C-R-TREAT-CD             PIC  X(008).
             05  XDJL409C-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL409C-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL409C-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객구분
             05  XDJL409C-I-CUST-DSTIC           PIC  X(001).
      *--       KB-PIN
             05  XDJL409C-I-KB-PIN               PIC  X(010).
      *--       신청번호
             05  XDJL409C-I-APLCN-NO             PIC  X(010).
      *--       한도신청구분
             05  XDJL409C-I-LIMT-APLCN-DSTIC     PIC  X(001).
      *----------------------------------------------------------------*
           03  XDJL409C-OUT.
      *----------------------------------------------------------------*
      *--       신청년월일
             05  XDJL409C-O-APLCN-YMD            PIC  X(008).
      *--       영업점명1
             05  XDJL409C-O-BBRN-NAME1           PIC  X(022).
      *--       영업점명2
             05  XDJL409C-O-BBRN-NAME2           PIC  X(022).
      *--       신청번호
             05  XDJL409C-O-APLCN-NO             PIC  X(010).
      *--       직원번호
             05  XDJL409C-O-EMPID                PIC  X(007).
      *--       직원명
             05  XDJL409C-O-EMNM                 PIC  X(042).
      *--       차주명
             05  XDJL409C-O-BRWR-NAME            PIC  X(052).
      *--       차주번호
             05  XDJL409C-O-BRWR-NO              PIC  X(013).
      *--       표준산업분류코드
             05  XDJL409C-O-STND-I-CLSFI-CD      PIC  X(005).
      *--       기업신용등급
             05  XDJL409C-O-CORP-CRDRAT          PIC  X(004).
      *--       그룹명
             05  XDJL409C-O-GROUP-NAME           PIC  X(042).
      *--       그룹등급
             05  XDJL409C-O-GROUP-GRD            PIC  X(004).
      *--       개별기업관리한도
             05  XDJL409C-O-IDIVI-CORP-MGT-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       개별기업익스포져
             05  XDJL409C-O-IDIVI-CORP-EXPSR     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그룹관리한도
             05  XDJL409C-O-GROUP-MGT-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그룹익스포져
             05  XDJL409C-O-GROUP-EXPSR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업군명
             05  XDJL409C-O-IDSTRY-GROUP-NAME    PIC  X(042).
      *--       산업별관리한도
             05  XDJL409C-O-IDSTRY-PER-MGT-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업별익스포져
             05  XDJL409C-O-IDSTRY-PER-EXPSR     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       변경전여신성관리한도
             05  XDJL409C-O-MODFI-BLI-MGT-LIMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       변경전시장성관리한도
             05  XDJL409C-O-MODFI-BM-MGT-LIMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       합계1
             05  XDJL409C-O-SUM1                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       변경후여신성관리한도
             05  XDJL409C-O-MODFI-ALI-MGT-LIMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       변경후시장성관리한도
             05  XDJL409C-O-MODFI-AM-MGT-LIMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       합계2
             05  XDJL409C-O-SUM2                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신청사유
             05  XDJL409C-O-APLCN-RESN           PIC  X(0001602).
      *================================================================*
      *        X  D  J  L  4  0  9  C    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL409C-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL409C-I-CUST-DSTIC         ;고객구분
      *X  XDJL409C-I-KB-PIN             ;KB-PIN
      *X  XDJL409C-I-APLCN-NO           ;신청번호
      *X  XDJL409C-I-LIMT-APLCN-DSTIC   ;한도신청구분
      *X  XDJL409C-O-APLCN-YMD          ;신청년월일
      *X  XDJL409C-O-BBRN-NAME1         ;영업점명1
      *X  XDJL409C-O-BBRN-NAME2         ;영업점명2
      *X  XDJL409C-O-APLCN-NO           ;신청번호
      *X  XDJL409C-O-EMPID              ;직원번호
      *X  XDJL409C-O-EMNM               ;직원명
      *X  XDJL409C-O-BRWR-NAME          ;차주명
      *X  XDJL409C-O-BRWR-NO            ;차주번호
      *X  XDJL409C-O-STND-I-CLSFI-CD    ;표준산업분류코드
      *X  XDJL409C-O-CORP-CRDRAT        ;기업신용등급
      *X  XDJL409C-O-GROUP-NAME         ;그룹명
      *X  XDJL409C-O-GROUP-GRD          ;그룹등급
      *S  XDJL409C-O-IDIVI-CORP-MGT-LIMT;개별기업관리한도
      *S  XDJL409C-O-IDIVI-CORP-EXPSR   ;개별기업익스포져
      *S  XDJL409C-O-GROUP-MGT-LIMT     ;그룹관리한도
      *S  XDJL409C-O-GROUP-EXPSR        ;그룹익스포져
      *X  XDJL409C-O-IDSTRY-GROUP-NAME  ;산업군명
      *S  XDJL409C-O-IDSTRY-PER-MGT-LIMT;산업별관리한도
      *S  XDJL409C-O-IDSTRY-PER-EXPSR   ;산업별익스포져
      *S  XDJL409C-O-MODFI-BLI-MGT-LIMT ;변경전여신성관리한도
      *S  XDJL409C-O-MODFI-BM-MGT-LIMT  ;변경전시장성관리한도
      *S  XDJL409C-O-SUM1               ;합계1
      *S  XDJL409C-O-MODFI-ALI-MGT-LIMT ;변경후여신성관리한도
      *S  XDJL409C-O-MODFI-AM-MGT-LIMT  ;변경후시장성관리한도
      *S  XDJL409C-O-SUM2               ;합계2
      *X  XDJL409C-O-APLCN-RESN         ;신청사유
