      *================================================================*
      *@ NAME : XDJLB081                                               *
      *@ DESC : DC신용공여이사회승인내역등록COPYBOOK                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-04-16 14:44:07                          *
      *  생성일시     : 2024-04-16 14:44:08                          *
      *  전체길이     : 00000212 BYTES                               *
      *================================================================*
           03  XDJLB081-RETURN.
             05  XDJLB081-R-STAT                 PIC  X(002).
                 88  COND-XDJLB081-OK            VALUE  '00'.
                 88  COND-XDJLB081-KEYDUP        VALUE  '01'.
                 88  COND-XDJLB081-NOTFOUND      VALUE  '02'.
                 88  COND-XDJLB081-SPVSTOP       VALUE  '05'.
                 88  COND-XDJLB081-ERROR         VALUE  '09'.
                 88  COND-XDJLB081-ABNORMAL      VALUE  '98'.
                 88  COND-XDJLB081-SYSERROR      VALUE  '99'.
             05  XDJLB081-R-LINE                 PIC  9(006).
             05  XDJLB081-R-ERRCD                PIC  X(008).
             05  XDJLB081-R-TREAT-CD             PIC  X(008).
             05  XDJLB081-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJLB081-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJLB081-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객식별자
             05  XDJLB081-I-CUST-IDNFR           PIC  X(010).
      *--       신용공여중분류코드
             05  XDJLB081-I-GRCR-MIDL-CLSFI-CD   PIC  X(003).
      *--       통화코드
             05  XDJLB081-I-CNCYCD               PIC  X(003).
      *--       이사회승인금액
             05  XDJLB081-I-BRDC-ATHOR-AMT       PIC  9(018).
      *--       소관부점코드
             05  XDJLB081-I-JRSDZ-BRNCD          PIC  X(004).
      *--       이사회승인년월일
             05  XDJLB081-I-BRDC-ATHOR-YMD       PIC  X(008).
      *--       이사회승인유효년월일
             05  XDJLB081-I-BRDC-ATHOR-VALD-YMD  PIC  X(008).
      *--       비고
             05  XDJLB081-I-RMARK                PIC  X(102).
      *--       이사회승인번호
             05  XDJLB081-I-BRDC-ATHOR-NO        PIC  X(010).
      *--       이사회승인금리내용
             05  XDJLB081-I-BRDC-ATHOR-IRT-CTNT  PIC  X(044).
      *----------------------------------------------------------------*
           03  XDJLB081-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XDJLB081-O-PRCSS-RSULT          PIC  X(002).
      *================================================================*
      *        X  D  J  L  B  0  8  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJLB081-I-PRCSS-DSTIC        ;처리구분
      *X  XDJLB081-I-CUST-IDNFR         ;고객식별자
      *X  XDJLB081-I-GRCR-MIDL-CLSFI-CD ;신용공여중분류코드
      *X  XDJLB081-I-CNCYCD             ;통화코드
      *N  XDJLB081-I-BRDC-ATHOR-AMT     ;이사회승인금액
      *X  XDJLB081-I-JRSDZ-BRNCD        ;소관부점코드
      *X  XDJLB081-I-BRDC-ATHOR-YMD     ;이사회승인년월일
      *X  XDJLB081-I-BRDC-ATHOR-VALD-YMD
      * 이사회승인유효년월일
      *X  XDJLB081-I-RMARK              ;비고
      *X  XDJLB081-I-BRDC-ATHOR-NO      ;이사회승인번호
      *X  XDJLB081-I-BRDC-ATHOR-IRT-CTNT;이사회승인금리내용
      *X  XDJLB081-O-PRCSS-RSULT        ;처리결과
