      *================================================================*
      *@ NAME : XDJL4028                                               *
      *@ DESC : DC계열사조회 COPYBOOK                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-30 15:02:52                          *
      *  생성일시     : 2009-06-30 15:02:54                          *
      *================================================================*
           03  XDJL4028-RETURN.
             05  XDJL4028-R-STAT                 PIC  X(002).
                 88  COND-XDJL4028-OK            VALUE  '00'.
                 88  COND-XDJL4028-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4028-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4028-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4028-ERROR         VALUE  '09'.
                 88  COND-XDJL4028-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4028-SYSERROR      VALUE  '99'.
             05  XDJL4028-R-LINE                 PIC  9(006).
             05  XDJL4028-R-ERRCD                PIC  X(008).
             05  XDJL4028-R-TREAT-CD             PIC  X(008).
             05  XDJL4028-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4028-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4028-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회구분
             05  XDJL4028-I-AFFLT-APLY-DSTCD     PIC  X(001).
      *--       계열코드
             05  XDJL4028-I-AFFLT-CORP-GROUP-CD  PIC  X(006).
      *----------------------------------------------------------------*
           03  XDJL4028-OUT.
      *----------------------------------------------------------------*
      *--       계열코드명
             05  XDJL4028-O-AFFLT-C-GROUP-NAME   PIC  X(052).
      *--       출력라인수1
             05  XDJL4028-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4028-O-GRID1                OCCURS 001000 TIMES.
      *--         계열코드
               07  XDJL4028-O-AFFLT-CORP-GROUP-CD
                                                 PIC  X(006).
      *--         채무자번호
               07  XDJL4028-O-BRWR-NO            PIC  X(013).
      *--         채무자명
               07  XDJL4028-O-DBTRZ-NAME         PIC  X(052).
      *--         기업규모
               07  XDJL4028-O-CORP-SCAL          PIC  X(020).
      *--         갱신여부
               07  XDJL4028-O-MODFI-YN           PIC  X(010).
      *================================================================*
      *        X  D  J  L  4  0  2  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4028-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4028-I-AFFLT-APLY-DSTCD   ;조회구분
      *X  XDJL4028-I-AFFLT-CORP-GROUP-CD;계열코드
      *X  XDJL4028-O-AFFLT-C-GROUP-NAME ;계열코드명
      *N  XDJL4028-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4028-O-GRID1              ;그리드1
      *X  XDJL4028-O-AFFLT-CORP-GROUP-CD;계열코드
      *X  XDJL4028-O-BRWR-NO            ;채무자번호
      *X  XDJL4028-O-DBTRZ-NAME         ;채무자명
      *X  XDJL4028-O-CORP-SCAL          ;기업규모
      *X  XDJL4028-O-MODFI-YN           ;갱신여부
