      *================================================================*
      *@ NAME : XDJL4042                                               *
      *@ DESC : DC부점별신용공여한도사용현황 COPYBOOK                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-12-03 16:46:06                          *
      *  생성일시     : 2020-12-03 16:46:47                          *
      *  전체길이     : 00000014 BYTES                               *
      *================================================================*
           03  XDJL4042-RETURN.
             05  XDJL4042-R-STAT                 PIC  X(002).
                 88  COND-XDJL4042-OK            VALUE  '00'.
                 88  COND-XDJL4042-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4042-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4042-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4042-ERROR         VALUE  '09'.
                 88  COND-XDJL4042-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4042-SYSERROR      VALUE  '99'.
             05  XDJL4042-R-LINE                 PIC  9(006).
             05  XDJL4042-R-ERRCD                PIC  X(008).
             05  XDJL4042-R-TREAT-CD             PIC  X(008).
             05  XDJL4042-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4042-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4042-I-PRCSS-DSTIC          PIC  X(002).
      *--       부점코드
             05  XDJL4042-I-BRNCD                PIC  X(004).
      *--       조회기준일자
             05  XDJL4042-I-BASE-YMD             PIC  X(008).
      *----------------------------------------------------------------*
           03  XDJL4042-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4042-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       출력라인수2
             05  XDJL4042-O-OUTPT-LINE-CNT2      PIC  9(005).
      *--       그리드1
             05  XDJL4042-O-GRID1                OCCURS 000500 TIMES.
      *--         ISO국가코드
               07  XDJL4042-O-ISO-NATNL-CD1      PIC  X(002).
      *--         국가명
               07  XDJL4042-O-ENG-NATNL-NAME1    PIC  X(052).
      *--         국가별관리한도
               07  XDJL4042-O-NATNL-PER-MGT-CLAM1
                                                 PIC  9(015).
      *--         파생상품
               07  XDJL4042-O-DRVT-PRDCT-BAL1    PIC  9(015).
      *--         대출
               07  XDJL4042-O-LN-BAL1            PIC  9(015).
      *--         주식
               07  XDJL4042-O-STCK-BAL1          PIC  9(015).
      *--         예치금
               07  XDJL4042-O-DTMN-BAL1          PIC  9(015).
      *--         지급보증
               07  XDJL4042-O-PYGRNT-BAL1        PIC  9(015).
      *--         회사채
               07  XDJL4042-O-COBND-BAL1         PIC  9(015).
      *--         기타유가증권
               07  XDJL4042-O-SECTS-BAL1         PIC  9(015).
      *--         기타
               07  XDJL4042-O-ETC-BAL1           PIC  9(015).
      *--         합계
               07  XDJL4042-O-BALSUM1            PIC  9(015).
      *--       그리드2
             05  XDJL4042-O-GRID2                OCCURS 000500 TIMES.
      *--         ISO국가코드
               07  XDJL4042-O-ISO-NATNL-CD2      PIC  X(002).
      *--         국가명
               07  XDJL4042-O-ENG-NATNL-NAME2    PIC  X(052).
      *--         관리부점명
               07  XDJL4042-O-MGTBRN-NAME2       PIC  X(052).
      *--         상품중분류명
               07  XDJL4042-O-PRDCT-M-CLSFI-NAME2
                                                 PIC  X(042).
      *--         차주명
               07  XDJL4042-O-BRWR-NAME2         PIC  X(082).
      *--         계좌번호
               07  XDJL4042-O-ACNO2              PIC  X(020).
      *--         상품코드
               07  XDJL4042-O-PRDCT-CD2          PIC  X(012).
      *--         계약한도구분
               07  XDJL4042-O-CTRC-LIMT-DSTCD2   PIC  X(010).
      *--         시작년월일
               07  XDJL4042-O-START-YMD2         PIC  X(008).
      *--         만기년월일
               07  XDJL4042-O-EXPIR-YMD2         PIC  X(008).
      *--         통화코드
               07  XDJL4042-O-CNCYCD2            PIC  X(003).
      *--         통화한도금액
               07  XDJL4042-O-CRNCY-CLAM2        PIC  9(016)V9(02).
      *--         통화잔액금액
               07  XDJL4042-O-CRNCY-TDD-BAL2     PIC  9(016)V9(02).
      *--         USD한도금액
               07  XDJL4042-O-USD-CLAM2          PIC  9(016)V9(02).
      *--         USD잔액금액
               07  XDJL4042-O-USD-TDD-BAL2       PIC  9(016)V9(02).
      *================================================================*
      *        X  D  J  L  4  0  4  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4042-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4042-I-BRNCD              ;부점코드
      *X  XDJL4042-I-BASE-YMD           ;조회기준일자
      *N  XDJL4042-O-OUTPT-LINE-CNT1    ;출력라인수1
      *N  XDJL4042-O-OUTPT-LINE-CNT2    ;출력라인수2
      *A  XDJL4042-O-GRID1              ;그리드1
      *X  XDJL4042-O-ISO-NATNL-CD1      ;ISO국가코드
      *X  XDJL4042-O-ENG-NATNL-NAME1    ;국가명
      *N  XDJL4042-O-NATNL-PER-MGT-CLAM1;국가별관리한도
      *N  XDJL4042-O-DRVT-PRDCT-BAL1    ;파생상품
      *N  XDJL4042-O-LN-BAL1            ;대출
      *N  XDJL4042-O-STCK-BAL1          ;주식
      *N  XDJL4042-O-DTMN-BAL1          ;예치금
      *N  XDJL4042-O-PYGRNT-BAL1        ;지급보증
      *N  XDJL4042-O-COBND-BAL1         ;회사채
      *N  XDJL4042-O-SECTS-BAL1         ;기타유가증권
      *N  XDJL4042-O-ETC-BAL1           ;기타
      *N  XDJL4042-O-BALSUM1            ;합계
      *A  XDJL4042-O-GRID2              ;그리드2
      *X  XDJL4042-O-ISO-NATNL-CD2      ;ISO국가코드
      *X  XDJL4042-O-ENG-NATNL-NAME2    ;국가명
      *X  XDJL4042-O-MGTBRN-NAME2       ;관리부점명
      *X  XDJL4042-O-PRDCT-M-CLSFI-NAME2;상품중분류명
      *X  XDJL4042-O-BRWR-NAME2         ;차주명
      *X  XDJL4042-O-ACNO2              ;계좌번호
      *X  XDJL4042-O-PRDCT-CD2          ;상품코드
      *X  XDJL4042-O-CTRC-LIMT-DSTCD2   ;계약한도구분
      *X  XDJL4042-O-START-YMD2         ;시작년월일
      *X  XDJL4042-O-EXPIR-YMD2         ;만기년월일
      *X  XDJL4042-O-CNCYCD2            ;통화코드
      *N  XDJL4042-O-CRNCY-CLAM2        ;통화한도금액
      *N  XDJL4042-O-CRNCY-TDD-BAL2     ;통화잔액금액
      *N  XDJL4042-O-USD-CLAM2          ;USD한도금액
      *N  XDJL4042-O-USD-TDD-BAL2       ;USD잔액금액
