      *================================================================*
      *@ NAME : XDJL4025                                               *
      *@ DESC : DC국별수기계좌조회COPYBOOK                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2021-01-28 13:46:02                          *
      *  생성일시     : 2021-01-28 13:46:03                          *
      *  전체길이     : 00000012 BYTES                               *
      *================================================================*
           03  XDJL4025-RETURN.
             05  XDJL4025-R-STAT                 PIC  X(002).
                 88  COND-XDJL4025-OK            VALUE  '00'.
                 88  COND-XDJL4025-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4025-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4025-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4025-ERROR         VALUE  '09'.
                 88  COND-XDJL4025-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4025-SYSERROR      VALUE  '99'.
             05  XDJL4025-R-LINE                 PIC  9(006).
             05  XDJL4025-R-ERRCD                PIC  X(008).
             05  XDJL4025-R-TREAT-CD             PIC  X(008).
             05  XDJL4025-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4025-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4025-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객식별자
             05  XDJL4025-I-CUST-IDNFR           PIC  X(010).
      *----------------------------------------------------------------*
           03  XDJL4025-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4025-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4025-O-GRID1                OCCURS 000100 TIMES.
      *--         고객식별자
               07  XDJL4025-O-CUST-IDNFR         PIC  X(010).
      *--         채무자명
               07  XDJL4025-O-DBTRZ-NAME         PIC  X(052).
      *--         제외사유
               07  XDJL4025-O-ECLUD-RESN         PIC  X(002).
      *--         등록년월일
               07  XDJL4025-O-REGI-YMD           PIC  X(008).
      *--         등록직원번호
               07  XDJL4025-O-REGI-EMPID         PIC  X(007).
      *--         기타사유내용
               07  XDJL4025-O-ETC-RESN-CTNT      PIC  X(052).
      *================================================================*
      *        X  D  J  L  4  0  2  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4025-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4025-I-CUST-IDNFR         ;고객식별자
      *N  XDJL4025-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4025-O-GRID1              ;그리드1
      *X  XDJL4025-O-CUST-IDNFR         ;고객식별자
      *X  XDJL4025-O-DBTRZ-NAME         ;채무자명
      *X  XDJL4025-O-ECLUD-RESN         ;제외사유
      *X  XDJL4025-O-REGI-YMD           ;등록년월일
      *X  XDJL4025-O-REGI-EMPID         ;등록직원번호
      *X  XDJL4025-O-ETC-RESN-CTNT      ;기타사유내용
