      *================================================================*
      *@ NAME : XDJL4053                                               *
      *@ DESC : DC기업규모별Sub-Limit관리조회 COPYBOOK             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-12-19 15:24:47                          *
      *  생성일시     : 2019-12-19 15:24:50                          *
      *  전체길이     : 00000011 BYTES                               *
      *================================================================*
           03  XDJL4053-RETURN.
             05  XDJL4053-R-STAT                 PIC  X(002).
                 88  COND-XDJL4053-OK            VALUE  '00'.
                 88  COND-XDJL4053-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4053-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4053-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4053-ERROR         VALUE  '09'.
                 88  COND-XDJL4053-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4053-SYSERROR      VALUE  '99'.
             05  XDJL4053-R-LINE                 PIC  9(006).
             05  XDJL4053-R-ERRCD                PIC  X(008).
             05  XDJL4053-R-TREAT-CD             PIC  X(008).
             05  XDJL4053-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4053-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4053-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회기준일자
             05  XDJL4053-I-BASE-YMD             PIC  X(008).
      *--       국내외구분코드
             05  XDJL4053-I-HMAB-DSTCD           PIC  X(001).
      *----------------------------------------------------------------*
           03  XDJL4053-OUT.
      *----------------------------------------------------------------*
      *--       그리드1
             05  XDJL4053-O-GRID1.
      *--         출력라인수1
               07  XDJL4053-O-OUTPT-LINE-CNT1    PIC  9(005).
      *--         데이터부
               07  XDJL4053-O-DATA-BOOK          OCCURS 000100 TIMES.
      *--           대분류업종코드
                 09  XDJL4053-O-LAG-CLSFI-BZTYP-CD
                                                 PIC  X(006).
      *--           대분류업종코드명
                 09  XDJL4053-O-LAG-C-BZTYP-CD-NAME
                                                 PIC  X(032).
      *--           기업규모구분
                 09  XDJL4053-O-CORP-SCAL-DSTIC  PIC  X(012).
      *--           산업별규모별SUB한도
                 09  XDJL4053-O-IDSTRY-PSP-SUB-LIMT
                                                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--           토탈익스포져
                 09  XDJL4053-O-TE               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--           비중
                 09  XDJL4053-O-WGHTZ            PIC  9(003)V9(02).
      *--           소진율
                 09  XDJL4053-O-EXHS-RT          PIC  9(003)V9(02).
      *--           한도여유액
                 09  XDJL4053-O-LIMT-SEXTR-AMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--           대상여부
                 09  XDJL4053-O-TAGET-YN         PIC  X(008).
      *--           한도초과년월일
                 09  XDJL4053-O-LIMT-EXCS-YMD    PIC  X(008).
      *--           예외적용년월일
                 09  XDJL4053-O-ECEPT-APLY-YMD   PIC  X(008).
      *--           취급중단년월일
                 09  XDJL4053-O-HNDLN-DSCN-YMD   PIC  X(008).
      *--           취급기준1적용년월일
                 09  XDJL4053-O-HNDLN-B-1-APLY-YMD
                                                 PIC  X(008).
      *--           취급기준2적용년월일
                 09  XDJL4053-O-HNDLN-B-2-APLY-YMD
                                                 PIC  X(008).
      *================================================================*
      *        X  D  J  L  4  0  5  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4053-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4053-I-BASE-YMD           ;조회기준일자
      *X  XDJL4053-I-HMAB-DSTCD         ;국내외구분코드
      *G  XDJL4053-O-GRID1              ;그리드1
      *N  XDJL4053-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4053-O-DATA-BOOK          ;데이터부
      *X  XDJL4053-O-LAG-CLSFI-BZTYP-CD ;대분류업종코드
      *X  XDJL4053-O-LAG-C-BZTYP-CD-NAME;대분류업종코드명
      *X  XDJL4053-O-CORP-SCAL-DSTIC    ;기업규모구분
      *S  XDJL4053-O-IDSTRY-PSP-SUB-LIMT
      * 산업별규모별SUB한도
      *S  XDJL4053-O-TE                 ;토탈익스포져
      *N  XDJL4053-O-WGHTZ              ;비중
      *N  XDJL4053-O-EXHS-RT            ;소진율
      *S  XDJL4053-O-LIMT-SEXTR-AMT     ;한도여유액
      *X  XDJL4053-O-TAGET-YN           ;대상여부
      *X  XDJL4053-O-LIMT-EXCS-YMD      ;한도초과년월일
      *X  XDJL4053-O-ECEPT-APLY-YMD     ;예외적용년월일
      *X  XDJL4053-O-HNDLN-DSCN-YMD     ;취급중단년월일
      *X  XDJL4053-O-HNDLN-B-1-APLY-YMD
      * 취급기준1적용년월일
      *X  XDJL4053-O-HNDLN-B-2-APLY-YMD
      * 취급기준2적용년월일
