      *================================================================*
      *@ NAME : XDJL4115                                               *
      *@ DESC : DC(EAD)그룹별TE현황조회 COPYBOOK                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-11-06 15:16:10                          *
      *  생성일시     : 2024-11-06 15:16:11                          *
      *  전체길이     : 00000049 BYTES                               *
      *================================================================*
           03  XDJL4115-RETURN.
             05  XDJL4115-R-STAT                 PIC  X(002).
                 88  COND-XDJL4115-OK            VALUE  '00'.
                 88  COND-XDJL4115-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4115-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4115-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4115-ERROR         VALUE  '09'.
                 88  COND-XDJL4115-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4115-SYSERROR      VALUE  '99'.
             05  XDJL4115-R-LINE                 PIC  9(006).
             05  XDJL4115-R-ERRCD                PIC  X(008).
             05  XDJL4115-R-TREAT-CD             PIC  X(008).
             05  XDJL4115-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4115-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4115-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월일
             05  XDJL4115-I-BASE-YMD             PIC  X(008).
      *--       그룹순위1
             05  XDJL4115-I-GROUP-RANKG1         PIC  9(003).
      *--       그룹순위2
             05  XDJL4115-I-GROUP-RANKG2         PIC  9(003).
      *--       그룹등급
             05  XDJL4115-I-GROUP-GRD            PIC  X(003).
      *--       관리한도1
             05  XDJL4115-I-MGT-CLAM1            PIC  9(015).
      *--       관리한도2
             05  XDJL4115-I-MGT-CLAM2            PIC  9(015).
      *----------------------------------------------------------------*
           03  XDJL4115-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4115-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4115-O-GRID1                OCCURS 000100 TIMES.
      *--         그룹순위
               07  XDJL4115-O-GROUP-RANKG        PIC  9(003).
      *--         그룹코드
               07  XDJL4115-O-GROUP-CD           PIC  X(006).
      *--         그룹명
               07  XDJL4115-O-GROUP-NAME         PIC  X(052).
      *--         그룹등급
               07  XDJL4115-O-GROUP-GRD          PIC  X(003).
      *--         그룹관리한도
               07  XDJL4115-O-GROUP-MGT-LIMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액직접한도
               07  XDJL4115-O-TTL-AMT-DRCT-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액간접한도
               07  XDJL4115-O-TTL-AMT-INDR-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액기준합계한도
               07  XDJL4115-O-TTL-AB-SUM-LIMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액직접잔액
               07  XDJL4115-O-TTL-AMT-DRCT-BAL   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액간접잔액
               07  XDJL4115-O-TTL-AMT-INDR-BAL   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액기준합계잔액
               07  XDJL4115-O-TTL-A-BASE-BALSUM  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         직접한도금액
               07  XDJL4115-O-DRCT-CLAM          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         간접한도금액
               07  XDJL4115-O-INDR-CLAM          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         합계한도기준금액
               07  XDJL4115-O-SUM-LIMT-BSAMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         소진율
               07  XDJL4115-O-EXHS-RT            PIC  9(003)V9(02).
      *================================================================*
      *        X  D  J  L  4  1  1  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4115-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4115-I-BASE-YMD           ;기준년월일
      *N  XDJL4115-I-GROUP-RANKG1       ;그룹순위1
      *N  XDJL4115-I-GROUP-RANKG2       ;그룹순위2
      *X  XDJL4115-I-GROUP-GRD          ;그룹등급
      *N  XDJL4115-I-MGT-CLAM1          ;관리한도1
      *N  XDJL4115-I-MGT-CLAM2          ;관리한도2
      *N  XDJL4115-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4115-O-GRID1              ;그리드1
      *N  XDJL4115-O-GROUP-RANKG        ;그룹순위
      *X  XDJL4115-O-GROUP-CD           ;그룹코드
      *X  XDJL4115-O-GROUP-NAME         ;그룹명
      *X  XDJL4115-O-GROUP-GRD          ;그룹등급
      *S  XDJL4115-O-GROUP-MGT-LIMT     ;그룹관리한도
      *S  XDJL4115-O-TTL-AMT-DRCT-LIMT  ;명목액직접한도
      *S  XDJL4115-O-TTL-AMT-INDR-LIMT  ;명목액간접한도
      *S  XDJL4115-O-TTL-AB-SUM-LIMT    ;명목액기준합계한도
      *S  XDJL4115-O-TTL-AMT-DRCT-BAL   ;명목액직접잔액
      *S  XDJL4115-O-TTL-AMT-INDR-BAL   ;명목액간접잔액
      *S  XDJL4115-O-TTL-A-BASE-BALSUM  ;명목액기준합계잔액
      *S  XDJL4115-O-DRCT-CLAM          ;직접한도금액
      *S  XDJL4115-O-INDR-CLAM          ;간접한도금액
      *S  XDJL4115-O-SUM-LIMT-BSAMT     ;합계한도기준금액
      *N  XDJL4115-O-EXHS-RT            ;소진율
