      *================================================================*
      *@ NAME : XDJL4112                                               *
      *@ DESC : DC(EAD)계좌별TE현황조회 COPYBOOK                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2010-10-28 16:37:50                          *
      *  생성일시     : 2010-10-28 16:37:53                          *
      *  전체길이     : 00000023 BYTES                               *
      *================================================================*
           03  XDJL4112-RETURN.
             05  XDJL4112-R-STAT                 PIC  X(002).
                 88  COND-XDJL4112-OK            VALUE  '00'.
                 88  COND-XDJL4112-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4112-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4112-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4112-ERROR         VALUE  '09'.
                 88  COND-XDJL4112-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4112-SYSERROR      VALUE  '99'.
             05  XDJL4112-R-LINE                 PIC  9(006).
             05  XDJL4112-R-ERRCD                PIC  X(008).
             05  XDJL4112-R-TREAT-CD             PIC  X(008).
             05  XDJL4112-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4112-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4112-I-PRCSS-DSTIC          PIC  X(002).
      *--       차주번호
             05  XDJL4112-I-BRWR-NO              PIC  X(013).
      *--       기준년월일
             05  XDJL4112-I-BASE-YMD             PIC  X(008).
      *----------------------------------------------------------------*
           03  XDJL4112-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수
             05  XDJL4112-O-OUTPT-LINE-CNT       PIC  9(005).
      *--       차주명
             05  XDJL4112-O-BRWR-NAME            PIC  X(052).
      *--       TE기준한도
             05  XDJL4112-O-TE-BASE-LIMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기준한도산출일
             05  XDJL4112-O-BASE-LIMT-CMPTN-DD   PIC  X(008).
      *--       한도설정유효일
             05  XDJL4112-O-LIMT-STUP-VALD-DD    PIC  X(008).
      *--       여신성관리한도
             05  XDJL4112-O-LNBZ-I-MGT-LIMT      PIC  9(015).
      *--       여신성한도기준TE
             05  XDJL4112-O-LNBZ-I-LIMT-BASE-TE  PIC  9(015).
      *--       여신성잔액기준TE
             05  XDJL4112-O-LNBZ-I-BAL-BASE-TE   PIC  9(015).
      *--       여신성한도여유액
             05  XDJL4112-O-LNBZ-IL-SEXTR-AMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       시장성관리한도
             05  XDJL4112-O-MRKTY-MGT-LIMT       PIC  9(015).
      *--       시장성한도기준TE
             05  XDJL4112-O-MRKTY-LIMT-BASE-TE   PIC  9(015).
      *--       시장성잔액기준TE
             05  XDJL4112-O-MRKTY-BAL-BASE-TE    PIC  9(015).
      *--       시장성한도여유액
             05  XDJL4112-O-MRKTY-L-SEXTR-AMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       관리한도
             05  XDJL4112-O-MGT-LIMT             PIC  9(015).
      *--       한도기준TE
             05  XDJL4112-O-LIMT-BASE-TE         PIC  9(015).
      *--       잔액기준TE
             05  XDJL4112-O-BAL-BASE-TE          PIC  9(015).
      *--       한도여유액
             05  XDJL4112-O-LIMT-SEXTR-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       파생상품총거래한도
             05  XDJL4112-O-DRVT-PT-TRAN-LIMT    PIC  9(015).
      *--       파생상품익스포져
             05  XDJL4112-O-DRVT-PRDCT-EXPSR     PIC  9(015).
      *--       그리드
             05  XDJL4112-O-GRID                 OCCURS 005000 TIMES.
      *--         계좌번호
               07  XDJL4112-O-ACNO               PIC  X(020).
      *--         상품코드
               07  XDJL4112-O-PRDCT-CD           PIC  X(012).
      *--         상품명
               07  XDJL4112-O-PRDCT-NAME         PIC  X(252).
      *--         자산구분
               07  XDJL4112-O-ASST-DSTIC         PIC  X(010).
      *--         약정구분
               07  XDJL4112-O-AGRE-DSTIC         PIC  X(010).
      *--         명목액기준한도
               07  XDJL4112-O-TTL-AMT-BASE-LIMT  PIC  9(015).
      *--         명목액기준잔액
               07  XDJL4112-O-TTL-AMT-BASE-BAL   PIC  9(015).
      *--         관리부점
               07  XDJL4112-O-MGTBRN             PIC  X(022).
      *--         시작년월일
               07  XDJL4112-O-START-YMD          PIC  X(008).
      *--         만기년월일
               07  XDJL4112-O-EXPIR-YMD          PIC  X(008).
      *================================================================*
      *        X  D  J  L  4  1  1  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4112-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4112-I-BRWR-NO            ;차주번호
      *X  XDJL4112-I-BASE-YMD           ;기준년월일
      *N  XDJL4112-O-OUTPT-LINE-CNT     ;출력라인수
      *X  XDJL4112-O-BRWR-NAME          ;차주명
      *S  XDJL4112-O-TE-BASE-LIMT       ;TE기준한도
      *X  XDJL4112-O-BASE-LIMT-CMPTN-DD ;기준한도산출일
      *X  XDJL4112-O-LIMT-STUP-VALD-DD  ;한도설정유효일
      *N  XDJL4112-O-LNBZ-I-MGT-LIMT    ;여신성관리한도
      *N  XDJL4112-O-LNBZ-I-LIMT-BASE-TE;여신성한도기준TE
      *N  XDJL4112-O-LNBZ-I-BAL-BASE-TE ;여신성잔액기준TE
      *S  XDJL4112-O-LNBZ-IL-SEXTR-AMT  ;여신성한도여유액
      *N  XDJL4112-O-MRKTY-MGT-LIMT     ;시장성관리한도
      *N  XDJL4112-O-MRKTY-LIMT-BASE-TE ;시장성한도기준TE
      *N  XDJL4112-O-MRKTY-BAL-BASE-TE  ;시장성잔액기준TE
      *S  XDJL4112-O-MRKTY-L-SEXTR-AMT  ;시장성한도여유액
      *N  XDJL4112-O-MGT-LIMT           ;관리한도
      *N  XDJL4112-O-LIMT-BASE-TE       ;한도기준TE
      *N  XDJL4112-O-BAL-BASE-TE        ;잔액기준TE
      *S  XDJL4112-O-LIMT-SEXTR-AMT     ;한도여유액
      *N  XDJL4112-O-DRVT-PT-TRAN-LIMT  ;파생상품총거래한도
      *N  XDJL4112-O-DRVT-PRDCT-EXPSR   ;파생상품익스포져
      *A  XDJL4112-O-GRID               ;그리드
      *X  XDJL4112-O-ACNO               ;계좌번호
      *X  XDJL4112-O-PRDCT-CD           ;상품코드
      *X  XDJL4112-O-PRDCT-NAME         ;상품명
      *X  XDJL4112-O-ASST-DSTIC         ;자산구분
      *X  XDJL4112-O-AGRE-DSTIC         ;약정구분
      *N  XDJL4112-O-TTL-AMT-BASE-LIMT  ;명목액기준한도
      *N  XDJL4112-O-TTL-AMT-BASE-BAL   ;명목액기준잔액
      *X  XDJL4112-O-MGTBRN             ;관리부점
      *X  XDJL4112-O-START-YMD          ;시작년월일
      *X  XDJL4112-O-EXPIR-YMD          ;만기년월일
