      *================================================================*
      *@ NAME : XDJL4039                                               *
      *@ DESC : DC본부부서기준값조회(신용공여한도관리) COPYBOO     *
      *@        K                                                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2023-12-12 09:14:06                          *
      *  생성일시     : 2023-12-12 09:14:07                          *
      *  전체길이     : 00000008 BYTES                               *
      *================================================================*
           03  XDJL4039-RETURN.
             05  XDJL4039-R-STAT                 PIC  X(002).
                 88  COND-XDJL4039-OK            VALUE  '00'.
                 88  COND-XDJL4039-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4039-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4039-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4039-ERROR         VALUE  '09'.
                 88  COND-XDJL4039-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4039-SYSERROR      VALUE  '99'.
             05  XDJL4039-R-LINE                 PIC  9(006).
             05  XDJL4039-R-ERRCD                PIC  X(008).
             05  XDJL4039-R-TREAT-CD             PIC  X(008).
             05  XDJL4039-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4039-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4039-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월
             05  XDJL4039-I-BASE-YM              PIC  X(006).
      *----------------------------------------------------------------*
           03  XDJL4039-OUT.
      *----------------------------------------------------------------*
      *--       기준년월
             05  XDJL4039-O-BASE-YM              PIC  X(006).
      *--       업무규제자기자본
             05  XDJL4039-O-BZWK-REGUL-ONCP      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       경영지표자기자본
             05  XDJL4039-O-MGBIZ-INDX-ONCP      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       은행기본자본
             05  XDJL4039-O-BNK-BASC-CAPTL       PIC S9(016)
                                                 LEADING  SEPARATE.
      *--       보통주자본
             05  XDJL4039-O-OSHR-CAPTL           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기타자본
             05  XDJL4039-O-ETC-CAPTL            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       보완자본
             05  XDJL4039-O-ENHN-CAPTL           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       총자본
             05  XDJL4039-O-TOTAL-CAPTL          PIC S9(016)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        X  D  J  L  4  0  3  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4039-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4039-I-BASE-YM            ;기준년월
      *X  XDJL4039-O-BASE-YM            ;기준년월
      *S  XDJL4039-O-BZWK-REGUL-ONCP    ;업무규제자기자본
      *S  XDJL4039-O-MGBIZ-INDX-ONCP    ;경영지표자기자본
      *S  XDJL4039-O-BNK-BASC-CAPTL     ;은행기본자본
      *S  XDJL4039-O-OSHR-CAPTL         ;보통주자본
      *S  XDJL4039-O-ETC-CAPTL          ;기타자본
      *S  XDJL4039-O-ENHN-CAPTL         ;보완자본
      *S  XDJL4039-O-TOTAL-CAPTL        ;총자본
