      *================================================================*
      *@ NAME : XDJL4098                                               *
      *@ DESC : DC기업및그룹한도신청및승인조회(개별그룹신용등급    *
      *@        별지원비율조회) COPYBOOK                             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-05-12 14:30:21                          *
      *  생성일시     : 2009-05-12 14:30:22                          *
      *================================================================*
           03  XDJL4098-RETURN.
             05  XDJL4098-R-STAT                 PIC  X(002).
                 88  COND-XDJL4098-OK            VALUE  '00'.
                 88  COND-XDJL4098-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4098-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4098-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4098-ERROR         VALUE  '09'.
                 88  COND-XDJL4098-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4098-SYSERROR      VALUE  '99'.
             05  XDJL4098-R-LINE                 PIC  9(006).
             05  XDJL4098-R-ERRCD                PIC  X(008).
             05  XDJL4098-R-TREAT-CD             PIC  X(008).
             05  XDJL4098-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4098-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4098-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객구분
             05  XDJL4098-I-CUST-DSTIC           PIC  X(001).
      *--       신용등급
             05  XDJL4098-I-CRDRAT               PIC  X(004).
      *--       표준산업분류코드
             05  XDJL4098-I-STND-I-CLSFI-CD      PIC  X(005).
      *----------------------------------------------------------------*
           03  XDJL4098-OUT.
      *----------------------------------------------------------------*
      *--       신용등급별지원비율
             05  XDJL4098-O-CRDRAT-P-SPORT-RATO  PIC  9(003)V9(02).
      *================================================================*
      *        X  D  J  L  4  0  9  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4098-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4098-I-CUST-DSTIC         ;고객구분
      *X  XDJL4098-I-CRDRAT             ;신용등급
      *X  XDJL4098-I-STND-I-CLSFI-CD    ;표준산업분류코드
      *N  XDJL4098-O-CRDRAT-P-SPORT-RATO;신용등급별지원비율
