      *================================================================*
      *@ NAME : XDJL4087                                               *
      *@ DESC : DC외화타점예치Depo별대주주조회COPYBOOK             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-08-20 11:10:13                          *
      *  생성일시     : 2024-08-20 11:10:13                          *
      *  전체길이     : 00000018 BYTES                               *
      *================================================================*
           03  XDJL4087-RETURN.
             05  XDJL4087-R-STAT                 PIC  X(002).
                 88  COND-XDJL4087-OK            VALUE  '00'.
                 88  COND-XDJL4087-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4087-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4087-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4087-ERROR         VALUE  '09'.
                 88  COND-XDJL4087-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4087-SYSERROR      VALUE  '99'.
             05  XDJL4087-R-LINE                 PIC  9(006).
             05  XDJL4087-R-ERRCD                PIC  X(008).
             05  XDJL4087-R-TREAT-CD             PIC  X(008).
             05  XDJL4087-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4087-IN.
      *----------------------------------------------------------------*
      *--       기준년월일
             05  XDJL4087-I-BASE-YMD             PIC  X(008).
      *--       고객식별자
             05  XDJL4087-I-CUST-IDNFR           PIC  X(010).
      *----------------------------------------------------------------*
           03  XDJL4087-OUT.
      *----------------------------------------------------------------*
      *--       현재건수1
             05  XDJL4087-O-PRSNT-NOITM1         PIC  9(005).
      *--       그리드1
             05  XDJL4087-O-GRID1                OCCURS 000100 TIMES.
      *--         기준년월일
               07  XDJL4087-O-BASE-YMD           PIC  X(008).
      *--         통화코드
               07  XDJL4087-O-CNCYCD             PIC  X(003).
      *--         구분
               07  XDJL4087-O-DSTIC              PIC  X(020).
      *--         거래은행BIC코드
               07  XDJL4087-O-TRAN-BNK-BIC       PIC  X(011).
      *--         통합계정과목코드
               07  XDJL4087-O-INTGRA-TIACC-CD    PIC  X(013).
      *--         외화잔액
               07  XDJL4087-O-FC-BAL             PIC  9(015)V9(03).
      *--         원화환산금액
               07  XDJL4087-O-WONC-AUC           PIC  9(015)V9(03).
      *--         고객식별자
               07  XDJL4087-O-CUST-IDNFR         PIC  X(010).
      *--         등록직원번호
               07  XDJL4087-O-REGI-EMPID         PIC  X(007).
      *--         등록일시
               07  XDJL4087-O-REGI-YMS           PIC  X(014).
      *================================================================*
      *        X  D  J  L  4  0  8  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4087-I-BASE-YMD           ;기준년월일
      *X  XDJL4087-I-CUST-IDNFR         ;고객식별자
      *N  XDJL4087-O-PRSNT-NOITM1       ;현재건수1
      *A  XDJL4087-O-GRID1              ;그리드1
      *X  XDJL4087-O-BASE-YMD           ;기준년월일
      *X  XDJL4087-O-CNCYCD             ;통화코드
      *X  XDJL4087-O-DSTIC              ;구분
      *X  XDJL4087-O-TRAN-BNK-BIC       ;거래은행BIC코드
      *X  XDJL4087-O-INTGRA-TIACC-CD    ;통합계정과목코드
      *N  XDJL4087-O-FC-BAL             ;외화잔액
      *N  XDJL4087-O-WONC-AUC           ;원화환산금액
      *X  XDJL4087-O-CUST-IDNFR         ;고객식별자
      *X  XDJL4087-O-REGI-EMPID         ;등록직원번호
      *X  XDJL4087-O-REGI-YMS           ;등록일시
