      *================================================================*
      *@ NAME : XDJL4081                                               *
      *@ DESC : DC신용공여이사회승인내역조회COPYBOOK                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-04-16 14:31:10                          *
      *  생성일시     : 2024-04-16 14:31:10                          *
      *  전체길이     : 00000014 BYTES                               *
      *================================================================*
           03  XDJL4081-RETURN.
             05  XDJL4081-R-STAT                 PIC  X(002).
                 88  COND-XDJL4081-OK            VALUE  '00'.
                 88  COND-XDJL4081-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4081-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4081-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4081-ERROR         VALUE  '09'.
                 88  COND-XDJL4081-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4081-SYSERROR      VALUE  '99'.
             05  XDJL4081-R-LINE                 PIC  9(006).
             05  XDJL4081-R-ERRCD                PIC  X(008).
             05  XDJL4081-R-TREAT-CD             PIC  X(008).
             05  XDJL4081-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4081-IN.
      *----------------------------------------------------------------*
      *--       소관부점코드
             05  XDJL4081-I-JRSDZ-BRNCD          PIC  X(004).
      *--       고객식별자
             05  XDJL4081-I-CUST-IDNFR           PIC  X(010).
      *----------------------------------------------------------------*
           03  XDJL4081-OUT.
      *----------------------------------------------------------------*
      *--       현재건수1
             05  XDJL4081-O-PRSNT-NOITM1         PIC  9(005).
      *--       그리드1
             05  XDJL4081-O-GRID1                OCCURS 000100 TIMES.
      *--         고객식별자
               07  XDJL4081-O-CUST-IDNFR         PIC  X(010).
      *--         고객명
               07  XDJL4081-O-CUSTNM             PIC  X(052).
      *--         신용공여중분류코드
               07  XDJL4081-O-GRCR-MIDL-CLSFI-CD PIC  X(003).
      *--         통화코드
               07  XDJL4081-O-CNCYCD             PIC  X(003).
      *--         이사회승인금액
               07  XDJL4081-O-BRDC-ATHOR-AMT     PIC  9(018).
      *--         이사회승인원화환산금액
               07  XDJL4081-O-BRDC-ATHOR-WONC-AUC
                                                 PIC  9(018).
      *--         이사회승인년월일
               07  XDJL4081-O-BRDC-ATHOR-YMD     PIC  X(008).
      *--         이사회승인유효년월일
               07  XDJL4081-O-BRDC-ATHOR-VALD-YMD
                                                 PIC  X(008).
      *--         소관부점코드
               07  XDJL4081-O-JRSDZ-BRNCD        PIC  X(004).
      *--         소관부점명
               07  XDJL4081-O-JRSD-BRNZ-NAME     PIC  X(040).
      *--         비고
               07  XDJL4081-O-RMARK              PIC  X(102).
      *--         이사회승인번호
               07  XDJL4081-O-BRDC-ATHOR-NO      PIC  X(010).
      *--         이사회승인금리내용
               07  XDJL4081-O-BRDC-ATHOR-IRT-CTNT
                                                 PIC  X(044).
      *================================================================*
      *        X  D  J  L  4  0  8  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4081-I-JRSDZ-BRNCD        ;소관부점코드
      *X  XDJL4081-I-CUST-IDNFR         ;고객식별자
      *N  XDJL4081-O-PRSNT-NOITM1       ;현재건수1
      *A  XDJL4081-O-GRID1              ;그리드1
      *X  XDJL4081-O-CUST-IDNFR         ;고객식별자
      *X  XDJL4081-O-CUSTNM             ;고객명
      *X  XDJL4081-O-GRCR-MIDL-CLSFI-CD ;신용공여중분류코드
      *X  XDJL4081-O-CNCYCD             ;통화코드
      *N  XDJL4081-O-BRDC-ATHOR-AMT     ;이사회승인금액
      *N  XDJL4081-O-BRDC-ATHOR-WONC-AUC
      * 이사회승인원화환산금액
      *X  XDJL4081-O-BRDC-ATHOR-YMD     ;이사회승인년월일
      *X  XDJL4081-O-BRDC-ATHOR-VALD-YMD
      * 이사회승인유효년월일
      *X  XDJL4081-O-JRSDZ-BRNCD        ;소관부점코드
      *X  XDJL4081-O-JRSD-BRNZ-NAME     ;소관부점명
      *X  XDJL4081-O-RMARK              ;비고
      *X  XDJL4081-O-BRDC-ATHOR-NO      ;이사회승인번호
      *X  XDJL4081-O-BRDC-ATHOR-IRT-CTNT;이사회승인금리내용
