      *================================================================*
      *@ NAME : XDJL4027                                               *
      *@ DESC : DC포괄신용공여한도과목별여신현황조회 COPYBOOK        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2022-03-17 16:29:12                          *
      *  생성일시     : 2022-03-17 16:29:12                          *
      *  전체길이     : 00000020 BYTES                               *
      *================================================================*
           03  XDJL4027-RETURN.
             05  XDJL4027-R-STAT                 PIC  X(002).
                 88  COND-XDJL4027-OK            VALUE  '00'.
                 88  COND-XDJL4027-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4027-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4027-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4027-ERROR         VALUE  '09'.
                 88  COND-XDJL4027-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4027-SYSERROR      VALUE  '99'.
             05  XDJL4027-R-LINE                 PIC  9(006).
             05  XDJL4027-R-ERRCD                PIC  X(008).
             05  XDJL4027-R-TREAT-CD             PIC  X(008).
             05  XDJL4027-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4027-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4027-I-PRCSS-DSTIC          PIC  X(002).
      *--       KB-PIN
             05  XDJL4027-I-KB-PIN               PIC  X(010).
      *--       조회기준일자
             05  XDJL4027-I-BASE-YMD             PIC  X(008).
      *----------------------------------------------------------------*
           03  XDJL4027-OUT.
      *----------------------------------------------------------------*
      *--       채무자명
             05  XDJL4027-O-DBTRZ-NAME           PIC  X(052).
      *--       여신성최고한도
             05  XDJL4027-O-LNBZ-I-HGST-LIMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       계열명
             05  XDJL4027-O-AFFLT-C-GROUP-NAME   PIC  X(052).
      *--       유효기일
             05  XDJL4027-O-MGT-LIMT-VALD-YMD    PIC  X(008).
      *--       포골신용공여관리한도
             05  XDJL4027-O-MGT-CLAM             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       계열신용등급
             05  XDJL4027-O-INTNL-CV-GRD-DSTCD   PIC  X(004).
      *--       업종명
             05  XDJL4027-O-STND-IDSTRY-CD-NAME  PIC  X(052).
      *--       기사용액
             05  XDJL4027-O-INLS-GRCR-LIMT-AUC   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기업신용등급
             05  XDJL4027-O-INTNL-CV-GRD-DSTCD1  PIC  X(004).
      *--       한도여유액
             05  XDJL4027-O-LIMT-SEXTR-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       최종포괄신용공여관리한도
             05  XDJL4027-O-LAST-INLS-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       출력라인수1
             05  XDJL4027-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4027-O-GRID1                OCCURS 001000 TIMES.
      *--         기준년월일
               07  XDJL4027-O-BASE-YMD           PIC  X(008).
      *--         항목구분
               07  XDJL4027-O-TE-ITEM-DSTIC1     PIC  X(025).
      *--         상품코드
               07  XDJL4027-O-PRDCT-CD1          PIC  X(012).
      *--         상품명
               07  XDJL4027-O-PRDCT-NAME1        PIC  X(252).
      *--         자산구분
               07  XDJL4027-O-TE-ASST-DSTCD1     PIC  X(010).
      *--         명목액기준한도
               07  XDJL4027-O-TTL-AMT-BASE-CLAM1 PIC  9(015).
      *--         명목액기준잔액
               07  XDJL4027-O-TTL-AMT-BASE-BAL1  PIC  9(015).
      *--         한도기준TE
               07  XDJL4027-O-TE-LIMT-AUC1       PIC  9(015).
      *================================================================*
      *        X  D  J  L  4  0  2  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4027-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4027-I-KB-PIN             ;KB-PIN
      *X  XDJL4027-I-BASE-YMD           ;조회기준일자
      *X  XDJL4027-O-DBTRZ-NAME         ;채무자명
      *S  XDJL4027-O-LNBZ-I-HGST-LIMT   ;여신성최고한도
      *X  XDJL4027-O-AFFLT-C-GROUP-NAME ;계열명
      *X  XDJL4027-O-MGT-LIMT-VALD-YMD  ;유효기일
      *S  XDJL4027-O-MGT-CLAM           ;포골신용공여관리한도
      *X  XDJL4027-O-INTNL-CV-GRD-DSTCD ;계열신용등급
      *X  XDJL4027-O-STND-IDSTRY-CD-NAME;업종명
      *S  XDJL4027-O-INLS-GRCR-LIMT-AUC ;기사용액
      *X  XDJL4027-O-INTNL-CV-GRD-DSTCD1;기업신용등급
      *S  XDJL4027-O-LIMT-SEXTR-AMT     ;한도여유액
      *S  XDJL4027-O-LAST-INLS-LIMT     ;최종포괄신용공여관리한도
      *N  XDJL4027-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4027-O-GRID1              ;그리드1
      *X  XDJL4027-O-BASE-YMD           ;기준년월일
      *X  XDJL4027-O-TE-ITEM-DSTIC1     ;항목구분
      *X  XDJL4027-O-PRDCT-CD1          ;상품코드
      *X  XDJL4027-O-PRDCT-NAME1        ;상품명
      *X  XDJL4027-O-TE-ASST-DSTCD1     ;자산구분
      *N  XDJL4027-O-TTL-AMT-BASE-CLAM1 ;명목액기준한도
      *N  XDJL4027-O-TTL-AMT-BASE-BAL1  ;명목액기준잔액
      *N  XDJL4027-O-TE-LIMT-AUC1       ;한도기준TE
