      *================================================================*
      *@ NAME : XDJL4821                                               *
      *@ DESC : DCSub-Limit현황(미기표포함)조회COPYBOOK          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-12-19 15:54:33                          *
      *  생성일시     : 2019-12-19 15:54:36                          *
      *  전체길이     : 00000011 BYTES                               *
      *================================================================*
           03  XDJL4821-RETURN.
             05  XDJL4821-R-STAT                 PIC  X(002).
                 88  COND-XDJL4821-OK            VALUE  '00'.
                 88  COND-XDJL4821-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4821-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4821-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4821-ERROR         VALUE  '09'.
                 88  COND-XDJL4821-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4821-SYSERROR      VALUE  '99'.
             05  XDJL4821-R-LINE                 PIC  9(006).
             05  XDJL4821-R-ERRCD                PIC  X(008).
             05  XDJL4821-R-TREAT-CD             PIC  X(008).
             05  XDJL4821-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4821-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4821-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월일
             05  XDJL4821-I-BASE-YMD             PIC  X(008).
      *--       국내외구분코드
             05  XDJL4821-I-HMAB-DSTCD           PIC  X(001).
      *----------------------------------------------------------------*
           03  XDJL4821-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4821-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4821-O-GRID1                OCCURS 000100 TIMES.
      *--         SUB업종코드
               07  XDJL4821-O-SUB-BZTYP-CD       PIC  X(003).
      *--         SUB업종코드명
               07  XDJL4821-O-SUB-BZTYP-CD-NAME  PIC  X(042).
      *--         산업TE기업규모구분
               07  XDJL4821-O-IDSTRY-TCS-DSTCD   PIC  X(001).
      *--         전년도말익스포져금액
               07  XDJL4821-O-PYY-X-END-EXPSR-AMT
                                                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         SUB관리한도금액
               07  XDJL4821-O-SUB-MGT-CLAM       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         SUB익스포져금액
               07  XDJL4821-O-SUB-EXPSR-AMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         여유액
               07  XDJL4821-O-SEXTR-AMT          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         소진율1
               07  XDJL4821-O-EXHS-RT1           PIC  9(003)V9(02).
      *--         순증한도
               07  XDJL4821-O-NTIC-LIMT          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         순증토탈익스포져
               07  XDJL4821-O-NTIC-TE            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         순증여유액
               07  XDJL4821-O-NTIC-SEXTR-AMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         소진율2
               07  XDJL4821-O-EXHS-RT2           PIC  9(003)V9(02).
      *--         대출금액
               07  XDJL4821-O-LN-AMT             PIC S9(018)
                                                 LEADING  SEPARATE.
      *--         실질여유액
               07  XDJL4821-O-ATUAL-SEXTR-AMT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         실질소진율
               07  XDJL4821-O-ATUAL-EXHS-RT      PIC  9(003)V9(02).
      *================================================================*
      *        X  D  J  L  4  8  2  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4821-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4821-I-BASE-YMD           ;기준년월일
      *X  XDJL4821-I-HMAB-DSTCD         ;국내외구분코드
      *N  XDJL4821-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4821-O-GRID1              ;그리드1
      *X  XDJL4821-O-SUB-BZTYP-CD       ;SUB업종코드
      *X  XDJL4821-O-SUB-BZTYP-CD-NAME  ;SUB업종코드명
      *X  XDJL4821-O-IDSTRY-TCS-DSTCD   ;산업TE기업규모구분
      *S  XDJL4821-O-PYY-X-END-EXPSR-AMT
      * 전년도말익스포져금액
      *S  XDJL4821-O-SUB-MGT-CLAM       ;SUB관리한도금액
      *S  XDJL4821-O-SUB-EXPSR-AMT      ;SUB익스포져금액
      *S  XDJL4821-O-SEXTR-AMT          ;여유액
      *N  XDJL4821-O-EXHS-RT1           ;소진율1
      *S  XDJL4821-O-NTIC-LIMT          ;순증한도
      *S  XDJL4821-O-NTIC-TE            ;순증토탈익스포져
      *S  XDJL4821-O-NTIC-SEXTR-AMT     ;순증여유액
      *N  XDJL4821-O-EXHS-RT2           ;소진율2
      *S  XDJL4821-O-LN-AMT             ;대출금액
      *S  XDJL4821-O-ATUAL-SEXTR-AMT    ;실질여유액
      *N  XDJL4821-O-ATUAL-EXHS-RT      ;실질소진율
