      *================================================================*
      *@ NAME : XDJL4041                                               *
      *@ DESC : DC국가별정보조회 COPYBOOK                            *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-02-11 15:30:50                          *
      *  생성일시     : 2020-02-11 15:30:52                          *
      *  전체길이     : 00000010 BYTES                               *
      *================================================================*
           03  XDJL4041-RETURN.
             05  XDJL4041-R-STAT                 PIC  X(002).
                 88  COND-XDJL4041-OK            VALUE  '00'.
                 88  COND-XDJL4041-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4041-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4041-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4041-ERROR         VALUE  '09'.
                 88  COND-XDJL4041-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4041-SYSERROR      VALUE  '99'.
             05  XDJL4041-R-LINE                 PIC  9(006).
             05  XDJL4041-R-ERRCD                PIC  X(008).
             05  XDJL4041-R-TREAT-CD             PIC  X(008).
             05  XDJL4041-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4041-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4041-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회기준년월
             05  XDJL4041-I-BASE-YM              PIC  X(006).
      *--       국가코드
             05  XDJL4041-I-ISO-NATNL-CD         PIC  X(002).
      *----------------------------------------------------------------*
           03  XDJL4041-OUT.
      *----------------------------------------------------------------*
      *--       국가명
             05  XDJL4041-O-ENG-NATNL-NAME       PIC  X(052).
      *--       출력라인수1
             05  XDJL4041-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4041-O-GRID1                OCCURS 000300 TIMES.
      *--         국가코드
               07  XDJL4041-O-ISO-NATNL-CD       PIC  X(002).
      *--         국가명1
               07  XDJL4041-O-ENG-NATNL-NAME1    PIC  X(052).
      *--         Total관리한도
               07  XDJL4041-O-WHOL-MGT-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         SP
               07  XDJL4041-O-SNP-GRD-DSTCD      PIC  X(002).
      *--         Moodys
               07  XDJL4041-O-MODYS-GRD-DSTCD    PIC  X(002).
      *--         Fitch
               07  XDJL4041-O-FITCH-GRD-DSTCD    PIC  X(002).
      *--         당행국가신용등급구분
               07  XDJL4041-O-OWBNK-NC-GRD-DSTCD PIC  X(004).
      *--         한도관리지역구분
               07  XDJL4041-O-LIMT-MGT-AREA-DSTCD
                                                 PIC  X(001).
      *--         지역관리한도금액
               07  XDJL4041-O-AREA-MGT-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         국가전체공통한도여부
               07  XDJL4041-O-NATNL-W-CMN-LIMT-YN
                                                 PIC  X(001).
      *--         공통관리한도금액
               07  XDJL4041-O-CMN-MGT-CLAM       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         국가위험수준구분
               07  XDJL4041-O-NATNL-R-LVEL-DSTCD PIC  X(001).
      *================================================================*
      *        X  D  J  L  4  0  4  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4041-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4041-I-BASE-YM            ;조회기준년월
      *X  XDJL4041-I-ISO-NATNL-CD       ;국가코드
      *X  XDJL4041-O-ENG-NATNL-NAME     ;국가명
      *N  XDJL4041-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4041-O-GRID1              ;그리드1
      *X  XDJL4041-O-ISO-NATNL-CD       ;국가코드
      *X  XDJL4041-O-ENG-NATNL-NAME1    ;국가명1
      *S  XDJL4041-O-WHOL-MGT-CLAM      ;Total관리한도
      *X  XDJL4041-O-SNP-GRD-DSTCD      ;SP
      *X  XDJL4041-O-MODYS-GRD-DSTCD    ;Moodys
      *X  XDJL4041-O-FITCH-GRD-DSTCD    ;Fitch
      *X  XDJL4041-O-OWBNK-NC-GRD-DSTCD ;당행국가신용등급구분
      *X  XDJL4041-O-LIMT-MGT-AREA-DSTCD;한도관리지역구분
      *S  XDJL4041-O-AREA-MGT-CLAM      ;지역관리한도금액
      *X  XDJL4041-O-NATNL-W-CMN-LIMT-YN
      * 국가전체공통한도여부
      *S  XDJL4041-O-CMN-MGT-CLAM       ;공통관리한도금액
      *X  XDJL4041-O-NATNL-R-LVEL-DSTCD ;국가위험수준구분
