      *================================================================*
      *@ NAME : XDJL4581                                               *
      *@ DESC : DC국별수기계좌조회COPYBOOK                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-12-04 16:36:46                          *
      *  생성일시     : 2020-12-04 16:36:46                          *
      *  전체길이     : 00000006 BYTES                               *
      *================================================================*
           03  XDJL4581-RETURN.
             05  XDJL4581-R-STAT                 PIC  X(002).
                 88  COND-XDJL4581-OK            VALUE  '00'.
                 88  COND-XDJL4581-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4581-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4581-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4581-ERROR         VALUE  '09'.
                 88  COND-XDJL4581-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4581-SYSERROR      VALUE  '99'.
             05  XDJL4581-R-LINE                 PIC  9(006).
             05  XDJL4581-R-ERRCD                PIC  X(008).
             05  XDJL4581-R-TREAT-CD             PIC  X(008).
             05  XDJL4581-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4581-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4581-I-PRCSS-DSTIC          PIC  X(002).
      *--       부점코드
             05  XDJL4581-I-BRNCD                PIC  X(004).
      *----------------------------------------------------------------*
           03  XDJL4581-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4581-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4581-O-GRID1                OCCURS 000100 TIMES.
      *--         계좌번호
               07  XDJL4581-O-ACNO               PIC  X(020).
      *--         고객식별자
               07  XDJL4581-O-CUST-IDNFR         PIC  X(010).
      *--         거래상대방
               07  XDJL4581-O-TRAN-CNPRT         PIC  X(082).
      *--         상품대분류코드
               07  XDJL4581-O-PRDCT-LAG-CLSFI-CD PIC  X(002).
      *--         상품중분류코드
               07  XDJL4581-O-PRDCT-MEDM-CLSFI-CD
                                                 PIC  X(002).
      *--         상품템플릿코드
               07  XDJL4581-O-PRDCT-TMPLT-CD     PIC  X(003).
      *--         상품번호
               07  XDJL4581-O-PRDCT-NO           PIC  X(005).
      *--         ISO국가코드
               07  XDJL4581-O-ISO-NATNL-CD       PIC  X(002).
      *--         관리부점
               07  XDJL4581-O-MGTBRN             PIC  X(004).
      *--         시작년월일
               07  XDJL4581-O-START-YMD          PIC  X(008).
      *--         만기년월일
               07  XDJL4581-O-EXPIR-YMD          PIC  X(008).
      *--         통화코드
               07  XDJL4581-O-CNCYCD             PIC  X(003).
      *--         통화한도금액
               07  XDJL4581-O-CRNCY-CLAM         PIC S9(015)V9(03)
                                                 LEADING  SEPARATE.
      *--         통화금일잔액
               07  XDJL4581-O-CRNCY-TDD-BAL      PIC S9(015)V9(03)
                                                 LEADING  SEPARATE.
      *--         등록년월일
               07  XDJL4581-O-REGI-YMD           PIC  X(008).
      *--         등록직원번호
               07  XDJL4581-O-REGI-EMPID         PIC  X(007).
      *--         등록부점
               07  XDJL4581-O-REGI-BRN           PIC  X(004).
      *================================================================*
      *        X  D  J  L  4  5  8  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4581-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4581-I-BRNCD              ;부점코드
      *N  XDJL4581-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4581-O-GRID1              ;그리드1
      *X  XDJL4581-O-ACNO               ;계좌번호
      *X  XDJL4581-O-CUST-IDNFR         ;고객식별자
      *X  XDJL4581-O-TRAN-CNPRT         ;거래상대방
      *X  XDJL4581-O-PRDCT-LAG-CLSFI-CD ;상품대분류코드
      *X  XDJL4581-O-PRDCT-MEDM-CLSFI-CD;상품중분류코드
      *X  XDJL4581-O-PRDCT-TMPLT-CD     ;상품템플릿코드
      *X  XDJL4581-O-PRDCT-NO           ;상품번호
      *X  XDJL4581-O-ISO-NATNL-CD       ;ISO국가코드
      *X  XDJL4581-O-MGTBRN             ;관리부점
      *X  XDJL4581-O-START-YMD          ;시작년월일
      *X  XDJL4581-O-EXPIR-YMD          ;만기년월일
      *X  XDJL4581-O-CNCYCD             ;통화코드
      *S  XDJL4581-O-CRNCY-CLAM         ;통화한도금액
      *S  XDJL4581-O-CRNCY-TDD-BAL      ;통화금일잔액
      *X  XDJL4581-O-REGI-YMD           ;등록년월일
      *X  XDJL4581-O-REGI-EMPID         ;등록직원번호
      *X  XDJL4581-O-REGI-BRN           ;등록부점
