      *================================================================*
      *@ NAME : XDJL4116                                               *
      *@ DESC : DC(EAD)그룹등급별TE현황조회 COPYBOOK               *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2010-10-25 14:28:24                          *
      *  생성일시     : 2010-10-25 14:28:26                          *
      *  전체길이     : 00000016 BYTES                               *
      *================================================================*
           03  XDJL4116-RETURN.
             05  XDJL4116-R-STAT                 PIC  X(002).
                 88  COND-XDJL4116-OK            VALUE  '00'.
                 88  COND-XDJL4116-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4116-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4116-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4116-ERROR         VALUE  '09'.
                 88  COND-XDJL4116-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4116-SYSERROR      VALUE  '99'.
             05  XDJL4116-R-LINE                 PIC  9(006).
             05  XDJL4116-R-ERRCD                PIC  X(008).
             05  XDJL4116-R-TREAT-CD             PIC  X(008).
             05  XDJL4116-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4116-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4116-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회기준일자
             05  XDJL4116-I-BASE-YMD             PIC  X(008).
      *--       계열순위1
             05  XDJL4116-I-AFFLT-CORP-RANKG1    PIC  9(003).
      *--       계열순위2
             05  XDJL4116-I-AFFLT-CORP-RANKG2    PIC  9(003).
      *----------------------------------------------------------------*
           03  XDJL4116-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XDJL4116-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4116-O-GRID1                OCCURS 000030 TIMES.
      *--         그룹신용등급
               07  XDJL4116-O-INTNL-CV-GRD-DSTCD PIC  X(006).
      *--         대상그룹수
               07  XDJL4116-O-TAGET-GROUP-CNT    PIC  9(015).
      *--         그룹관리한도(A)
               07  XDJL4116-O-MGT-CLAM           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액기준한도
               07  XDJL4116-O-TTL-AMT-BASE-CLAM  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         명목액기준잔액
               07  XDJL4116-O-TTL-AMT-BASE-BAL   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         한도기준TE(B)
               07  XDJL4116-O-TE-LIMT-AUC        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         잔액기준TE
               07  XDJL4116-O-TE-BAL-AUC         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         소진율(B/A)
               07  XDJL4116-O-EXHS-RT            PIC  9(003)V9(02).
      *================================================================*
      *        X  D  J  L  4  1  1  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4116-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4116-I-BASE-YMD           ;조회기준일자
      *N  XDJL4116-I-AFFLT-CORP-RANKG1  ;계열순위1
      *N  XDJL4116-I-AFFLT-CORP-RANKG2  ;계열순위2
      *N  XDJL4116-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4116-O-GRID1              ;그리드1
      *X  XDJL4116-O-INTNL-CV-GRD-DSTCD ;그룹신용등급
      *N  XDJL4116-O-TAGET-GROUP-CNT    ;대상그룹수
      *S  XDJL4116-O-MGT-CLAM           ;그룹관리한도(A)
      *S  XDJL4116-O-TTL-AMT-BASE-CLAM  ;명목액기준한도
      *S  XDJL4116-O-TTL-AMT-BASE-BAL   ;명목액기준잔액
      *S  XDJL4116-O-TE-LIMT-AUC        ;한도기준TE(B)
      *S  XDJL4116-O-TE-BAL-AUC         ;잔액기준TE
      *N  XDJL4116-O-EXHS-RT            ;소진율(B/A)
