      *================================================================*
      *@ NAME : XDJL4136                                               *
      *@ DESC : DC대주주(특수관계인포함)에대한신용공여현황조회   *
      *@        COPYBOOK                                             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-08-27 16:27:32                          *
      *  생성일시     : 2024-08-27 16:27:33                          *
      *  전체길이     : 00000014 BYTES                               *
      *================================================================*
           03  XDJL4136-RETURN.
             05  XDJL4136-R-STAT                 PIC  X(002).
                 88  COND-XDJL4136-OK            VALUE  '00'.
                 88  COND-XDJL4136-KEYDUP        VALUE  '01'.
                 88  COND-XDJL4136-NOTFOUND      VALUE  '02'.
                 88  COND-XDJL4136-SPVSTOP       VALUE  '05'.
                 88  COND-XDJL4136-ERROR         VALUE  '09'.
                 88  COND-XDJL4136-ABNORMAL      VALUE  '98'.
                 88  COND-XDJL4136-SYSERROR      VALUE  '99'.
             05  XDJL4136-R-LINE                 PIC  9(006).
             05  XDJL4136-R-ERRCD                PIC  X(008).
             05  XDJL4136-R-TREAT-CD             PIC  X(008).
             05  XDJL4136-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJL4136-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJL4136-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월일
             05  XDJL4136-I-BASE-YMD             PIC  X(008).
      *--       소관부점코드
             05  XDJL4136-I-JRSDZ-BRNCD          PIC  X(004).
      *----------------------------------------------------------------*
           03  XDJL4136-OUT.
      *----------------------------------------------------------------*
      *--       업무규제자기자본
             05  XDJL4136-O-BZWK-REGUL-ONCP      PIC  9(015).
      *--       자기자본기준년월
             05  XDJL4136-O-ONCP-BASE-YM         PIC  X(006).
      *--       대주주신용공여한도
             05  XDJL4136-O-STKLN-M-GRCR-LIMT    PIC  9(015).
      *--       자회사신용공여한도
             05  XDJL4136-O-SBCO-GRCR-LIMT       PIC  9(015).
      *--       신용공여한도
             05  XDJL4136-O-GRCR-LIMT            PIC  9(015).
      *--       대주주신용공여잔액
             05  XDJL4136-O-STKLN-MAIN-GRCR-BAL  PIC  9(015).
      *--       자회사신용공여잔액
             05  XDJL4136-O-SBCO-GRCR-BAL        PIC  9(015).
      *--       신용공여잔액
             05  XDJL4136-O-GRCR-BAL             PIC  9(015).
      *--       대주주한도여유액
             05  XDJL4136-O-STKLN-ML-SEXTR-AMT   PIC  9(015).
      *--       자회사한도여유액
             05  XDJL4136-O-SBCO-LIMT-SEXTR-AMT  PIC  9(015).
      *--       한도여유액
             05  XDJL4136-O-LIMT-SEXTR-AMT       PIC  9(015).
      *--       출력라인수1
             05  XDJL4136-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XDJL4136-O-GRID1                OCCURS 000500 TIMES.
      *--         고객식별자
               07  XDJL4136-O-CUST-IDNFR         PIC  X(010).
      *--         고객명
               07  XDJL4136-O-CUSTNM             PIC  X(052).
      *--         소관부점명
               07  XDJL4136-O-JRSD-BRNZ-NAME     PIC  X(042).
      *--         신용공여중분류코드
               07  XDJL4136-O-GRCR-MIDL-CLSFI-CD PIC  X(003).
      *--         통화코드1
               07  XDJL4136-O-CNCYCD1            PIC  X(003).
      *--         이사회승인금액
               07  XDJL4136-O-BRDC-ATHOR-AMT     PIC  9(018).
      *--         이사회승인원화환산금액
               07  XDJL4136-O-BRDC-ATHOR-WONC-AUC
                                                 PIC  9(018).
      *--         이사회승인년월일
               07  XDJL4136-O-BRDC-ATHOR-YMD     PIC  X(008).
      *--         이사회승인유효년월일
               07  XDJL4136-O-BRDC-ATHOR-VALD-YMD
                                                 PIC  X(008).
      *--         통합계정과목코드
               07  XDJL4136-O-INTGRA-TIACC-CD    PIC  X(013).
      *--         상품명
               07  XDJL4136-O-PRDCT-NAME         PIC  X(052).
      *--         계좌번호
               07  XDJL4136-O-ACNO               PIC  X(020).
      *--         약정계좌번호
               07  XDJL4136-O-AGRE-ACNO          PIC  X(020).
      *--         시작년월일
               07  XDJL4136-O-START-YMD          PIC  X(008).
      *--         만기년월일
               07  XDJL4136-O-EXPIR-YMD          PIC  X(008).
      *--         통화코드2
               07  XDJL4136-O-CNCYCD2            PIC  X(003).
      *--         통화한도
               07  XDJL4136-O-CRNCY-CLAM         PIC  9(018).
      *--         통화잔액
               07  XDJL4136-O-CRNCY-BAL          PIC  9(018).
      *--         BS기준한도
               07  XDJL4136-O-BS-BASE-CLAM       PIC  9(015).
      *--         BS기준잔액
               07  XDJL4136-O-BS-BASE-BAL        PIC  9(015).
      *--         신용공여익스포져금액
               07  XDJL4136-O-GRCR-EXPSR-AMT     PIC  9(015).
      *--         금리내용
               07  XDJL4136-O-IRTZ-CTNT          PIC  X(042).
      *--         담보형태구분
               07  XDJL4136-O-SCURTY-FORM-DSTCD  PIC  X(001).
      *--         담보설정금액
               07  XDJL4136-O-SCURTY-SETAMT      PIC  9(015).
      *--         취급부점명
               07  XDJL4136-O-HNDLN-BRN-NAME     PIC  X(042).
      *--         대출취급형태구분
               07  XDJL4136-O-LN-HNDLN-FORM-DSTCD
                                                 PIC  X(001).
      *--         이사회승인번호
               07  XDJL4136-O-BRDC-ATHOR-NO      PIC  X(010).
      *--         관련여신일련번호
               07  XDJL4136-O-RELATD-LNBZ-SERNO  PIC  9(003).
      *================================================================*
      *        X  D  J  L  4  1  3  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJL4136-I-PRCSS-DSTIC        ;처리구분
      *X  XDJL4136-I-BASE-YMD           ;기준년월일
      *X  XDJL4136-I-JRSDZ-BRNCD        ;소관부점코드
      *N  XDJL4136-O-BZWK-REGUL-ONCP    ;업무규제자기자본
      *X  XDJL4136-O-ONCP-BASE-YM       ;자기자본기준년월
      *N  XDJL4136-O-STKLN-M-GRCR-LIMT  ;대주주신용공여한도
      *N  XDJL4136-O-SBCO-GRCR-LIMT     ;자회사신용공여한도
      *N  XDJL4136-O-GRCR-LIMT          ;신용공여한도
      *N  XDJL4136-O-STKLN-MAIN-GRCR-BAL;대주주신용공여잔액
      *N  XDJL4136-O-SBCO-GRCR-BAL      ;자회사신용공여잔액
      *N  XDJL4136-O-GRCR-BAL           ;신용공여잔액
      *N  XDJL4136-O-STKLN-ML-SEXTR-AMT ;대주주한도여유액
      *N  XDJL4136-O-SBCO-LIMT-SEXTR-AMT;자회사한도여유액
      *N  XDJL4136-O-LIMT-SEXTR-AMT     ;한도여유액
      *N  XDJL4136-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XDJL4136-O-GRID1              ;그리드1
      *X  XDJL4136-O-CUST-IDNFR         ;고객식별자
      *X  XDJL4136-O-CUSTNM             ;고객명
      *X  XDJL4136-O-JRSD-BRNZ-NAME     ;소관부점명
      *X  XDJL4136-O-GRCR-MIDL-CLSFI-CD ;신용공여중분류코드
      *X  XDJL4136-O-CNCYCD1            ;통화코드1
      *N  XDJL4136-O-BRDC-ATHOR-AMT     ;이사회승인금액
      *N  XDJL4136-O-BRDC-ATHOR-WONC-AUC
      * 이사회승인원화환산금액
      *X  XDJL4136-O-BRDC-ATHOR-YMD     ;이사회승인년월일
      *X  XDJL4136-O-BRDC-ATHOR-VALD-YMD
      * 이사회승인유효년월일
      *X  XDJL4136-O-INTGRA-TIACC-CD    ;통합계정과목코드
      *X  XDJL4136-O-PRDCT-NAME         ;상품명
      *X  XDJL4136-O-ACNO               ;계좌번호
      *X  XDJL4136-O-AGRE-ACNO          ;약정계좌번호
      *X  XDJL4136-O-START-YMD          ;시작년월일
      *X  XDJL4136-O-EXPIR-YMD          ;만기년월일
      *X  XDJL4136-O-CNCYCD2            ;통화코드2
      *N  XDJL4136-O-CRNCY-CLAM         ;통화한도
      *N  XDJL4136-O-CRNCY-BAL          ;통화잔액
      *N  XDJL4136-O-BS-BASE-CLAM       ;BS기준한도
      *N  XDJL4136-O-BS-BASE-BAL        ;BS기준잔액
      *N  XDJL4136-O-GRCR-EXPSR-AMT     ;신용공여익스포져금액
      *X  XDJL4136-O-IRTZ-CTNT          ;금리내용
      *X  XDJL4136-O-SCURTY-FORM-DSTCD  ;담보형태구분
      *N  XDJL4136-O-SCURTY-SETAMT      ;담보설정금액
      *X  XDJL4136-O-HNDLN-BRN-NAME     ;취급부점명
      *X  XDJL4136-O-LN-HNDLN-FORM-DSTCD;대출취급형태구분
      *X  XDJL4136-O-BRDC-ATHOR-NO      ;이사회승인번호
      *N  XDJL4136-O-RELATD-LNBZ-SERNO  ;관련여신일련번호
