      *================================================================*
      *@ NAME : XDJLB711                                               *
      *@ DESC : DC신용공여기관정보COPYBOOK                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2012-09-27 13:55:39                          *
      *  생성일시     : 2012-09-27 13:55:41                          *
      *  전체길이     : 00000098 BYTES                               *
      *================================================================*
           03  XDJLB711-RETURN.
             05  XDJLB711-R-STAT                 PIC  X(002).
                 88  COND-XDJLB711-OK            VALUE  '00'.
                 88  COND-XDJLB711-KEYDUP        VALUE  '01'.
                 88  COND-XDJLB711-NOTFOUND      VALUE  '02'.
                 88  COND-XDJLB711-SPVSTOP       VALUE  '05'.
                 88  COND-XDJLB711-ERROR         VALUE  '09'.
                 88  COND-XDJLB711-ABNORMAL      VALUE  '98'.
                 88  COND-XDJLB711-SYSERROR      VALUE  '99'.
             05  XDJLB711-R-LINE                 PIC  9(006).
             05  XDJLB711-R-ERRCD                PIC  X(008).
             05  XDJLB711-R-TREAT-CD             PIC  X(008).
             05  XDJLB711-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XDJLB711-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XDJLB711-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월
             05  XDJLB711-I-BASE-YM              PIC  X(006).
      *--       보증기관번호
             05  XDJLB711-I-GRNTY-INSTI-NO       PIC  X(013).
      *--       TE보증기관코드
             05  XDJLB711-I-T-E-GRNTY-INSTI-CD   PIC  X(003).
      *--       보증기관명
             05  XDJLB711-I-GRNTY-INSTI-NAME     PIC  X(052).
      *--       신표준산업분류코드
             05  XDJLB711-I-NEW-SI-CLSFI-CD      PIC  X(005).
      *--       국가코드
             05  XDJLB711-I-NATNL-CD             PIC  X(003).
      *--       신용공여위험가중치
             05  XDJLB711-I-GRCR-RISK-WGHT       PIC  9(003).
      *--       신용공여기관구분
             05  XDJLB711-I-GRCR-INSTI-DSTCD     PIC  X(001).
      *--       보증기관고객식별자
             05  XDJLB711-I-GRNTY-I-CUST-IDNFR   PIC  X(010).
      *----------------------------------------------------------------*
           03  XDJLB711-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XDJLB711-O-PRCSS-RSULT          PIC  X(002).
      *================================================================*
      *        X  D  J  L  B  7  1  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XDJLB711-I-PRCSS-DSTIC        ;처리구분
      *X  XDJLB711-I-BASE-YM            ;기준년월
      *X  XDJLB711-I-GRNTY-INSTI-NO     ;보증기관번호
      *X  XDJLB711-I-T-E-GRNTY-INSTI-CD ;TE보증기관코드
      *X  XDJLB711-I-GRNTY-INSTI-NAME   ;보증기관명
      *X  XDJLB711-I-NEW-SI-CLSFI-CD    ;신표준산업분류코드
      *X  XDJLB711-I-NATNL-CD           ;국가코드
      *N  XDJLB711-I-GRCR-RISK-WGHT     ;신용공여위험가중치
      *X  XDJLB711-I-GRCR-INSTI-DSTCD   ;신용공여기관구분
      *X  XDJLB711-I-GRNTY-I-CUST-IDNFR ;보증기관고객식별자
      *X  XDJLB711-O-PRCSS-RSULT        ;처리결과
