      *================================================================*
      *@ NAME : XIJL4006                                               *
      *@ DESC : ICExposure총괄조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-31 10:57:40                          *
      *  생성일시     : 2009-07-31 10:57:43                          *
      *================================================================*
           03  XIJL4006-RETURN.
             05  XIJL4006-R-STAT                 PIC  X(002).
                 88  COND-XIJL4006-OK            VALUE  '00'.
                 88  COND-XIJL4006-KEYDUP        VALUE  '01'.
                 88  COND-XIJL4006-NOTFOUND      VALUE  '02'.
                 88  COND-XIJL4006-SPVSTOP       VALUE  '05'.
                 88  COND-XIJL4006-ERROR         VALUE  '09'.
                 88  COND-XIJL4006-ABNORMAL      VALUE  '98'.
                 88  COND-XIJL4006-SYSERROR      VALUE  '99'.
             05  XIJL4006-R-LINE                 PIC  9(006).
             05  XIJL4006-R-ERRCD                PIC  X(008).
             05  XIJL4006-R-TREAT-CD             PIC  X(008).
             05  XIJL4006-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XIJL4006-IN.
      *----------------------------------------------------------------*
      *--       조회기준일자
             05  XIJL4006-I-BASE-YMD             PIC  X(008).
      *--       채무자번호
             05  XIJL4006-I-BRWR-NO              PIC  X(013).
      *----------------------------------------------------------------*
           03  XIJL4006-OUT.
      *----------------------------------------------------------------*
      *--       TE관리한도
             05  XIJL4006-O-TE-MGT-CLAM          PIC  9(015).
      *--       TotalExposure
             05  XIJL4006-O-TE-AMT               PIC  9(015).
      *================================================================*
      *        X  I  J  L  4  0  0  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XIJL4006-I-BASE-YMD           ;조회기준일자
      *X  XIJL4006-I-BRWR-NO            ;채무자번호
      *N  XIJL4006-O-TE-MGT-CLAM        ;TE관리한도
      *N  XIJL4006-O-TE-AMT             ;TotalExposure
