      *================================================================*
      *@ NAME : XIJL413B                                               *
      *@ DESC : ICTE한신평관리대상그룹조회COPYBOOK                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2017-08-22 15:51:34                          *
      *  생성일시     : 2017-08-22 15:51:35                          *
      *  전체길이     : 00000053 BYTES                               *
      *================================================================*
           03  XIJL413B-RETURN.
             05  XIJL413B-R-STAT                 PIC  X(002).
                 88  COND-XIJL413B-OK            VALUE  '00'.
                 88  COND-XIJL413B-KEYDUP        VALUE  '01'.
                 88  COND-XIJL413B-NOTFOUND      VALUE  '02'.
                 88  COND-XIJL413B-SPVSTOP       VALUE  '05'.
                 88  COND-XIJL413B-ERROR         VALUE  '09'.
                 88  COND-XIJL413B-ABNORMAL      VALUE  '98'.
                 88  COND-XIJL413B-SYSERROR      VALUE  '99'.
             05  XIJL413B-R-LINE                 PIC  9(006).
             05  XIJL413B-R-ERRCD                PIC  X(008).
             05  XIJL413B-R-TREAT-CD             PIC  X(008).
             05  XIJL413B-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XIJL413B-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XIJL413B-I-PRCSS-DSTIC          PIC  X(001).
      *--       KB-PIN
             05  XIJL413B-I-KB-PIN               PIC  X(010).
      *--       한신평그룹명
             05  XIJL413B-I-AFFLT-C-GROUP-NAME   PIC  X(042).
      *----------------------------------------------------------------*
           03  XIJL413B-OUT.
      *----------------------------------------------------------------*
      *--       그리드
             05  XIJL413B-O-GRID.
      *--         총라인수
               07  XIJL413B-O-TOTAL-LINE-CNT     PIC  9(005).
      *--         데이터부
               07  XIJL413B-O-DATA-BOOK          OCCURS 000100 TIMES.
      *--           계열기업군코드
                 09  XIJL413B-O-AFFLT-CORP-GROUP-CD
                                                 PIC  X(003).
      *--           계열기업군명
                 09  XIJL413B-O-AFFLT-C-GROUP-NAME
                                                 PIC  X(042).
      *--           그룹사신용등급구분
                 09  XIJL413B-O-CMGR-CRTDSCD     PIC  X(003).
      *--           계열기업순위
                 09  XIJL413B-O-AFFLT-CORP-RANKG PIC  9(003).
      *--           KB-PIN
                 09  XIJL413B-O-KB-PIN           PIC  X(010).
      *--           채무자명
                 09  XIJL413B-O-DBTRZ-NAME       PIC  X(052).
      *================================================================*
      *        X  I  J  L  4  1  3  B    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XIJL413B-I-PRCSS-DSTIC        ;처리구분
      *X  XIJL413B-I-KB-PIN             ;KB-PIN
      *X  XIJL413B-I-AFFLT-C-GROUP-NAME ;한신평그룹명
      *G  XIJL413B-O-GRID               ;그리드
      *N  XIJL413B-O-TOTAL-LINE-CNT     ;총라인수
      *A  XIJL413B-O-DATA-BOOK          ;데이터부
      *X  XIJL413B-O-AFFLT-CORP-GROUP-CD;계열기업군코드
      *X  XIJL413B-O-AFFLT-C-GROUP-NAME ;계열기업군명
      *X  XIJL413B-O-CMGR-CRTDSCD       ;그룹사신용등급구분
      *N  XIJL413B-O-AFFLT-CORP-RANKG   ;계열기업순위
      *X  XIJL413B-O-KB-PIN             ;KB-PIN
      *X  XIJL413B-O-DBTRZ-NAME         ;채무자명
