      *================================================================*
      *@ NAME : XIJL4003                                               *
      *@ DESC : IC포괄신용공여한도설정여부조회 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2010-06-08 14:49:32                          *
      *  생성일시     : 2010-06-08 14:49:43                          *
      *  전체길이     : 00000015 BYTES                               *
      *================================================================*
           03  XIJL4003-RETURN.
             05  XIJL4003-R-STAT                 PIC  X(002).
                 88  COND-XIJL4003-OK            VALUE  '00'.
                 88  COND-XIJL4003-KEYDUP        VALUE  '01'.
                 88  COND-XIJL4003-NOTFOUND      VALUE  '02'.
                 88  COND-XIJL4003-SPVSTOP       VALUE  '05'.
                 88  COND-XIJL4003-ERROR         VALUE  '09'.
                 88  COND-XIJL4003-ABNORMAL      VALUE  '98'.
                 88  COND-XIJL4003-SYSERROR      VALUE  '99'.
             05  XIJL4003-R-LINE                 PIC  9(006).
             05  XIJL4003-R-ERRCD                PIC  X(008).
             05  XIJL4003-R-TREAT-CD             PIC  X(008).
             05  XIJL4003-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XIJL4003-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XIJL4003-I-PRCSS-DSTIC          PIC  X(002).
      *--       차주번호
             05  XIJL4003-I-BRWR-NO              PIC  X(013).
      *----------------------------------------------------------------*
           03  XIJL4003-OUT.
      *----------------------------------------------------------------*
      *--       기준년월일
             05  XIJL4003-O-BASE-YMD             PIC  X(008).
      *--       설정여부
             05  XIJL4003-O-STUP-YN              PIC  X(001).
      *================================================================*
      *        X  I  J  L  4  0  0  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XIJL4003-I-PRCSS-DSTIC        ;처리구분
      *X  XIJL4003-I-BRWR-NO            ;차주번호
      *X  XIJL4003-O-BASE-YMD           ;기준년월일
      *X  XIJL4003-O-STUP-YN            ;설정여부
