      *================================================================*
      *@ NAME : XPJLB273                                               *
      *@ DESC : PC포괄신용공여한도신청저장 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-24 16:34:46                          *
      *  생성일시     : 2009-06-24 16:34:48                          *
      *================================================================*
           03  XPJLB273-RETURN.
             05  XPJLB273-R-STAT                 PIC  X(002).
                 88  COND-XPJLB273-OK            VALUE  '00'.
                 88  COND-XPJLB273-KEYDUP        VALUE  '01'.
                 88  COND-XPJLB273-NOTFOUND      VALUE  '02'.
                 88  COND-XPJLB273-SPVSTOP       VALUE  '05'.
                 88  COND-XPJLB273-ERROR         VALUE  '09'.
                 88  COND-XPJLB273-ABNORMAL      VALUE  '98'.
                 88  COND-XPJLB273-SYSERROR      VALUE  '99'.
             05  XPJLB273-R-LINE                 PIC  9(006).
             05  XPJLB273-R-ERRCD                PIC  X(008).
             05  XPJLB273-R-TREAT-CD             PIC  X(008).
             05  XPJLB273-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJLB273-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJLB273-I-PRCSS-DSTIC          PIC  X(002).
      *--       차주번호
             05  XPJLB273-I-BRWR-NO              PIC  X(013).
      *--       신청번호
             05  XPJLB273-I-APLCN-NO             PIC  X(010).
      *--       한도신청종류구분코드
             05  XPJLB273-I-LIMT-A-KND-DSTCD     PIC  X(001).
      *--       신청년월일
             05  XPJLB273-I-APLCN-YMD            PIC  X(008).
      *--       신청부점코드
             05  XPJLB273-I-APLCN-BRNCD          PIC  X(004).
      *--       신청직원번호
             05  XPJLB273-I-APLCN-EMPID          PIC  X(007).
      *--       한도설정가능금액
             05  XPJLB273-I-LIMT-STUP-ABLAMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도신청금액
             05  XPJLB273-I-LIMT-APLCN-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신청사유내용
             05  XPJLB273-I-APLCN-RESN-CTNT      PIC  X(302).
      *----------------------------------------------------------------*
           03  XPJLB273-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XPJLB273-O-PRCSS-RSULT          PIC  X(002).
      *--       신청번호
             05  XPJLB273-O-APLCN-NO             PIC  X(010).
      *================================================================*
      *        X  P  J  L  B  2  7  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJLB273-I-PRCSS-DSTIC        ;처리구분
      *X  XPJLB273-I-BRWR-NO            ;차주번호
      *X  XPJLB273-I-APLCN-NO           ;신청번호
      *X  XPJLB273-I-LIMT-A-KND-DSTCD   ;한도신청종류구분코드
      *X  XPJLB273-I-APLCN-YMD          ;신청년월일
      *X  XPJLB273-I-APLCN-BRNCD        ;신청부점코드
      *X  XPJLB273-I-APLCN-EMPID        ;신청직원번호
      *S  XPJLB273-I-LIMT-STUP-ABLAMT   ;한도설정가능금액
      *S  XPJLB273-I-LIMT-APLCN-AMT     ;한도신청금액
      *X  XPJLB273-I-APLCN-RESN-CTNT    ;신청사유내용
      *X  XPJLB273-O-PRCSS-RSULT        ;처리결과
      *X  XPJLB273-O-APLCN-NO           ;신청번호
