      *================================================================*
      *@ NAME : XPJL4043                                               *
      *@ DESC : PC보고서조회 COPYBOOK                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-17 19:18:50                          *
      *  생성일시     : 2009-07-17 19:18:54                          *
      *================================================================*
           03  XPJL4043-RETURN.
             05  XPJL4043-R-STAT                 PIC  X(002).
                 88  COND-XPJL4043-OK            VALUE  '00'.
                 88  COND-XPJL4043-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4043-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4043-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4043-ERROR         VALUE  '09'.
                 88  COND-XPJL4043-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4043-SYSERROR      VALUE  '99'.
             05  XPJL4043-R-LINE                 PIC  9(006).
             05  XPJL4043-R-ERRCD                PIC  X(008).
             05  XPJL4043-R-TREAT-CD             PIC  X(008).
             05  XPJL4043-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4043-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4043-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회기준일자
             05  XPJL4043-I-BASE-YMD             PIC  X(008).
      *----------------------------------------------------------------*
           03  XPJL4043-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XPJL4043-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       출력라인수2
             05  XPJL4043-O-OUTPT-LINE-CNT2      PIC  9(005).
      *--       출력라인수3
             05  XPJL4043-O-OUTPT-LINE-CNT3      PIC  9(005).
      *--       그리드1
             05  XPJL4043-O-GRID1                OCCURS 000100 TIMES.
      *--         지역
               07  XPJL4043-O-LIMT-M-AREA-DSTCD1 PIC  X(020).
      *--         국가수
               07  XPJL4043-O-NATNL-CNT1         PIC  9(003).
      *--         설정한도(A)
               07  XPJL4043-O-WHOL-MGT-CLAM1     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         금일운용잔액(B)
               07  XPJL4043-O-USD-CLAM1          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         금일운용비율(B/A)
               07  XPJL4043-O-TDD-MGIVST-RATO1   PIC  9(003)V9(02).
      *--         한도여유액(A-B)
               07  XPJL4043-O-LIMT-SEXTR-AMT1    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그리드2
             05  XPJL4043-O-GRID2                OCCURS 000100 TIMES.
      *--         Country
               07  XPJL4043-O-LIMT-N-CNSN-DSTCD2 PIC  X(020).
      *--         국가수
               07  XPJL4043-O-NATNL-CNT2         PIC  9(003).
      *--         공여한도(A)
               07  XPJL4043-O-WHOL-MGT-CLAM2     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         한도사용액(B)
               07  XPJL4043-O-LIMT-USE-AMT2      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         한도소진율(B/A)
               07  XPJL4043-O-LIMT-EXHS-RT2      PIC  9(003)V9(02).
      *--         한도여유액(A-B)
               07  XPJL4043-O-LIMT-SEXTR-AMT2    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그리드3
             05  XPJL4043-O-GRID3                OCCURS 000300 TIMES.
      *--         국가
               07  XPJL4043-O-ENG-NATNL-NAME3    PIC  X(052).
      *--         SP
               07  XPJL4043-O-SNP-GRD-DSTCD3     PIC  X(004).
      *--         Moodys
               07  XPJL4043-O-MODYS-GRD-DSTCD3   PIC  X(004).
      *--         Fitch
               07  XPJL4043-O-FITCH-GRD-DSTCD3   PIC  X(004).
      *--         공여한도(A)
               07  XPJL4043-O-WHOL-MGT-CLAM3     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         전월잔액
               07  XPJL4043-O-LSMN-BAL3          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         금일잔액(B)
               07  XPJL4043-O-USD-CLAM3          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         변동액
               07  XPJL4043-O-FLXBL-AMT3         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         한도소진율(B/A)
               07  XPJL4043-O-LIMT-EXHS-RT3      PIC  9(003)V9(02).
      *--         한도여유액(A-B)
               07  XPJL4043-O-LIMT-SEXTR-AMT3    PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        X  P  J  L  4  0  4  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4043-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4043-I-BASE-YMD           ;조회기준일자
      *N  XPJL4043-O-OUTPT-LINE-CNT1    ;출력라인수1
      *N  XPJL4043-O-OUTPT-LINE-CNT2    ;출력라인수2
      *N  XPJL4043-O-OUTPT-LINE-CNT3    ;출력라인수3
      *A  XPJL4043-O-GRID1              ;그리드1
      *X  XPJL4043-O-LIMT-M-AREA-DSTCD1 ;지역
      *N  XPJL4043-O-NATNL-CNT1         ;국가수
      *S  XPJL4043-O-WHOL-MGT-CLAM1     ;설정한도(A)
      *S  XPJL4043-O-USD-CLAM1          ;금일운용잔액(B)
      *N  XPJL4043-O-TDD-MGIVST-RATO1   ;금일운용비율(B/A)
      *S  XPJL4043-O-LIMT-SEXTR-AMT1    ;한도여유액(A-B)
      *A  XPJL4043-O-GRID2              ;그리드2
      *X  XPJL4043-O-LIMT-N-CNSN-DSTCD2 ;Country Type
      *N  XPJL4043-O-NATNL-CNT2         ;국가수
      *S  XPJL4043-O-WHOL-MGT-CLAM2     ;공여한도(A)
      *S  XPJL4043-O-LIMT-USE-AMT2      ;한도사용액(B)
      *N  XPJL4043-O-LIMT-EXHS-RT2      ;한도소진율(B/A)
      *S  XPJL4043-O-LIMT-SEXTR-AMT2    ;한도여유액(A-B)
      *A  XPJL4043-O-GRID3              ;그리드3
      *X  XPJL4043-O-ENG-NATNL-NAME3    ;국가
      *X  XPJL4043-O-SNP-GRD-DSTCD3     ;SP
      *X  XPJL4043-O-MODYS-GRD-DSTCD3   ;Moodys
      *X  XPJL4043-O-FITCH-GRD-DSTCD3   ;Fitch
      *S  XPJL4043-O-WHOL-MGT-CLAM3     ;공여한도(A)
      *S  XPJL4043-O-LSMN-BAL3          ;전월잔액
      *S  XPJL4043-O-USD-CLAM3          ;금일잔액(B)
      *S  XPJL4043-O-FLXBL-AMT3         ;변동액
      *N  XPJL4043-O-LIMT-EXHS-RT3      ;한도소진율(B/A)
      *S  XPJL4043-O-LIMT-SEXTR-AMT3    ;한도여유액(A-B)
