      *================================================================*
      *@ NAME : XPJL4094                                               *
      *@ DESC : PC기업및그룹한도신청및승인조회(금융기관기준한도    *
      *@        조회) COPYBOOK                                       *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-22 10:52:07                          *
      *  생성일시     : 2009-07-22 10:52:10                          *
      *================================================================*
           03  XPJL4094-RETURN.
             05  XPJL4094-R-STAT                 PIC  X(002).
                 88  COND-XPJL4094-OK            VALUE  '00'.
                 88  COND-XPJL4094-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4094-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4094-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4094-ERROR         VALUE  '09'.
                 88  COND-XPJL4094-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4094-SYSERROR      VALUE  '99'.
             05  XPJL4094-R-LINE                 PIC  9(006).
             05  XPJL4094-R-ERRCD                PIC  X(008).
             05  XPJL4094-R-TREAT-CD             PIC  X(008).
             05  XPJL4094-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4094-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4094-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객구분
             05  XPJL4094-I-CUST-DSTIC           PIC  X(001).
      *--       차주번호
             05  XPJL4094-I-BRWR-NO              PIC  X(013).
      *--       신청번호
             05  XPJL4094-I-APLCN-NO             PIC  X(010).
      *----------------------------------------------------------------*
           03  XPJL4094-OUT.
      *----------------------------------------------------------------*
      *--       신용등급
             05  XPJL4094-O-CRDRAT               PIC  X(004).
      *--       결산년월
             05  XPJL4094-O-STLACC-YM            PIC  X(006).
      *--       업종코드
             05  XPJL4094-O-BZTYP-CD             PIC  X(002).
      *--       업종명
             05  XPJL4094-O-BZTYP-NAME           PIC  X(010).
      *--       업종평균기준년
             05  XPJL4094-O-BZTYP-AVG-BASE-YR    PIC  X(004).
      *--       신용등급별지원비율
             05  XPJL4094-O-CRDRAT-P-SPORT-RATO  PIC  9(003)V9(02).
      *--       전전기법인세비율차감전계속사업이익
             05  XPJL4094-O-BF-PCRSBC-BIZ-PRFT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       전기법인세비율차감전계속사업이익
             05  XPJL4094-O-PRPRID-CRSBCB-PRFT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       당기법인세비율차감전계속사업이익
             05  XPJL4094-O-CRTM-CRSBC-BIZ-PRFT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       전전기자기자본
             05  XPJL4094-O-BF-PRPRID-ONCP       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       전기자기자본
             05  XPJL4094-O-PRPRID-ONCP          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       당기자기자본
             05  XPJL4094-O-CRTM-ONCP            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       최근업종평균자기자본비율
             05  XPJL4094-O-LA-B-AVG-ONCP-RATO   PIC  9(003)V9(02).
      *--       상환능력기준한도
             05  XPJL4094-O-SOLVN-BASE-LIMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       규모기준한도
             05  XPJL4094-O-SCAL-BASE-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기준한도
             05  XPJL4094-O-BASE-LIMT            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정신용등급
             05  XPJL4094-O-AMND-CRDRAT          PIC  X(004).
      *--       수정결산년월
             05  XPJL4094-O-AMND-STLACC-YM       PIC  X(006).
      *--       수정업종코드
             05  XPJL4094-O-AMND-BZTYP-CD        PIC  X(002).
      *--       수정업종명
             05  XPJL4094-O-AMND-BZTYP-NAME      PIC  X(010).
      *--       수정업종평균기준년
             05  XPJL4094-O-AMND-B-AVG-BASE-YR   PIC  X(004).
      *--       수정신용등급별지원비율
             05  XPJL4094-O-AMND-CP-SPORT-RATO   PIC  9(003)V9(02).
      *--       수정전전기법인세비율차감전계속사업이익
             05  XPJL4094-O-AMND-BPCRSBCB-PRFT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정전기법인세비율차감전계속사업이익
             05  XPJL4094-O-AMND-PCRSBCB-PRFT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정당기법인세비율차감전계속사업이익
             05  XPJL4094-O-AMND-CCRSBCB-PRFT    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정전전기자기자본
             05  XPJL4094-O-AMND-BF-PRPRID-ONCP  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정전기자기자본
             05  XPJL4094-O-AMND-PRPRID-ONCP     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정당기자기자본
             05  XPJL4094-O-AMND-CRTM-ONCP       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정최근업종평균자기자본비율
             05  XPJL4094-O-AMND-LBA-ONCP-RATO   PIC  9(003)V9(02).
      *--       수정상환능력기준한도
             05  XPJL4094-O-AMND-S-BASE-LIMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정규모기준한도
             05  XPJL4094-O-AMND-SCAL-BASE-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정기준한도
             05  XPJL4094-O-AMND-BASE-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        X  P  J  L  4  0  9  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4094-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4094-I-CUST-DSTIC         ;고객구분
      *X  XPJL4094-I-BRWR-NO            ;차주번호
      *X  XPJL4094-I-APLCN-NO           ;신청번호
      *X  XPJL4094-O-CRDRAT             ;신용등급
      *X  XPJL4094-O-STLACC-YM          ;결산년월
      *X  XPJL4094-O-BZTYP-CD           ;업종코드
      *X  XPJL4094-O-BZTYP-NAME         ;업종명
      *X  XPJL4094-O-BZTYP-AVG-BASE-YR  ;업종평균기준년
      *N  XPJL4094-O-CRDRAT-P-SPORT-RATO;신용등급별지원비율
      *S  XPJL4094-O-BF-PCRSBC-BIZ-PRFT
      * 전전기법인세비율차감전계속사업이익
      *S  XPJL4094-O-PRPRID-CRSBCB-PRFT
      * 전기법인세비율차감전계속사업이익
      *S  XPJL4094-O-CRTM-CRSBC-BIZ-PRFT
      * 당기법인세비율차감전계속사업이익
      *S  XPJL4094-O-BF-PRPRID-ONCP     ;전전기자기자본
      *S  XPJL4094-O-PRPRID-ONCP        ;전기자기자본
      *S  XPJL4094-O-CRTM-ONCP          ;당기자기자본
      *N  XPJL4094-O-LA-B-AVG-ONCP-RATO
      * 최근업종평균자기자본비율
      *S  XPJL4094-O-SOLVN-BASE-LIMT    ;상환능력기준한도
      *S  XPJL4094-O-SCAL-BASE-LIMT     ;규모기준한도
      *S  XPJL4094-O-BASE-LIMT          ;기준한도
      *X  XPJL4094-O-AMND-CRDRAT        ;수정신용등급
      *X  XPJL4094-O-AMND-STLACC-YM     ;수정결산년월
      *X  XPJL4094-O-AMND-BZTYP-CD      ;수정업종코드
      *X  XPJL4094-O-AMND-BZTYP-NAME    ;수정업종명
      *X  XPJL4094-O-AMND-B-AVG-BASE-YR ;수정업종평균기준년
      *N  XPJL4094-O-AMND-CP-SPORT-RATO
      * 수정신용등급별지원비율
      *S  XPJL4094-O-AMND-BPCRSBCB-PRFT
      * 수정전전기법인세비율차감전계속사업이익
      *S  XPJL4094-O-AMND-PCRSBCB-PRFT
      * 수정전기법인세비율차감전계속사업이익
      *S  XPJL4094-O-AMND-CCRSBCB-PRFT
      * 수정당기법인세비율차감전계속사업이익
      *S  XPJL4094-O-AMND-BF-PRPRID-ONCP;수정전전기자기자본
      *S  XPJL4094-O-AMND-PRPRID-ONCP   ;수정전기자기자본
      *S  XPJL4094-O-AMND-CRTM-ONCP     ;수정당기자기자본
      *N  XPJL4094-O-AMND-LBA-ONCP-RATO
      * 수정최근업종평균자기자본비율
      *S  XPJL4094-O-AMND-S-BASE-LIMT   ;수정상환능력기준한도
      *S  XPJL4094-O-AMND-SCAL-BASE-LIMT;수정규모기준한도
      *S  XPJL4094-O-AMND-BASE-LIMT     ;수정기준한도
