      *================================================================*
      *@ NAME : XPJL409A                                               *
      *@ DESC : PC기업및그룹한도신청및승인조회(설정신청조회) C     *
      *@        OPYBOOK                                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-05-14 17:09:06                          *
      *  생성일시     : 2009-05-14 17:09:08                          *
      *================================================================*
           03  XPJL409A-RETURN.
             05  XPJL409A-R-STAT                 PIC  X(002).
                 88  COND-XPJL409A-OK            VALUE  '00'.
                 88  COND-XPJL409A-KEYDUP        VALUE  '01'.
                 88  COND-XPJL409A-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL409A-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL409A-ERROR         VALUE  '09'.
                 88  COND-XPJL409A-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL409A-SYSERROR      VALUE  '99'.
             05  XPJL409A-R-LINE                 PIC  9(006).
             05  XPJL409A-R-ERRCD                PIC  X(008).
             05  XPJL409A-R-TREAT-CD             PIC  X(008).
             05  XPJL409A-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL409A-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL409A-I-PRCSS-DSTIC          PIC  X(002).
      *--       고객구분
             05  XPJL409A-I-CUST-DSTIC           PIC  X(001).
      *--       차주번호
             05  XPJL409A-I-BRWR-NO              PIC  X(013).
      *--       신청번호
             05  XPJL409A-I-APLCN-NO             PIC  X(010).
      *--       한도신청구분
             05  XPJL409A-I-LIMT-APLCN-DSTIC     PIC  X(001).
      *----------------------------------------------------------------*
           03  XPJL409A-OUT.
      *----------------------------------------------------------------*
      *--       한도신청구분
             05  XPJL409A-O-LIMT-APLCN-DSTIC     PIC  X(001).
      *--       대표자명
             05  XPJL409A-O-RPRS-NAME            PIC  X(052).
      *--       기업신용등급
             05  XPJL409A-O-CORP-CRDRAT          PIC  X(004).
      *--       표준산업분류코드
             05  XPJL409A-O-STND-I-CLSFI-CD      PIC  X(005).
      *--       그룹명
             05  XPJL409A-O-GROUP-NAME           PIC  X(042).
      *--       그룹등급
             05  XPJL409A-O-GROUP-GRD            PIC  X(004).
      *--       영업점코드
             05  XPJL409A-O-BBRN-CD              PIC  X(004).
      *--       영업점명
             05  XPJL409A-O-BBRN-NAME            PIC  X(022).
      *--       직원번호
             05  XPJL409A-O-EMPID                PIC  X(007).
      *--       직원명
             05  XPJL409A-O-EMNM                 PIC  X(042).
      *--       개별기업관리한도
             05  XPJL409A-O-IDIVI-CORP-MGT-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       개별기업익스포져
             05  XPJL409A-O-IDIVI-CORP-EXPSR     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그룹관리한도
             05  XPJL409A-O-GROUP-MGT-LIMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       그룹익스포져
             05  XPJL409A-O-GROUP-EXPSR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업군명
             05  XPJL409A-O-IDSTRY-GROUP-NAME    PIC  X(042).
      *--       산업별관리한도
             05  XPJL409A-O-IDSTRY-PER-MGT-LIMT  PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업별익스포져
             05  XPJL409A-O-IDSTRY-PER-EXPSR     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       변경전여신성관리한도
             05  XPJL409A-O-MODFI-BLI-MGT-LIMT   PIC  9(015).
      *--       변경전시장성관리한도
             05  XPJL409A-O-MODFI-BM-MGT-LIMT    PIC  9(015).
      *--       변경후여신성관리한도
             05  XPJL409A-O-MODFI-ALI-MGT-LIMT   PIC  9(015).
      *--       변경후시장성관리한도
             05  XPJL409A-O-MODFI-AM-MGT-LIMT    PIC  9(015).
      *--       신청사유
             05  XPJL409A-O-APLCN-RESN           PIC  X(302).
      *================================================================*
      *        X  P  J  L  4  0  9  A    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL409A-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL409A-I-CUST-DSTIC         ;고객구분
      *X  XPJL409A-I-BRWR-NO            ;차주번호
      *X  XPJL409A-I-APLCN-NO           ;신청번호
      *X  XPJL409A-I-LIMT-APLCN-DSTIC   ;한도신청구분
      *X  XPJL409A-O-LIMT-APLCN-DSTIC   ;한도신청구분
      *X  XPJL409A-O-RPRS-NAME          ;대표자명
      *X  XPJL409A-O-CORP-CRDRAT        ;기업신용등급
      *X  XPJL409A-O-STND-I-CLSFI-CD    ;표준산업분류코드
      *X  XPJL409A-O-GROUP-NAME         ;그룹명
      *X  XPJL409A-O-GROUP-GRD          ;그룹등급
      *X  XPJL409A-O-BBRN-CD            ;영업점코드
      *X  XPJL409A-O-BBRN-NAME          ;영업점명
      *X  XPJL409A-O-EMPID              ;직원번호
      *X  XPJL409A-O-EMNM               ;직원명
      *S  XPJL409A-O-IDIVI-CORP-MGT-LIMT;개별기업관리한도
      *S  XPJL409A-O-IDIVI-CORP-EXPSR   ;개별기업익스포져
      *S  XPJL409A-O-GROUP-MGT-LIMT     ;그룹관리한도
      *S  XPJL409A-O-GROUP-EXPSR        ;그룹익스포져
      *X  XPJL409A-O-IDSTRY-GROUP-NAME  ;산업군명
      *S  XPJL409A-O-IDSTRY-PER-MGT-LIMT;산업별관리한도
      *S  XPJL409A-O-IDSTRY-PER-EXPSR   ;산업별익스포져
      *N  XPJL409A-O-MODFI-BLI-MGT-LIMT ;변경전여신성관리한도
      *N  XPJL409A-O-MODFI-BM-MGT-LIMT  ;변경전시장성관리한도
      *N  XPJL409A-O-MODFI-ALI-MGT-LIMT ;변경후여신성관리한도
      *N  XPJL409A-O-MODFI-AM-MGT-LIMT  ;변경후시장성관리한도
      *X  XPJL409A-O-APLCN-RESN         ;신청사유
