      *================================================================*
      *@ NAME : XPJLB027                                               *
      *@ DESC : PC포괄신용공여한도신청및승인 COPYBOOK                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-03-03 17:15:41                          *
      *  생성일시     : 2009-03-03 17:15:42                          *
      *================================================================*
           03  XPJLB027-RETURN.
             05  XPJLB027-R-STAT                 PIC  X(002).
                 88  COND-XPJLB027-OK            VALUE  '00'.
                 88  COND-XPJLB027-KEYDUP        VALUE  '01'.
                 88  COND-XPJLB027-NOTFOUND      VALUE  '02'.
                 88  COND-XPJLB027-ERROR         VALUE  '09'.
                 88  COND-XPJLB027-ABNORMAL      VALUE  '98'.
                 88  COND-XPJLB027-SYSERROR      VALUE  '99'.
             05  XPJLB027-R-LINE                 PIC  9(006).
             05  XPJLB027-R-ERRCD                PIC  X(008).
             05  XPJLB027-R-TREAT-CD             PIC  X(008).
             05  XPJLB027-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJLB027-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJLB027-I-PRCSS-DSTIC          PIC  X(002).
      *--       차주번호
             05  XPJLB027-I-BRWR-NO              PIC  X(013).
      *--       한도신청번호
             05  XPJLB027-I-LIMT-APLCN-NO        PIC  X(010).
      *--       수정총자산
             05  XPJLB027-I-AMND-TOTAL-ASST      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정매출액
             05  XPJLB027-I-AMND-SALEPR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정기준년자기자본금
             05  XPJLB027-I-AMND-B-YR-ONCP-AMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정금융비용차입금
             05  XPJLB027-I-AMND-FNCS-AMBR       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정당행차입금
             05  XPJLB027-I-AMND-OWBNK-AMBR      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정영업현금흐름액
             05  XPJLB027-I-AMND-BZOPR-ACF       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정업체평균이자율
             05  XPJLB027-I-AMND-ENTP-AVG-IRT    PIC  9(003)V9(02).
      *--       수정여신성자산한도금액
             05  XPJLB027-I-AMND-LI-ASST-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정자기자본기준금액
             05  XPJLB027-I-AMND-O-CAPTL-BSAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정영업활동기준한도금액
             05  XPJLB027-I-AMND-BA-BASE-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정포괄설정가능금액
             05  XPJLB027-I-AMND-I-STUP-ABLAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신용등급지원비율
             05  XPJLB027-I-CRDRAT-SPORT-RATO    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도신청종류구분코드
             05  XPJLB027-I-LIMT-A-KND-DSTCD     PIC  X(001).
      *--       신청년월일
             05  XPJLB027-I-APLCN-YMD            PIC  X(008).
      *--       신청부점코드
             05  XPJLB027-I-APLCN-BRNCD          PIC  X(004).
      *--       신청직원번호
             05  XPJLB027-I-APLCN-EMPID          PIC  X(007).
      *--       한도설정가능금액
             05  XPJLB027-I-LIMT-STUP-ABLAMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도신청금액
             05  XPJLB027-I-LIMT-APLCN-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신청사유내용
             05  XPJLB027-I-APLCN-RESN-CTNT      PIC  X(252).
      *--       한도승인금액
             05  XPJLB027-I-LIMT-ATHOR-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도설정유효년월일
             05  XPJLB027-I-LIMT-STUP-VALD-YMD   PIC  X(008).
      *--       한도승인구분코드
             05  XPJLB027-I-LIMT-ATHOR-DSTCD     PIC  X(001).
      *--       승인사유내용
             05  XPJLB027-I-ATHOR-RESN-CTNT      PIC  X(252).
      *----------------------------------------------------------------*
           03  XPJLB027-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XPJLB027-O-PRCSS-RSULT          PIC  X(002).
      *--       수정여신성자산한도금액
             05  XPJLB027-O-AMND-LI-ASST-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정자기자본기준금액
             05  XPJLB027-O-AMND-O-CAPTL-BSAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정영업활동기준한도금액
             05  XPJLB027-O-AMND-BA-BASE-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       수정포괄설정가능금액
             05  XPJLB027-O-AMND-I-STUP-ABLAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도신청번호
             05  XPJLB027-O-LIMT-APLCN-NO        PIC  X(010).
      *================================================================*
      *        X  P  J  L  B  0  2  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJLB027-I-PRCSS-DSTIC        ;처리구분
      *X  XPJLB027-I-BRWR-NO            ;차주번호
      *X  XPJLB027-I-LIMT-APLCN-NO      ;한도신청번호
      *S  XPJLB027-I-AMND-TOTAL-ASST    ;수정총자산
      *S  XPJLB027-I-AMND-SALEPR        ;수정매출액
      *S  XPJLB027-I-AMND-B-YR-ONCP-AMT ;수정기준년자기자본금
      *S  XPJLB027-I-AMND-FNCS-AMBR     ;수정금융비용차입금
      *S  XPJLB027-I-AMND-OWBNK-AMBR    ;수정당행차입금
      *S  XPJLB027-I-AMND-BZOPR-ACF     ;수정영업현금흐름액
      *N  XPJLB027-I-AMND-ENTP-AVG-IRT  ;수정업체평균이자율
      *S  XPJLB027-I-AMND-LI-ASST-CLAM
      * 수정여신성자산한도금액
      *S  XPJLB027-I-AMND-O-CAPTL-BSAMT ;수정자기자본기준금액
      *S  XPJLB027-I-AMND-BA-BASE-CLAM
      * 수정영업활동기준한도금액
      *S  XPJLB027-I-AMND-I-STUP-ABLAMT ;수정포괄설정가능금액
      *S  XPJLB027-I-CRDRAT-SPORT-RATO  ;신용등급지원비율
      *X  XPJLB027-I-LIMT-A-KND-DSTCD   ;한도신청종류구분코드
      *X  XPJLB027-I-APLCN-YMD          ;신청년월일
      *X  XPJLB027-I-APLCN-BRNCD        ;신청부점코드
      *X  XPJLB027-I-APLCN-EMPID        ;신청직원번호
      *S  XPJLB027-I-LIMT-STUP-ABLAMT   ;한도설정가능금액
      *S  XPJLB027-I-LIMT-APLCN-AMT     ;한도신청금액
      *X  XPJLB027-I-APLCN-RESN-CTNT    ;신청사유내용
      *S  XPJLB027-I-LIMT-ATHOR-AMT     ;한도승인금액
      *X  XPJLB027-I-LIMT-STUP-VALD-YMD ;한도설정유효년월일
      *X  XPJLB027-I-LIMT-ATHOR-DSTCD   ;한도승인구분코드
      *X  XPJLB027-I-ATHOR-RESN-CTNT    ;승인사유내용
      *X  XPJLB027-O-PRCSS-RSULT        ;처리결과
      *S  XPJLB027-O-AMND-LI-ASST-CLAM
      * 수정여신성자산한도금액
      *S  XPJLB027-O-AMND-O-CAPTL-BSAMT ;수정자기자본기준금액
      *S  XPJLB027-O-AMND-BA-BASE-CLAM
      * 수정영업활동기준한도금액
      *S  XPJLB027-O-AMND-I-STUP-ABLAMT ;수정포괄설정가능금액
      *X  XPJLB027-O-LIMT-APLCN-NO      ;한도신청번호
