      *================================================================*
      *@ NAME : XPJLB271                                               *
      *@ DESC : PC포괄신용공여한도산출조회 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-03-10 20:12:28                          *
      *  생성일시     : 2009-03-10 20:12:30                          *
      *================================================================*
           03  XPJLB271-RETURN.
             05  XPJLB271-R-STAT                 PIC  X(002).
                 88  COND-XPJLB271-OK            VALUE  '00'.
                 88  COND-XPJLB271-KEYDUP        VALUE  '01'.
                 88  COND-XPJLB271-NOTFOUND      VALUE  '02'.
                 88  COND-XPJLB271-ERROR         VALUE  '09'.
                 88  COND-XPJLB271-ABNORMAL      VALUE  '98'.
                 88  COND-XPJLB271-SYSERROR      VALUE  '99'.
             05  XPJLB271-R-LINE                 PIC  9(006).
             05  XPJLB271-R-ERRCD                PIC  X(008).
             05  XPJLB271-R-TREAT-CD             PIC  X(008).
             05  XPJLB271-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJLB271-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJLB271-I-PRCSS-DSTIC          PIC  X(002).
      *--       fld총자산2
             05  XPJLB271-I-AMND-TOTAL-ASST      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld매출액2
             05  XPJLB271-I-AMND-SALEPR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld자기자본2
             05  XPJLB271-I-AMND-B-YR-ONCP-AMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld금융차입금
             05  XPJLB271-I-AMND-FNCS-AMBR       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld당행차입금
             05  XPJLB271-I-AMND-OWBNK-AMBR      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld영업흐름액
             05  XPJLB271-I-AMND-BZOPR-ACF       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld평균이자율
             05  XPJLB271-I-AMND-ENTP-AVG-IRT    PIC  9(003)V9(02).
      *--       fld여신성한도
             05  XPJLB271-I-AMND-LI-ASST-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld자기자본한도2
             05  XPJLB271-I-AMND-O-CAPTL-BSAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld영업한도2
             05  XPJLB271-I-AMND-BA-BASE-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld포괄한도2
             05  XPJLB271-I-AMND-I-STUP-ABLAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld신용등급지원비율
             05  XPJLB271-I-CRDRAT-SPORT-RATO    PIC  9(003).
      *----------------------------------------------------------------*
           03  XPJLB271-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XPJLB271-O-PRCSS-RSULT          PIC  X(002).
      *--       fld여신성한도2
             05  XPJLB271-O-AMND-LI-ASST-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld자기자본한도2
             05  XPJLB271-O-AMND-O-CAPTL-BSAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld영업한도2
             05  XPJLB271-O-AMND-BA-BASE-CLAM    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       fld포괄한도2
             05  XPJLB271-O-AMND-I-STUP-ABLAMT   PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        X  P  J  L  B  2  7  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJLB271-I-PRCSS-DSTIC        ;처리구분
      *S  XPJLB271-I-AMND-TOTAL-ASST    ;fld총자산2
      *S  XPJLB271-I-AMND-SALEPR        ;fld매출액2
      *S  XPJLB271-I-AMND-B-YR-ONCP-AMT ;fld자기자본2
      *S  XPJLB271-I-AMND-FNCS-AMBR     ;fld금융차입금
      *S  XPJLB271-I-AMND-OWBNK-AMBR    ;fld당행차입금
      *S  XPJLB271-I-AMND-BZOPR-ACF     ;fld영업흐름액
      *N  XPJLB271-I-AMND-ENTP-AVG-IRT  ;fld평균이자율
      *S  XPJLB271-I-AMND-LI-ASST-CLAM  ;fld여신성한도
      *S  XPJLB271-I-AMND-O-CAPTL-BSAMT ;fld자기자본한도2
      *S  XPJLB271-I-AMND-BA-BASE-CLAM  ;fld영업한도2
      *S  XPJLB271-I-AMND-I-STUP-ABLAMT ;fld포괄한도2
      *N  XPJLB271-I-CRDRAT-SPORT-RATO  ;fld신용등급지원비율
      *X  XPJLB271-O-PRCSS-RSULT        ;처리결과
      *S  XPJLB271-O-AMND-LI-ASST-CLAM  ;fld여신성한도2
      *S  XPJLB271-O-AMND-O-CAPTL-BSAMT ;fld자기자본한도2
      *S  XPJLB271-O-AMND-BA-BASE-CLAM  ;fld영업한도2
      *S  XPJLB271-O-AMND-I-STUP-ABLAMT ;fld포괄한도2
