      *================================================================*
      *@ NAME : XPJL4001                                               *
      *@ DESC : PC채무자고객번호및고객명조회 COPYBOOK                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-08 13:12:48                          *
      *  생성일시     : 2009-06-08 13:12:49                          *
      *================================================================*
           03  XPJL4001-RETURN.
             05  XPJL4001-R-STAT                 PIC  X(002).
                 88  COND-XPJL4001-OK            VALUE  '00'.
                 88  COND-XPJL4001-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4001-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4001-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4001-ERROR         VALUE  '09'.
                 88  COND-XPJL4001-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4001-SYSERROR      VALUE  '99'.
             05  XPJL4001-R-LINE                 PIC  9(006).
             05  XPJL4001-R-ERRCD                PIC  X(008).
             05  XPJL4001-R-TREAT-CD             PIC  X(008).
             05  XPJL4001-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4001-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4001-I-PRCSS-DSTIC          PIC  X(002).
      *--       차주번호
             05  XPJL4001-I-BRWR-NO              PIC  X(013).
      *--       채무자명
             05  XPJL4001-I-DBTRZ-NAME           PIC  X(042).
      *----------------------------------------------------------------*
           03  XPJL4001-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XPJL4001-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XPJL4001-O-GRID1                OCCURS 000030 TIMES.
      *--         차주번호
               07  XPJL4001-O-BRWR-NO            PIC  X(013).
      *--         채무자명
               07  XPJL4001-O-DBTRZ-NAME         PIC  X(042).
      *================================================================*
      *        X  P  J  L  4  0  0  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4001-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4001-I-BRWR-NO            ;차주번호
      *X  XPJL4001-I-DBTRZ-NAME         ;채무자명
      *N  XPJL4001-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XPJL4001-O-GRID1              ;그리드1
      *X  XPJL4001-O-BRWR-NO            ;차주번호
      *X  XPJL4001-O-DBTRZ-NAME         ;채무자명
