      *================================================================*
      *@ NAME : XPJLB038                                               *
      *@ DESC : PC자회사및대주주등록 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-17 20:26:16                          *
      *  생성일시     : 2009-07-17 20:26:19                          *
      *================================================================*
           03  XPJLB038-RETURN.
             05  XPJLB038-R-STAT                 PIC  X(002).
                 88  COND-XPJLB038-OK            VALUE  '00'.
                 88  COND-XPJLB038-KEYDUP        VALUE  '01'.
                 88  COND-XPJLB038-NOTFOUND      VALUE  '02'.
                 88  COND-XPJLB038-SPVSTOP       VALUE  '05'.
                 88  COND-XPJLB038-ERROR         VALUE  '09'.
                 88  COND-XPJLB038-ABNORMAL      VALUE  '98'.
                 88  COND-XPJLB038-SYSERROR      VALUE  '99'.
             05  XPJLB038-R-LINE                 PIC  9(006).
             05  XPJLB038-R-ERRCD                PIC  X(008).
             05  XPJLB038-R-TREAT-CD             PIC  X(008).
             05  XPJLB038-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJLB038-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJLB038-I-PRCSS-DSTIC          PIC  X(002).
      *--       채무자번호
             05  XPJLB038-I-BRWR-NO              PIC  X(013).
      *--       자회사/대주주구분
             05  XPJLB038-I-SBCO-L-SKHDR-DSTCD   PIC  X(001).
      *--       출자금액
             05  XPJLB038-I-LAG-SKHDR-AMFN       PIC  9(015).
      *----------------------------------------------------------------*
           03  XPJLB038-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XPJLB038-O-PRCSS-RSULT          PIC  X(002).
      *================================================================*
      *        X  P  J  L  B  0  3  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJLB038-I-PRCSS-DSTIC        ;처리구분
      *X  XPJLB038-I-BRWR-NO            ;채무자번호
      *X  XPJLB038-I-SBCO-L-SKHDR-DSTCD ;자회사/대주주구분
      *N  XPJLB038-I-LAG-SKHDR-AMFN     ;출자금액
      *X  XPJLB038-O-PRCSS-RSULT        ;처리결과
