      *================================================================*
      *@ NAME : XPJL4002                                               *
      *@ DESC : PC그룹코드및그룹명조회 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-08 18:15:33                          *
      *  생성일시     : 2009-06-08 18:15:35                          *
      *================================================================*
           03  XPJL4002-RETURN.
             05  XPJL4002-R-STAT                 PIC  X(002).
                 88  COND-XPJL4002-OK            VALUE  '00'.
                 88  COND-XPJL4002-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4002-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4002-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4002-ERROR         VALUE  '09'.
                 88  COND-XPJL4002-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4002-SYSERROR      VALUE  '99'.
             05  XPJL4002-R-LINE                 PIC  9(006).
             05  XPJL4002-R-ERRCD                PIC  X(008).
             05  XPJL4002-R-TREAT-CD             PIC  X(008).
             05  XPJL4002-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4002-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4002-I-PRCSS-DSTIC          PIC  X(002).
      *--       계열적용구분코드
             05  XPJL4002-I-AFFLT-APLY-DSTCD     PIC  X(001).
      *--       계열기업군코드
             05  XPJL4002-I-AFFLT-CORP-GROUP-CD  PIC  X(006).
      *--       계열기업군명
             05  XPJL4002-I-AFFLT-C-GROUP-NAME   PIC  X(042).
      *----------------------------------------------------------------*
           03  XPJL4002-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XPJL4002-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XPJL4002-O-GRID1                OCCURS 000030 TIMES.
      *--         계열기업군코드
               07  XPJL4002-O-AFFLT-CORP-GROUP-CD
                                                 PIC  X(006).
      *--         계열기업군명
               07  XPJL4002-O-AFFLT-C-GROUP-NAME PIC  X(042).
      *================================================================*
      *        X  P  J  L  4  0  0  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4002-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4002-I-AFFLT-APLY-DSTCD   ;계열적용구분코드
      *X  XPJL4002-I-AFFLT-CORP-GROUP-CD;계열기업군코드
      *X  XPJL4002-I-AFFLT-C-GROUP-NAME ;계열기업군명
      *N  XPJL4002-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XPJL4002-O-GRID1              ;그리드1
      *X  XPJL4002-O-AFFLT-CORP-GROUP-CD;계열기업군코드
      *X  XPJL4002-O-AFFLT-C-GROUP-NAME ;계열기업군명
