      *================================================================*
      *@ NAME : XPJL4096                                               *
      *@ DESC : PC기업및그룹한도신청및승인조회(표준산업코드별비    *
      *@        율조회) COPYBOOK                                     *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-05-06 11:26:40                          *
      *  생성일시     : 2009-05-06 11:26:42                          *
      *================================================================*
           03  XPJL4096-RETURN.
             05  XPJL4096-R-STAT                 PIC  X(002).
                 88  COND-XPJL4096-OK            VALUE  '00'.
                 88  COND-XPJL4096-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4096-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4096-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4096-ERROR         VALUE  '09'.
                 88  COND-XPJL4096-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4096-SYSERROR      VALUE  '99'.
             05  XPJL4096-R-LINE                 PIC  9(006).
             05  XPJL4096-R-ERRCD                PIC  X(008).
             05  XPJL4096-R-TREAT-CD             PIC  X(008).
             05  XPJL4096-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4096-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4096-I-PRCSS-DSTIC          PIC  X(002).
      *--       표준산업분류코드
             05  XPJL4096-I-STND-I-CLSFI-CD      PIC  X(005).
      *----------------------------------------------------------------*
           03  XPJL4096-OUT.
      *----------------------------------------------------------------*
      *--       표준산업분류코드명
             05  XPJL4096-O-STND-IC-CD-NAME      PIC  X(042).
      *--       가중평균이자율
             05  XPJL4096-O-WGHTG-AVGZ-IRT       PIC  9(003)V9(02).
      *--       업종평균비율1
             05  XPJL4096-O-BZTYP-AVG-RATO1      PIC  9(003)V9(02).
      *--       업종평균비율2
             05  XPJL4096-O-BZTYP-AVG-RATO2      PIC  9(003)V9(02).
      *--       업종평균비율3
             05  XPJL4096-O-BZTYP-AVG-RATO3      PIC  9(003)V9(02).
      *================================================================*
      *        X  P  J  L  4  0  9  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4096-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4096-I-STND-I-CLSFI-CD    ;표준산업분류코드
      *X  XPJL4096-O-STND-IC-CD-NAME    ;표준산업분류코드명
      *N  XPJL4096-O-WGHTG-AVGZ-IRT     ;가중평균이자율
      *N  XPJL4096-O-BZTYP-AVG-RATO1    ;업종평균비율1
      *N  XPJL4096-O-BZTYP-AVG-RATO2    ;업종평균비율2
      *N  XPJL4096-O-BZTYP-AVG-RATO3    ;업종평균비율3
