      *================================================================*
      *@ NAME : XPJLB044                                               *
      *@ DESC : PC한도관리제외대상차주등록 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-28 16:44:35                          *
      *  생성일시     : 2009-07-28 16:44:37                          *
      *================================================================*
           03  XPJLB044-RETURN.
             05  XPJLB044-R-STAT                 PIC  X(002).
                 88  COND-XPJLB044-OK            VALUE  '00'.
                 88  COND-XPJLB044-KEYDUP        VALUE  '01'.
                 88  COND-XPJLB044-NOTFOUND      VALUE  '02'.
                 88  COND-XPJLB044-SPVSTOP       VALUE  '05'.
                 88  COND-XPJLB044-ERROR         VALUE  '09'.
                 88  COND-XPJLB044-ABNORMAL      VALUE  '98'.
                 88  COND-XPJLB044-SYSERROR      VALUE  '99'.
             05  XPJLB044-R-LINE                 PIC  9(006).
             05  XPJLB044-R-ERRCD                PIC  X(008).
             05  XPJLB044-R-TREAT-CD             PIC  X(008).
             05  XPJLB044-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJLB044-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJLB044-I-PRCSS-DSTIC          PIC  X(002).
      *--       채무자번호
             05  XPJLB044-I-BRWR-NO              PIC  X(013).
      *--       제외사유
             05  XPJLB044-I-ECLUD-RESN           PIC  X(001).
      *----------------------------------------------------------------*
           03  XPJLB044-OUT.
      *----------------------------------------------------------------*
      *--       처리결과
             05  XPJLB044-O-PRCSS-RSULT          PIC  X(002).
      *================================================================*
      *        X  P  J  L  B  0  4  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJLB044-I-PRCSS-DSTIC        ;처리구분
      *X  XPJLB044-I-BRWR-NO            ;채무자번호
      *X  XPJLB044-I-ECLUD-RESN         ;제외사유
      *X  XPJLB044-O-PRCSS-RSULT        ;처리결과
