      *================================================================*
      *@ NAME : XPJL4035                                               *
      *@ DESC : PC거액신용공여총액조회 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-13 16:03:32                          *
      *  생성일시     : 2009-07-13 16:03:33                          *
      *================================================================*
           03  XPJL4035-RETURN.
             05  XPJL4035-R-STAT                 PIC  X(002).
                 88  COND-XPJL4035-OK            VALUE  '00'.
                 88  COND-XPJL4035-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4035-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4035-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4035-ERROR         VALUE  '09'.
                 88  COND-XPJL4035-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4035-SYSERROR      VALUE  '99'.
             05  XPJL4035-R-LINE                 PIC  9(006).
             05  XPJL4035-R-ERRCD                PIC  X(008).
             05  XPJL4035-R-TREAT-CD             PIC  X(008).
             05  XPJL4035-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4035-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4035-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회기준일자
             05  XPJL4035-I-BASE-YMD             PIC  X(008).
      *----------------------------------------------------------------*
           03  XPJL4035-OUT.
      *----------------------------------------------------------------*
      *--       신용공여한도
             05  XPJL4035-O-ONCP-BSAMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신용공여잔액
             05  XPJL4035-O-FS-GRCR-AMT          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도여유액
             05  XPJL4035-O-LIMT-SEXTR-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       경영지표자기자본
             05  XPJL4035-O-ONCP-BSAMT1          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       자기자본기준년월
             05  XPJL4035-O-BASE-YM              PIC  X(006).
      *--       출력라인수1
             05  XPJL4035-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XPJL4035-O-GRID1                OCCURS 000300 TIMES.
      *--         채무자번호(계열코드)
               07  XPJL4035-O-BRWR-NO1           PIC  X(013).
      *--         채무자명(계열명)
               07  XPJL4035-O-AFFLT-C-GROUP-NAME1
                                                 PIC  X(052).
      *--         신용공여잔액(은행)
               07  XPJL4035-O-KB-GRCR-AMT1       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         신용공여잔액(금감원)
               07  XPJL4035-O-FS-GRCR-AMT1       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         제외자산
               07  XPJL4035-O-ECLUD-TAGET-AMT1   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--         공여비율(%)
               07  XPJL4035-O-GVNG-RATO1         PIC  9(003)V9(02).
      *================================================================*
      *        X  P  J  L  4  0  3  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4035-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4035-I-BASE-YMD           ;조회기준일자
      *S  XPJL4035-O-ONCP-BSAMT         ;신용공여한도
      *S  XPJL4035-O-FS-GRCR-AMT        ;신용공여잔액
      *S  XPJL4035-O-LIMT-SEXTR-AMT     ;한도여유액
      *S  XPJL4035-O-ONCP-BSAMT1        ;경영지표자기자본
      *X  XPJL4035-O-BASE-YM            ;자기자본기준년월
      *N  XPJL4035-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XPJL4035-O-GRID1              ;그리드1
      *X  XPJL4035-O-BRWR-NO1           ;채무자번호(계열코드)
      *X  XPJL4035-O-AFFLT-C-GROUP-NAME1;채무자명(계열명)
      *S  XPJL4035-O-KB-GRCR-AMT1       ;신용공여잔액(은행)
      *S  XPJL4035-O-FS-GRCR-AMT1       ;신용공여잔액(금감원)
      *S  XPJL4035-O-ECLUD-TAGET-AMT1   ;제외자산
      *N  XPJL4035-O-GVNG-RATO1         ;공여비율(%)
