      *================================================================*
      *@ NAME : XPJL4030                                               *
      *@ DESC : PC계열그룹조회 COPYBOOK                              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-28 14:31:02                          *
      *  생성일시     : 2009-11-28 14:31:04                          *
      *================================================================*
           03  XPJL4030-RETURN.
             05  XPJL4030-R-STAT                 PIC  X(002).
                 88  COND-XPJL4030-OK            VALUE  '00'.
                 88  COND-XPJL4030-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4030-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4030-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4030-ERROR         VALUE  '09'.
                 88  COND-XPJL4030-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4030-SYSERROR      VALUE  '99'.
             05  XPJL4030-R-LINE                 PIC  9(006).
             05  XPJL4030-R-ERRCD                PIC  X(008).
             05  XPJL4030-R-TREAT-CD             PIC  X(008).
             05  XPJL4030-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4030-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4030-I-PRCSS-DSTIC          PIC  X(002).
      *--       조회구분
             05  XPJL4030-I-INQURY-DSTIC         PIC  X(001).
      *----------------------------------------------------------------*
           03  XPJL4030-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XPJL4030-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XPJL4030-O-GRID1                OCCURS 001000 TIMES.
      *--         그룹순위
               07  XPJL4030-O-AFFLT-CORP-RANKG   PIC  9(003).
      *--         그룹코드
               07  XPJL4030-O-AFFLT-CORP-GROUP-CD
                                                 PIC  X(006).
      *--         그룹명
               07  XPJL4030-O-AFFLT-C-GROUP-NAME PIC  X(052).
      *--         주채권은행
               07  XPJL4030-O-MAIN-BND-BNK-CD    PIC  X(003).
      *--         그룹(내부)평가등급
               07  XPJL4030-O-INTNL-CV-GRD-DSTCD PIC  X(004).
      *================================================================*
      *        X  P  J  L  4  0  3  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4030-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4030-I-INQURY-DSTIC       ;조회구분
      *N  XPJL4030-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XPJL4030-O-GRID1              ;그리드1
      *N  XPJL4030-O-AFFLT-CORP-RANKG   ;그룹순위
      *X  XPJL4030-O-AFFLT-CORP-GROUP-CD;그룹코드
      *X  XPJL4030-O-AFFLT-C-GROUP-NAME ;그룹명
      *X  XPJL4030-O-MAIN-BND-BNK-CD    ;주채권은행
      *X  XPJL4030-O-INTNL-CV-GRD-DSTCD
      * 그룹(내부)평가등급
