      *================================================================*
      *@ NAME : XPJL4020                                               *
      *@ DESC : PC상품정보원장조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-12-04 13:35:20                          *
      *  생성일시     : 2009-12-04 13:35:22                          *
      *================================================================*
           03  XPJL4020-RETURN.
             05  XPJL4020-R-STAT                 PIC  X(002).
                 88  COND-XPJL4020-OK            VALUE  '00'.
                 88  COND-XPJL4020-KEYDUP        VALUE  '01'.
                 88  COND-XPJL4020-NOTFOUND      VALUE  '02'.
                 88  COND-XPJL4020-SPVSTOP       VALUE  '05'.
                 88  COND-XPJL4020-ERROR         VALUE  '09'.
                 88  COND-XPJL4020-ABNORMAL      VALUE  '98'.
                 88  COND-XPJL4020-SYSERROR      VALUE  '99'.
             05  XPJL4020-R-LINE                 PIC  9(006).
             05  XPJL4020-R-ERRCD                PIC  X(008).
             05  XPJL4020-R-TREAT-CD             PIC  X(008).
             05  XPJL4020-R-SQL-CD               PIC S9(005)
                                                 LEADING  SEPARATE.
      *----------------------------------------------------------------*
           03  XPJL4020-IN.
      *----------------------------------------------------------------*
      *--       처리구분
             05  XPJL4020-I-PRCSS-DSTIC          PIC  X(002).
      *--       기준년월
             05  XPJL4020-I-BASE-YM              PIC  X(006).
      *--       상품코드
             05  XPJL4020-I-PRDCT-CD             PIC  X(012).
      *----------------------------------------------------------------*
           03  XPJL4020-OUT.
      *----------------------------------------------------------------*
      *--       출력라인수1
             05  XPJL4020-O-OUTPT-LINE-CNT1      PIC  9(005).
      *--       그리드1
             05  XPJL4020-O-GRID1                OCCURS 002000 TIMES.
      *--         회계구분명
               07  XPJL4020-O-ACCTG-DSTIC-NAME   PIC  X(020).
      *--         상품대분류코드
               07  XPJL4020-O-PRDCT-LAG-CLSFI-CD PIC  X(002).
      *--         상품중분류코드
               07  XPJL4020-O-PRDCT-MEDM-CLSFI-CD
                                                 PIC  X(002).
      *--         상품템플릿코드
               07  XPJL4020-O-PRDCT-TMPLT-CD     PIC  X(003).
      *--         상품번호
               07  XPJL4020-O-PRDCT-NO           PIC  X(005).
      *--         자산구분명
               07  XPJL4020-O-ASST-DSTIC-NAME    PIC  X(010).
      *--         토탈익스포져환산율
               07  XPJL4020-O-TE-UTCRT           PIC  9(003).
      *--         토탈익스포져금융환산율
               07  XPJL4020-O-TE-FINAC-UTCRT     PIC  9(003).
      *--         CA대상계정여부
               07  XPJL4020-O-CA-TAGET-ACITM-YN  PIC  X(004).
      *--         신용공여한도환산율
               07  XPJL4020-O-GRCR-LIMT-UTCRT    PIC  9(003).
      *--         포괄신용공여대상계정여부
               07  XPJL4020-O-INLS-GT-ACITM-YN   PIC  X(004).
      *--         포괄신용공여환산율
               07  XPJL4020-O-INLS-GRCR-UTCRT    PIC  9(003).
      *--         상품명
               07  XPJL4020-O-PRDCT-NAME         PIC  X(262).
      *--         토탈익스포져중분류코드
               07  XPJL4020-O-TE-MEDM-CLSFI-CD   PIC  X(003).
      *--         토탈익스포져중분류명
               07  XPJL4020-O-TE-MEDM-CLSFI-NAME PIC  X(042).
      *--         CA중분류코드
               07  XPJL4020-O-CA-MEDM-CLSFI-CD   PIC  X(003).
      *--         CA중분류명
               07  XPJL4020-O-CA-MEDM-CLSFI-NAME PIC  X(042).
      *--         통합계정과목코드
               07  XPJL4020-O-INTGRA-TIACC-CD    PIC  X(013).
      *================================================================*
      *        X  P  J  L  4  0  2  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  XPJL4020-I-PRCSS-DSTIC        ;처리구분
      *X  XPJL4020-I-BASE-YM            ;기준년월
      *X  XPJL4020-I-PRDCT-CD           ;상품코드
      *N  XPJL4020-O-OUTPT-LINE-CNT1    ;출력라인수1
      *A  XPJL4020-O-GRID1              ;그리드1
      *X  XPJL4020-O-ACCTG-DSTIC-NAME   ;회계구분명
      *X  XPJL4020-O-PRDCT-LAG-CLSFI-CD ;상품대분류코드
      *X  XPJL4020-O-PRDCT-MEDM-CLSFI-CD;상품중분류코드
      *X  XPJL4020-O-PRDCT-TMPLT-CD     ;상품템플릿코드
      *X  XPJL4020-O-PRDCT-NO           ;상품번호
      *X  XPJL4020-O-ASST-DSTIC-NAME    ;자산구분명
      *N  XPJL4020-O-TE-UTCRT           ;토탈익스포져환산율
      *N  XPJL4020-O-TE-FINAC-UTCRT     ;토탈익스포져금융환산율
      *X  XPJL4020-O-CA-TAGET-ACITM-YN  ;CA대상계정여부
      *N  XPJL4020-O-GRCR-LIMT-UTCRT    ;신용공여한도환산율
      *X  XPJL4020-O-INLS-GT-ACITM-YN
      * 포괄신용공여대상계정여부
      *N  XPJL4020-O-INLS-GRCR-UTCRT    ;포괄신용공여환산율
      *X  XPJL4020-O-PRDCT-NAME         ;상품명
      *X  XPJL4020-O-TE-MEDM-CLSFI-CD   ;토탈익스포져중분류코드
      *X  XPJL4020-O-TE-MEDM-CLSFI-NAME ;토탈익스포져중분류명
      *X  XPJL4020-O-CA-MEDM-CLSFI-CD   ;CA중분류코드
      *X  XPJL4020-O-CA-MEDM-CLSFI-NAME ;CA중분류명
      *X  XPJL4020-O-INTGRA-TIACC-CD    ;통합계정과목코드
