      *================================================================*
      *@ NAME : YNJL4115                                               *
      *@ DESC : AS(EAD)그룹별TE현황조회 COPYBOOK                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2024-11-06 15:15:54                          *
      *  생성일시     : 2024-11-06 15:15:56                          *
      *  전체길이     : 00000049 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL4115-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월일
           07  YNJL4115-BASE-YMD                 PIC  X(008).
      *--     그룹순위1
           07  YNJL4115-GROUP-RANKG1             PIC  9(003).
      *--     그룹순위2
           07  YNJL4115-GROUP-RANKG2             PIC  9(003).
      *--     그룹등급
           07  YNJL4115-GROUP-GRD                PIC  X(003).
      *--     관리한도1
           07  YNJL4115-MGT-CLAM1                PIC  9(015).
      *--     관리한도2
           07  YNJL4115-MGT-CLAM2                PIC  9(015).
      *================================================================*
      *        Y  N  J  L  4  1  1  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4115-PRCSS-DSTIC          ;처리구분
      *X  YNJL4115-BASE-YMD             ;기준년월일
      *N  YNJL4115-GROUP-RANKG1         ;그룹순위1
      *N  YNJL4115-GROUP-RANKG2         ;그룹순위2
      *X  YNJL4115-GROUP-GRD            ;그룹등급
      *N  YNJL4115-MGT-CLAM1            ;관리한도1
      *N  YNJL4115-MGT-CLAM2            ;관리한도2
