      *================================================================*
      *@ NAME : YNJL4091                                               *
      *@ DESC : AS기업및그룹한도신청및승인조회(최종설정현황조회    *
      *@        ) COPYBOOK                                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-23 11:21:01                          *
      *  생성일시     : 2009-04-23 11:21:06                          *
      *================================================================*
      *--     처리구분
           07  YNJL4091-PRCSS-DSTIC              PIC  X(002).
      *--     fld고객구분
           07  YNJL4091-CUST-DSTIC               PIC  X(001).
      *--     fld채무자번호
           07  YNJL4091-BRWR-NO                  PIC  X(013).
      *--     fld신청번호
           07  YNJL4091-APLCN-NO                 PIC  X(010).
      *================================================================*
      *        Y  N  J  L  4  0  9  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4091-PRCSS-DSTIC          ;처리구분
      *X  YNJL4091-CUST-DSTIC           ;fld고객구분
      *X  YNJL4091-BRWR-NO              ;fld채무자번호
      *X  YNJL4091-APLCN-NO             ;fld신청번호
