      *================================================================*
      *@ NAME : YNJL4033                                               *
      *@ DESC : AS동일차주별신용공여조회 COPYBOOK                    *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-10-07 17:02:06                          *
      *  생성일시     : 2009-10-07 17:02:13                          *
      *================================================================*
      *--     처리구분
           07  YNJL4033-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준년월
           07  YNJL4033-BASE-YM                  PIC  X(006).
      *--     구분
           07  YNJL4033-INQURY-DSTIC             PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  3  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4033-PRCSS-DSTIC          ;처리구분
      *X  YNJL4033-BASE-YM              ;조회기준년월
      *X  YNJL4033-INQURY-DSTIC         ;구분
