      *================================================================*
      *@ NAME : YNJLB055                                               *
      *@ DESC : AS신용공여기관관리COPYBOOK                           *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2012-09-26 11:16:41                          *
      *  생성일시     : 2012-09-26 11:16:45                          *
      *  전체길이     : 00000098 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB055-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  YNJLB055-BASE-YM                  PIC  X(006).
      *--     보증기관번호
           07  YNJLB055-GRNTY-INSTI-NO           PIC  X(013).
      *--     TE보증기관코드
           07  YNJLB055-T-E-GRNTY-INSTI-CD       PIC  X(003).
      *--     보증기관명
           07  YNJLB055-GRNTY-INSTI-NAME         PIC  X(052).
      *--     신표준산업분류코드
           07  YNJLB055-NEW-SI-CLSFI-CD          PIC  X(005).
      *--     국가코드
           07  YNJLB055-NATNL-CD                 PIC  X(003).
      *--     신용공여위험가중치
           07  YNJLB055-GRCR-RISK-WGHT           PIC  9(003).
      *--     신용공여기관구분
           07  YNJLB055-GRCR-INSTI-DSTCD         PIC  X(001).
      *--     보증기관고객식별자
           07  YNJLB055-GRNTY-I-CUST-IDNFR       PIC  X(010).
      *================================================================*
      *        Y  N  J  L  B  0  5  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB055-PRCSS-DSTIC          ;처리구분
      *X  YNJLB055-BASE-YM              ;기준년월
      *X  YNJLB055-GRNTY-INSTI-NO       ;보증기관번호
      *X  YNJLB055-T-E-GRNTY-INSTI-CD   ;TE보증기관코드
      *X  YNJLB055-GRNTY-INSTI-NAME     ;보증기관명
      *X  YNJLB055-NEW-SI-CLSFI-CD      ;신표준산업분류코드
      *X  YNJLB055-NATNL-CD             ;국가코드
      *N  YNJLB055-GRCR-RISK-WGHT       ;신용공여위험가중치
      *X  YNJLB055-GRCR-INSTI-DSTCD     ;신용공여기관구분
      *X  YNJLB055-GRNTY-I-CUST-IDNFR   ;보증기관고객식별자
