      *================================================================*
      *@ NAME : YNJL4024                                               *
      *@ DESC : AS포괄신용공여한도설정대상 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-28 15:38:07                          *
      *  생성일시     : 2009-11-28 15:38:14                          *
      *================================================================*
      *--     처리구분
           07  YNJL4024-PRCSS-DSTIC              PIC  X(002).
      *--     부점코드
           07  YNJL4024-BRNCD                    PIC  X(004).
      *--     기준년월일
           07  YNJL4024-BASE-YMD                 PIC  X(008).
      *--     조회구분
           07  YNJL4024-INQURY-DSTIC             PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  2  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4024-PRCSS-DSTIC          ;처리구분
      *X  YNJL4024-BRNCD                ;부점코드
      *X  YNJL4024-BASE-YMD             ;기준년월일
      *X  YNJL4024-INQURY-DSTIC         ;조회구분
