      *================================================================*
      *@ NAME : YNJL4124                                               *
      *@ DESC : AS(EAD)포괄신용공여한도설정대상 COPYBOOK             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2022-03-15 16:11:53                          *
      *  생성일시     : 2022-03-15 16:11:58                          *
      *  전체길이     : 00000025 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL4124-PRCSS-DSTIC              PIC  X(002).
      *--     부점코드
           07  YNJL4124-BRNCD                    PIC  X(004).
      *--     기준년월일
           07  YNJL4124-BASE-YMD                 PIC  X(008).
      *--     조회구분
           07  YNJL4124-INQURY-DSTIC             PIC  X(001).
      *--     KB-PIN
           07  YNJL4124-KB-PIN                   PIC  X(010).
      *================================================================*
      *        Y  N  J  L  4  1  2  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4124-PRCSS-DSTIC          ;처리구분
      *X  YNJL4124-BRNCD                ;부점코드
      *X  YNJL4124-BASE-YMD             ;기준년월일
      *X  YNJL4124-INQURY-DSTIC         ;조회구분
      *X  YNJL4124-KB-PIN               ;KB-PIN
