      *================================================================*
      *@ NAME : YNJLB046                                               *
      *@ DESC : AS최고한도관리제외대상차주등록 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-28 15:03:32                          *
      *  생성일시     : 2009-07-28 15:03:37                          *
      *================================================================*
      *--     처리구분
           07  YNJLB046-PRCSS-DSTIC              PIC  X(002).
      *--     채무자번호
           07  YNJLB046-BRWR-NO                  PIC  X(013).
      *--     제외사유
           07  YNJLB046-ECLUD-RESN               PIC  X(001).
      *================================================================*
      *        Y  N  J  L  B  0  4  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB046-PRCSS-DSTIC          ;처리구분
      *X  YNJLB046-BRWR-NO              ;채무자번호
      *X  YNJLB046-ECLUD-RESN           ;제외사유
