      *================================================================*
      *@ NAME : YNJLB020                                               *
      *@ DESC : AS상품정보원장 COPYBOOK                              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-12-04 14:35:18                          *
      *  생성일시     : 2009-12-04 14:35:24                          *
      *================================================================*
      *--     처리구분
           07  YNJLB020-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준년월
           07  YNJLB020-BASE-YM                  PIC  X(006).
      *--     회계구분
           07  YNJLB020-ACCTG-DSTCD              PIC  X(001).
      *--     상품대분류코드
           07  YNJLB020-PRDCT-LAG-CLSFI-CD       PIC  X(002).
      *--     상품중분류코드
           07  YNJLB020-PRDCT-MEDM-CLSFI-CD      PIC  X(002).
      *--     상품템플릿코드
           07  YNJLB020-PRDCT-TMPLT-CD           PIC  X(003).
      *--     상품번호
           07  YNJLB020-PRDCT-NO                 PIC  X(005).
      *--     상품명
           07  YNJLB020-PRDCT-NAME               PIC  X(042).
      *--     TE자산구분
           07  YNJLB020-TE-ASST-DSTCD            PIC  X(001).
      *--     TE환산율
           07  YNJLB020-TE-UTCRT                 PIC  9(003).
      *--     TE금융환산율
           07  YNJLB020-TE-FINAC-UTCRT           PIC  9(003).
      *--     TE중분류코드
           07  YNJLB020-TE-MEDM-CLSFI-CD         PIC  X(003).
      *--     TE중분류코드명
           07  YNJLB020-TE-MEDM-CLSFI-NAME       PIC  X(042).
      *--     CA대상계정여부
           07  YNJLB020-CA-TAGET-ACITM-YN        PIC  X(001).
      *--     CA중분류코드
           07  YNJLB020-CA-MEDM-CLSFI-CD         PIC  X(003).
      *--     CA중분류명
           07  YNJLB020-CA-MEDM-CLSFI-NAME       PIC  X(042).
      *--     CA계정환산율
           07  YNJLB020-GRCR-LIMT-UTCRT          PIC  9(003).
      *--     CP대상계정여부
           07  YNJLB020-INLS-GT-ACITM-YN         PIC  X(001).
      *--     CP계정환산율
           07  YNJLB020-INLS-GRCR-UTCRT          PIC  9(003).
      *--     통합계정과목코드
           07  YNJLB020-INTGRA-TIACC-CD          PIC  X(013).
      *================================================================*
      *        Y  N  J  L  B  0  2  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB020-PRCSS-DSTIC          ;처리구분
      *X  YNJLB020-BASE-YM              ;조회기준년월
      *X  YNJLB020-ACCTG-DSTCD          ;회계구분
      *X  YNJLB020-PRDCT-LAG-CLSFI-CD   ;상품대분류코드
      *X  YNJLB020-PRDCT-MEDM-CLSFI-CD  ;상품중분류코드
      *X  YNJLB020-PRDCT-TMPLT-CD       ;상품템플릿코드
      *X  YNJLB020-PRDCT-NO             ;상품번호
      *X  YNJLB020-PRDCT-NAME           ;상품명
      *X  YNJLB020-TE-ASST-DSTCD        ;TE자산구분
      *N  YNJLB020-TE-UTCRT             ;TE환산율
      *N  YNJLB020-TE-FINAC-UTCRT       ;TE금융환산율
      *X  YNJLB020-TE-MEDM-CLSFI-CD     ;TE중분류코드
      *X  YNJLB020-TE-MEDM-CLSFI-NAME   ;TE중분류코드명
      *X  YNJLB020-CA-TAGET-ACITM-YN    ;CA대상계정여부
      *X  YNJLB020-CA-MEDM-CLSFI-CD     ;CA중분류코드
      *X  YNJLB020-CA-MEDM-CLSFI-NAME   ;CA중분류명
      *N  YNJLB020-GRCR-LIMT-UTCRT      ;CA계정환산율
      *X  YNJLB020-INLS-GT-ACITM-YN     ;CP대상계정여부
      *N  YNJLB020-INLS-GRCR-UTCRT      ;CP계정환산율
      *X  YNJLB020-INTGRA-TIACC-CD      ;통합계정과목코드
