      *================================================================*
      *@ NAME : YNJL4032                                               *
      *@ DESC : AS동일차주신용공여조회 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-17 10:19:53                          *
      *  생성일시     : 2009-04-17 10:20:03                          *
      *================================================================*
      *--     처리구분
           07  YNJL4032-PRCSS-DSTIC              PIC  X(002).
      *--     계열코드
           07  YNJL4032-AFFLT-CORP-GROUP-CD      PIC  X(006).
      *--     조회기준년월
           07  YNJL4032-BASE-YM                  PIC  X(006).
      *================================================================*
      *        Y  N  J  L  4  0  3  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4032-PRCSS-DSTIC          ;처리구분
      *X  YNJL4032-AFFLT-CORP-GROUP-CD  ;계열코드
      *X  YNJL4032-BASE-YM              ;조회기준년월
