      *================================================================*
      *@ NAME : YNJLB041                                               *
      *@ DESC : AS국가별정보관리 COPYBOOK                            *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-02-13 14:54:11                          *
      *  생성일시     : 2020-02-13 14:54:15                          *
      *  전체길이     : 00000091 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB041-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준년월
           07  YNJLB041-BASE-YM                  PIC  X(006).
      *--     국가코드
           07  YNJLB041-ISO-NATNL-CD             PIC  X(002).
      *--     국가명
           07  YNJLB041-ENG-NATNL-NAME           PIC  X(052).
      *--     Total관리한도
           07  YNJLB041-WHOL-MGT-CLAM            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     SP
           07  YNJLB041-SNP-GRD-DSTCD            PIC  X(002).
      *--     Moodys
           07  YNJLB041-MODYS-GRD-DSTCD          PIC  X(002).
      *--     Fitch
           07  YNJLB041-FITCH-GRD-DSTCD          PIC  X(002).
      *--     당행국가신용등급구분
           07  YNJLB041-OWBNK-NC-GRD-DSTCD       PIC  X(004).
      *--     한도관리지역구분
           07  YNJLB041-LIMT-MGT-AREA-DSTCD      PIC  X(001).
      *--     국가전체공통한도여부
           07  YNJLB041-NATNL-W-CMN-LIMT-YN      PIC  X(001).
      *--     국가위험수준구분
           07  YNJLB041-NATNL-R-LVEL-DSTCD       PIC  X(001).
      *================================================================*
      *        Y  N  J  L  B  0  4  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB041-PRCSS-DSTIC          ;처리구분
      *X  YNJLB041-BASE-YM              ;조회기준년월
      *X  YNJLB041-ISO-NATNL-CD         ;국가코드
      *X  YNJLB041-ENG-NATNL-NAME       ;국가명
      *S  YNJLB041-WHOL-MGT-CLAM        ;Total관리한도
      *X  YNJLB041-SNP-GRD-DSTCD        ;SP
      *X  YNJLB041-MODYS-GRD-DSTCD      ;Moodys
      *X  YNJLB041-FITCH-GRD-DSTCD      ;Fitch
      *X  YNJLB041-OWBNK-NC-GRD-DSTCD   ;당행국가신용등급구분
      *X  YNJLB041-LIMT-MGT-AREA-DSTCD  ;한도관리지역구분
      *X  YNJLB041-NATNL-W-CMN-LIMT-YN  ;국가전체공통한도여부
      *X  YNJLB041-NATNL-R-LVEL-DSTCD   ;국가위험수준구분
