      *================================================================*
      *@ NAME : YNJL4009                                               *
      *@ DESC : AS기업및그룹한도신청및승인조회 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-02-19 21:41:29                          *
      *  생성일시     : 2009-02-19 21:41:40                          *
      *================================================================*
      *--     처리구분
           07  YNJL4009-PRCSS-DSTIC              PIC  X(002).
      *--     fld조회구분_hdn
           07  YNJL4009-CUST-DSTIC               PIC  X(001).
      *--     fld채무자번호_hdn,fld기업구분_hdn
           07  YNJL4009-BRWR-NO                  PIC  X(013).
      *--     fld신청번호
           07  YNJL4009-LIMT-APLCN-NO            PIC  X(010).
      *--     fld설정신청구분_hdn
           07  YNJL4009-LIMT-A-KND-DSTCD         PIC  X(001).
      *--     fld기업구분_hdn
           07  YNJL4009-CORP-DSTIC               PIC  X(001).
      *--     fld조회저장구분_hdn
           07  YNJL4009-INQURY-STORG-DSTIC       PIC  X(001).
      *--     fld본건입력수_hdn
           07  YNJL4009-MAIN-CAS-INPT-CNT        PIC  X(005).
      *--     fld신청자ID_hdn
           07  YNJL4009-APLCN-EMPID              PIC  X(008).
      *--     fld신청자명_hdn
           07  YNJL4009-APLCN-EMNM               PIC  X(042).
      *--     fld영업점코드_hdn
           07  YNJL4009-BRNCD                    PIC  X(004).
      *--     fld영업점명_hdn
           07  YNJL4009-BRN-HANGL-NAME           PIC  X(062).
      *================================================================*
      *        Y  N  J  L  4  0  0  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4009-PRCSS-DSTIC          ;처리구분
      *X  YNJL4009-CUST-DSTIC           ;fld조회구분_hdn
      *X  YNJL4009-BRWR-NO
      * fld채무자번호_hdn,fld기업구분_hdn
      *X  YNJL4009-LIMT-APLCN-NO        ;fld신청번호
      *X  YNJL4009-LIMT-A-KND-DSTCD     ;fld설정신청구분_hdn
      *X  YNJL4009-CORP-DSTIC           ;fld기업구분_hdn
      *X  YNJL4009-INQURY-STORG-DSTIC   ;fld조회저장구분_hdn
      *X  YNJL4009-MAIN-CAS-INPT-CNT    ;fld본건입력수_hdn
      *X  YNJL4009-APLCN-EMPID          ;fld신청자ID_hdn
      *X  YNJL4009-APLCN-EMNM           ;fld신청자명_hdn
      *X  YNJL4009-BRNCD                ;fld영업점코드_hdn
      *X  YNJL4009-BRN-HANGL-NAME       ;fld영업점명_hdn
