      *================================================================*
      *@ NAME : YNJL4005                                               *
      *@ DESC : AS피어코드및피어코드명조회 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-08 18:43:48                          *
      *  생성일시     : 2009-06-08 18:43:53                          *
      *================================================================*
      *--     처리구분
           07  YNJL4005-PRCSS-DSTIC              PIC  X(002).
      *--     피어코드
           07  YNJL4005-PEER-DSTCD               PIC  X(005).
      *--     피어코드명
           07  YNJL4005-PEER-CD-NAME             PIC  X(102).
      *================================================================*
      *        Y  N  J  L  4  0  0  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4005-PRCSS-DSTIC          ;처리구분
      *X  YNJL4005-PEER-DSTCD           ;피어코드
      *X  YNJL4005-PEER-CD-NAME         ;피어코드명
