      *================================================================*
      *@ NAME : YNJL4052                                               *
      *@ DESC : AS등급및규모별TE현황조회 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-12-19 14:59:25                          *
      *  생성일시     : 2019-12-19 14:59:38                          *
      *  전체길이     : 00000014 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL4052-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준일자
           07  YNJL4052-BASE-YMD                 PIC  X(008).
      *--     대분류업종코드
           07  YNJL4052-LAG-CLSFI-BZTYP-CD       PIC  X(003).
      *--     국내외구분코드
           07  YNJL4052-HMAB-DSTCD               PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  5  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4052-PRCSS-DSTIC          ;처리구분
      *X  YNJL4052-BASE-YMD             ;조회기준일자
      *X  YNJL4052-LAG-CLSFI-BZTYP-CD   ;대분류업종코드
      *X  YNJL4052-HMAB-DSTCD           ;국내외구분코드
