      *================================================================*
      *@ NAME : YNJL4040                                               *
      *@ DESC : AS국가코드,국가명조회(팝업) COPYBOOK             *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-16 17:05:20                          *
      *  생성일시     : 2009-07-16 17:05:31                          *
      *================================================================*
      *--     처리구분
           07  YNJL4040-PRCSS-DSTIC              PIC  X(002).
      *--     국가코드
           07  YNJL4040-ISO-NATNL-CD             PIC  X(003).
      *--     국가명
           07  YNJL4040-ENG-NATNL-NAME           PIC  X(052).
      *================================================================*
      *        Y  N  J  L  4  0  4  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4040-PRCSS-DSTIC          ;처리구분
      *X  YNJL4040-ISO-NATNL-CD         ;국가코드
      *X  YNJL4040-ENG-NATNL-NAME       ;국가명
