      *================================================================*
      *@ NAME : YNJLB022                                               *
      *@ DESC : AS본부부서수기원장등록 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2023-05-10 17:47:45                          *
      *  생성일시     : 2023-05-10 17:47:47                          *
      *  전체길이     : 00000704 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB022-PRCSS-DSTIC              PIC  X(002).
      *--     계좌번호
           07  YNJLB022-ACNO                     PIC  X(020).
      *--     채무자번호
           07  YNJLB022-BRWR-NO                  PIC  X(013).
      *--     상품대분류코드
           07  YNJLB022-PRDCT-LAG-CLSFI-CD       PIC  X(002).
      *--     상품중분류코드
           07  YNJLB022-PRDCT-MEDM-CLSFI-CD      PIC  X(002).
      *--     상품템플릿코드
           07  YNJLB022-PRDCT-TMPLT-CD           PIC  X(003).
      *--     상품번호
           07  YNJLB022-PRDCT-NO                 PIC  X(005).
      *--     신규년월일
           07  YNJLB022-NEW-YMD                  PIC  X(008).
      *--     만기년월일
           07  YNJLB022-EXPIR-YMD                PIC  X(008).
      *--     통화코드
           07  YNJLB022-CNCYCD                   PIC  X(003).
      *--     통화한도금액
           07  YNJLB022-CRNCY-CLAM               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     통화금일잔액
           07  YNJLB022-CRNCY-TDD-BAL            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     관리부점코드
           07  YNJLB022-MGT-BRNCD                PIC  X(004).
      *--     비고
           07  YNJLB022-RMARK                    PIC  X(602).
      *================================================================*
      *        Y  N  J  L  B  0  2  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB022-PRCSS-DSTIC          ;처리구분
      *X  YNJLB022-ACNO                 ;계좌번호
      *X  YNJLB022-BRWR-NO              ;채무자번호
      *X  YNJLB022-PRDCT-LAG-CLSFI-CD   ;상품대분류코드
      *X  YNJLB022-PRDCT-MEDM-CLSFI-CD  ;상품중분류코드
      *X  YNJLB022-PRDCT-TMPLT-CD       ;상품템플릿코드
      *X  YNJLB022-PRDCT-NO             ;상품번호
      *X  YNJLB022-NEW-YMD              ;신규년월일
      *X  YNJLB022-EXPIR-YMD            ;만기년월일
      *X  YNJLB022-CNCYCD               ;통화코드
      *S  YNJLB022-CRNCY-CLAM           ;통화한도금액
      *S  YNJLB022-CRNCY-TDD-BAL        ;통화금일잔액
      *X  YNJLB022-MGT-BRNCD            ;관리부점코드
      *X  YNJLB022-RMARK                ;비고
