      *================================================================*
      *@ NAME : YNJLB064                                               *
      *@ DESC : ASTE변경고객정보관리COPYBOOK                         *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2018-04-10 14:12:28                          *
      *  생성일시     : 2018-04-10 14:12:38                          *
      *  전체길이     : 00000019 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB064-PRCSS-DSTIC              PIC  X(002).
      *--     KB-PIN
           07  YNJLB064-KB-PIN                   PIC  X(010).
      *--     신표준산업분류코드
           07  YNJLB064-NEW-SI-CLSFI-CD          PIC  X(005).
      *--     한신평재무업종구분
           07  YNJLB064-KIS-F-BZTYP-DSTCD        PIC  X(002).
      *================================================================*
      *        Y  N  J  L  B  0  6  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB064-PRCSS-DSTIC          ;처리구분
      *X  YNJLB064-KB-PIN               ;KB-PIN
      *X  YNJLB064-NEW-SI-CLSFI-CD      ;신표준산업분류코드
      *X  YNJLB064-KIS-F-BZTYP-DSTCD    ;한신평재무업종구분
