      *================================================================*
      *@ NAME : YNJL4017                                               *
      *@ DESC : AS피어코드별TE현황조회 COPYBOOK                    *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2019-12-23 10:16:25                          *
      *  생성일시     : 2019-12-23 10:16:32                          *
      *  전체길이     : 00000016 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL4017-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준일자
           07  YNJL4017-BASE-YMD                 PIC  X(008).
      *--     피어코드
           07  YNJL4017-PEER-DSTCD               PIC  X(005).
      *--     국내외구분코드
           07  YNJL4017-HMAB-DSTCD               PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  1  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4017-PRCSS-DSTIC          ;처리구분
      *X  YNJL4017-BASE-YMD             ;조회기준일자
      *X  YNJL4017-PEER-DSTCD           ;피어코드
      *X  YNJL4017-HMAB-DSTCD           ;국내외구분코드
