      *================================================================*
      *@ NAME : YNJL4111                                               *
      *@ DESC : AS(EAD)한도초과업체명세조회 COPYBOOK                 *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2016-09-23 16:15:09                          *
      *  생성일시     : 2016-09-23 16:15:18                          *
      *  전체길이     : 00000178 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL4111-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준일자
           07  YNJL4111-BASE-YMD                 PIC  X(008).
      *--     관리대상구분
           07  YNJL4111-MGT-TAGET-DSTIC          PIC  X(001).
      *--     조회구분
           07  YNJL4111-INQURY-DSTIC             PIC  X(001).
      *--     차주번호
           07  YNJL4111-BRWR-NO                  PIC  X(013).
      *--     예외사유구분코드
           07  YNJL4111-LIMT-EM-ECEPT-DSTCD      PIC  X(001).
      *--     예외사유
           07  YNJL4111-LIMT-EM-ECEPT-CTNT       PIC  X(152).
      *================================================================*
      *        Y  N  J  L  4  1  1  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4111-PRCSS-DSTIC          ;처리구분
      *X  YNJL4111-BASE-YMD             ;조회기준일자
      *X  YNJL4111-MGT-TAGET-DSTIC      ;관리대상구분
      *X  YNJL4111-INQURY-DSTIC         ;조회구분
      *X  YNJL4111-BRWR-NO              ;차주번호
      *X  YNJL4111-LIMT-EM-ECEPT-DSTCD  ;예외사유구분코드
      *X  YNJL4111-LIMT-EM-ECEPT-CTNT   ;예외사유
