      *================================================================*
      *@ NAME : YNJL4023                                               *
      *@ DESC : AS본부부서기준값조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-06 16:58:00                          *
      *  생성일시     : 2009-07-06 16:58:10                          *
      *================================================================*
      *--     처리구분
           07  YNJL4023-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월1
           07  YNJL4023-BASE-YM1                 PIC  X(006).
      *--     기준년월2
           07  YNJL4023-BASE-YM2                 PIC  X(006).
      *================================================================*
      *        Y  N  J  L  4  0  2  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4023-PRCSS-DSTIC          ;처리구분
      *X  YNJL4023-BASE-YM1             ;기준년월1
      *X  YNJL4023-BASE-YM2             ;기준년월2
