      *================================================================*
      *@ NAME : YNJL4020                                               *
      *@ DESC : AS상품정보원장조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-12-04 13:34:25                          *
      *  생성일시     : 2009-12-04 13:34:31                          *
      *================================================================*
      *--     처리구분
           07  YNJL4020-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  YNJL4020-BASE-YM                  PIC  X(006).
      *--     상품코드
           07  YNJL4020-PRDCT-CD                 PIC  X(012).
      *================================================================*
      *        Y  N  J  L  4  0  2  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4020-PRCSS-DSTIC          ;처리구분
      *X  YNJL4020-BASE-YM              ;기준년월
      *X  YNJL4020-PRDCT-CD             ;상품코드
