      *================================================================*
      *@ NAME : YNJL4034                                               *
      *@ DESC : AS동일인신용공여조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-13 13:34:25                          *
      *  생성일시     : 2009-07-13 13:34:31                          *
      *================================================================*
      *--     처리구분
           07  YNJL4034-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  YNJL4034-BRWR-NO                  PIC  X(013).
      *--     기준년월
           07  YNJL4034-BASE-YM                  PIC  X(006).
      *================================================================*
      *        Y  N  J  L  4  0  3  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4034-PRCSS-DSTIC          ;처리구분
      *X  YNJL4034-BRWR-NO              ;차주번호
      *X  YNJL4034-BASE-YM              ;기준년월
