      *================================================================*
      *@ NAME : YNJLB273                                               *
      *@ DESC : AS포괄신용공여한도신청저장 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2023-09-05 15:41:46                          *
      *  생성일시     : 2023-09-05 15:41:49                          *
      *  전체길이     : 00000383 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB273-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  YNJLB273-BRWR-NO                  PIC  X(013).
      *--     신청번호
           07  YNJLB273-APLCN-NO                 PIC  X(010).
      *--     한도신청종류구분코드
           07  YNJLB273-LIMT-A-KND-DSTCD         PIC  X(001).
      *--     신청년월일
           07  YNJLB273-APLCN-YMD                PIC  X(008).
      *--     신청부점코드
           07  YNJLB273-APLCN-BRNCD              PIC  X(004).
      *--     신청직원번호
           07  YNJLB273-APLCN-EMPID              PIC  X(007).
      *--     한도설정가능금액
           07  YNJLB273-LIMT-STUP-ABLAMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도신청금액
           07  YNJLB273-LIMT-APLCN-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     신청사유내용
           07  YNJLB273-APLCN-RESN-CTNT          PIC  X(302).
      *--     산업평가등급구분
           07  YNJLB273-IDSTRY-V-GRD-DSTCD       PIC  X(004).
      *================================================================*
      *        Y  N  J  L  B  2  7  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB273-PRCSS-DSTIC          ;처리구분
      *X  YNJLB273-BRWR-NO              ;차주번호
      *X  YNJLB273-APLCN-NO             ;신청번호
      *X  YNJLB273-LIMT-A-KND-DSTCD     ;한도신청종류구분코드
      *X  YNJLB273-APLCN-YMD            ;신청년월일
      *X  YNJLB273-APLCN-BRNCD          ;신청부점코드
      *X  YNJLB273-APLCN-EMPID          ;신청직원번호
      *S  YNJLB273-LIMT-STUP-ABLAMT     ;한도설정가능금액
      *S  YNJLB273-LIMT-APLCN-AMT       ;한도신청금액
      *X  YNJLB273-APLCN-RESN-CTNT      ;신청사유내용
      *X  YNJLB273-IDSTRY-V-GRD-DSTCD   ;산업평가등급구분
