      *================================================================*
      *@ NAME : YNJLB039                                               *
      *@ DESC : AS본부부서기준값등록(신용공여한도관리) COPYBOO     *
      *@        K                                                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2023-12-12 09:45:55                          *
      *  생성일시     : 2023-12-12 09:45:58                          *
      *  전체길이     : 00000088 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJLB039-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월
           07  YNJLB039-BASE-YM                  PIC  X(006).
      *--     업무규제자기자본
           07  YNJLB039-BZWK-REGUL-ONCP          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     경영지표자기자본
           07  YNJLB039-MGBIZ-INDX-ONCP          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     보통주자본
           07  YNJLB039-OSHR-CAPTL               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     기타자본
           07  YNJLB039-ETC-CAPTL                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     보완자본
           07  YNJLB039-ENHN-CAPTL               PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        Y  N  J  L  B  0  3  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB039-PRCSS-DSTIC          ;처리구분
      *X  YNJLB039-BASE-YM              ;기준년월
      *S  YNJLB039-BZWK-REGUL-ONCP      ;업무규제자기자본
      *S  YNJLB039-MGBIZ-INDX-ONCP      ;경영지표자기자본
      *S  YNJLB039-OSHR-CAPTL           ;보통주자본
      *S  YNJLB039-ETC-CAPTL            ;기타자본
      *S  YNJLB039-ENHN-CAPTL           ;보완자본
