      *================================================================*
      *@ NAME : YNJL409B                                               *
      *@ DESC : AS기업및그룹한도신청및승인조회(설정승인조회) C     *
      *@        OPYBOOK                                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-06-09 18:14:08                          *
      *  생성일시     : 2020-06-09 18:14:22                          *
      *  전체길이     : 00000023 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL409B-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  YNJL409B-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  YNJL409B-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  YNJL409B-APLCN-NO                 PIC  X(010).
      *================================================================*
      *        Y  N  J  L  4  0  9  B    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL409B-PRCSS-DSTIC          ;처리구분
      *X  YNJL409B-CUST-DSTIC           ;고객구분
      *X  YNJL409B-KB-PIN               ;KB-PIN
      *X  YNJL409B-APLCN-NO             ;신청번호
