      *================================================================*
      *@ NAME : YNJL4028                                               *
      *@ DESC : AS계열사조회 COPYBOOK                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-30 15:01:33                          *
      *  생성일시     : 2009-06-30 15:01:42                          *
      *================================================================*
      *--     처리구분
           07  YNJL4028-PRCSS-DSTIC              PIC  X(002).
      *--     조회구분
           07  YNJL4028-AFFLT-APLY-DSTCD         PIC  X(001).
      *--     계열코드
           07  YNJL4028-AFFLT-CORP-GROUP-CD      PIC  X(006).
      *================================================================*
      *        Y  N  J  L  4  0  2  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4028-PRCSS-DSTIC          ;처리구분
      *X  YNJL4028-AFFLT-APLY-DSTCD     ;조회구분
      *X  YNJL4028-AFFLT-CORP-GROUP-CD  ;계열코드
