      *================================================================*
      *@ NAME : YNJL409A                                               *
      *@ DESC : AS기업및그룹한도신청및승인조회(설정신청조회) C     *
      *@        OPYBOOK                                                *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-07-16 10:50:08                          *
      *  생성일시     : 2020-07-16 10:50:17                          *
      *  전체길이     : 00000024 BYTES                               *
      *================================================================*
      *--     처리구분
           07  YNJL409A-PRCSS-DSTIC              PIC  X(002).
      *--     고객구분
           07  YNJL409A-CUST-DSTIC               PIC  X(001).
      *--     KB-PIN
           07  YNJL409A-KB-PIN                   PIC  X(010).
      *--     신청번호
           07  YNJL409A-APLCN-NO                 PIC  X(010).
      *--     한도신청구분
           07  YNJL409A-LIMT-APLCN-DSTIC         PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  9  A    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL409A-PRCSS-DSTIC          ;처리구분
      *X  YNJL409A-CUST-DSTIC           ;고객구분
      *X  YNJL409A-KB-PIN               ;KB-PIN
      *X  YNJL409A-APLCN-NO             ;신청번호
      *X  YNJL409A-LIMT-APLCN-DSTIC     ;한도신청구분
