      *================================================================*
      *@ NAME : YNJL4031                                               *
      *@ DESC : AS한도초과대상조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-16 16:57:22                          *
      *  생성일시     : 2009-04-16 16:57:27                          *
      *================================================================*
      *--     처리구분
           07  YNJL4031-PRCSS-DSTIC              PIC  X(002).
      *--     조회기준일자
           07  YNJL4031-BASE-YMD                 PIC  X(008).
      *--     한도구분
           07  YNJL4031-LIMT-DSTCD               PIC  X(001).
      *================================================================*
      *        Y  N  J  L  4  0  3  1    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4031-PRCSS-DSTIC          ;처리구분
      *X  YNJL4031-BASE-YMD             ;조회기준일자
      *X  YNJL4031-LIMT-DSTCD           ;한도구분
