      *================================================================*
      *@ NAME : YNJL4012                                               *
      *@ DESC : AS계좌별TE현황조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-26 14:45:29                          *
      *  생성일시     : 2009-11-26 14:45:36                          *
      *================================================================*
      *--     처리구분
           07  YNJL4012-PRCSS-DSTIC              PIC  X(002).
      *--     차주번호
           07  YNJL4012-BRWR-NO                  PIC  X(013).
      *--     기준년월일
           07  YNJL4012-BASE-YMD                 PIC  X(008).
      *================================================================*
      *        Y  N  J  L  4  0  1  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4012-PRCSS-DSTIC          ;처리구분
      *X  YNJL4012-BRWR-NO              ;차주번호
      *X  YNJL4012-BASE-YMD             ;기준년월일
