      *================================================================*
      *@ NAME : YNJL4014                                               *
      *@ DESC : AS개별그룹TE현황조회 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-08-20 10:48:08                          *
      *  생성일시     : 2009-08-20 10:48:22                          *
      *================================================================*
      *--     처리구분
           07  YNJL4014-PRCSS-DSTIC              PIC  X(002).
      *--     기준년월일
           07  YNJL4014-BASE-YMD                 PIC  X(008).
      *--     그룹코드
           07  YNJL4014-GROUP-CD                 PIC  X(006).
      *================================================================*
      *        Y  N  J  L  4  0  1  4    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4014-PRCSS-DSTIC          ;처리구분
      *X  YNJL4014-BASE-YMD             ;기준년월일
      *X  YNJL4014-GROUP-CD             ;그룹코드
