      *================================================================*
      *@ NAME : YNJLB009                                               *
      *@ DESC : AS기업및그룹한도신청및승인 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-02-20 13:36:32                          *
      *  생성일시     : 2009-02-20 13:36:40                          *
      *================================================================*
      *--     처리구분
           07  YNJLB009-PRCSS-DSTIC              PIC  X(002).
      *--     fld조회구분_hdn
           07  YNJLB009-CUST-DSTIC               PIC  X(001).
      *--     fld기업구분_hdn
           07  YNJLB009-CORP-DSTIC               PIC  X(001).
      *--     fld조회저장구분_hdn
           07  YNJLB009-INQURY-STORG-DSTIC       PIC  X(001).
      *--     fld채무자번호_hdn
           07  YNJLB009-BRWR-NO                  PIC  X(013).
      *--     fld신청번호
           07  YNJLB009-LIMT-APLCN-NO            PIC  X(010).
      *--     cbo수정신용등급
           07  YNJLB009-AMND-ICV-GRD-DSTCD       PIC  X(015).
      *--     fld수정결산년월
           07  YNJLB009-AMND-STLACC-YM           PIC  X(006).
      *--     fld수정업종
           07  YNJLB009-AMND-NSI-CLSFI-CD        PIC  X(005).
      *--     fld수정업종명
           07  YNJLB009-AMND-SI-CD-NAME          PIC  X(040).
      *--     fld수정기준년도
           07  YNJLB009-AMND-B-AVG-APLY-YR       PIC  X(004).
      *--     fld수정신용등급지원비율
           07  YNJLB009-AMND-C-SPORT-RATO        PIC  9(003)V9(02).
      *--     fld수정영업이익
           07  YNJLB009-AMND-OPRFT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정수입이자
           07  YNJLB009-AMND-INT-ERN             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정감가상각비
           07  YNJLB009-AMND-DPRC-CST            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융비용
           07  YNJLB009-AMND-FNCS                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정단기차입금
           07  YNJLB009-AMND-SHTRM-AMBR          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정차입금상환예상액
           07  YNJLB009-AMND-S-AMBR-RPAYAMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정가중평균이자율
           07  YNJLB009-AMND-B-WGHTG-AVG-RT      PIC  9(003)V9(02).
      *--     fld수정총차입금
           07  YNJLB009-AMND-E-TOTAL-AMBR        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정매출액
           07  YNJLB009-AMND-SALEPR              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정cashflow기준액
           07  YNJLB009-AMND-CSFW-BSAMT          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정차입금자기자본비율
           07  YNJLB009-AMND-B-YR-ONCP-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정차입금자기자본비율
           07  YNJLB009-AMND-AMBR-ONCP-RT        PIC  9(003)V9(02).
      *--     fld수정자기자본기준액
           07  YNJLB009-AMND-O-CAPTL-BSAMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정상환능력기준한도
           07  YNJLB009-AMND-S-BASE-CLAM         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정전년도매출액
           07  YNJLB009-AMND-SALEPR1             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정차입금매출액비율
           07  YNJLB009-AMND-A-SALEPR-RATO       PIC  9(003)V9(02).
      *--     fld수정전년도총자산
           07  YNJLB009-AMND-PYY-TOTAL-ASST      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정차입금총자산비율
           07  YNJLB009-AMND-AT-ASST-RATO        PIC  9(003)V9(02).
      *--     fld수정규모기준한도
           07  YNJLB009-AMND-SCAL-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정기준한도
           07  YNJLB009-AMND-BASE-CLAM           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     cbo수정금융신용등급
           07  YNJLB009-AMND-FICV-GRD-DSTCD      PIC  X(006).
      *--     fld수정금융결산년월
           07  YNJLB009-AMND-F-STLACC-YM         PIC  X(006).
      *--     fld수정금융업종
           07  YNJLB009-AMND-FL-BZTYP-DSTCD      PIC  X(005).
      *--     cbo수정금융업종명
           07  YNJLB009-AMND-FLB-DSTCD-NAME      PIC  X(042).
      *--     fld수정금융업종평균기준년도
           07  YNJLB009-AMND-FB-AVG-APLY-YR      PIC  X(004).
      *--     fld수정금융신용등급별지원비율
           07  YNJLB009-AMND-FC-SPORT-RATO       PIC  9(003)V9(02).
      *--     fld수정금융전전기경상이익
           07  YNJLB009-AMND-FBP-ODNR-PRFT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융전기경상이익
           07  YNJLB009-AMND-FP-ODNR-PRFT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융당기경상이익
           07  YNJLB009-AMND-FBY-ODNR-PRFT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융전전기자기자본
           07  YNJLB009-AMND-FBP-ONCP-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융전기자기자본
           07  YNJLB009-AMND-PYY-ONCP-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융당기자기자본
           07  YNJLB009-AMND-FB-YR-ONCP-AMT      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융최근업종평균자본비율
           07  YNJLB009-AMND-F-ONCP-RATO         PIC  9(003)V9(02).
      *--     fld수정금융상환능력기준한도
           07  YNJLB009-AMND-FS-BASE-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융규모기준기준한도
           07  YNJLB009-AMND-S-BASE-CLAM1        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld수정금융금융기관기준한도
           07  YNJLB009-AMND-F-BASE-CLAM         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld설정신청구분_hdn
           07  YNJLB009-LIMT-A-KND-DSTCD         PIC  X(001).
      *--     fld본건입력수_hdn
           07  YNJLB009-MAIN-CAS-INPT-CNT        PIC  X(005).
      *--     fld신청1_대표자
           07  YNJLB009-RPRS-NAME                PIC  X(042).
      *--     fld신청1_기업신용등급
           07  YNJLB009-INTNL-CV-GRD-DSTCD1      PIC  X(006).
      *--     fld신청1_표준산업분류코드
           07  YNJLB009-NEW-SI-CLSFI-CD1         PIC  X(005).
      *--     fld신청1_그룹명
           07  YNJLB009-HANGL-GROUP-NAME         PIC  X(042).
      *--     fld신청1_그룹등급
           07  YNJLB009-CMGR-CRTDSCD             PIC  X(004).
      *--     fld영업점코드_hdn,fld신청1_영업점코드
           07  YNJLB009-BRNCD                    PIC  X(004).
      *--     fld영업점명_hdn,fld신청1_영업점명
           07  YNJLB009-BRN-HANGL-NAME           PIC  X(042).
      *--     fld신청자ID_hdn,fld신청1_신청자ID
           07  YNJLB009-APLCN-EMPID              PIC  X(008).
      *--     fld신청자명_hdn,fld신청1_신청자명
           07  YNJLB009-APLCN-EMNM               PIC  X(042).
      *--     출력라인수1
           07  YNJLB009-OUTPT-LINE-CNT1          PIC  9(005).
      *--     grd조회내용1
           07  YNJLB009-GRID1                    OCCURS 0030 TIMES.
      *--       통화코드
             09  YNJLB009-CNCYCD                 PIC  X(003).
      *--       본건신청금액
             09  YNJLB009-MAIN-CAS-APLCN-AMT     PIC  9(015).
      *--       본건여신종류
             09  YNJLB009-TIACC-NAME             PIC  X(070).
      *--       원화환산액
             09  YNJLB009-WONC-AUC               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       원화 Exposure
             09  YNJLB009-MAIN-CAS-EXPSR-AMT     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     출력라인수2
           07  YNJLB009-OUTPT-LINE-CNT2          PIC  9(005).
      *--     grd조회내용2
           07  YNJLB009-GRID2                    OCCURS 0030 TIMES.
      *--       관리한도
             09  YNJLB009-MGT-CLAM2              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       익스포져
             09  YNJLB009-TE-LIMT-AUC            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       본건명목액
             09  YNJLB009-WONC-AUC1              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       본건익스포져
             09  YNJLB009-MAIN-CAS-EXPSR-AMT1    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     출력라인수3
           07  YNJLB009-OUTPT-LINE-CNT3          PIC  9(005).
      *--     grd조회내용3
           07  YNJLB009-GRID3                    OCCURS 0030 TIMES.
      *--       산업군명
             09  YNJLB009-LAG-C-BZTYP-CD-NAME    PIC  X(070).
      *--       산업별관리한도
             09  YNJLB009-IDSTRY-MGT-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       산업별Exposure
             09  YNJLB009-TE-LIMT-AUC1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     출력라인수4
           07  YNJLB009-OUTPT-LINE-CNT4          PIC  9(005).
      *--     grd조회내용4
           07  YNJLB009-GRID4                    OCCURS 0030 TIMES.
      *--       여신성TE관리한도
             09  YNJLB009-BF-LNBZ-INCLIN-ASST    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       시장성TE관리한도
             09  YNJLB009-BF-MRKTY-ASST          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       여신성TE관리한도
             09  YNJLB009-AF-LNBZ-INCLIN-ASST    PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       시장성TE관리한도
             09  YNJLB009-AF-MRKTY-ASST          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     mln신청1_신청사유
           07  YNJLB009-APLCN-RESN-CTNT          PIC  X(252).
      *--     fld승인_신청일자
           07  YNJLB009-ATHOR-APLCN-YMD          PIC  X(008).
      *--     fld승인_신청자ID
           07  YNJLB009-ATHOR-APLCN-EMPID        PIC  X(008).
      *--     fld승인_신청자명
           07  YNJLB009-ATHOR-APLCN-EMNM         PIC  X(042).
      *--     fld승인_영업점코드
           07  YNJLB009-ATHOR-BRNCD              PIC  X(006).
      *--     fld승인_영업점명
           07  YNJLB009-ATHOR-B-HANGL-NAME       PIC  X(042).
      *--     cbo승인_신청구분
           07  YNJLB009-ATHOR-L-APLCN-DSTCD      PIC  X(001).
      *--     fld승인_승인일자
           07  YNJLB009-ATHOR-YMD                PIC  X(008).
      *--     fld승인_기준한도산출액
           07  YNJLB009-ATHOR-BASE-CLAM          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld승인_TE관리한도설정액
           07  YNJLB009-ATHOR-MGT-CLAM           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld한도유효일
           07  YNJLB009-LIMT-STUP-VALD-YMD       PIC  X(008).
      *--     fld승인_여신성TE관리한도
           07  YNJLB009-ATHOR-LI-MGT-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     fld승인_시장성TE관리한도
           07  YNJLB009-ATHOR-M-MGT-CLAM         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     cbo승인권자
           07  YNJLB009-ATHOR-EMPID              PIC  X(008).
      *--     cbo조건부승인조건
           07  YNJLB009-LIMT-A-CNDN-DSTCD        PIC  X(001).
      *--     cbo승인구분
           07  YNJLB009-LIMT-ATHOR-DSTCD         PIC  X(001).
      *--     mln승인사유
           07  YNJLB009-ATHOR-RESN-CTNT          PIC  X(252).
      *================================================================*
      *        Y  N  J  L  B  0  0  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJLB009-PRCSS-DSTIC          ;처리구분
      *X  YNJLB009-CUST-DSTIC           ;fld조회구분_hdn
      *X  YNJLB009-CORP-DSTIC           ;fld기업구분_hdn
      *X  YNJLB009-INQURY-STORG-DSTIC   ;fld조회저장구분_hdn
      *X  YNJLB009-BRWR-NO              ;fld채무자번호_hdn
      *X  YNJLB009-LIMT-APLCN-NO        ;fld신청번호
      *X  YNJLB009-AMND-ICV-GRD-DSTCD   ;cbo수정신용등급
      *X  YNJLB009-AMND-STLACC-YM       ;fld수정결산년월
      *X  YNJLB009-AMND-NSI-CLSFI-CD    ;fld수정업종
      *X  YNJLB009-AMND-SI-CD-NAME      ;fld수정업종명
      *X  YNJLB009-AMND-B-AVG-APLY-YR   ;fld수정기준년도
      *N  YNJLB009-AMND-C-SPORT-RATO    ;fld수정신용등급지원비율
      *S  YNJLB009-AMND-OPRFT           ;fld수정영업이익
      *S  YNJLB009-AMND-INT-ERN         ;fld수정수입이자
      *S  YNJLB009-AMND-DPRC-CST        ;fld수정감가상각비
      *S  YNJLB009-AMND-FNCS            ;fld수정금융비용
      *S  YNJLB009-AMND-SHTRM-AMBR      ;fld수정단기차입금
      *S  YNJLB009-AMND-S-AMBR-RPAYAMT
      * fld수정차입금상환예상액
      *N  YNJLB009-AMND-B-WGHTG-AVG-RT  ;fld수정가중평균이자율
      *S  YNJLB009-AMND-E-TOTAL-AMBR    ;fld수정총차입금
      *S  YNJLB009-AMND-SALEPR          ;fld수정매출액
      *S  YNJLB009-AMND-CSFW-BSAMT      ;fld수정cashflow기준액
      *S  YNJLB009-AMND-B-YR-ONCP-AMT
      * fld수정차입금자기자본비율
      *N  YNJLB009-AMND-AMBR-ONCP-RT
      * fld수정차입금자기자본비율
      *S  YNJLB009-AMND-O-CAPTL-BSAMT   ;fld수정자기자본기준액
      *S  YNJLB009-AMND-S-BASE-CLAM     ;fld수정상환능력기준한도
      *S  YNJLB009-AMND-SALEPR1         ;fld수정전년도매출액
      *N  YNJLB009-AMND-A-SALEPR-RATO
      * fld수정차입금매출액비율
      *S  YNJLB009-AMND-PYY-TOTAL-ASST  ;fld수정전년도총자산
      *N  YNJLB009-AMND-AT-ASST-RATO    ;fld수정차입금총자산비율
      *S  YNJLB009-AMND-SCAL-BASE-CLAM  ;fld수정규모기준한도
      *S  YNJLB009-AMND-BASE-CLAM       ;fld수정기준한도
      *X  YNJLB009-AMND-FICV-GRD-DSTCD  ;cbo수정금융신용등급
      *X  YNJLB009-AMND-F-STLACC-YM     ;fld수정금융결산년월
      *X  YNJLB009-AMND-FL-BZTYP-DSTCD  ;fld수정금융업종
      *X  YNJLB009-AMND-FLB-DSTCD-NAME  ;cbo수정금융업종명
      *X  YNJLB009-AMND-FB-AVG-APLY-YR
      * fld수정금융업종평균기준년도
      *N  YNJLB009-AMND-FC-SPORT-RATO
      * fld수정금융신용등급별지원비율
      *S  YNJLB009-AMND-FBP-ODNR-PRFT
      * fld수정금융전전기경상이익
      *S  YNJLB009-AMND-FP-ODNR-PRFT    ;fld수정금융전기경상이익
      *S  YNJLB009-AMND-FBY-ODNR-PRFT
      * fld수정금융당기경상이익
      *S  YNJLB009-AMND-FBP-ONCP-AMT
      * fld수정금융전전기자기자본
      *S  YNJLB009-AMND-PYY-ONCP-AMT    ;fld수정금융전기자기자본
      *S  YNJLB009-AMND-FB-YR-ONCP-AMT
      * fld수정금융당기자기자본
      *N  YNJLB009-AMND-F-ONCP-RATO
      * fld수정금융최근업종평균자본비율
      *S  YNJLB009-AMND-FS-BASE-CLAM
      * fld수정금융상환능력기준한도
      *S  YNJLB009-AMND-S-BASE-CLAM1
      * fld수정금융규모기준기준한도
      *S  YNJLB009-AMND-F-BASE-CLAM
      * fld수정금융금융기관기준한도
      *X  YNJLB009-LIMT-A-KND-DSTCD     ;fld설정신청구분_hdn
      *X  YNJLB009-MAIN-CAS-INPT-CNT    ;fld본건입력수_hdn
      *X  YNJLB009-RPRS-NAME            ;fld신청1_대표자
      *X  YNJLB009-INTNL-CV-GRD-DSTCD1
      * fld신청1_기업신용등급
      *X  YNJLB009-NEW-SI-CLSFI-CD1
      * fld신청1_표준산업분류코드
      *X  YNJLB009-HANGL-GROUP-NAME     ;fld신청1_그룹명
      *X  YNJLB009-CMGR-CRTDSCD         ;fld신청1_그룹등급
      *X  YNJLB009-BRNCD
      * fld영업점코드_hdn,fld신청1_영업점코드
      *X  YNJLB009-BRN-HANGL-NAME
      * fld영업점명_hdn,fld신청1_영업점명
      *X  YNJLB009-APLCN-EMPID
      * fld신청자ID_hdn,fld신청1_신청자ID
      *X  YNJLB009-APLCN-EMNM
      * fld신청자명_hdn,fld신청1_신청자명
      *N  YNJLB009-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YNJLB009-GRID1                ;grd조회내용1
      *X  YNJLB009-CNCYCD               ;통화코드
      *N  YNJLB009-MAIN-CAS-APLCN-AMT   ;본건신청금액
      *X  YNJLB009-TIACC-NAME           ;본건여신종류
      *S  YNJLB009-WONC-AUC             ;원화환산액
      *S  YNJLB009-MAIN-CAS-EXPSR-AMT   ;원화 Exposure
      *N  YNJLB009-OUTPT-LINE-CNT2      ;출력라인수2
      *A  YNJLB009-GRID2                ;grd조회내용2
      *S  YNJLB009-MGT-CLAM2            ;관리한도
      *S  YNJLB009-TE-LIMT-AUC          ;익스포져
      *S  YNJLB009-WONC-AUC1            ;본건명목액
      *S  YNJLB009-MAIN-CAS-EXPSR-AMT1  ;본건익스포져
      *N  YNJLB009-OUTPT-LINE-CNT3      ;출력라인수3
      *A  YNJLB009-GRID3                ;grd조회내용3
      *X  YNJLB009-LAG-C-BZTYP-CD-NAME  ;산업군명
      *S  YNJLB009-IDSTRY-MGT-CLAM      ;산업별관리한도
      *S  YNJLB009-TE-LIMT-AUC1         ;산업별Exposure
      *N  YNJLB009-OUTPT-LINE-CNT4      ;출력라인수4
      *A  YNJLB009-GRID4                ;grd조회내용4
      *S  YNJLB009-BF-LNBZ-INCLIN-ASST  ;여신성TE관리한도
      *S  YNJLB009-BF-MRKTY-ASST        ;시장성TE관리한도
      *S  YNJLB009-AF-LNBZ-INCLIN-ASST  ;여신성TE관리한도
      *S  YNJLB009-AF-MRKTY-ASST        ;시장성TE관리한도
      *X  YNJLB009-APLCN-RESN-CTNT      ;mln신청1_신청사유
      *X  YNJLB009-ATHOR-APLCN-YMD      ;fld승인_신청일자
      *X  YNJLB009-ATHOR-APLCN-EMPID    ;fld승인_신청자ID
      *X  YNJLB009-ATHOR-APLCN-EMNM     ;fld승인_신청자명
      *X  YNJLB009-ATHOR-BRNCD          ;fld승인_영업점코드
      *X  YNJLB009-ATHOR-B-HANGL-NAME   ;fld승인_영업점명
      *X  YNJLB009-ATHOR-L-APLCN-DSTCD  ;cbo승인_신청구분
      *X  YNJLB009-ATHOR-YMD            ;fld승인_승인일자
      *S  YNJLB009-ATHOR-BASE-CLAM      ;fld승인_기준한도산출액
      *S  YNJLB009-ATHOR-MGT-CLAM       ;fld승인_TE관리한도설정액
      *X  YNJLB009-LIMT-STUP-VALD-YMD   ;fld한도유효일
      *S  YNJLB009-ATHOR-LI-MGT-CLAM
      * fld승인_여신성TE관리한도
      *S  YNJLB009-ATHOR-M-MGT-CLAM
      * fld승인_시장성TE관리한도
      *X  YNJLB009-ATHOR-EMPID          ;cbo승인권자
      *X  YNJLB009-LIMT-A-CNDN-DSTCD    ;cbo조건부승인조건
      *X  YNJLB009-LIMT-ATHOR-DSTCD     ;cbo승인구분
      *X  YNJLB009-ATHOR-RESN-CTNT      ;mln승인사유
