      *================================================================*
      *@ NAME : YNJL4007                                               *
      *@ DESC : ASTE한도관리대상조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-06-09 13:17:05                          *
      *  생성일시     : 2009-06-09 13:17:11                          *
      *================================================================*
      *--     처리구분
           07  YNJL4007-PRCSS-DSTIC              PIC  X(002).
      *--     부점코드
           07  YNJL4007-BRNCD                    PIC  X(004).
      *--     고객구분
           07  YNJL4007-CUST-DSTIC               PIC  X(001).
      *--     설정상태
           07  YNJL4007-STUP-STUS                PIC  X(001).
      *--     기준년월일
           07  YNJL4007-BASE-YMD                 PIC  X(008).
      *--     금액1
           07  YNJL4007-AMT1                     PIC  9(015).
      *--     금액2
           07  YNJL4007-AMT2                     PIC  9(015).
      *================================================================*
      *        Y  N  J  L  4  0  0  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YNJL4007-PRCSS-DSTIC          ;처리구분
      *X  YNJL4007-BRNCD                ;부점코드
      *X  YNJL4007-CUST-DSTIC           ;고객구분
      *X  YNJL4007-STUP-STUS            ;설정상태
      *X  YNJL4007-BASE-YMD             ;기준년월일
      *N  YNJL4007-AMT1                 ;금액1
      *N  YNJL4007-AMT2                 ;금액2
