      *================================================================*
      *@ NAME : YPJL4150                                               *
      *@ DESC : AS국별수기국적조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2025-05-07 10:00:19                          *
      *  생성일시     : 2025-05-07 10:00:22                          *
      *  전체길이     : 00010905 BYTES                               *
      *================================================================*
      *--     현재건수1
           07  YPJL4150-PRSNT-NOITM1             PIC  9(005).
      *--     그리드1
           07  YPJL4150-GRID1                    OCCURS 000100 TIMES.
      *--       계좌번호
             09  YPJL4150-ACNO                   PIC  X(020).
      *--       ISO국가코드
             09  YPJL4150-ISO-NATNL-CD           PIC  X(002).
      *--       USD한도
             09  YPJL4150-USD-CLAM               PIC  9(015)V9(03).
      *--       ISO국가코드2
             09  YPJL4150-ISO-NATNL-CD2          PIC  X(002).
      *--       등록년월일
             09  YPJL4150-REGI-YMD               PIC  X(008).
      *--       등록직원번호
             09  YPJL4150-REGI-EMPID             PIC  X(007).
      *--       등록직원명
             09  YPJL4150-REGI-EMNM              PIC  X(052).
      *================================================================*
      *        Y  P  J  L  4  1  5  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4150-PRSNT-NOITM1         ;현재건수1
      *A  YPJL4150-GRID1                ;그리드1
      *X  YPJL4150-ACNO                 ;계좌번호
      *X  YPJL4150-ISO-NATNL-CD         ;ISO국가코드
      *N  YPJL4150-USD-CLAM             ;USD한도
      *X  YPJL4150-ISO-NATNL-CD2        ;ISO국가코드2
      *X  YPJL4150-REGI-YMD             ;등록년월일
      *X  YPJL4150-REGI-EMPID           ;등록직원번호
      *X  YPJL4150-REGI-EMNM            ;등록직원명
