      *================================================================*
      *@ NAME : YPJL4107                                               *
      *@ DESC : TE한도관리대상조회                                   *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2021-09-24 16:10:40                          *
      *  생성일시     : 2021-09-24 16:10:46                          *
      *  전체길이     : 01030067 BYTES                               *
      *================================================================*
      *--     부점명
           07  YPJL4107-BRN-NAME                 PIC  X(062).
      *--     출력라인수1
           07  YPJL4107-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4107-GRID1                    OCCURS 005000 TIMES.
      *--       차주번호
             09  YPJL4107-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  YPJL4107-DBTRZ-NAME             PIC  X(042).
      *--       기업규모
             09  YPJL4107-CORP-SCAL              PIC  X(020).
      *--       관리한도금액
             09  YPJL4107-MGT-CLAM               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준한도금액
             09  YPJL4107-TTL-AMT-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4107-TTL-AMT-BASE-BAL       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도기준토탈익스포져금액
             09  YPJL4107-LIMT-BASE-TE-AMT       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도소진율
             09  YPJL4107-LIMT-EXHS-RT           PIC  9(003)V9(02).
      *--       신용평가유효년월일
             09  YPJL4107-CRDT-VALUA-VALD-YMD    PIC  X(008).
      *--       관리한도유효년월일
             09  YPJL4107-MGT-LIMT-VALD-YMD      PIC  X(008).
      *--       관리부점코드
             09  YPJL4107-MGT-BRNCD              PIC  X(004).
      *--       관리부점명
             09  YPJL4107-MGT-BRN-NAME           PIC  X(042).
      *================================================================*
      *        Y  P  J  L  4  1  0  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YPJL4107-BRN-NAME             ;부점명
      *N  YPJL4107-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4107-GRID1                ;그리드1
      *X  YPJL4107-BRWR-NO              ;차주번호
      *X  YPJL4107-DBTRZ-NAME           ;채무자명
      *X  YPJL4107-CORP-SCAL            ;기업규모
      *S  YPJL4107-MGT-CLAM             ;관리한도금액
      *S  YPJL4107-TTL-AMT-BASE-CLAM    ;명목액기준한도금액
      *S  YPJL4107-TTL-AMT-BASE-BAL     ;명목액기준잔액
      *S  YPJL4107-LIMT-BASE-TE-AMT     ;한도기준토탈익스포져금액
      *N  YPJL4107-LIMT-EXHS-RT         ;한도소진율
      *X  YPJL4107-CRDT-VALUA-VALD-YMD  ;신용평가유효년월일
      *X  YPJL4107-MGT-LIMT-VALD-YMD    ;관리한도유효년월일
      *X  YPJL4107-MGT-BRNCD            ;관리부점코드
      *X  YPJL4107-MGT-BRN-NAME         ;관리부점명
