      *================================================================*
      *@ NAME : YPJLB045                                               *
      *@ DESC : AS산업취급관리COPYBOOK                               *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2022-10-21 13:38:31                          *
      *  생성일시     : 2022-10-21 13:38:37                          *
      *  전체길이     : 00287007 BYTES                               *
      *================================================================*
      *--     처리결과
           07  YPJLB045-PRCSS-RSULT              PIC  X(002).
      *--     총라인수
           07  YPJLB045-TOTAL-LINE-CNT           PIC  9(005).
      *--     그리드
           07  YPJLB045-GRID                     OCCURS 001000 TIMES.
      *--       대분류업종코드
             09  YPJLB045-LAG-CLSFI-BZTYP-CD     PIC  X(003).
      *--       대분류업종코드명
             09  YPJLB045-LAG-C-BZTYP-CD-NAME    PIC  X(032).
      *--       일련번호
             09  YPJLB045-SERNO                  PIC  9(007).
      *--       취급중단년월일
             09  YPJLB045-HNDLN-DSCN-YMD         PIC  X(008).
      *--       예외적용년월일
             09  YPJLB045-ECEPT-APLY-YMD         PIC  X(008).
      *--       산업등록해제구분코드
             09  YPJLB045-LIMT-EIRR-DSTCD        PIC  X(001).
      *--       등록직원번호
             09  YPJLB045-REGI-EMPID             PIC  X(007).
      *--       등록직원명
             09  YPJLB045-REGI-EMNM              PIC  X(042).
      *--       등록년월일
             09  YPJLB045-REGI-YMD               PIC  X(008).
      *--       등록결재직원번호
             09  YPJLB045-REGI-APRVAL-EMPID      PIC  X(007).
      *--       등록결재직원명
             09  YPJLB045-REGI-APRVAL-EMNM       PIC  X(042).
      *--       등록결재년월일
             09  YPJLB045-REGI-APRVAL-YMD        PIC  X(008).
      *--       해제직원번호
             09  YPJLB045-REVOC-EMPID            PIC  X(007).
      *--       해제직원명
             09  YPJLB045-REVOC-EMNM             PIC  X(042).
      *--       해제년월일
             09  YPJLB045-REVOC-YMD              PIC  X(008).
      *--       해제결재직원번호
             09  YPJLB045-REVOC-APRVAL-EMPID     PIC  X(007).
      *--       해제결재직원명
             09  YPJLB045-REVOC-APRVAL-EMNM      PIC  X(042).
      *--       해제결재년월일
             09  YPJLB045-REVOC-APRVAL-YMD       PIC  X(008).
      *================================================================*
      *        Y  P  J  L  B  0  4  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YPJLB045-PRCSS-RSULT          ;처리결과
      *N  YPJLB045-TOTAL-LINE-CNT       ;총라인수
      *A  YPJLB045-GRID                 ;그리드
      *X  YPJLB045-LAG-CLSFI-BZTYP-CD   ;대분류업종코드
      *X  YPJLB045-LAG-C-BZTYP-CD-NAME  ;대분류업종코드명
      *N  YPJLB045-SERNO                ;일련번호
      *X  YPJLB045-HNDLN-DSCN-YMD       ;취급중단년월일
      *X  YPJLB045-ECEPT-APLY-YMD       ;예외적용년월일
      *X  YPJLB045-LIMT-EIRR-DSTCD      ;산업등록해제구분코드
      *X  YPJLB045-REGI-EMPID           ;등록직원번호
      *X  YPJLB045-REGI-EMNM            ;등록직원명
      *X  YPJLB045-REGI-YMD             ;등록년월일
      *X  YPJLB045-REGI-APRVAL-EMPID    ;등록결재직원번호
      *X  YPJLB045-REGI-APRVAL-EMNM     ;등록결재직원명
      *X  YPJLB045-REGI-APRVAL-YMD      ;등록결재년월일
      *X  YPJLB045-REVOC-EMPID          ;해제직원번호
      *X  YPJLB045-REVOC-EMNM           ;해제직원명
      *X  YPJLB045-REVOC-YMD            ;해제년월일
      *X  YPJLB045-REVOC-APRVAL-EMPID   ;해제결재직원번호
      *X  YPJLB045-REVOC-APRVAL-EMNM    ;해제결재직원명
      *X  YPJLB045-REVOC-APRVAL-YMD     ;해제결재년월일
