      *================================================================*
      *@ NAME : YPJL4060                                               *
      *@ DESC : ASCRM섭외정보현황조회COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2017-10-24 11:00:24                          *
      *  생성일시     : 2017-10-24 11:00:31                          *
      *  전체길이     : 00067505 BYTES                               *
      *================================================================*
      *--     총라인수
           07  YPJL4060-TOTAL-LINE-CNT           PIC  9(005).
      *--     그리드
           07  YPJL4060-GRID                     OCCURS 000500 TIMES.
      *--       대분류업종코드
             09  YPJL4060-LAG-CLSFI-BZTYP-CD     PIC  X(003).
      *--       대분류업종코드명
             09  YPJL4060-LAG-C-BZTYP-CD-NAME    PIC  X(032).
      *--       협상유치계획건수
             09  YPJL4060-ATRC-PLAN-NOITM1       PIC  9(005).
      *--       협상유치계획금액
             09  YPJL4060-ATRC-PLAN-AMT1         PIC  9(015).
      *--       상품제안유치계획건수
             09  YPJL4060-ATRC-PLAN-NOITM2       PIC  9(005).
      *--       상품제안유치계획금액
             09  YPJL4060-ATRC-PLAN-AMT2         PIC  9(015).
      *--       의사결정중유치계획건
             09  YPJL4060-ATRC-PLAN-NOITM3       PIC  9(005).
      *--       의사결정중유치계획금
             09  YPJL4060-ATRC-PLAN-AMT3         PIC  9(015).
      *--       계약체결중유치계획건
             09  YPJL4060-ATRC-PLAN-NOITM4       PIC  9(005).
      *--       계약체결중유치계획금
             09  YPJL4060-ATRC-PLAN-AMT4         PIC  9(015).
      *--       유치계획건수
             09  YPJL4060-ATRC-PLAN-NOITM        PIC  9(005).
      *--       유치계획금액
             09  YPJL4060-ATRC-PLAN-AMT          PIC  9(015).
      *================================================================*
      *        Y  P  J  L  4  0  6  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4060-TOTAL-LINE-CNT       ;총라인수
      *A  YPJL4060-GRID                 ;그리드
      *X  YPJL4060-LAG-CLSFI-BZTYP-CD   ;대분류업종코드
      *X  YPJL4060-LAG-C-BZTYP-CD-NAME  ;대분류업종코드명
      *N  YPJL4060-ATRC-PLAN-NOITM1     ;협상유치계획건수
      *N  YPJL4060-ATRC-PLAN-AMT1       ;협상유치계획금액
      *N  YPJL4060-ATRC-PLAN-NOITM2     ;상품제안유치계획건수
      *N  YPJL4060-ATRC-PLAN-AMT2       ;상품제안유치계획금액
      *N  YPJL4060-ATRC-PLAN-NOITM3     ;의사결정중유치계획건
      *N  YPJL4060-ATRC-PLAN-AMT3       ;의사결정중유치계획금
      *N  YPJL4060-ATRC-PLAN-NOITM4     ;계약체결중유치계획건
      *N  YPJL4060-ATRC-PLAN-AMT4       ;계약체결중유치계획금
      *N  YPJL4060-ATRC-PLAN-NOITM      ;유치계획건수
      *N  YPJL4060-ATRC-PLAN-AMT        ;유치계획금액
