      *================================================================*
      *@ NAME : YPJL4045                                               *
      *@ DESC : AS최고한도관리조회 COPYBOOK                          *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-27 17:19:32                          *
      *  생성일시     : 2009-07-27 17:19:41                          *
      *================================================================*
      *--     출력라인수1
           07  YPJL4045-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4045-GRID1                    OCCURS 000100 TIMES.
      *--       대분류업종코드명
             09  YPJL4045-LAG-C-BZTYP-CD-NAME    PIC  X(052).
      *--       산업관리한도금액
             09  YPJL4045-IDSTRY-MGT-CLAM        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준한도금액
             09  YPJL4045-TTL-AMT-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4045-TTL-AMT-BASE-BAL       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져한도환산금액
             09  YPJL4045-TE-LIMT-AUC            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       토탈익스포져잔액환산금액
             09  YPJL4045-TE-BAL-AUC             PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도여유액
             09  YPJL4045-LIMT-SEXTR-AMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소진율
             09  YPJL4045-EXHS-RT                PIC  9(003)V9(02).
      *================================================================*
      *        Y  P  J  L  4  0  4  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4045-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4045-GRID1                ;그리드1
      *X  YPJL4045-LAG-C-BZTYP-CD-NAME  ;대분류업종코드명
      *S  YPJL4045-IDSTRY-MGT-CLAM      ;산업관리한도금액
      *S  YPJL4045-TTL-AMT-BASE-CLAM    ;명목액기준한도금액
      *S  YPJL4045-TTL-AMT-BASE-BAL     ;명목액기준잔액
      *S  YPJL4045-TE-LIMT-AUC          ;토탈익스포져한도환산금액
      *S  YPJL4045-TE-BAL-AUC           ;토탈익스포져잔액환산금액
      *S  YPJL4045-LIMT-SEXTR-AMT       ;한도여유액
      *N  YPJL4045-EXHS-RT              ;소진율
