      *================================================================*
      *@ NAME : YPJL4035                                               *
      *@ DESC : AS거액신용공여총액조회 COPYBOOK                      *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-13 16:02:58                          *
      *  생성일시     : 2009-07-13 16:03:06                          *
      *================================================================*
      *--     신용공여한도
           07  YPJL4035-ONCP-BSAMT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     신용공여잔액
           07  YPJL4035-FS-GRCR-AMT              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  YPJL4035-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     경영지표자기자본
           07  YPJL4035-ONCP-BSAMT1              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     자기자본기준년월
           07  YPJL4035-BASE-YM                  PIC  X(006).
      *--     출력라인수1
           07  YPJL4035-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4035-GRID1                    OCCURS 000300 TIMES.
      *--       채무자번호(계열코드)
             09  YPJL4035-BRWR-NO1               PIC  X(013).
      *--       채무자명(계열명)
             09  YPJL4035-AFFLT-C-GROUP-NAME1    PIC  X(052).
      *--       신용공여잔액(은행)
             09  YPJL4035-KB-GRCR-AMT1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       신용공여잔액(금감원)
             09  YPJL4035-FS-GRCR-AMT1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       제외자산
             09  YPJL4035-ECLUD-TAGET-AMT1       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       공여비율(%)
             09  YPJL4035-GVNG-RATO1             PIC  9(003)V9(02).
      *================================================================*
      *        Y  P  J  L  4  0  3  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *S  YPJL4035-ONCP-BSAMT           ;신용공여한도
      *S  YPJL4035-FS-GRCR-AMT          ;신용공여잔액
      *S  YPJL4035-LIMT-SEXTR-AMT       ;한도여유액
      *S  YPJL4035-ONCP-BSAMT1          ;경영지표자기자본
      *X  YPJL4035-BASE-YM              ;자기자본기준년월
      *N  YPJL4035-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4035-GRID1                ;그리드1
      *X  YPJL4035-BRWR-NO1             ;채무자번호(계열코드)
      *X  YPJL4035-AFFLT-C-GROUP-NAME1  ;채무자명(계열명)
      *S  YPJL4035-KB-GRCR-AMT1         ;신용공여잔액(은행)
      *S  YPJL4035-FS-GRCR-AMT1         ;신용공여잔액(금감원)
      *S  YPJL4035-ECLUD-TAGET-AMT1     ;제외자산
      *N  YPJL4035-GVNG-RATO1           ;공여비율(%)
