      *================================================================*
      *@ NAME : YPJL4052                                               *
      *@ DESC : AS등급및규모별TE현황조회 COPYBOOK                  *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2011-06-20 16:54:39                          *
      *  생성일시     : 2011-06-20 16:54:49                          *
      *  전체길이     : 00003215 BYTES                               *
      *================================================================*
      *--     출력라인수1
           07  YPJL4052-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4052-GRID1                    OCCURS 000030 TIMES.
      *--       내부신용평가등급구분코드
             09  YPJL4052-INTNL-CV-GRD-DSTCD     PIC  X(006).
      *--       대기업토탈익스포져
             09  YPJL4052-CNGL-TE                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       중소기업토탈익스포져
             09  YPJL4052-SME-TE                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기업형소호토탈익스포져
             09  YPJL4052-CORP-TYP-SOHO-TE       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소매형소호토탈익스포져
             09  YPJL4052-RTLSAL-TYP-SOHO-TE     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       기타토탈익스포져
             09  YPJL4052-ETC-TE                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       소계
             09  YPJL4052-SUBT                   PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       비중
             09  YPJL4052-WGHTZ                  PIC  9(003)V9(02).
      *================================================================*
      *        Y  P  J  L  4  0  5  2    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4052-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4052-GRID1                ;그리드1
      *X  YPJL4052-INTNL-CV-GRD-DSTCD
      * 내부신용평가등급구분코드
      *S  YPJL4052-CNGL-TE              ;대기업토탈익스포져
      *S  YPJL4052-SME-TE               ;중소기업토탈익스포져
      *S  YPJL4052-CORP-TYP-SOHO-TE     ;기업형소호토탈익스포져
      *S  YPJL4052-RTLSAL-TYP-SOHO-TE   ;소매형소호토탈익스포져
      *S  YPJL4052-ETC-TE               ;기타토탈익스포져
      *S  YPJL4052-SUBT                 ;소계
      *N  YPJL4052-WGHTZ                ;비중
