      *================================================================*
      *@ NAME : YPJL4025                                               *
      *@ DESC : AS포괄신용공여한도기업여신현황 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-07 16:10:28                          *
      *  생성일시     : 2009-07-07 16:10:36                          *
      *================================================================*
      *--     채무자명
           07  YPJL4025-DBTRZ-NAME               PIC  X(052).
      *--     포골신용공여관리한도
           07  YPJL4025-MGT-CLAM                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     계열명
           07  YPJL4025-AFFLT-C-GROUP-NAME       PIC  X(052).
      *--     유효기일
           07  YPJL4025-MGT-LIMT-VALD-YMD        PIC  X(008).
      *--     기사용액
           07  YPJL4025-INLS-GRCR-LIMT-AUC       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     계열신용등급
           07  YPJL4025-INTNL-CV-GRD-DSTCD       PIC  X(004).
      *--     업종명
           07  YPJL4025-STND-IDSTRY-CD-NAME      PIC  X(052).
      *--     한도여유액
           07  YPJL4025-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     기업신용등급
           07  YPJL4025-INTNL-CV-GRD-DSTCD1      PIC  X(004).
      *--     출력라인수1
           07  YPJL4025-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4025-GRID1                    OCCURS 005000 TIMES.
      *--       계좌번호
             09  YPJL4025-ACNO                   PIC  X(020).
      *--       상품코드
             09  YPJL4025-PRDCT-CD               PIC  X(012).
      *--       상품명
             09  YPJL4025-PRDCT-NAME             PIC  X(262).
      *--       명목액기준한도
             09  YPJL4025-TTL-AMT-BASE-CLAM      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4025-TTL-AMT-BASE-BAL       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도환산액
             09  YPJL4025-LIMT-AUC               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       잔액환산액
             09  YPJL4025-BAL-AUC                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       대출일
             09  YPJL4025-START-YMD              PIC  X(008).
      *--       만기일
             09  YPJL4025-EXPIR-YMD              PIC  X(008).
      *================================================================*
      *        Y  P  J  L  4  0  2  5    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YPJL4025-DBTRZ-NAME           ;채무자명
      *S  YPJL4025-MGT-CLAM             ;포골신용공여관리한도
      *X  YPJL4025-AFFLT-C-GROUP-NAME   ;계열명
      *X  YPJL4025-MGT-LIMT-VALD-YMD    ;유효기일
      *S  YPJL4025-INLS-GRCR-LIMT-AUC   ;기사용액
      *X  YPJL4025-INTNL-CV-GRD-DSTCD   ;계열신용등급
      *X  YPJL4025-STND-IDSTRY-CD-NAME  ;업종명
      *S  YPJL4025-LIMT-SEXTR-AMT       ;한도여유액
      *X  YPJL4025-INTNL-CV-GRD-DSTCD1  ;기업신용등급
      *N  YPJL4025-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4025-GRID1                ;그리드1
      *X  YPJL4025-ACNO                 ;계좌번호
      *X  YPJL4025-PRDCT-CD             ;상품코드
      *X  YPJL4025-PRDCT-NAME           ;상품명
      *S  YPJL4025-TTL-AMT-BASE-CLAM    ;명목액기준한도
      *S  YPJL4025-TTL-AMT-BASE-BAL     ;명목액기준잔액
      *S  YPJL4025-LIMT-AUC             ;한도환산액
      *S  YPJL4025-BAL-AUC              ;잔액환산액
      *X  YPJL4025-START-YMD            ;대출일
      *X  YPJL4025-EXPIR-YMD            ;만기일
