      *================================================================*
      *@ NAME : YPJL4050                                               *
      *@ DESC : AS포괄신용공여한도대상차주조회 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2015-04-16 16:15:26                          *
      *  생성일시     : 2015-04-16 16:15:36                          *
      *  전체길이     : 00084005 BYTES                               *
      *================================================================*
      *--     출력라인수1
           07  YPJL4050-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4050-GRID1                    OCCURS 001000 TIMES.
      *--       채무자번호
             09  YPJL4050-BRWR-NO                PIC  X(013).
      *--       KB-PIN
             09  YPJL4050-KB-PIN                 PIC  X(010).
      *--       채무자명
             09  YPJL4050-DBTRZ-NAME             PIC  X(052).
      *--       관리대상구분
             09  YPJL4050-MGT-TAGET-DSTIC        PIC  X(001).
      *--       등록년월일
             09  YPJL4050-REGI-YMD               PIC  X(008).
      *================================================================*
      *        Y  P  J  L  4  0  5  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4050-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4050-GRID1                ;그리드1
      *X  YPJL4050-BRWR-NO              ;채무자번호
      *X  YPJL4050-KB-PIN               ;KB-PIN
      *X  YPJL4050-DBTRZ-NAME           ;채무자명
      *X  YPJL4050-MGT-TAGET-DSTIC      ;관리대상구분
      *X  YPJL4050-REGI-YMD             ;등록년월일
