      *================================================================*
      *@ NAME : YPJL4036                                               *
      *@ DESC : AS자회사신용공여조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-09 11:07:12                          *
      *  생성일시     : 2009-07-09 11:07:22                          *
      *================================================================*
      *--     신용공여한도(전체)
           07  YPJL4036-GRCR-LIMT                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     신용공여잔액
           07  YPJL4036-GRCR-BAL                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  YPJL4036-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     업무규제자기자본
           07  YPJL4036-BZWK-REGUL-ONCP          PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     자기자본기준년월
           07  YPJL4036-ONCP-BASE-YM             PIC  X(006).
      *--     출력라인수1
           07  YPJL4036-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4036-GRID1                    OCCURS 000100 TIMES.
      *--       채무자번호
             09  YPJL4036-BRWR-NO1               PIC  X(013).
      *--       채무자명
             09  YPJL4036-DBTR-NAME1             PIC  X(052).
      *--       신용공여한도(개별)
             09  YPJL4036-CA-AMT1                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       은행기준
             09  YPJL4036-BS-BASE-BAL1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       금감원기준
             09  YPJL4036-CA-SCURTY-AUC1         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       제외자산
             09  YPJL4036-ECLUD-ASAM1            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       공여율
             09  YPJL4036-GVNG-RATO1             PIC  9(003)V9(02).
      *================================================================*
      *        Y  P  J  L  4  0  3  6    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *S  YPJL4036-GRCR-LIMT            ;신용공여한도(전체)
      *S  YPJL4036-GRCR-BAL             ;신용공여잔액
      *S  YPJL4036-LIMT-SEXTR-AMT       ;한도여유액
      *S  YPJL4036-BZWK-REGUL-ONCP      ;업무규제자기자본
      *X  YPJL4036-ONCP-BASE-YM         ;자기자본기준년월
      *N  YPJL4036-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4036-GRID1                ;그리드1
      *X  YPJL4036-BRWR-NO1             ;채무자번호
      *X  YPJL4036-DBTR-NAME1           ;채무자명
      *S  YPJL4036-CA-AMT1              ;신용공여한도(개별)
      *S  YPJL4036-BS-BASE-BAL1         ;은행기준
      *S  YPJL4036-CA-SCURTY-AUC1       ;금감원기준
      *S  YPJL4036-ECLUD-ASAM1          ;제외자산
      *N  YPJL4036-GVNG-RATO1           ;공여율
