      *================================================================*
      *@ NAME : YPJL4030                                               *
      *@ DESC : AS계열그룹조회 COPYBOOK                              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2020-06-23 11:18:41                          *
      *  생성일시     : 2020-06-23 11:18:51                          *
      *  전체길이     : 00070005 BYTES                               *
      *================================================================*
      *--     출력라인수1
           07  YPJL4030-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4030-GRID1                    OCCURS 001000 TIMES.
      *--       그룹순위
             09  YPJL4030-AFFLT-CORP-RANKG       PIC  9(003).
      *--       그룹코드
             09  YPJL4030-AFFLT-CORP-GROUP-CD    PIC  X(006).
      *--       그룹명
             09  YPJL4030-AFFLT-C-GROUP-NAME     PIC  X(052).
      *--       주채권은행
             09  YPJL4030-MAIN-BND-BNK-CD        PIC  X(003).
      *--       그룹(내부)평가등급
             09  YPJL4030-INTNL-CV-GRD-DSTCD     PIC  X(003).
      *--       최종집단등급구분
             09  YPJL4030-LAST-CLCT-GRD-DSTCD    PIC  X(003).
      *================================================================*
      *        Y  P  J  L  4  0  3  0    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4030-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4030-GRID1                ;그리드1
      *N  YPJL4030-AFFLT-CORP-RANKG     ;그룹순위
      *X  YPJL4030-AFFLT-CORP-GROUP-CD  ;그룹코드
      *X  YPJL4030-AFFLT-C-GROUP-NAME   ;그룹명
      *X  YPJL4030-MAIN-BND-BNK-CD      ;주채권은행
      *X  YPJL4030-INTNL-CV-GRD-DSTCD   ;그룹(내부)평가등급
      *X  YPJL4030-LAST-CLCT-GRD-DSTCD  ;최종집단등급구분
