      *================================================================*
      *@ NAME : YPJL4038                                               *
      *@ DESC : AS자회사및대주주조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-04-14 10:52:02                          *
      *  생성일시     : 2009-04-14 10:52:09                          *
      *================================================================*
      *--     출력라인수1
           07  YPJL4038-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4038-GRID1                    OCCURS 0100 TIMES.
      *--       채무자번호
             09  YPJL4038-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  YPJL4038-DBTRZ-NAME             PIC  X(052).
      *--       등록일자
             09  YPJL4038-REGI-YMD               PIC  X(008).
      *--       출자금액
             09  YPJL4038-LAG-SKHDR-AMFN         PIC  9(015).
      *--       해제일자
             09  YPJL4038-TERMI-YMD              PIC  X(008).
      *================================================================*
      *        Y  P  J  L  4  0  3  8    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4038-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4038-GRID1                ;그리드1
      *X  YPJL4038-BRWR-NO              ;채무자번호
      *X  YPJL4038-DBTRZ-NAME           ;채무자명
      *X  YPJL4038-REGI-YMD             ;등록일자
      *N  YPJL4038-LAG-SKHDR-AMFN       ;출자금액
      *X  YPJL4038-TERMI-YMD            ;해제일자
