      *================================================================*
      *@ NAME : YPJL4017                                               *
      *@ DESC : AS피어코드별TE현황조회 COPYBOOK                    *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2016-01-18 16:29:07                          *
      *  생성일시     : 2016-01-18 16:29:11                          *
      *  전체길이     : 00087607 BYTES                               *
      *================================================================*
      *--     피어코드명
           07  YPJL4017-PEER-CD-NAME             PIC  X(102).
      *--     출력라인수1
           07  YPJL4017-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4017-GRID1                    OCCURS 000500 TIMES.
      *--       피어코드
             09  YPJL4017-PEER-DSTCD1            PIC  X(010).
      *--       피어코드명
             09  YPJL4017-PEER-CD-NAME1          PIC  X(102).
      *--       대상업체수
             09  YPJL4017-TAGET-ENTP-NOITM1      PIC  9(015).
      *--       명목액기준한도
             09  YPJL4017-TTL-AMT-BASE-CLAM1     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4017-TTL-AMT-BASE-BAL1      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도기준TE(B)
             09  YPJL4017-TE-LIMT-AUC1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        Y  P  J  L  4  0  1  7    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *X  YPJL4017-PEER-CD-NAME         ;피어코드명
      *N  YPJL4017-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4017-GRID1                ;그리드1
      *X  YPJL4017-PEER-DSTCD1          ;피어코드
      *X  YPJL4017-PEER-CD-NAME1        ;피어코드명
      *N  YPJL4017-TAGET-ENTP-NOITM1    ;대상업체수
      *S  YPJL4017-TTL-AMT-BASE-CLAM1   ;명목액기준한도
      *S  YPJL4017-TTL-AMT-BASE-BAL1    ;명목액기준잔액
      *S  YPJL4017-TE-LIMT-AUC1         ;한도기준TE(B)
