      *================================================================*
      *@ NAME : YPJL4029                                               *
      *@ DESC : AS금감원주채무계열변경내역조회 COPYBOOK              *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-11-28 14:56:11                          *
      *  생성일시     : 2009-11-28 14:56:20                          *
      *================================================================*
      *--     출력라인수1
           07  YPJL4029-OUTPT-LINE-CNT1          PIC  9(005).
      *--     그리드1
           07  YPJL4029-GRID1                    OCCURS 001000 TIMES.
      *--       기준년월
             09  YPJL4029-BASE-YM                PIC  X(006).
      *--       구분
             09  YPJL4029-PRCSS-DSTIC            PIC  X(006).
      *--       채무자고객번호
             09  YPJL4029-BRWR-NO                PIC  X(013).
      *--       채무자명
             09  YPJL4029-DBTRZ-NAME             PIC  X(052).
      *--       그룹코드
             09  YPJL4029-AFFLT-CORP-GROUP-CD    PIC  X(006).
      *--       그룹명
             09  YPJL4029-AFFLT-C-GROUP-NAME     PIC  X(042).
      *--       등록직원번호
             09  YPJL4029-REGI-EMPID             PIC  X(007).
      *--       등록년월일
             09  YPJL4029-REGI-YMD               PIC  X(008).
      *================================================================*
      *        Y  P  J  L  4  0  2  9    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4029-OUTPT-LINE-CNT1      ;출력라인수1
      *A  YPJL4029-GRID1                ;그리드1
      *X  YPJL4029-BASE-YM              ;기준년월
      *X  YPJL4029-PRCSS-DSTIC          ;구분
      *X  YPJL4029-BRWR-NO              ;채무자고객번호
      *X  YPJL4029-DBTRZ-NAME           ;채무자명
      *X  YPJL4029-AFFLT-CORP-GROUP-CD  ;그룹코드
      *X  YPJL4029-AFFLT-C-GROUP-NAME   ;그룹명
      *X  YPJL4029-REGI-EMPID           ;등록직원번호
      *X  YPJL4029-REGI-YMD             ;등록년월일
