      *================================================================*
      *@ NAME : YPJL4013                                               *
      *@ DESC : AS과목별TE현황조회 COPYBOOK                        *
      *----------------------------------------------------------------*
      *  최종변경일시 : 2009-07-15 10:49:46                          *
      *  생성일시     : 2009-07-15 10:49:56                          *
      *================================================================*
      *--     출력라인수1
           07  YPJL4013-OUTPT-LINE-CNT1          PIC  9(005).
      *--     출력라인수2
           07  YPJL4013-OUTPT-LINE-CNT2          PIC  9(005).
      *--     채무자명
           07  YPJL4013-DBTRZ-NAME               PIC  X(052).
      *--     기준한도금액
           07  YPJL4013-BASE-CLAM                PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     기준한도산출년월일
           07  YPJL4013-BASE-LIMT-CMPTN-YMD      PIC  X(008).
      *--     관리한도유효년월일
           07  YPJL4013-MGT-LIMT-VALD-YMD        PIC  X(008).
      *--     관리한도금액
           07  YPJL4013-MGT-CLAM                 PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     토탈익스포져
           07  YPJL4013-TE                       PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     한도여유액
           07  YPJL4013-LIMT-SEXTR-AMT           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성한도
           07  YPJL4013-LNBZ-INCLIN-LIMT         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성익스포져
           07  YPJL4013-LNBZ-INCLIN-EXPSR        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     여신성한도여유액
           07  YPJL4013-LNBZ-IL-SEXTR-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성한도
           07  YPJL4013-MRKTY-LIMT               PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성익스포져
           07  YPJL4013-MRKTY-EXPSR              PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     시장성한도여유액
           07  YPJL4013-MRKTY-L-SEXTR-AMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     파생상품총거래한도
           07  YPJL4013-DRVT-PT-TRAN-LIMT        PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     파생상품익스포져
           07  YPJL4013-DRVT-PRDCT-EXPSR         PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그리드1
           07  YPJL4013-GRID1                    OCCURS 001000 TIMES.
      *--       항목구분
             09  YPJL4013-TE-ITEM-DSTIC1         PIC  X(025).
      *--       상품코드
             09  YPJL4013-PRDCT-CD1              PIC  X(012).
      *--       상품명
             09  YPJL4013-PRDCT-NAME1            PIC  X(262).
      *--       자산구분
             09  YPJL4013-TE-ASST-DSTCD1         PIC  X(010).
      *--       명목액기준한도
             09  YPJL4013-TTL-AMT-BASE-CLAM1     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4013-TTL-AMT-BASE-BAL1      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도기준TE
             09  YPJL4013-TE-LIMT-AUC1           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       잔액기준TE
             09  YPJL4013-TE-BAL-AUC1            PIC S9(015)
                                                 LEADING  SEPARATE.
      *--     그리드2
           07  YPJL4013-GRID2                    OCCURS 001000 TIMES.
      *--       항목구분
             09  YPJL4013-TE-ITEM-DSTIC2         PIC  X(025).
      *--       상품코드
             09  YPJL4013-PRDCT-CD2              PIC  X(012).
      *--       상품명
             09  YPJL4013-PRDCT-NAME2            PIC  X(262).
      *--       자산구분
             09  YPJL4013-TE-ASST-DSTCD2         PIC  X(010).
      *--       명목액기준한도
             09  YPJL4013-TTL-AMT-BASE-CLAM2     PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       명목액기준잔액
             09  YPJL4013-TTL-AMT-BASE-BAL2      PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       한도기준TE
             09  YPJL4013-TE-LIMT-AUC2           PIC S9(015)
                                                 LEADING  SEPARATE.
      *--       잔액기준TE
             09  YPJL4013-TE-BAL-AUC2            PIC S9(015)
                                                 LEADING  SEPARATE.
      *================================================================*
      *        Y  P  J  L  4  0  1  3    C  O  P  Y  B  O  O  K        *
      *================================================================*
      *N  YPJL4013-OUTPT-LINE-CNT1      ;출력라인수1
      *N  YPJL4013-OUTPT-LINE-CNT2      ;출력라인수2
      *X  YPJL4013-DBTRZ-NAME           ;채무자명
      *S  YPJL4013-BASE-CLAM            ;기준한도금액
      *X  YPJL4013-BASE-LIMT-CMPTN-YMD  ;기준한도산출년월일
      *X  YPJL4013-MGT-LIMT-VALD-YMD    ;관리한도유효년월일
      *S  YPJL4013-MGT-CLAM             ;관리한도금액
      *S  YPJL4013-TE                   ;토탈익스포져
      *S  YPJL4013-LIMT-SEXTR-AMT       ;한도여유액
      *S  YPJL4013-LNBZ-INCLIN-LIMT     ;여신성한도
      *S  YPJL4013-LNBZ-INCLIN-EXPSR    ;여신성익스포져
      *S  YPJL4013-LNBZ-IL-SEXTR-AMT    ;여신성한도여유액
      *S  YPJL4013-MRKTY-LIMT           ;시장성한도
      *S  YPJL4013-MRKTY-EXPSR          ;시장성익스포져
      *S  YPJL4013-MRKTY-L-SEXTR-AMT    ;시장성한도여유액
      *S  YPJL4013-DRVT-PT-TRAN-LIMT    ;파생상품총거래한도
      *S  YPJL4013-DRVT-PRDCT-EXPSR     ;파생상품익스포져
      *A  YPJL4013-GRID1                ;그리드1
      *X  YPJL4013-TE-ITEM-DSTIC1       ;항목구분
      *X  YPJL4013-PRDCT-CD1            ;상품코드
      *X  YPJL4013-PRDCT-NAME1          ;상품명
      *X  YPJL4013-TE-ASST-DSTCD1       ;자산구분
      *S  YPJL4013-TTL-AMT-BASE-CLAM1   ;명목액기준한도
      *S  YPJL4013-TTL-AMT-BASE-BAL1    ;명목액기준잔액
      *S  YPJL4013-TE-LIMT-AUC1         ;한도기준TE
      *S  YPJL4013-TE-BAL-AUC1          ;잔액기준TE
      *A  YPJL4013-GRID2                ;그리드2
      *X  YPJL4013-TE-ITEM-DSTIC2       ;항목구분
      *X  YPJL4013-PRDCT-CD2            ;상품코드
      *X  YPJL4013-PRDCT-NAME2          ;상품명
      *X  YPJL4013-TE-ASST-DSTCD2       ;자산구분
      *S  YPJL4013-TTL-AMT-BASE-CLAM2   ;명목액기준한도
      *S  YPJL4013-TTL-AMT-BASE-BAL2    ;명목액기준잔액
      *S  YPJL4013-TE-LIMT-AUC2         ;한도기준TE
      *S  YPJL4013-TE-BAL-AUC2          ;잔액기준TE
