//MKJLDP19 JOB (Z-KESA),CLASS=B,MSGCLASS=X,REGION=0M                    JOB06162
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP18
//*********************************************************************
//*주의!!!!!
//*이　작업　수행시  테이블　해당　파티션　데이터　삭제
//*대상 TABLE : THKJL0131
//* %%GLOBAL  PARMGLB1
//* %%SET %%A = %%SUBSTR %%$ODATE 7 2
//*********************************************************************
//STEP01   EXEC PGM=DSNUTILB,PARM='DAPG,THKJL0131',COND=(4,LT)
//STEPLIB  DD DSN=DB2APS.DSND10.SDSNLOAD,DISP=SHR
//SW01WK01 DD UNIT=SYSALLDA,SPACE=(CYL,(3000,200),,,ROUND)
//SW02WK01 DD UNIT=SYSALLDA,SPACE=(CYL,(3000,200),,,ROUND)
//SW03WK01 DD UNIT=SYSALLDA,SPACE=(CYL,(3000,200),,,ROUND)
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(3000,200),,,ROUND)
//SORTOUT  DD UNIT=SYSALLDA,SPACE=(CYL,(3000,200),,,ROUND)
//PARTKJL  DD DUMMY
//SYSPRINT DD SYSOUT=*
//UTPRINT  DD SYSOUT=*
//SYSIN    DD *
 LOAD DATA
 LOG NO  NOCOPYPEND KEEPDICTIONARY
 INTO TABLE DB2DBA.THKJL0131
                   PART %%A INDDN PARTKJL RESUME NO REPLACE
/*
//*********************************************************************
//*  국외상품차주　익스포져　일집계자료생성
//*********************************************************************
//STEP02   EXEC JZBDEXEC,MBR=BJLI311,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP19-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
