//MKJLDP32 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* %%SET %%A = %%SUBSTR %%$ODATE 3 6
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDB31
//*********************************************************************
//*   그룹관리대상정보갱신(생성)
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD122,OPT=&SYSUID
//INFILE   DD DISP=OLD,DSN=KJL.SD.BJLD121.V001
//CHGLOG   DD DSN=KJL.PT.CHGLOG.MKJLD122.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP32-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
