//MKJLGD01 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* 지주사 리스크분석 일 DATA EAI NDM 전송
//*  %%GLOBAL  PARMGLB1
//*********************************************************************
//*-------  ZAPH(PA),ZABA,ZADA <-> EAI(NDM) RECE/SEND  JCL --------*/
//*-- (/*JOBPARM =PH  : ZAPH->PH, ZABA->BA, ZADA->DA )           --*/
//*-(PH:NDMPH.LINKLIB/NDMPH1.NETMAP/NDMPH1.MSG/NDM.PEAI.ETCP.PROC)-*/
//*-(BA:NDMBA.LINKLIB/NDMBA1.NETMAP/NDMBA1.MSG/NDM.PEAI.ETCP.PROC)-*/
//*-(DA:NDMDA.LINKLIB/NDMDA1.NETMAP/NDMDA1.MSG/NDM.TBAT.ETCP.PROC)-*/
//*-(UA:NDMPH.LINKLIB/NDMPH.NETMAP /NDMPH.MSG /NDM.UBAT.ETCP.PROC)-*/
//*----------------------------------------------------------------*/
//*-------------------------------------------------------------------*
//*   THKJL0127 TE차주익스포져중간일집계
//*-------------------------------------------------------------------*
//JL0127C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0127.EXPD12.G001.CHK -
    &TODSN="KB0_FBJ_EXP_D12_%%$ODATE.chk"
  SIGNOFF
/*
//JL0127D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0127.EXPD12.G001.DAT -
    &TODSN="KB0_FBJ_EXP_D12_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0129 TE차주일집계
//*-------------------------------------------------------------------*
//JL0129C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0129.EXPD13.G003.CHK -
    &TODSN="KB0_FBJ_EXP_D13_%%$ODATE.chk"
  SIGNOFF
/*
//JL0129D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0129.EXPD13.G003.DAT -
    &TODSN="KB0_FBJ_EXP_D13_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0031 TE간접익스포져일집계
//*-------------------------------------------------------------------*
//JL0031C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0031.EXPD14.G005.CHK -
    &TODSN="KB0_FBJ_EXP_D14_%%$ODATE.chk"
  SIGNOFF
/*
//JL0031D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0031.EXPD14.G005.DAT -
    &TODSN="KB0_FBJ_EXP_D14_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0135 TE계열기업군일집계
//*-------------------------------------------------------------------*
//JL0135C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0135.EXPD17.G008.CHK -
    &TODSN="KB0_FBJ_EXP_D17_%%$ODATE.chk"
  SIGNOFF
/*
//JL0135D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0135.EXPD17.G008.DAT -
    &TODSN="KB0_FBJ_EXP_D17_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0039 TE산업규모별일집계
//*-------------------------------------------------------------------*
//JL0039C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0039.EXPD19.G011.CHK -
    &TODSN="KB0_FBJ_EXP_D19_%%$ODATE.chk"
  SIGNOFF
/*
//JL0039D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0039.EXPD19.G011.DAT -
    &TODSN="KB0_FBJ_EXP_D19_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0064 SUB한도일집계
//*-------------------------------------------------------------------*
//JL0064C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0064.EXPD21.G013.CHK -
    &TODSN="KB0_FBJ_EXP_D21_%%$ODATE.chk"
  SIGNOFF
/*
//JL0064D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0064.EXPD21.G013.DAT -
    &TODSN="KB0_FBJ_EXP_D21_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0055 TE국별일집계
//*-------------------------------------------------------------------*
//JL0055C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0055.EXPD22.G015.CHK -
    &TODSN="KB0_FBJ_EXP_D22_%%$ODATE.chk"
  SIGNOFF
/*
//JL0055D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0055.EXPD22.G015.DAT -
    &TODSN="KB0_FBJ_EXP_D22_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0015 채무자고객기본
//*-------------------------------------------------------------------*
//JL0015C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0015.EXPD29.G018.CHK -
    &TODSN="KB0_FBJ_EXP_D29_%%$ODATE.chk"
  SIGNOFF
/*
//JL0015D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SD.KJL0015.EXPD29.G018.DAT -
    &TODSN="KB0_FBJ_EXP_D29_%%$ODATE.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   암호화전 SAMFILE DELETE
//*-------------------------------------------------------------------*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SD.KJL0127.EXPD12.G001.DATTMP3'
  DELETE  'KJL.SD.KJL0127.EXPD12.G001.DATTMP4'
  DELETE  'KJL.SD.KJL0129.EXPD13.G003.DATTMP3'
  DELETE  'KJL.SD.KJL0129.EXPD13.G003.DATTMP4'
  DELETE  'KJL.SD.KJL0031.EXPD14.G005.DATTMP3'
  DELETE  'KJL.SD.KJL0031.EXPD14.G005.DATTMP4'
  DELETE  'KJL.SD.KJL0055.EXPD22.G015.DATTMP3'
  DELETE  'KJL.SD.KJL0055.EXPD22.G015.DATTMP4'
  DELETE  'KJL.SD.KJL0015.EXPD29.G018.DATTMP3'
  DELETE  'KJL.SD.KJL0015.EXPD29.G018.DATTMP4'

  SET MAXCC=0
/*
//
