//MKJLZDL5 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=B,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제 처리
//*********************************************************************
//*   THKJL0026
//*********************************************************************
//BJLZ026  EXEC JZBDEXEC,MBR=BJLZ026,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ026.KJL0026.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL5-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ026.KJL0026.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ026.KJL0026,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0072
//*********************************************************************
//BJLZ072  EXEC JZBDEXEC,MBR=BJLZ072,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ072.KJL0072.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL5-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ072.KJL0072.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ072.KJL0072,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0073
//*********************************************************************
//BJLZ073  EXEC JZBDEXEC,MBR=BJLZ073,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ073.KJL0073.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL5-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ073.KJL0073.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ073.KJL0073,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR013
//*********************************************************************
//BJLZR13  EXEC JZBDEXEC,MBR=BJLZR13,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR13.KJLR013.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL5-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR13.KJLR013.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR13.KJLR013,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR014
//*********************************************************************
//BJLZR14  EXEC JZBDEXEC,MBR=BJLZR14,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR14.KJLR014.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL5-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR14.KJLR014.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR14.KJLR014,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//
