//MKJLDP20 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP19
//*********************************************************************
//*  국외영업점산업별TE현황 정보생성
//*********************************************************************
//STEP01   EXEC JZBDEXEC,MBR=BJLD911,OPT=&SYSUID,COND=(4,LT)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP20-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
