//MKJLMDL2 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=B,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제 처리
//*********************************************************************
//*   THKJL0001
//*********************************************************************
//BJL0001  EXEC JZBDEXEC,MBR=BJL0001,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0001.KJL0001.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP01   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0001.KJL0001.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0001.KJL0001,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0003
//*********************************************************************
//BJL0003  EXEC JZBDEXEC,MBR=BJL0003,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0003.KJL0003.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP02   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0003.KJL0003.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0003.KJL0003,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0004
//*********************************************************************
//BJL0004  EXEC JZBDEXEC,MBR=BJL0004,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0004.KJL0004.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP03   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0004.KJL0004.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0004.KJL0004,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0006
//*********************************************************************
//BJL0006  EXEC JZBDEXEC,MBR=BJL0006,OPT=&SYSUID,COND=(4,LT)
//INFILE2  DD DSN=KJL.SY.BJL0006.KJL0006.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP04   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0006.KJL0006.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0006.KJL0006,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0007
//*********************************************************************
//BJL0007  EXEC JZBDEXEC,MBR=BJL0007,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0007.KJL0007.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP05   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0007.KJL0007.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0007.KJL0007,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0008
//*********************************************************************
//BJL0008  EXEC JZBDEXEC,MBR=BJL0008,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0008.KJL0008.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP06   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0008.KJL0008.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0008.KJL0008,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0009
//*********************************************************************
//BJL0009  EXEC JZBDEXEC,MBR=BJL0009,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0009.KJL0009.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP07   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0009.KJL0009.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0009.KJL0009,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0010
//*********************************************************************
//BJL0010  EXEC JZBDEXEC,MBR=BJL0010,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0010.KJL0010.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP08   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0010.KJL0010.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0010.KJL0010,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0011
//*********************************************************************
//BJL0011  EXEC JZBDEXEC,MBR=BJL0011,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0011.KJL0011.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP09   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0011.KJL0011.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0011.KJL0011,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0014
//*********************************************************************
//BJL0014  EXEC JZBDEXEC,MBR=BJL0014,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0014.KJL0014.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP10   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0014.KJL0014.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0014.KJL0014,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0015
//*********************************************************************
//BJL0015  EXEC JZBDEXEC,MBR=BJL0015,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0015.KJL0015.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP11   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0015.KJL0015.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0015.KJL0015,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0016
//*********************************************************************
//BJL0016  EXEC JZBDEXEC,MBR=BJL0016,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0016.KJL0016.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP12   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0016.KJL0016.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0016.KJL0016,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0017
//*********************************************************************
//BJL0017  EXEC JZBDEXEC,MBR=BJL0017,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0017.KJL0017.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP13   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0017.KJL0017.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0017.KJL0017,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0020
//*********************************************************************
//BJL0020  EXEC JZBDEXEC,MBR=BJL0020,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0020.KJL0020.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP14   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0020.KJL0020.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0020.KJL0020,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0026
//*********************************************************************
//BJL0026  EXEC JZBDEXEC,MBR=BJL0026,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0026.KJL0026.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP17   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0026.KJL0026.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0026.KJL0026,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0028
//*********************************************************************
//BJL0028  EXEC JZBDEXEC,MBR=BJL0028,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0028.KJL0028.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP18   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0028.KJL0028.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0028.KJL0028,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0030
//*********************************************************************
//BJL0030  EXEC JZBDEXEC,MBR=BJL0030,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0030.KJL0030.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP19   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0030.KJL0030.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0030.KJL0030,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0032
//*********************************************************************
//BJL0032  EXEC JZBDEXEC,MBR=BJL0032,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0032.KJL0032.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP20   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0032.KJL0032.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0032.KJL0032,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0034
//*********************************************************************
//BJL0034  EXEC JZBDEXEC,MBR=BJL0034,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0034.KJL0034.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLMDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP21   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJL0034.KJL0034.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJL0034.KJL0034,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//
