//MKJLDB05 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 매일（휴일／영업일　무관）
//*선행작업명     : MKJLDP04
//*********************************************************************
//*    개인사업자/해외/외국인고객정보추출
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD151,OPT=&SYSUID
//OTFILE   DD DSN=KJL.SD.BJLD151.V001,
//            DISP=(OLD,CATLG,CATLG),
//            UNIT=SYSBA,
//            SPACE=(CYL,(1000,0500),RLSE),
//            DCB=(RECFM=FB)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDB05-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*    법인기본정보추출프로그램
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLD152,OPT=&SYSUID
//OTFILE   DD DSN=KJL.SD.BJLD152.V001,
//            DISP=(OLD,CATLG,CATLG),
//            UNIT=SYSBA,
//            SPACE=(CYL,(0100,0050),RLSE),
//            DCB=(RECFM=FB)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDB05-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
