//MKJLZDL2 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=B,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제 처리
//*********************************************************************
//*   THKJL0001
//*********************************************************************
//BJLZ001  EXEC JZBDEXEC,MBR=BJLZ001,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ001.KJL0001.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP01   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ001.KJL0001.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ001.KJL0001,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0002
//*********************************************************************
//BJLZ002  EXEC JZBDEXEC,MBR=BJLZ002,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ002.KJL0002.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP02   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ002.KJL0002.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ002.KJL0002,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0003
//*********************************************************************
//BJLZ003  EXEC JZBDEXEC,MBR=BJLZ003,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ003.KJL0003.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP03   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ003.KJL0003.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ003.KJL0003,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0004
//*********************************************************************
//BJLZ004  EXEC JZBDEXEC,MBR=BJLZ004,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ004.KJL0004.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP04   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ004.KJL0004.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ004.KJL0004,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0006
//*********************************************************************
//BJLZ006  EXEC JZBDEXEC,MBR=BJLZ006,OPT=&SYSUID,COND=(4,LT)
//INFILE2  DD DSN=KJL.SY.BJLZ006.KJL0006.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP06   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ006.KJL0006.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ006.KJL0006,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0007
//*********************************************************************
//BJLZ007  EXEC JZBDEXEC,MBR=BJLZ007,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ007.KJL0007.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP07   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ007.KJL0007.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ007.KJL0007,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0008
//*********************************************************************
//BJLZ008  EXEC JZBDEXEC,MBR=BJLZ008,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ008.KJL0008.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP08   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ008.KJL0008.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ008.KJL0008,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0009
//*********************************************************************
//BJLZ009  EXEC JZBDEXEC,MBR=BJLZ009,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ009.KJL0009.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP09   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ009.KJL0009.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ009.KJL0009,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0010
//*********************************************************************
//BJLZ010  EXEC JZBDEXEC,MBR=BJLZ010,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ010.KJL0010.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP10   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ010.KJL0010.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ010.KJL0010,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0011
//*********************************************************************
//BJLZ011  EXEC JZBDEXEC,MBR=BJLZ011,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ011.KJL0011.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP11   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ011.KJL0011.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ011.KJL0011,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0014
//*********************************************************************
//BJLZ014  EXEC JZBDEXEC,MBR=BJLZ014,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ014.KJL0014.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP14   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ014.KJL0014.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ014.KJL0014,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0015
//*********************************************************************
//BJLZ015  EXEC JZBDEXEC,MBR=BJLZ015,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ015.KJL0015.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP15   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ015.KJL0015.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ015.KJL0015,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0016
//*********************************************************************
//BJLZ016  EXEC JZBDEXEC,MBR=BJLZ016,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ016.KJL0016.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP16   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ016.KJL0016.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ016.KJL0016,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0017
//*********************************************************************
//BJLZ017  EXEC JZBDEXEC,MBR=BJLZ017,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ017.KJL0017.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP17   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ017.KJL0017.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ017.KJL0017,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0018
//*********************************************************************
//BJLZ018  EXEC JZBDEXEC,MBR=BJLZ018,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ018.KJL0018.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP18   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ018.KJL0018.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ018.KJL0018,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0020
//*********************************************************************
//BJLZ020  EXEC JZBDEXEC,MBR=BJLZ020,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ020.KJL0020.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP20   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ020.KJL0020.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ020.KJL0020,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0021
//*********************************************************************
//BJLZ021  EXEC JZBDEXEC,MBR=BJLZ021,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ021.KJL0021.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP21   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ021.KJL0021.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ021.KJL0021,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0024
//*********************************************************************
//BJLZ024  EXEC JZBDEXEC,MBR=BJLZ024,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ024.KJL0024.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP24   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ024.KJL0024.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ024.KJL0024,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0025
//*********************************************************************
//BJLZ025  EXEC JZBDEXEC,MBR=BJLZ025,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ025.KJL0025.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP25   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ025.KJL0025.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ025.KJL0025,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0027
//*********************************************************************
//BJLZ027  EXEC JZBDEXEC,MBR=BJLZ027,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ027.KJL0027.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP27   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ027.KJL0027.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ027.KJL0027,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0028
//*********************************************************************
//BJLZ028  EXEC JZBDEXEC,MBR=BJLZ028,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ028.KJL0028.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP28   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ028.KJL0028.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ028.KJL0028,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0031
//*********************************************************************
//BJLZ031  EXEC JZBDEXEC,MBR=BJLZ031,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ031.KJL0031.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP31   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ031.KJL0031.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ031.KJL0031,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0032
//*********************************************************************
//BJLZ032  EXEC JZBDEXEC,MBR=BJLZ032,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ032.KJL0032.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP32   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ032.KJL0032.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ032.KJL0032,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0033
//*********************************************************************
//BJLZ033  EXEC JZBDEXEC,MBR=BJLZ033,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ033.KJL0033.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP33   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ033.KJL0033.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ033.KJL0033,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0034
//*********************************************************************
//BJLZ034  EXEC JZBDEXEC,MBR=BJLZ034,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ034.KJL0034.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ034.KJL0034.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ034.KJL0034,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0040
//*********************************************************************
//BJLZ040  EXEC JZBDEXEC,MBR=BJLZ040,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ040.KJL0040.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP40   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ040.KJL0040.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ040.KJL0040,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0041
//*********************************************************************
//BJLZ041  EXEC JZBDEXEC,MBR=BJLZ041,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ041.KJL0041.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP41   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ041.KJL0041.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ041.KJL0041,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0042
//*********************************************************************
//BJLZ042  EXEC JZBDEXEC,MBR=BJLZ042,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ042.KJL0042.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP42   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ042.KJL0042.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ042.KJL0042,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0055
//*********************************************************************
//BJLZ055  EXEC JZBDEXEC,MBR=BJLZ055,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ055.KJL0055.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP55   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ055.KJL0055.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ055.KJL0055,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0058
//*********************************************************************
//BJLZ058  EXEC JZBDEXEC,MBR=BJLZ058,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ058.KJL0058.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP58   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ058.KJL0058.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ058.KJL0058,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0059
//*********************************************************************
//BJLZ059  EXEC JZBDEXEC,MBR=BJLZ059,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ059.KJL0059.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLDM3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP59   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ059.KJL0059.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ059.KJL0059,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0062
//*********************************************************************
//BJLZ062  EXEC JZBDEXEC,MBR=BJLZ062,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ062.KJL0062.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL2-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP62   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ062.KJL0062.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ062.KJL0062,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//
