//MKJLDB01 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 매일（휴일／영업일　무관）
//*선행작업명     : MKJLMP01
//*********************************************************************
//*   한신평기준그룹사정보추출
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD131,OPT=&SYSUID
//OTFILE   DD DSN=KJL.SD.BJLD131.V001,
//            DISP=(OLD,CATLG,CATLG),
//            UNIT=SYSBA,
//            SPACE=(CYL,(0100,0050),RLSE),
//            DCB=(RECFM=FB,LRECL=109)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDB01-001-ONLBAT-KB STAR-%%$DATE-BJLD131
//*자료기준년월일-작업직원번호
//*********************************************************************
//*   한신평기준계열사정보추출
//*********************************************************************
//STEP02  EXEC JZBDEXEC,MBR=BJLD141,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLD141.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0100,0050),RLSE),
//             DCB=(RECFM=FB,LRECL=135)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB01-001-ONLBAT-KB STAR-%%$DATE-BJLD141
//*자료기준년월일-작업직원번호
