//MKJLDP34 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* %%SET %%A = %%$WCALC %%$ODATE -1 WORKDAYS
//* %%SET %%B = %%SUBSTR %%$ODATE 3 6
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP33,MKIH8501
//*********************************************************************
//*  산업별규모별등급별익스포져일집계자료추출
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD661,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP34-001-ONLBAT-KB STAR-%%$ODATE-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*  산업별규모별익스포져일집계자료추출（경기민감업종기업규모별）
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLD671,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP34-001-ONLBAT-KB STAR-%%$ODATE-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*  산업별규모별익스포져일집계자료갱신（한도초과일／예외적용일）
//*********************************************************************
//STEP03 EXEC JZBDEXEC,MBR=BJLD674,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.PT.CHGLOG.MKJLD674.D%%B.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP34-001-ONLBAT-KB STAR-%%$ODATE-%%A
//*자료기준년월일
//
