//MKJLRMS1 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//********************************************************************/
//*                   배치실행JCL                                  */
//*********************************************************************
//*배치작업기준일 :영업일                                        */
//*선행작업명     : MKJLSNDH                                       */
//*********************************************************************
//*   그룹관리한도원장UNLOAD - 지주사　제공자료                  */
//********************************************************************/
//STEP01   EXEC PGM=INZUTILB,REGION=0M,DYNAMNBR=99,
//         PARM='DAPG,KJL0012'
//STEPLIB  DD  DSN=DB2APS.DSND10.SDSNEXIT,DISP=SHR
//         DD  DSN=DB2APS.DSND10.SDSNLOAD,DISP=SHR
//UNLDDN1  DD  DSN=KJL.SD.SHRRMS.SKJL0012.P00001,DISP=OLD
//LOADDDN1 DD  SYSOUT=*
//*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
     UNLOAD TABLESPACE
     DB2 NO LOCK NO
     QUIESCE NO  QUIESCECAT NO
     OPTIONS LENGTHBYTE NO
      SELECT 그룹회사코드
           , 기준년월
           , 계열기업군코드
           , 그룹사신용등급구분
           , 신용평가년월일
           ,  SUBSTR(CHAR(기준한도),2,15)
           , 기준한도산출년월일
           ,  SUBSTR(CHAR(관리한도),2,15)
           , 관리한도설정년월일
           , 관리한도유효년월일
           ,  SUBSTR(CHAR(여신성관리한도),2,15)
           ,  SUBSTR(CHAR(시장성관리한도),2,15)
           , 시스템최종처리일시
           , 시스템최종사용자번호
        FROM  DB2DBA.THKJL0012
       WHERE 그룹회사코드= 'KB0'
         AND 기준년월    = '%%$OYEAR.%%OMONTH'
     OUTDDN (UNLDDN1)
      FORMAT USER()
/*
