//MKJLZDL3 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=B,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제 처리
//*********************************************************************
//*   THKJL0071
//*********************************************************************
//BJLZ071  EXEC JZBDEXEC,MBR=BJLZ071,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ071.KJL0071.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP71   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ071.KJL0071.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ071.KJL0071,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0074
//*********************************************************************
//BJLZ074  EXEC JZBDEXEC,MBR=BJLZ074,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ074.KJL0074.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP74   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ074.KJL0074.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ074.KJL0074,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0075
//*********************************************************************
//BJLZ075  EXEC JZBDEXEC,MBR=BJLZ075,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ075.KJL0075.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP75   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ075.KJL0075.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ075.KJL0075,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0076
//*********************************************************************
//BJLZ076  EXEC JZBDEXEC,MBR=BJLZ076,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ076.KJL0076.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP76   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ076.KJL0076.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ076.KJL0076,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0077
//*********************************************************************
//BJLZ077  EXEC JZBDEXEC,MBR=BJLZ077,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ077.KJL0077.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP77   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ077.KJL0077.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ077.KJL0077,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0078
//*********************************************************************
//BJLZ078  EXEC JZBDEXEC,MBR=BJLZ078,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ078.KJL0078.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP78   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ078.KJL0078.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ078.KJL0078,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0081
//*********************************************************************
//BJLZ081  EXEC JZBDEXEC,MBR=BJLZ081,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ081.KJL0081.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP81   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ081.KJL0081.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ081.KJL0081,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0082
//*********************************************************************
//BJLZ082  EXEC JZBDEXEC,MBR=BJLZ082,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ082.KJL0082.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP82   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ082.KJL0082.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ082.KJL0082,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0083
//*********************************************************************
//BJLZ083  EXEC JZBDEXEC,MBR=BJLZ083,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ083.KJL0083.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP83   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ083.KJL0083.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ083.KJL0083,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0084
//*********************************************************************
//BJLZ084  EXEC JZBDEXEC,MBR=BJLZ084,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ084.KJL0084.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP84   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ084.KJL0084.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ084.KJL0084,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0125
//*********************************************************************
//BJLZ125  EXEC JZBDEXEC,MBR=BJLZ125,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ125.KJL0125.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP125  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ125.KJL0125.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ125.KJL0125,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0126
//*********************************************************************
//BJLZ126  EXEC JZBDEXEC,MBR=BJLZ126,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ126.KJL0126.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP126  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ126.KJL0126.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ126.KJL0126,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0127
//*********************************************************************
//BJLZ127  EXEC JZBDEXEC,MBR=BJLZ127,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ127.KJL0127.D%%ODATE,DISP=SHR
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP127  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ127.KJL0127.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ127.KJL0127,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0128
//*********************************************************************
//BJLZ128  EXEC JZBDEXEC,MBR=BJLZ128,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ128.KJL0128.D%%ODATE,DISP=SHR
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP128  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ128.KJL0128.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ128.KJL0128,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0129
//*********************************************************************
//BJLZ129  EXEC JZBDEXEC,MBR=BJLZ129,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ129.KJL0129.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP129  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ129.KJL0129.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ129.KJL0129,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0130
//*********************************************************************
//BJLZ130  EXEC JZBDEXEC,MBR=BJLZ130,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ130.KJL0130.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP130  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ130.KJL0130.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ130.KJL0130,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0131
//*********************************************************************
//BJLZ131  EXEC JZBDEXEC,MBR=BJLZ131,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ131.KJL0131.D%%ODATE,DISP=SHR
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP131  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ131.KJL0131.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ131.KJL0131,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0132
//*********************************************************************
//BJLZ132  EXEC JZBDEXEC,MBR=BJLZ132,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ132.KJL0132.D%%ODATE,DISP=SHR
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP132  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ132.KJL0132.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ132.KJL0132,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0151
//*********************************************************************
//BJLZ151  EXEC JZBDEXEC,MBR=BJLZ151,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ151.KJL0151.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP151  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ151.KJL0151.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ151.KJL0151,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0152
//*********************************************************************
//BJLZ152  EXEC JZBDEXEC,MBR=BJLZ152,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ152.KJL0152.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP152  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ152.KJL0152.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ152.KJL0152,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0153
//*********************************************************************
//BJLZ153  EXEC JZBDEXEC,MBR=BJLZ153,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ153.KJL0153.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP153  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ153.KJL0153.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ153.KJL0153,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0161
//*********************************************************************
//BJLZ161  EXEC JZBDEXEC,MBR=BJLZ161,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZ161.KJL0161.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP161  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ161.KJL0161.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ161.KJL0161,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0162
//*********************************************************************
//BJLZ162  EXEC JZBDEXEC,MBR=BJLZ162,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZ162.KJL0162.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP162  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ162.KJL0162.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ162.KJL0162,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLG001
//*********************************************************************
//BJLZG01  EXEC JZBDEXEC,MBR=BJLZG01,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZG01.KJLG001.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPG01  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZG01.KJLG001.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZG01.KJLG001,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR003
//*********************************************************************
//BJLZR03  EXEC JZBDEXEC,MBR=BJLZR03,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR03.KJLR003.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR03  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR03.KJLR003.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR03.KJLR003,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR004
//*********************************************************************
//BJLZR04  EXEC JZBDEXEC,MBR=BJLZR04,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR04.KJLR004.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR04  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR04.KJLR004.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR04.KJLR004,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR005
//*********************************************************************
//BJLZR05  EXEC JZBDEXEC,MBR=BJLZR05,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR05.KJLR005.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR05  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR05.KJLR005.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR05.KJLR005,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR006
//*********************************************************************
//BJLZR06  EXEC JZBDEXEC,MBR=BJLZR06,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR06.KJLR006.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR06  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR06.KJLR006.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR06.KJLR006,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR007
//*********************************************************************
//BJLZR07  EXEC JZBDEXEC,MBR=BJLZR07,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR07.KJLR007.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR07  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR07.KJLR007.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR07.KJLR007,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR009
//*********************************************************************
//BJLZR09  EXEC JZBDEXEC,MBR=BJLZR09,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR09.KJLR009.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR09  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR09.KJLR009.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR09.KJLR009,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR011
//*********************************************************************
//BJLZR11  EXEC JZBDEXEC,MBR=BJLZR11,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR11.KJLR011.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR11  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR11.KJLR011.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR11.KJLR011,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR012
//*********************************************************************
//BJLZR12  EXEC JZBDEXEC,MBR=BJLZR12,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR12.KJLR012.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR12  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR12.KJLR012.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR12.KJLR012,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR017
//*********************************************************************
//BJLZR17  EXEC JZBDEXEC,MBR=BJLZR17,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR17.KJLR017.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR17  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR17.KJLR017.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR17.KJLR017,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR019
//*********************************************************************
//BJLZR19  EXEC JZBDEXEC,MBR=BJLZR19,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR19.KJLR019.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPR19  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR19.KJLR019.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR19.KJLR019,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLRM05
//*********************************************************************
//BJLZRM5  EXEC JZBDEXEC,MBR=BJLZRM5,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZRM5.KJLRM05.D%%ODATE,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEPRM5  EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZRM5.KJLRM05.D%%ODATE,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZRM5.KJLRM05,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//
