//MKJLD151 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=B,MSGCLASS=X
//*********************************************************************
//*주의!!!!!
//*이　작업　수행시  테이블　해당　파티션　데이터　삭제
//*채무자고객기본 일정보 (THKJL0151)생성
//* %%GLOBAL  PARMGLB1
//* %%SET %%A = %%SUBSTR %%$ODATE 7 2
//*********************************************************************
//DELETE1  EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SD.KJL0151.LOAD'

  SET MAXCC=0
/*
//SORT1    EXEC PGM=ICEMAN,COND=(4,LT)
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=KJL.SD.SHRTAA.SKJL0015.P00001,DISP=SHR
//SORTOUT  DD DSN=KJL.SD.KJL0151.LOAD,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(3000,1000),RLSE),
//            UNIT=SYSPA,DCB=(RECFM=FB,LRECL=325,BLKSIZE=0)
//SORTWK01 DD UNIT=SYSPA,SPACE=(CYL,(3000,1000))
//SORTWK02 DD UNIT=SYSPA,SPACE=(CYL,(3000,1000))
//SORTWK03 DD UNIT=SYSPA,SPACE=(CYL,(3000,1000))
//SORTWK04 DD UNIT=SYSPA,SPACE=(CYL,(3000,1000))
//SORTWK05 DD UNIT=SYSPA,SPACE=(CYL,(3000,1000))
//SYSIN    DD *
  SORT   FIELDS=COPY
  OUTREC FIELDS=(1,3,C'%%A',C'%%$OYEAR.%%OMONTH',4,314)
  END
/*
//*********************************************************************
//*THKJL0151 LOAD
//*********************************************************************
//STEP02   EXEC DSNUPROC,PARM='DAPG,KJL0151',COND=(4,LT)
//DSNTRACE DD  SYSOUT=*
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//DFSPARM  DD  DSN=SYS1.PARMLIB(DFSPARMH),DISP=SHR
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SORTOUT  DD  UNIT=SYSDA,SPACE=(CYL,(3000,200),RLSE)
//SYSPRINT DD  SYSOUT=*
//SYSREC01 DD  DSN=KJL.SD.KJL0151.LOAD,DISP=SHR
//SYSIN    DD *
  LOAD DATA LOG NO
  NOCOPYPEND
  INDDN SYSREC01 INTO TABLE
      DB2DBA.THKJL0151
      PART %%A RESUME NO REPLACE
/*
//
