//MKJLDP33 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* %%GLOBAL  PARMGLB1
//* %%SET %%A = %%SUBSTR %%$ODATE 3 6
//* %%SET %%B = %%SUBSTR %%$ODATE 7 2
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP22 / MKJLDP32
//*********************************************************************
//*********************************************************************
//*   TE관리대상차주추가(추출)
//*********************************************************************
//STEP05   EXEC JZBDEXEC,MBR=BJLD111,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLD111.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   채무자고객정보변경
//*********************************************************************
//STEP06   EXEC JZBDEXEC,MBR=BJLD154,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLD154.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   EAD그룹익스포져일정보생성
//*********************************************************************
//STEP07   EXEC JZBDEXEC,MBR=BJLI351,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   산업등급별TE현황자료추출
//*********************************************************************
//STEP08   EXEC JZBDEXEC,MBR=BJLD391,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   한도관리최고한도산업등급별TE현황추출
//*********************************************************************
//STEP09   EXEC JZBDEXEC,MBR=BJLD601,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*     EAD한도초과업체명세정보생성
//*********************************************************************
//STEP10   EXEC JZBDEXEC,MBR=BJLD611,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLD611.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP33-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
