//MKJLGM01 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* 지주사 리스크분석 월 DATA EAI NDM 전송
//*  %%GLOBAL  PARMGLB1
//*  %%SET %%A = %%MEND%%$OYEAR.%%OMONTH
//*  %%SET %%B = %%SUBSTR %%A 1 6
//*********************************************************************
//*-------  ZAPH(PA),ZABA,ZADA <-> EAI(NDM) RECE/SEND  JCL --------*/
//*-- (/*JOBPARM =PH  : ZAPH->PH, ZABA->BA, ZADA->DA )           --*/
//*-(PH:NDMPH.LINKLIB/NDMPH1.NETMAP/NDMPH1.MSG/NDM.PEAI.ETCP.PROC)-*/
//*-(BA:NDMBA.LINKLIB/NDMBA1.NETMAP/NDMBA1.MSG/NDM.PEAI.ETCP.PROC)-*/
//*-(DA:NDMDA.LINKLIB/NDMDA1.NETMAP/NDMDA1.MSG/NDM.TBAT.ETCP.PROC)-*/
//*-(UA:NDMPH.LINKLIB/NDMPH.NETMAP /NDMPH.MSG /NDM.UBAT.ETCP.PROC)-*/
//*----------------------------------------------------------------*/
//*-------------------------------------------------------------------*
//*   THKJL0128 TE차주익스포져중간월집계
//*-------------------------------------------------------------------*
//JL0128C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0128.EXPM12.G002.CHK -
    &TODSN="KB0_FBJ_EXP_M12_%%B.chk"
  SIGNOFF
/*
//JL0128D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0128.EXPM12.G002.DAT -
    &TODSN="KB0_FBJ_EXP_M12_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0130 TE차주월집계
//*-------------------------------------------------------------------*
//JL0130C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0130.EXPM13.G004.CHK -
    &TODSN="KB0_FBJ_EXP_M13_%%B.chk"
  SIGNOFF
/*
//JL0130D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0130.EXPM13.G004.DAT -
    &TODSN="KB0_FBJ_EXP_M13_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0032 간접익스포져월집계
//*-------------------------------------------------------------------*
//JL0032C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0032.EXPM14.G006.CHK -
    &TODSN="KB0_FBJ_EXP_M14_%%B.chk"
  SIGNOFF
/*
//JL0032D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0032.EXPM14.G006.DAT -
    &TODSN="KB0_FBJ_EXP_M14_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0011 TE차주관리한도
//*-------------------------------------------------------------------*
//JL0011C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0011.EXPM15.G007.CHK -
    &TODSN="KB0_FBJ_EXP_M15_%%B.chk"
  SIGNOFF
/*
//JL0011D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0011.EXPM15.G007.DAT -
    &TODSN="KB0_FBJ_EXP_M15_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0136 TE계열기업군월집계
//*-------------------------------------------------------------------*
//JL0136C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0136.EXPM17.G009.CHK -
    &TODSN="KB0_FBJ_EXP_M17_%%B.chk"
  SIGNOFF
/*
//JL0136D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0136.EXPM17.G009.DAT -
    &TODSN="KB0_FBJ_EXP_M17_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0012 TE계열기업군관리한도
//*-------------------------------------------------------------------*
//JL0012C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0012.EXPM18.G010.CHK -
    &TODSN="KB0_FBJ_EXP_M18_%%B.chk"
  SIGNOFF
/*
//JL0012D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0012.EXPM18.G010.DAT -
    &TODSN="KB0_FBJ_EXP_M18_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0039 TE산업규모별월집계
//*-------------------------------------------------------------------*
//JL0039C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0039.EXPM19.G012.CHK -
    &TODSN="KB0_FBJ_EXP_M19_%%B.chk"
  SIGNOFF
/*
//JL0039D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0039.EXPM19.G012.DAT -
    &TODSN="KB0_FBJ_EXP_M19_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0064 TE한도월집계
//*-------------------------------------------------------------------*
//JL0064C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0064.EXPM21.G014.CHK -
    &TODSN="KB0_FBJ_EXP_M21_%%B.chk"
  SIGNOFF
/*
//JL0064D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0064.EXPM21.G014.DAT -
    &TODSN="KB0_FBJ_EXP_M21_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0055 TE국별월집계
//*-------------------------------------------------------------------*
//JL0055C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0055.EXPM22.G016.CHK -
    &TODSN="KB0_FBJ_EXP_M22_%%B.chk"
  SIGNOFF
/*
//JL0055D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0055.EXPM22.G016.DAT -
    &TODSN="KB0_FBJ_EXP_M22_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0056 TE국별관리한도
//*-------------------------------------------------------------------*
//JL0056C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0056.EXPM23.G017.CHK -
    &TODSN="KB0_FBJ_EXP_M23_%%B.chk"
  SIGNOFF
/*
//JL0056D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0056.EXPM23.G017.DAT -
    &TODSN="KB0_FBJ_EXP_M23_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0014 계열사기본
//*-------------------------------------------------------------------*
//JL0014C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0014.EXPM27.G019.CHK -
    &TODSN="KB0_FBJ_EXP_M27_%%B.chk"
  SIGNOFF
/*
//JL0014D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0014.EXPM27.G019.DAT -
    &TODSN="KB0_FBJ_EXP_M27_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0013 그룹사기본
//*-------------------------------------------------------------------*
//JL0013C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0013.EXPM28.G020.CHK -
    &TODSN="KB0_FBJ_EXP_M28_%%B.chk"
  SIGNOFF
/*
//JL0013D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0013.EXPM28.G020.DAT -
    &TODSN="KB0_FBJ_EXP_M28_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0019 간접익스포져상품코드목록
//*-------------------------------------------------------------------*
//JL0019C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0019.EXPM24.G021.CHK -
    &TODSN="KB0_FBJ_EXP_M24_%%B.chk"
  SIGNOFF
/*
//JL0019D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0019.EXPM24.G021.DAT -
    &TODSN="KB0_FBJ_EXP_M24_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0044 표준산업분류코드
//*-------------------------------------------------------------------*
//JL0044C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0044.EXPM25.G022.CHK -
    &TODSN="KB0_FBJ_EXP_M25_%%B.chk"
  SIGNOFF
/*
//JL0044D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0044.EXPM25.G022.DAT -
    &TODSN="KB0_FBJ_EXP_M25_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   THKJL0118 TE상품코드목록
//*-------------------------------------------------------------------*
//JL0118C   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0118.EXPM26.G023.CHK -
    &TODSN="KB0_FBJ_EXP_M26_%%B.chk"
  SIGNOFF
/*
//JL0118D   EXEC PGM=DMBATCH,PARM=(YYSLYNN)
//STEPLIB   DD DISP=SHR,DSN=MVS.NDMBA.LINKLIB
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA1.NETMAP
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA1.MSG
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BEAI.EGIP.PROC
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
  SIGNON USERID=(C160491) CASE=YES ESF=NO
  SUBMIT PROC=MKIBJIJU MAXDELAY=UNLIMITED -
    &FRDSN=KJL.SM.KJL0118.EXPM26.G023.DAT -
    &TODSN="KB0_FBJ_EXP_M26_%%B.dat"
  SIGNOFF
/*
//*-------------------------------------------------------------------*
//*   암호화전 SAMFILE DELETE
//*-------------------------------------------------------------------*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SM.KJL0128.EXPM12.G002.DATTMP3'
  DELETE  'KJL.SM.KJL0128.EXPM12.G002.DATTMP4'
  DELETE  'KJL.SM.KJL0130.EXPM13.G004.DATTMP3'
  DELETE  'KJL.SM.KJL0130.EXPM13.G004.DATTMP4'
  DELETE  'KJL.SM.KJL0032.EXPM14.G006.DATTMP3'
  DELETE  'KJL.SM.KJL0032.EXPM14.G006.DATTMP4'
  DELETE  'KJL.SM.KJL0011.EXPM15.G007.DATTMP3'
  DELETE  'KJL.SM.KJL0011.EXPM15.G007.DATTMP4'
  DELETE  'KJL.SM.KJL0055.EXPM22.G016.DATTMP3'
  DELETE  'KJL.SM.KJL0055.EXPM22.G016.DATTMP4'
  DELETE  'KJL.SM.KJL0014.EXPM27.G019.DATTMP3'
  DELETE  'KJL.SM.KJL0014.EXPM27.G019.DATTMP4'

  SET MAXCC=0
/*
//
