//MKJLDP23 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP06 / MKJLDP12
//*********************************************************************
//*   국별익스포져(국외점포)계좌추출
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD551,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(KBTS-외화주식)계좌추출
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLD552,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLD552.D%%ODATE.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(KBTS-외화채권（개별여신））계좌추출
//*********************************************************************
//STEP03 EXEC JZBDEXEC,MBR=BJLD553,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(KBTS-외화파생상품)계좌추출
//*********************************************************************
//STEP04 EXEC JZBDEXEC,MBR=BJLD554,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(KBTS-외화채권（한도／건별여신））계좌추출
//*********************************************************************
//STEP05 EXEC JZBDEXEC,MBR=BJLD555,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(CMBS-연결회계수익증권)계좌추출
//*********************************************************************
//STEP06 EXEC JZBDEXEC,MBR=BJLD556,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별익스포져(국별수기관리)계좌추출
//*********************************************************************
//STEP07 EXEC JZBDEXEC,MBR=BJLD558,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   국별부점별익스포져생성
//*********************************************************************
//STEP08 EXEC JZBDEXEC,MBR=BJLD571,OPT=&SYSUID
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP23-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
