//MKJLDB11 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : 일자전환
//*********************************************************************
//*   EAD여신계좌(외환계정제외)추출
//*********************************************************************
//STEP01  EXEC JZBDEXEC,MBR=BJLI251,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLI251.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0100,0050),RLSE),
//             DCB=(RECFM=FB,LRECL=320)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB11-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   EAD여신계좌(외환계정만)추출
//*********************************************************************
//STEP02  EXEC JZBDEXEC,MBR=BJLI253,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLI253.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0050,0030),RLSE),
//             DCB=(RECFM=FB,LRECL=320)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB11-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   EAD한도계좌추출
//*********************************************************************
//STEP03  EXEC JZBDEXEC,MBR=BJLI254,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLI254.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0050,0030),RLSE),
//             DCB=(RECFM=FB,LRECL=320)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB11-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   EAD매출채권계좌추출
//*********************************************************************
//STEP04  EXEC JZBDEXEC,MBR=BJLI255,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLI255.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0050,0030),RLSE),
//             DCB=(RECFM=FB,LRECL=320)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB11-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
//*********************************************************************
//*   EAD가지급금,미수금계정추출
//*********************************************************************
//STEP05  EXEC JZBDEXEC,MBR=BJLI256,OPT=&SYSUID
//OTFILE    DD DSN=KJL.SD.BJLI256.V001,
//             DISP=(OLD,CATLG,CATLG),
//             UNIT=SYSBA,
//             SPACE=(CYL,(0050,0030),RLSE),
//             DCB=(RECFM=FB,LRECL=320)
//SYSIN     DD *
KB0-%%$ODATE-MKJLDB11-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
