//MKJLNDM2 JOB ,'M V S',CLASS=B,MSGCLASS=X,REGION=0M
//*---------------------------------------------*
//*  지주사모니터링시스템에자료전송하는ＮＤＭ *
//*  FROM : ZABA                                *
//*  TO   : FEFMAPO2                            *
//*---------------------------------------------*
//NDMPROC  EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0015.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0001_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0018.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0002_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0019.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0003_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0029.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0004_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0031.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0005_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0013.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0006_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0014.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0007_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0039.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0009_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0044.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0010_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0055.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0011_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0056.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0012_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0033.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0013_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0000.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0000_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0118.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0014_D_%%$ODATE.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0129.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0015_D_%%$ODATE.dat
 SIGNOFF
/*
//
