//MKJLDP21 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* %%SET %%A = %%SUBSTR %%$ODATE 3 6
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : MKJLDP18
//*********************************************************************
//*   포괄신용공여대상계좌정보 추가 추출(별도전결권 적용계좌)
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD211,OPT=&SYSUID
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLD221.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP21-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
