//MKJLDP39 JOB (Z-KESA),CLASS=B,MSGCLASS=X
//*********************************************************************
//* 관리한도설정대상차주　한도　및ＴＥ현황(ASTAMS 제공)
//*********************************************************************
//STEP01  EXEC JZBDEXEC,MBR=BJLD113,OPT=&SYSUID,COND=(4,LT)
//INFILE  DD DSN=KJL.SD.SHRCTK.BJLD113.INPUT,DISP=SHR
//OTFILE  DD DSN=KJL.SD.SHRCTK.BJLD113.OUTPUT,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP39-001-ONLBAT-KB STAR-%%$ODATE-&SYSUID
//*자료기준년월일-작업직원번호

