//TKJLSCP2 JOB CLASS=T,MSGCLASS=X,NOTIFY=&SYSUID,REGION=0M
//*********************************************************************
//*  %%GLOBAL  PARMGLB1
//*  %%SET %%A = %%MEND%%$OYEAR.%%OMONTH
//*  %%SET %%B = %%SUBSTR %%A 3 6
//*********************************************************************
//*-------------------------------------------------------------
//*  << 주민등록번호　검색 UTIL - ZABA 파일검색 >>
//*-------------------------------------------------------------
//STEP01   EXEC PGM=SCPSRCH,
//         PARM='SUM,16:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0073.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP02   EXEC PGM=SCPSRCH,
//         PARM='SUM,38:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0074.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP03   EXEC PGM=SCPSRCH,
//         PARM='SUM,38:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0074.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP04   EXEC PGM=SCPSRCH,
//         PARM='SUM,38:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0075.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP05   EXEC PGM=SCPSRCH,
//         PARM='SUM,37:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0118.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP06   EXEC PGM=SCPSRCH,
//         PARM='SUM,16:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0125.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP07   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0126.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP08   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0126.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP09   EXEC PGM=SCPSRCH,
//         PARM='SUM,36:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0127.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP10   EXEC PGM=SCPSRCH,
//         PARM='SUM,36:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0127.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP11   EXEC PGM=SCPSRCH,
//         PARM='SUM,34:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0128.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP12   EXEC PGM=SCPSRCH,
//         PARM='SUM,34:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0129.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP13   EXEC PGM=SCPSRCH,
//         PARM='SUM,34:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0129.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP14   EXEC PGM=SCPSRCH,
//         PARM='SUM,32:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0130.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP15   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0136.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP16   EXEC PGM=SCPSRCH,
//         PARM='SUM,20:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0136.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP17   EXEC PGM=SCPSRCH,
//         PARM='SUM,9:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.UNLOAD.KJL0013.MBFD06
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP18   EXEC PGM=SCPSRCH,
//         PARM='SUM,9:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.UNLOAD.KJL0014.MBFD07
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP23   EXEC PGM=SCPSRCH,
//         PARM='SUM,72:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.BJLI25C.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP24   EXEC PGM=SCPSRCH,
//         PARM='SUM,72:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.BJLI25D.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP25   EXEC PGM=SCPSRCH,
//         PARM='SUM,72:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.BJLI25I.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP26   EXEC PGM=SCPSRCH,
//         PARM='SUM,72:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.BJLI25J.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP27   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0011.EXPM15.G007.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP28   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0011.EXPM15.G007.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP29   EXEC PGM=SCPSRCH,
//         PARM='SUM,8:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0011.EXPM15.G007.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP31   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0012.EXPM18.G010.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP32   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0012.EXPM18.G010.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP33   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0012.EXPM18.G010.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP34   EXEC PGM=SCPSRCH,
//         PARM='SUM,8:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0012.EXPM18.G010.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP35   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0013.EXPM28.G020.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP36   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0013.EXPM28.G020.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP37   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0013.EXPM28.G020.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP38   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0013.EXPM28.G020.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP39   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0014.EXPM27.G019.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP40   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0014.EXPM27.G019.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP41   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0014.EXPM27.G019.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP43   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0019.EXPM24.G021.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP44   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0019.EXPM24.G021.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP45   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0019.EXPM24.G021.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP46   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0019.EXPM24.G021.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP47   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0032.EXPM14.G006.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP48   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0032.EXPM14.G006.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP49   EXEC PGM=SCPSRCH,
//         PARM='SUM,7:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0032.EXPM14.G006.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP51   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0039.EXPM19.G012.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP52   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0039.EXPM19.G012.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP53   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0039.EXPM19.G012.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP54   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0039.EXPM19.G012.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP55   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0044.EXPM25.G022.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP56   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0044.EXPM25.G022.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP57   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0044.EXPM25.G022.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP58   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0044.EXPM25.G022.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP59   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0055.EXPM22.G016.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP60   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0055.EXPM22.G016.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP61   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0055.EXPM22.G016.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP63   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0056.EXPM23.G017.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP64   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0056.EXPM23.G017.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP65   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0056.EXPM23.G017.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP66   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0056.EXPM23.G017.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP67   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0064.EXPM21.G014.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP68   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0064.EXPM21.G014.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP69   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0064.EXPM21.G014.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP70   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0064.EXPM21.G014.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP71   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0118.EXPM26.G023.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP72   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0118.EXPM26.G023.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP73   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0118.EXPM26.G023.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP74   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0118.EXPM26.G023.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP75   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0128.EXPM12.G002.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP76   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0128.EXPM12.G002.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP77   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0128.EXPM12.G002.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP79   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0130.EXPM13.G004.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP80   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0130.EXPM13.G004.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP81   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0130.EXPM13.G004.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP83   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0136.EXPM17.G009.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP84   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0136.EXPM17.G009.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP85   EXEC PGM=SCPSRCH,
//         PARM='SUM,1:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0136.EXPM17.G009.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP86   EXEC PGM=SCPSRCH,
//         PARM='SUM,12:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.KJL0136.EXPM17.G009.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP87   EXEC PGM=SCPSRCH,
//         PARM='SUM,4:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SM.UNLOAD.KJLG001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP88   EXEC PGM=SCPSRCH,
//         PARM='SUM,20:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SY.BJLD153.V001.D%%B
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//
