//TKJLTSIN JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*      수시　배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : 없음
//*********************************************************************
//*   신용공여차주별집계원장추출
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLD331,OPT=&SYSUID
//SYSIN    DD *
KB0-20101029-MKJLDP24-001-ONLBAT-KB STAR-20101029
//*자료기준년월일
//*********************************************************************
//*   신용공여그룹별집계원장추출
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLD371,OPT=&SYSUID
//SYSIN    DD *
KB0-20101029-MKJLDP24-001-ONLBAT-KB STAR-20101029
//*자료기준년월일
//*********************************************************************
//*   거액신용공여정보원장추출
//*********************************************************************
//STEP03 EXEC JZBDEXEC,MBR=BJLD411,OPT=&SYSUID
//SYSIN    DD *
KB0-20101029-MKJLDP24-001-ONLBAT-KB STAR-20101029
//*자료기준년월일
//*********************************************************************
//*   신용공여초과대상업체추출
//*********************************************************************
//STEP04 EXEC JZBDEXEC,MBR=BJLD401,OPT=&SYSUID
//SYSIN    DD *
KB0-20101029-MKJLDP24-001-ONLBAT-KB STAR-20101029
//*자료기준년월일
