//TKJLZDL3 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제 처리
//*********************************************************************
//*   THKJL0071
//*********************************************************************
//BJLZ071  EXEC JZBDEXEC,MBR=BJLZ071,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ071.KJL0071.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ071.KJL0071.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ071.KJL0071,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0072
//*********************************************************************
//BJLZ072  EXEC JZBDEXEC,MBR=BJLZ072,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ072.KJL0072.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ072.KJL0072.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ072.KJL0072,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0073
//*********************************************************************
//BJLZ073  EXEC JZBDEXEC,MBR=BJLZ073,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJLZ073.KJL0073.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP30   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ073.KJL0073.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ073.KJL0073,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0074
//*********************************************************************
//BJLZ074  EXEC JZBDEXEC,MBR=BJLZ074,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ074.KJL0074.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP31   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ074.KJL0074.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ074.KJL0074,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0075
//*********************************************************************
//BJLZ075  EXEC JZBDEXEC,MBR=BJLZ075,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ075.KJL0075.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP31   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ075.KJL0075.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ075.KJL0075,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0125
//*********************************************************************
//BJLZ125  EXEC JZBDEXEC,MBR=BJLZ125,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ125.KJL0125.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP32   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ125.KJL0125.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ125.KJL0125,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0126
//*********************************************************************
//BJLZ126  EXEC JZBDEXEC,MBR=BJLZ126,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ126.KJL0126.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP32   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ126.KJL0126.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ126.KJL0126,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0127
//*********************************************************************
//BJLZ127  EXEC JZBDEXEC,MBR=BJLZ127,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ127.KJL0127.D000101,DISP=SHR
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP33   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ127.KJL0127.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ127.KJL0127,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0128
//*********************************************************************
//BJLZ128  EXEC JZBDEXEC,MBR=BJLZ128,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ128.KJL0128.D000101,DISP=SHR
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP33   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ128.KJL0128.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ128.KJL0128,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0129
//*********************************************************************
//BJLZ129  EXEC JZBDEXEC,MBR=BJLZ129,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ129.KJL0129.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ129.KJL0129.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ129.KJL0129,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0130
//*********************************************************************
//BJLZ130  EXEC JZBDEXEC,MBR=BJLZ130,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ130.KJL0130.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ130.KJL0130.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ130.KJL0130,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0151
//*********************************************************************
//BJLZ151  EXEC JZBDEXEC,MBR=BJLZ151,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ151.KJL0151.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ151.KJL0151.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ151.KJL0151,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0152
//*********************************************************************
//BJLZ152  EXEC JZBDEXEC,MBR=BJLZ152,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ152.KJL0152.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ152.KJL0152.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ152.KJL0152,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0153
//*********************************************************************
//BJLZ153  EXEC JZBDEXEC,MBR=BJLZ153,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJLZ153.KJL0153.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP34   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ153.KJL0153.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ153.KJL0153,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0161
//*********************************************************************
//BJLZ161  EXEC JZBDEXEC,MBR=BJLZ161,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZ161.KJL0161.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP35   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ161.KJL0161.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ161.KJL0161,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJL0162
//*********************************************************************
//BJLZ162  EXEC JZBDEXEC,MBR=BJLZ162,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZ162.KJL0162.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP36   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZ162.KJL0162.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZ162.KJL0162,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLG001
//*********************************************************************
//BJLZG01  EXEC JZBDEXEC,MBR=BJLZG01,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZG01.KJLG001.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZG01.KJLG001.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZG01.KJLG001,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR003
//*********************************************************************
//BJLZR03  EXEC JZBDEXEC,MBR=BJLZR03,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR03.KJLR003.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR03.KJLR003.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR03.KJLR003,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR004
//*********************************************************************
//BJLZR04  EXEC JZBDEXEC,MBR=BJLZR04,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR04.KJLR004.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR04.KJLR004.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR04.KJLR004,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR005
//*********************************************************************
//BJLZR05  EXEC JZBDEXEC,MBR=BJLZR05,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR05.KJLR005.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR05.KJLR005.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR05.KJLR005,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR006
//*********************************************************************
//BJLZR06  EXEC JZBDEXEC,MBR=BJLZR06,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR06.KJLR006.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR06.KJLR006.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR06.KJLR006,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR007
//*********************************************************************
//BJLZR07  EXEC JZBDEXEC,MBR=BJLZR07,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR07.KJLR007.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP37   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR07.KJLR007.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR07.KJLR007,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR009
//*********************************************************************
//BJLZR09  EXEC JZBDEXEC,MBR=BJLZR09,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR09.KJLR009.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR09.KJLR009.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR09.KJLR009,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR011
//*********************************************************************
//BJLZR11  EXEC JZBDEXEC,MBR=BJLZR11,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR11.KJLR011.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR11.KJLR011.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR11.KJLR011,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR012
//*********************************************************************
//BJLZR12  EXEC JZBDEXEC,MBR=BJLZR12,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR12.KJLR012.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR12.KJLR012.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR12.KJLR012,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR013
//*********************************************************************
//BJLZR13  EXEC JZBDEXEC,MBR=BJLZR13,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR13.KJLR013.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR13.KJLR013.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR13.KJLR013,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//*********************************************************************
//*   THKJLR014
//*********************************************************************
//BJLZR14  EXEC JZBDEXEC,MBR=BJLZR14,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJLZR14.KJLR014.D000101,DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLZDL3-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
//STEP38   EXEC PGM=SORT,COND=(4,LT)
//SORTIN   DD DSN=KJL.SY.BJLZR14.KJLR014.D000101,DISP=SHR
//SORTOUT  DD DSN=KJL.SY.BJLZR14.KJLR014,
//            DISP=(MOD,CATLG,CATLG),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,BLKSIZE=0)
//SORTWK01 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK02 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SORTWK03 DD SPACE=(CYL,(300,200),RLSE),UNIT=SYSPA
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT     FIELDS=COPY
/*
//
