//TKJLDB21 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     : 일자전환
//*********************************************************************
//*********************************************************************
//*    보증서담보PF대출보증추출
//*********************************************************************
//STEP00 EXEC JZBDEXEC,MBR=BJLD275,OPT=&SYSUID
//OTFILE   DD DSN=KJL.SD.BJLD275.V001,
//            DISP=(OLD,CATLG,CATLG),
//            UNIT=SYSPA,
//            SPACE=(CYL,(0100,0050),RLSE),
//            DCB=(RECFM=FB)
//SYSIN    DD *
KB0-%%$ODATE-MKJLDP22-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
