//TKJLTY20 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*------------------------------------------------------------------*/
//* TOTAL EXPOSURE 자료 - SAM FILE UNLOAD
//*------------------------------------------------------------------*/
//DELETE   EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SD.UNLOAD.KJLR006.D250710'
  SET MAXCC=0
/*
//UNLOAD2  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD SYSOUT=*
//SYSREC00 DD DSN=KJL.SD.UNLOAD.KJLR006.D250710,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,1000),RLSE)
//SYSIN    DD *
  SELECT *
    FROM DB2DBA.THKJLR006
   WHERE 그룹회사코드 = 'KB0'
     AND 기준년월일 IN ('20250704' , '20250709' )
     AND 유가증권상품구분 IN ( '12' , '15' )
    WITH UR;
/*
//*------------------------------------------------------------------*/
//DELETE   EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SD.UNLOAD.KJLR011.D250710'
  SET MAXCC=0
/*
//UNLOAD3  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD SYSOUT=*
//SYSREC00 DD DSN=KJL.SD.UNLOAD.KJLR011.D250710,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,1000),RLSE)
//SYSIN    DD *
  SELECT *
    FROM DB2DBA.THKJLR011
   WHERE 그룹회사코드 = 'KB0'
     AND 기준년월일 IN ('20250704' , '20250709' )
    WITH UR;
/*
//
