//TKJLTP33 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*********************************************************************
//*********************************************************************
//*   EAD그룹익스포져일정보생성
//*********************************************************************
//STEP01   EXEC JZBDEXEC,MBR=BJLI351,OPT=&SYSUID
//SYSIN    DD *
KB0-20150402-MKJLDP33-001-ONLBAT-KB STAR-20150402
//*자료기준년월일
//*********************************************************************
//*   그룹익스포져일정보생성
//*********************************************************************
//STEP02   EXEC JZBDEXEC,MBR=BJLD351,OPT=&SYSUID
//SYSIN    DD *
KB0-20150402-MKJLOP33-001-ONLBAT-KB STAR-20150402
//*자료기준년월일
//
