//TKJLFAUN JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//* 정보개발부 DW 전송용 TABLE UNLOAD
//*********************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
   DELETE  'KJL.PT.PIN.LOAD.SKJL0011.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0014.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0015.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0026.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0027.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0028.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0029.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0030.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0074.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0075.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0125.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0126.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0127.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0128.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0129.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0130.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJL0161.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJLR009.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJLR011.ALL'
   DELETE  'KJL.PT.PIN.LOAD.SKJLR012.ALL'
   SET MAXCC=0
/*
//KJL0011  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0011.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0011;
/*
//KJL0014  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0014.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0014;
/*
//KJL0015  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0015.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0015;
/*
//KJL0026  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0026.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0026;
/*
//KJL0027  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0027.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0027;
/*
//KJL0028  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0028.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0028;
/*
//KJL0029  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0029.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0029;
/*
//KJL0030  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0030.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0030;
/*
//KJL0074  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0074.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0074;
/*
//KJL0075  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0075.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0075;
/*
//KJL0125  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0125.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0125;
/*
//KJL0126  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0126.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0126;
/*
//KJL0127  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0127.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0127;
/*
//KJL0128  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0128.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0128;
/*
//KJL0129  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0129.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0129;
/*
//KJL0130  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0130.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0130;
/*
//KJL0161  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJL0161.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJL0161;
/*
//KJLR009  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJLR009.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJLR009;
/*
//KJLR011  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJLR011.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJLR011;
/*
//KJLR012  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN  SYSTEM(DAPG)
  RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.SKJLR012.ALL,
//            DISP=(NEW,CATLG,DELETE),SPACE=(CYL,(2000,1000),RLSE)
//SYSIN    DD *
  SELECT * FROM DB2DBA.THKJLR012;
/*
//
