//TKJLP025 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*  THKJL0025 TABLE  LOAD
//*********************************************************************
//LOAD01  EXEC DSNUPROC,PARM='DAPG,KJL0025',COND=(4,LT)
//DSNTRACE DD  SYSOUT=*
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//DFSPARM  DD  DSN=SYS1.PARMLIB(DFSPARMH),DISP=SHR
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1000,500),RLSE)
//SORTOUT  DD  UNIT=SYSDA,SPACE=(CYL,(1000,500),RLSE)
//SYSPRINT DD  SYSOUT=*
//SYSREC01 DD  DSN=KJL.PT.PIN.LOAD.KJL0025,DISP=SHR
//SYSIN    DD *
  LOAD DATA LOG NO
  NOCOPYPEND
  RESUME NO REPLACE
  STATISTICS TABLE ALL INDEX ALL
  INDDN SYSREC01 INTO TABLE
      DB2DBA.THKJL0025
  (
  "그룹회사코드"                       POSITION(       1         )
  CHAR(                      3)                ,
  "계좌번호"                           POSITION(       4         )
  CHAR(                     20)                ,
  "기준일"                             POSITION(      24         )
  CHAR(                      2)                ,
  "기준년월"                           POSITION(      26         )
  CHAR(                      6)                ,
  "계좌중복일련번호"                   POSITION(      32:      35)
  DECIMAL                                      ,
  "고객식별자"                         POSITION(      36         )
  CHAR(                     10)                ,
  "고객관리번호"                       POSITION(      46         )
  CHAR(                      5)                ,
  "해외현지법인여부"                   POSITION(      51         )
  CHAR(                      1)                ,
  "차주번호"                           POSITION(      52         )
  CHAR(                     13)                ,
  "관리부점코드"                       POSITION(      65         )
  CHAR(                      4)                ,
  "계좌적용구분"                       POSITION(      69         )
  CHAR(                      1)                ,
  "한도계좌여부"                       POSITION(      70         )
  CHAR(                      1)                ,
  "상품대분류코드"                     POSITION(      71         )
  CHAR(                      2)                ,
  "상품중분류코드"                     POSITION(      73         )
  CHAR(                      2)                ,
  "상품템플릿코드"                     POSITION(      75         )
  CHAR(                      3)                ,
  "상품번호"                           POSITION(      78         )
  CHAR(                      5)                ,
  "대출자격구분"                       POSITION(      83         )
  CHAR(                      3)                ,
  "시작년월일"                         POSITION(      86         )
  CHAR(                      8)                ,
  "만기년월일"                         POSITION(      94         )
  CHAR(                      8)                ,
  "종료년월일"                         POSITION(     102         )
  CHAR(                      8)                ,
  "상품계약상태구분"                   POSITION(     110         )
  CHAR(                      1)                ,
  "통화코드"                           POSITION(     111         )
  CHAR(                      3)                ,
  "통화한도"                           POSITION(     114:     123)
  DECIMAL                                      ,
  "통화잔액"                           POSITION(     124:     133)
  DECIMAL                                      ,
  "BS기준잔액"                         POSITION(     134:     141)
  DECIMAL                                      ,
  "명목액기준한도"                     POSITION(     142:     149)
  DECIMAL                                      ,
  "명목액기준잔액"                     POSITION(     150:     157)
  DECIMAL                                      ,
  "TE한도환산금액"                     POSITION(     158:     165)
  DECIMAL                                      ,
  "TE잔액환산금액"                     POSITION(     166:     173)
  DECIMAL                                      ,
  "CP한도환산금액"                     POSITION(     174:     181)
  DECIMAL                                      ,
  "CP잔액환산금액"                     POSITION(     182:     189)
  DECIMAL                                      ,
  "CA담보제외금액"                     POSITION(     190:     197)
  DECIMAL                                      ,
  "CA담보환산금액"                     POSITION(     198:     205)
  DECIMAL                                      ,
  "관련테이블명"                       POSITION(     206         )
  CHAR(                     12)                ,
  "과목코드"                           POSITION(     218         )
  CHAR(                      3)                ,
  "시스템최종처리일시"                 POSITION(     221         )
  CHAR(                     20)                ,
  "시스템최종사용자번호"               POSITION(     241         )
  CHAR(                      7)                ,
  "차주고객식별자"                     POSITION(     248         )
  CHAR(                     10)
  )
//
