//TKJLDP13 JOB ,'M V S',CLASS=T,MSGCLASS=X,REGION=0M
//*********************************************************************
//* THKJLR013 LOAD
//*********************************************************************
//LOAD    EXEC DSNUPROC,PARM='DAPG,KJLR013',COND=(4,LT)
//DSNTRACE DD  SYSOUT=*
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//DFSPARM  DD  DSN=SYS1.PARMLIB(DFSPARMH),DISP=SHR
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SORTOUT  DD  UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSPRINT DD  SYSOUT=*
//SYSREC01 DD  DSN=KJL.SD.BJLR013.V001,DISP=SHR
//SYSIN    DD *
  LOAD DATA LOG NO
  NOCOPYPEND
  RESUME NO REPLACE
  STATISTICS TABLE ALL INDEX ALL
  INDDN SYSREC01 INTO TABLE
      DB2DBA.THKJLR013
 ( "그룹회사코드"          POSITION(009:011) CHAR MIXED(003)
 , "계좌번호"              POSITION(012:031) CHAR MIXED(020)
 , "상품계약회차"          POSITION(032:040) DECIMAL EXTERNAL(7,0)
 , "상품코드"              POSITION(041:052) CHAR MIXED(012)
 , "상품대분류코드"        POSITION(053:054) CHAR MIXED(002)
 , "상품중분류코드"        POSITION(055:056) CHAR MIXED(002)
 , "상품템플릿코드"        POSITION(057:059) CHAR MIXED(003)
 , "상품번호"              POSITION(060:064) CHAR MIXED(005)
 , "대출자격구분"          POSITION(065:067) CHAR MIXED(003)
 , "개별코드"              POSITION(068:070) CHAR MIXED(003)
 , "통화코드"              POSITION(071:073) CHAR MIXED(003)
 , "계약자고객식별자"      POSITION(074:083) CHAR MIXED(010)
 , "계약자고객관리번호"    POSITION(084:088) CHAR MIXED(005)
 , "상품계약회차상태구분"  POSITION(089:089) CHAR MIXED(001)
 , "계약회차생성사유구분"  POSITION(090:092) CHAR MIXED(003)
 , "계약회차약정년월일"    POSITION(093:100) CHAR MIXED(008)
 , "계약회차생성년월일"    POSITION(101:108) CHAR MIXED(008)
 , "계약회차폐기사유구분"  POSITION(109:111) CHAR MIXED(003)
 , "계약회차폐기년월일"    POSITION(112:119) CHAR MIXED(008)
 , "계약회차만기년월일"    POSITION(120:127) CHAR MIXED(008)
 , "과목코드"              POSITION(130:132) CHAR MIXED(003)
 , "통합계정과목코드"      POSITION(133:145) CHAR MIXED(013)
 , "잔액"                  POSITION(159:178) DECIMAL EXTERNAL(18,3)
 , "원장잔액"              POSITION(179:198) DECIMAL EXTERNAL(18,3)
 , "계약한도구분"          POSITION(334:335) CHAR MIXED(002)
 , "계리신탁합동구분"      POSITION(340:342) CHAR MIXED(003)
 , "계리신탁펀드코드"      POSITION(343:345) CHAR MIXED(003)
 , "신규시거래자구분"      POSITION(346:347) CHAR MIXED(002)
 , "신규표준산업분류코드"  POSITION(348:352) CHAR MIXED(005)
 , "신규시기업규모구분"    POSITION(353:353) CHAR MIXED(001)
 , "관리부점코드"          POSITION(354:357) CHAR MIXED(004)
 , "계약금액"              POSITION(358:377) DECIMAL EXTERNAL(18,3)
 , "대출실행누계금액"      POSITION(378:397) DECIMAL EXTERNAL(18,3)
 , "유동화자산구분"        POSITION(400:402) CHAR MIXED(003)
 , "유동화차수"            POSITION(403:407) DECIMAL EXTERNAL(3,0)
 , "한도계좌여부"          POSITION(408:408) CHAR MIXED(001)
 , "한도계좌관리구분"      POSITION(409:409) CHAR MIXED(001)
 , "여신한도운용구분"      POSITION(410:410) CHAR MIXED(001)
 , "주담보종류구분"        POSITION(421:421) CHAR MIXED(001)
 , "주담보구분"            POSITION(422:424) CHAR MIXED(003)
 , "한도계좌번호"          POSITION(484:503) CHAR MIXED(020)
 , "투자금융관리번호"      POSITION(524:532) CHAR MIXED(009)
 , "투자트렌치번호"        POSITION(533:535) CHAR MIXED(003)
 , "투자금융회차"          POSITION(536:542) DECIMAL EXTERNAL(5,0)
 , "시스템최종처리일시"    POSITION(001:008) CHAR MIXED(008)
 )
//
