//TKJLDEL1 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제
//*********************************************************************
//BJL0001  EXEC JZBDEXEC,MBR=BJL0001,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0001.KJL0001,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=272,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0003  EXEC JZBDEXEC,MBR=BJL0003,OPT=&SYSUID,COND=(4,LT)
//OTFILE1  DD DSN=KJL.SY.BJL0003.KJL0003,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=302,BLKSIZE=0)
//OTFILE2  DD DSN=KJL.SY.BJL0003.KJL0006,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=644,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0004  EXEC JZBDEXEC,MBR=BJL0004,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0004.KJL0004,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=268,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0007  EXEC JZBDEXEC,MBR=BJL0007,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0007.KJL0007,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=122,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0008  EXEC JZBDEXEC,MBR=BJL0008,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0008.KJL0008,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=137,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0009  EXEC JZBDEXEC,MBR=BJL0009,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0009.KJL0009,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=139,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0010  EXEC JZBDEXEC,MBR=BJL0010,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0010.KJL0010,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=113,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0011  EXEC JZBDEXEC,MBR=BJL0011,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0011.KJL0011,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=160,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0014  EXEC JZBDEXEC,MBR=BJL0014,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0014.KJL0014,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=125,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0015  EXEC JZBDEXEC,MBR=BJL0015,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0015.KJL0015,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=307,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0016  EXEC JZBDEXEC,MBR=BJL0016,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0016.KJL0016,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=303,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0017  EXEC JZBDEXEC,MBR=BJL0017,OPT=&SYSUID,COND=(4,LT)
//OTFILE   DD DSN=KJL.SY.BJL0017.KJL0017,
//            DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB,LRECL=104,BLKSIZE=0)
//SYSIN    DD *
KB0-%%$ODATE-TKJL0001-001-NORBAT-19000101
//*작업일                     자료기준년월일
//
