//TKJLEAD7 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     :  TKJLEAD6
//*********************************************************************
//*   차주별익스포져중간집계원장구축
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLI271,OPT=&SYSUID
//SYSIN    DD *
KB0-20101117-TKJLEAD7-001-ONLBAT-KB STAR-20101117
//*자료기준년월일
//*********************************************************************
//*   차주별익스포져집계원장구축
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLI291,OPT=&SYSUID
//SYSIN    DD *
KB0-20101117-TKJLEAD7-001-ONLBAT-KB STAR-20101117
//*자료기준년월일
//*********************************************************************
//*   그룹익스포져일정보생성
//*********************************************************************
//STEP03 EXEC JZBDEXEC,MBR=BJLI351,OPT=&SYSUID
//SYSIN    DD *
KB0-20101117-TKJLEAD7-001-ONLBAT-KB STAR-20101117
//*자료기준년월일
