//TKJLFAIF JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*  정보개발부 DW 전송용 TABLE UNLOAD  (온라인용)
//*********************************************************************
//INFO0011 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0011.ALL' -
     /fsshare01/kbpin/THKJL0011_LOAD_01.dat
QUIT
/*
//INFO0014 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0014.ALL' -
     /fsshare01/kbpin/THKJL0014_LOAD_01.dat
QUIT
/*
//INFO0015 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0015.ALL' -
     /fsshare01/kbpin/THKJL0015_LOAD_01.dat
QUIT
/*
//INFO0026 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0026.ALL' -
     /fsshare01/kbpin/THKJL0026_LOAD_01.dat
QUIT
/*
//INFO0027 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0027.ALL' -
     /fsshare01/kbpin/THKJL0027_LOAD_01.dat
QUIT
/*
//INFO0028 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0028.ALL' -
     /fsshare01/kbpin/THKJL0028_LOAD_01.dat
QUIT
/*
//INFO0029 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0029.ALL' -
     /fsshare01/kbpin/THKJL0029_LOAD_01.dat
QUIT
/*
//INFO0030 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0030.ALL' -
     /fsshare01/kbpin/THKJL0030_LOAD_01.dat
QUIT
/*
//INFO0074 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0074.ALL' -
     /fsshare01/kbpin/THKJL0074_LOAD_01.dat
QUIT
/*
//INFO0075 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0075.ALL' -
     /fsshare01/kbpin/THKJL0075_LOAD_01.dat
QUIT
/*
//INFO0125 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0125.ALL' -
     /fsshare01/kbpin/THKJL0125_LOAD_01.dat
QUIT
/*
//INFO0126 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0126.ALL' -
     /fsshare01/kbpin/THKJL0126_LOAD_01.dat
QUIT
/*
//INFO0127 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0127.ALL' -
     /fsshare01/kbpin/THKJL0127_LOAD_01.dat
QUIT
/*
//INFO0128 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0128.ALL' -
     /fsshare01/kbpin/THKJL0128_LOAD_01.dat
QUIT
/*
//INFO0129 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0129.ALL' -
     /fsshare01/kbpin/THKJL0129_LOAD_01.dat
QUIT
/*
//INFO0130 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0130.ALL' -
     /fsshare01/kbpin/THKJL0130_LOAD_01.dat
QUIT
/*
//INFO0161 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJL0161.ALL' -
     /fsshare01/kbpin/THKJL0161_LOAD_01.dat
QUIT
/*
//INFOR009 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJLR009.ALL' -
     /fsshare01/kbpin/THKJLR009_LOAD_01.dat
QUIT
/*
//INFOR011 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJLR011.ALL' -
     /fsshare01/kbpin/THKJLR011_LOAD_01.dat
QUIT
/*
//INFOR012 EXEC #IMEDWF
//SYSIN    DD *

open daddbo01_f
//       DD DSN=KJL.PT.PIN.LOAD.SERVER,DISP=SHR
//       DD *
replace
bin
PUT 'KJL.PT.PIN.LOAD.SKJLR012.ALL' -
     /fsshare01/kbpin/THKJLR012_LOAD_01.dat
QUIT
/*
//
//

