//TKJLTY40 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*------------------------------------------------------------------*/
//* TOTAL EXPOSURE ÀÚ·á - DUMP
//*------------------------------------------------------------------*/
//NDMPROC1 EXEC PGM=DMBATCH
//DMNETMAP DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT  DD SYSOUT=*
//SYSIN    DD *
  SIGNON USERID=(B824243,) ESF=NO CASE=YES
  SUBMIT PROC=$NDMRECV MAXDELAY=0          -
         &SNODE=NDM.ZADA                   -
         &FTDSN=KJL.DM.REPORT.TY01         -
         &TODSN=KJL.SM.REPORT.TY01
  SIGNOFF
/*
//DSNTEP2  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
  LIB('DB2APS.DSND10.RUNLIB.LOAD') PARMS('/ALIGN(MID)')
  END
//SYSIN    DD DSN=KJL.SM.REPORT.TY01,DISP=SHR
/*
//
