//TKJLTBN3 JOB ,'M V S',CLASS=T,MSGCLASS=X,REGION=0M
//*---------------------------------------------*
//*  지주사모니터링시스템에자료전송하는ＮＤＭ *
//*  FROM : ZABA                                *
//*  TO   : FEFMAPO2                            *
//*---------------------------------------------*
//NDMPROC  EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0029.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0004_D_20110608.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0033.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0013_D_20110608.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0029.P00002 -
         &TODSN=/fsfile/RMS/riskdata/TE_0004_D_20110609.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0033.P00002 -
         &TODSN=/fsfile/RMS/riskdata/TE_0013_D_20110609.dat
 SIGNOFF
/*
//
//
//NDMPROC  EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0015.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0001_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0018.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0002_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0019.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0003_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0029.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0004_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0031.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0005_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0013.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0006_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0014.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0007_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0039.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0009_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0044.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0010_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0055.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0011_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0056.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0012_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0033.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0013_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0000.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0000_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0118.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0014_D_20110103.dat
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0129.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0015_D_20110103.dat
 SIGNOFF
/*
//
//
//
//
//NDMPROC7 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0014.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0007_D_20101124.dat
 SIGNOFF
/*
//
//
/*
/*
/*
//NDMPROC2 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0018.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0002_D_20100825.dat
 SIGNOFF
/*
//NDMPROC3 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0019.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0003_D_20100825.dat
 SIGNOFF
/*
//NDMPROC4 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0029.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0004_D_20100825.dat
 SIGNOFF
/*
//NDMPROC5 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0031.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0005_D_20100825.dat
 SIGNOFF
/*
//NDMPROC6 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0013.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0006_D_20100825.dat
 SIGNOFF
/*
//NDMPROC8 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0035.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0008_D_20100825.dat
 SIGNOFF
/*
//NDMPROC9 EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0039.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0009_D_20100825.dat
 SIGNOFF
/*
//NDMPROCA EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0044.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0010_D_20100825.dat
 SIGNOFF
/*
//NDMPROCB EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0055.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0011_D_20100825.dat
 SIGNOFF
/*
//NDMPROCC EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0056.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0012_D_20100825.dat
 SIGNOFF
/*
//NDMPROCD EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0033.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0013_D_20100825.dat
 SIGNOFF
/*
//NDMPROCE EXEC PGM=DMBATCH
//DMNETMAP  DD DISP=SHR,DSN=MVS.NDMBA.NETMAP
//DMPUBLIB  DD DISP=SHR,DSN=NDM.BBAT.PROC
//DMMSGFIL  DD DISP=SHR,DSN=MVS.NDMBA.MSG
//DMPRINT   DD  SYSOUT=*
//SYSIN     DD  *
 SIGNON USERID=(C309509,) ESF=NO CASE=YES
 SUBMIT PROC=MKJLNDM2 MAXDELAY=0 -
         &SNODE=NDM.FEFMAPO2 -
         &FTDSN=KJL.SD.SHRRMS.SKJL0037.P00001 -
         &TODSN=/fsfile/RMS/riskdata/TE_0014_D_20100825.dat
 SIGNOFF
/*
//
//
