//TKJLF016 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*  THKJL0016 변경채무자고객기본 TABLE UNLOAD
//*********************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.PT.PIN.UNLOAD.KJL0016.ALL'
  SET MAXCC=0
/*
//UNLOAD0  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
 DSN SYSTEM(DAPG)
 RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.UNLOAD.KJL0016.ALL,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,3000),RLSE)
//SYSIN    DD *
SELECT *
  FROM DB2DBA.THKJL0016
 WITH UR;
/*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.PT.PIN.LOAD.KJL0016'
  SET MAXCC=0
/*
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
 DSN SYSTEM(DAPG)
 RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD SYSOUT=*
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.KJL0016,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,3000),RLSE)
//SYSIN    DD *
SELECT A.그룹회사코드
	    ,B.고객식별자
      ,CHAR('             ')   AS 차주번호
      ,A.차주번호구분
      ,A.신표준산업분류코드
      ,A.내부신용평가등급구분
      ,A.신용평가년월일
      ,A.신용평가유효년월일
      ,A.고객관리부점코드
      ,A.기업규모구분
      ,A."PEER구분"
      ,A.대분류업종코드
      ,A.산업평가등급구분
      ,A.채무자명
      ,A.계열기업군코드
      ,A.계열기업군명
      ,A.대표사업자번호
      ,A.매출액
      ,A.총자산
      ,A.한도고객구분
      ,CHAR('             ')   AS 모기업법인등록번호
      ,A.연합회차주번호
      ,A."고객ID구분"
      ,A.한도그룹번호
      ,A.그룹사신용등급구분
      ,A.차주대표자명
      ,A.등록년월일
      ,A.시스템최종처리일시
      ,A.시스템최종사용자번호
      ,CHAR(VALUE(C.고객식별자,'          ')) 모기업법인고객식별자
 FROM  DB2DBA.THKJL0016 A   LEFT OUTER JOIN
       DB2DBA.THKJL0015 C
   ON  A.그룹회사코드       = C.그룹회사코드
  AND  A.모기업법인등록번호 = C.차주번호
      ,DB2DBA.THKJL0015 B
WHERE  A.그룹회사코드 = B.그룹회사코드
  AND  A.차주번호     = B.차주번호
WITH UR;
/*
//
