//TKJLF014 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*  THKJL0014 계열사기본 TABLE UNLOAD
//*********************************************************************
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.PT.PIN.UNLOAD.KJL0014.ALL'
  SET MAXCC=0
/*
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
 DSN SYSTEM(DAPG)
 RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSREC00 DD DSN=KJL.PT.PIN.UNLOAD.KJL0014.ALL,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,3000),RLSE)
//SYSIN    DD *
SELECT  *
  FROM DB2DBA.THKJL0014
  WITH UR;
/*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.PT.PIN.LOAD.KJL0014'
  SET MAXCC=0
/*
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
 DSN SYSTEM(DAPG)
 RUN  PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD SYSOUT=*
//SYSREC00 DD DSN=KJL.PT.PIN.LOAD.KJL0014,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(3000,3000),RLSE)
//SYSIN    DD *
SELECT  A.그룹회사코드
       ,A.기준년월
       ,CHAR(SUBSTR(A.차주번호,1,10)) AS 고객식별자
       ,A.계열적용구분
       ,CHAR('             ') AS 차주번호
       ,A.계열기업군코드
       ,A.기업규모구분
       ,A.등록직원번호
       ,A.등록년월일
       ,A.변경여부
       ,A.채무자명
       ,A.시스템최종처리일시
       ,A.시스템최종사용자번호
 FROM  DB2DBA.THKJL0014 A
WHERE  A.그룹회사코드 = 'KB0'
  AND  LENGTH(TRIM(A.차주번호)) <= 6
  AND  A.차주번호               != ''
UNION ALL
SELECT  A.그룹회사코드
       ,A.기준년월
       ,B.고객식별자
       ,A.계열적용구분
       ,CHAR('             ') AS 차주번호
       ,A.계열기업군코드
       ,A.기업규모구분
       ,A.등록직원번호
       ,A.등록년월일
       ,A.변경여부
       ,A.채무자명
       ,A.시스템최종처리일시
       ,A.시스템최종사용자번호
 FROM  DB2DBA.THKJL0014 A
      ,DB2DBA.THKJL0015 B
WHERE  A.그룹회사코드 = B.그룹회사코드
  AND  A.차주번호     = B.차주번호
  AND  LENGTH(TRIM(A.차주번호)) > 6
 WITH UR;
/*
