//TKJLDEL4 JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*********************************************************************
//*   2단계보안조치 관련 정보삭제
//*********************************************************************
//BJL0073  EXEC JZBDEXEC,MBR=BJL0073,OPT=&SYSUID,COND=(4,LT)
//INFILE3  DD DSN=KJL.SY.BJL0073.KJL0073,
//            DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJL0073-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0126  EXEC JZBDEXEC,MBR=BJL0126,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0126.KJL0126,
//            DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJL0126-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0128  EXEC JZBDEXEC,MBR=BJL0128,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0128.KJL0128,
//            DISP=SHR
KB0-%%$ODATE-TKJL0128-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0130  EXEC JZBDEXEC,MBR=BJL0130,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.SY.BJL0130.KJL0130,
//            DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJL0130-001-NORBAT-19000101
//*작업일                     자료기준년월일
//*********************************************************************
//BJL0R07  EXEC JZBDEXEC,MBR=BJL0R07,OPT=&SYSUID,COND=(4,LT)
//INFILE   DD DSN=KJL.SY.BJL0R07.KJLR007,
//            DISP=SHR
//SYSIN    DD *
KB0-%%$ODATE-TKJLR007-001-NORBAT-19000101
//*작업일                     자료기준년월일
//
