//TKJLSCP1 JOB CLASS=T,MSGCLASS=X,NOTIFY=&SYSUID,REGION=0M
//*-------------------------------------------------------------
//*  << 주민등록번호　검색 UTIL - ZABA 파일검색 >>
//*-------------------------------------------------------------
//STEP01   EXEC PGM=SCPSRCH,
//         PARM='SUM,36:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD011.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP02   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD012.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP03   EXEC PGM=SCPSRCH,
//         PARM='SUM,20:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD013.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP04   EXEC PGM=SCPSRCH,
//         PARM='SUM,20:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD014.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP05   EXEC PGM=SCPSRCH,
//         PARM='SUM,17:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD081.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP06   EXEC PGM=SCPSRCH,
//         PARM='SUM,22:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD082.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP07   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD121.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP08   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD131.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP09   EXEC PGM=SCPSRCH,
//         PARM='SUM,21:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD141.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP10   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD151.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP11   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD152.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP12   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD153.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP13   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD153.V001.DUP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP28   EXEC PGM=SCPSRCH,
//         PARM='SUM,47:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD271.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP29   EXEC PGM=SCPSRCH,
//         PARM='SUM,47:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD272.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP30   EXEC PGM=SCPSRCH,
//         PARM='SUM,47:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLD273.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP31   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI251.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP32   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI253.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP33   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI254.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP34   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI255.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP35   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI256.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP36   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI257.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP37   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI258.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP38   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25A.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP39   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25B.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP40   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25C.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP41   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25D.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP42   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25H.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP43   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25I.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP44   EXEC PGM=SCPSRCH,
//         PARM='SUM,52:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.BJLI25J.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP45   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:09'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0013.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP46   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0015.EXPD29.G018.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP47   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0015.EXPD29.G018.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP48   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0015.EXPD29.G018.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP50   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0031.EXPD14.G005.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP51   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0031.EXPD14.G005.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP52   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0031.EXPD14.G005.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP54   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0039.EXPD19.G011.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP55   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0039.EXPD19.G011.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP56   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0039.EXPD19.G011.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP57   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0039.EXPD19.G011.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP58   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0055.EXPD22.G015.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP59   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0055.EXPD22.G015.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP60   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0055.EXPD22.G015.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP62   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0064.EXPD21.G013.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP63   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0064.EXPD21.G013.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP64   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0064.EXPD21.G013.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP65   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0064.EXPD21.G013.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP66   EXEC PGM=SCPSRCH,
//         PARM='SUM,24:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0072.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP67   EXEC PGM=SCPSRCH,
//         PARM='SUM,54:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0074.V001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP68   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0127.EXPD12.G001.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP69   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0127.EXPD12.G001.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP70   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0127.EXPD12.G001.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP72   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0129.EXPD13.G003.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP73   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0129.EXPD13.G003.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP74   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0129.EXPD13.G003.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP76   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0135.EXPD17.G008.CHK
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP77   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0135.EXPD17.G008.CHKTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP78   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0135.EXPD17.G008.DAT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP79   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0135.EXPD17.G008.DATTMP
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP80   EXEC PGM=SCPSRCH,
//         PARM='SUM,22:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.KJL0151.LOAD
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP81   EXEC PGM=SCPSRCH,
//         PARM='SUM,22:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0010.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP82   EXEC PGM=SCPSRCH,
//         PARM='SUM,20:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0011.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP83   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0012.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP84   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0013.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP85   EXEC PGM=SCPSRCH,
//         PARM='SUM,21:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0014.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP86   EXEC PGM=SCPSRCH,
//         PARM='SUM,14:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0015.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP90   EXEC PGM=SCPSRCH,
//         PARM='SUM,31:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0027.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP91   EXEC PGM=SCPSRCH,
//         PARM='SUM,01:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0028.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP95   EXEC PGM=SCPSRCH,
//         PARM='SUM,15:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0039.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP96   EXEC PGM=SCPSRCH,
//         PARM='SUM,15:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0039.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP97   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0044.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP98   EXEC PGM=SCPSRCH,
//         PARM='SUM,10:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0051.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP99   EXEC PGM=SCPSRCH,
//         PARM='SUM,24:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0072.P00001
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//STEP100  EXEC PGM=SCPSRCH,
//         PARM='SUM,24:13'
//STEPLIB  DD DISP=SHR,DSN=SEC.XCPS.ZABA.LOADLIB
//INPUT    DD DISP=SHR,DSN=KJL.SD.SHRTAA.SKJL0072.P00002
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
/*
//
