//TKJLT099 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//* %%SET %%A = %%SUBSTR %%$ODATE 3 6
//*********************************************************************
//*   THKJL0004
//*********************************************************************
//DELETE3  EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.ST.BJLT099.KJL0004.D%%ODATE'

  SET MAXCC=0
/*
//UNLOAD3  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
  END
//SYSREC00 DD DSN=KJL.ST.BJLT099.KJL0004.D%%ODATE,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSIN    DD *
SELECT 그룹회사코드
      ,한도신청번호
  FROM DB2DBA.THKJL0004
 WHERE 그룹회사코드         = 'KB0'
   AND 내부신용평가등급구분 = 'Blan'
  WITH UR;
/*
//*********************************************************************
//*   THKJL0044
//*********************************************************************
//DELETE4  EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.ST.BJLT099.KJL0044.D%%ODATE'

  SET MAXCC=0
/*
//UNLOAD4  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
  END
//SYSREC00 DD DSN=KJL.ST.BJLT099.KJL0044.D%%ODATE,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSIN    DD *
SELECT 그룹회사코드
      ,기준년월
      ,신표준산업분류코드
  FROM DB2DBA.THKJL0044
 WHERE 그룹회사코드         = 'KB0'
   AND 산업평가등급구분    != '0000'
   AND SUBSTR(산업평가등급구분,3,1) = '0'
  WITH UR;
/*
//*********************************************************************
//*   THKJL0151
//*********************************************************************
//DELETE39 EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.ST.BJLT099.KJL0151.D%%ODATE'

  SET MAXCC=0
/*
//UNLOAD39 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
  END
//SYSREC00 DD DSN=KJL.ST.BJLT099.KJL0151.D%%ODATE,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSIN    DD *
SELECT 그룹회사코드
      ,기준일
      ,기준년월
      ,고객식별자
  FROM DB2DBA.THKJL0151
 WHERE 그룹회사코드      = 'KB0'
   AND 산업평가등급구분 != '0000'
   AND SUBSTR(산업평가등급구분,3,1) = '0'
  WITH UR;
/*
//*********************************************************************
//*   THKJL0152
//*********************************************************************
//DELETE40 EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.ST.BJLT099.KJL0152.D%%ODATE'

  SET MAXCC=0
/*
//UNLOAD40 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
  END
//SYSREC00 DD DSN=KJL.ST.BJLT099.KJL0152.D%%ODATE,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(0500,0300),RLSE),
//            DCB=(RECFM=FB)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSIN    DD *
SELECT 그룹회사코드
      ,기준년월
      ,고객식별자
  FROM DB2DBA.THKJL0152
 WHERE 그룹회사코드      = 'KB0'
   AND 산업평가등급구분 != '0000'
   AND SUBSTR(산업평가등급구분,3,1) = '0'
  WITH UR;
/*
//*********************************************************************
//*   BJLT099
//*********************************************************************
//BJLT099  EXEC JZBDEXEC,MBR=BJLT099,OPT=&SYSUID,COND=(4,LT)
//INFILE1  DD DSN=KJL.ST.BJLT099.KJL0004.D%%ODATE,DISP=SHR
//INFILE2  DD DSN=KJL.ST.BJLT099.KJL0044.D%%ODATE,DISP=SHR
//INFILE3  DD DSN=KJL.ST.BJLT099.KJL0151.D%%ODATE,DISP=SHR
//INFILE4  DD DSN=KJL.ST.BJLT099.KJL0152.D%%ODATE,DISP=SHR
//CHGLOG   DD DSN=KJL.ST.CHGLOG.TKJLT099.D%%A.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(500,300),RLSE)
//SYSIN    DD *
KB0-%%$ODATE-TKJLT099-001-NORBAT-%%$ODATE
//*작업일                     자료기준년월일
/*
//
