//TKJLEAD6 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*배치작업기준일 : 영업일작업
//*선행작업명     :  TKJLEAD5
//*********************************************************************
//*   한도관리계좌MC
//*********************************************************************
//STEP01 EXEC JZBDEXEC,MBR=BJLI25K,OPT=&SYSUID
//INFILE   DD DISP=SHR,DSN=KJL.SD.BJLI25J.V001
//SYSIN    DD *
KB0-20101117-TKJLEAD6-001-ONLBAT-KB STAR-20101117-Y
//*자료기준년월일-원장삭제구분
