//TKJLDP47 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//*   기업집단평가기본수보 적재(THKJLR018)
//*********************************************************************
//DELETE1  EXEC PGM=IDCAMS,COND=(4,LT)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE  'KJL.SD.SAMFILE.KIPB110'

  SET MAXCC=0
/*
//UNLOAD1  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTIAUL) PLAN(DSNTIB13) PARMS('SQL') -
      LIB('DB2APS.DSND10.RUNLIB.LOAD')
  END
//SYSREC00 DD DSN=KJL.SD.SAMFILE.KIPB110,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(CYL,(10,1),RLSE),
//            DCB=(RECFM=FB,LRECL=100)
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSPUNCH DD DUMMY
//SYSIN    DD *
SELECT 그룹회사코드
      ,기업집단그룹코드
      ,기업집단등록코드
      ,평가년월일
      ,기업집단처리단계구분
      ,최종집단등급구분
      ,시스템최종처리일시
      ,시스템최종사용자번호
  FROM DB2DBA.THKIPB110 B110
 WHERE 그룹회사코드     = 'KB0'
   AND 기업집단등록코드 = 'GRS'
   AND 평가년월일       =
       (SELECT MAX(평가년월일)
          FROM DB2DBA.THKIPB110
         WHERE 그룹회사코드 = B110.그룹회사코드
           AND 기업집단그룹코드 =
               B110.기업집단그룹코드
           AND 기업집단등록코드 =
               B110.기업집단등록코드
           AND 기업집단처리단계구분 = '6'
       )
  WITH UR;
/*
//*********************************************************************
//*   BJLR018
//*********************************************************************
//STEP02  EXEC JZBDEXEC,MBR=BJLDR18,OPT=&SYSUID
//INFILE   DD DISP=SHR,DSN=KJL.SD.SAMFILE.KIPB110
//CHGLOG   DD DSN=KJL.SY.CHGLOG.BJLDR18.D%%ODATE.T%%TIME,
//            DISP=(NEW,CATLG,DELETE),
//            DCB=(RECFM=VB,BLKSIZE=32760,LRECL=32756),
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)
//SYSIN     DD *
KB0-%%$ODATE-TKJLDP47-001-ONLBAT-KB STAR-%%$ODATE
//*자료기준년월일
/*
//
