//TKJLFSEL JOB 'KJL',REGION=0M,NOTIFY=$SYSUID,CLASS=T,MSGCLASS=X
//*------------------------------------------------------------------*/
//* TOTAL EXPOSURE 이행 후 검증
//*------------------------------------------------------------------*/
//DSNTEP2  EXEC PGM=IKJEFT01,DYNAMNBR=20
//SYSTSPRT DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSUDUMP DD SYSOUT=*
//SYSTSIN  DD *
  DSN SYSTEM(DAPG)
  RUN PROGRAM(DSNTEP2) PLAN(DSNTEP13) -
  LIB('DB2APS.DSND10.RUNLIB.LOAD') PARMS('/ALIGN(MID)')
  END
//SYSIN    DD *
SELECT *  FROM DB2DBA.THKJL0001
 WHERE 그룹회사코드 = 'KB0'
   AND LENGTH(TRIM(고객식별자)) = 10
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0008
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0010
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0011
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0014
 WHERE 그룹회사코드 = 'KB0'
   AND LENGTH(TRIM(고객식별자)) = 10
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0015
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0016
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0017
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0025
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0026
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0027
 WHERE 그룹회사코드 = 'KB0'
   AND 담보보증고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0028
 WHERE 그룹회사코드 = 'KB0'
   AND 담보보증고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0029
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0030
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0031
 WHERE 그룹회사코드 = 'KB0'
   AND 담보보증고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0032
 WHERE 그룹회사코드 = 'KB0'
   AND 담보보증고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0033
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0034
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0040
 WHERE 그룹회사코드 = 'KB0'
   AND LENGTH(TRIM(고객식별자)) = 10
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0041
 WHERE 그룹회사코드 = 'KB0'
   AND LENGTH(TRIM(고객식별자)) = 10
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0042
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0055
 WHERE 그룹회사코드 = 'KB0'
   AND SUBSTR(고객식별자,1,1) IN ('7','8')
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0059
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0061
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0062
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0074
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0075
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0125
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0126
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0127
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0128
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0129
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0130
 WHERE 그룹회사코드 = 'KB0'
   AND 차주고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0152
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0161
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0162
 WHERE 그룹회사코드 = 'KB0'
   AND LENGTH(TRIM(고객식별자)) = 10
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR005
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR006
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR007
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR009
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0003
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0004
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0007
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0009
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJL0020
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR011
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
SELECT *  FROM DB2DBA.THKJLR012
 WHERE 그룹회사코드 = 'KB0'
   AND 고객식별자 != ''
 FETCH FIRST 10 ROW ONLY
WITH UR;
/*
//
