//TKJLTB01 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*                   배치실행JCL
//*********************************************************************
//* 기준일에 따라 A를
//* 전월말영업일이나 전영업일로 수정하여 사용
//*
//*  %%GLOBAL  PARMGLB1
//*  %%SET %%A = %%MEND%%$OYEAR.%%OMONTH
//*********************************************************************
//*  EAD 신용공여한도추출
//*********************************************************************
//STEP02 EXEC JZBDEXEC,MBR=BJLI25J,OPT=&SYSUID
//INFILE   DD DISP=SHR,DSN=KJL.SM.BJLI25I.V001
//OTFILE   DD DSN=KJL.SM.BJLI25J.V001,
//            DISP=(OLD,CATLG,CATLG),
//            UNIT=SYSBA,
//            SPACE=(CYL,(0300,0100),RLSE),
//            DCB=(RECFM=FB,LRECL=320)
//SYSIN    DD *
KB0-%%A-TKJLTB01-001-ONLBAT-KB STAR-%%A
//*자료기준년월일
//
//*전월말영업일:%%MEND%%$OYEAR.%%OMONTH
//*전영업일    :%%$WCALC %%$ODATE -1 WORKDAYS
