//TKJLP128 JOB (Z-KESA),CLASS=T,MSGCLASS=X
//*********************************************************************
//*  THKJL0128 TABLE  LOAD
//*********************************************************************
//LOAD01  EXEC DSNUPROC,PARM='DAPG,KJL0128',COND=(4,LT)
//DSNTRACE DD  SYSOUT=*
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR
//DFSPARM  DD  DSN=SYS1.PARMLIB(DFSPARMH),DISP=SHR
//SORTWK01 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK02 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK03 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SORTWK04 DD  UNIT=SYSDA,SPACE=(CYL,(500,200),RLSE)
//SYSUT1   DD  UNIT=SYSDA,SPACE=(CYL,(1000,500),RLSE)
//SORTOUT  DD  UNIT=SYSDA,SPACE=(CYL,(1000,500),RLSE)
//SYSPRINT DD  SYSOUT=*
//SYSREC01 DD  DSN=KJL.PT.PIN.LOAD.KJL0128,DISP=SHR
//SYSIN    DD *
  LOAD DATA LOG NO
  NOCOPYPEND
  RESUME NO REPLACE
  STATISTICS TABLE ALL INDEX ALL
  INDDN SYSREC01 INTO TABLE
      DB2DBA.THKJL0128
   (
   "그룹회사코드"                  POSITION(       1         )
   CHAR(                      3)         ,
   "기준년월"                      POSITION(       4         )
   CHAR(                      6)         ,
   "차주고객식별자"                POSITION(      10         )
   CHAR(                     10)         ,
   "한도계좌번호"                  POSITION(      20         )
   CHAR(                     20)         ,
   "한도상품대분류코드"            POSITION(      40         )
   CHAR(                      2)         ,
   "한도상품중분류코드"            POSITION(      42         )
   CHAR(                      2)         ,
   "한도상품템플릿코드"            POSITION(      44         )
   CHAR(                      3)         ,
   "한도상품번호"                  POSITION(      47         )
   CHAR(                      5)         ,
   "차주번호"                      POSITION(      52         )
   CHAR(                     13)         ,
   "BS기준잔액"                    POSITION(      65:      72)
   DECIMAL                               ,
   "명목액기준한도"                POSITION(      73:      80)
   DECIMAL                               ,
   "명목액기준잔액"                POSITION(      81:      88)
   DECIMAL                               ,
   "EAD한도"                       POSITION(      89:      96)
   DECIMAL                               ,
   "명목잔액CCF환산금액"         POSITION(      97:     104)
   DECIMAL                               ,
   "EAD한도CCF환산금액"          POSITION(     105:     112)
   DECIMAL                               ,
   "한도기준TE금액"              POSITION(     113:     120)
   DECIMAL                               ,
   "잔액기준TE금액"              POSITION(     121:     128)
   DECIMAL                               ,
   "CA담보제외금액"                POSITION(     129:     136)
   DECIMAL                               ,
   "CA담보환산금액"                POSITION(     137:     144)
   DECIMAL                               ,
   "신용공여한도"                  POSITION(     145:     152)
   DECIMAL                               ,
   "외화신용공여한도"              POSITION(     153:     160)
   DECIMAL                               ,
   "시스템최종처리일시"            POSITION(     161         )
   CHAR(                     20)         ,
   "시스템최종사용자번호"          POSITION(     181         )
   CHAR(                      7)         ,
   "BS기준한도"                    POSITION(     188:     195)
   DECIMAL
   )
//
