      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4111 (AS EAD한도초과업체명세조회)
      *@처리유형  : AS
      *@처리개요  : 관리한도 대비 Exposure 초과 기업 명세
      *@            : 를 조회하는 프로그램이다(EAD)
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081207: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091204: PC 삭제
      *김진태:20101120: EAD신규작성
      *YBH     :20130816: 조회조건 관리대상구분 추가
      *YBH     :20150430: 1단계 분리보관 처리
      *HYH     :20160923: 관리한도유효년월일 추가
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4111.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/07.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4111 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
130816     03  CO-CHA-04               PIC  X(002) VALUE '04'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   조회DC  INTERFACE
       01  XDJL4111-CA.
           COPY  XDJL4111.
130816*   처리DC  INTERFACE
       01  XDJLB111-CA.
           COPY  XDJLB111.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4111-CA.
           COPY  YNJL4111.
      *    AS COPYBOOK
       01  YPJL4111-CA.
           COPY  YPJL4111.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4111-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4111-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4111-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
150430*   고객번호
           MOVE YNJL4111-BRWR-NO
             TO JICOM-CNO

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4111-PRCSS-DSTIC = 01 OR 02 OR 04
      *@처리내용:처리구분 01:조회,02:등록및변경,04:삭제
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4111-PRCSS-DSTIC = (CO-CHA-01
130816                             OR CO-CHA-02
                                   OR CO-CHA-04)
               CONTINUE
           ELSE
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .

       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
130816     IF YNJL4111-PRCSS-DSTIC = CO-CHA-01
      *       조회DC호출
               PERFORM S3100-DJL4111-CALL-RTN
                  THRU S3100-DJL4111-CALL-EXT
           ELSE
      *       등록 및 변경,삭제 DC호출
               PERFORM S3200-DJLB111-CALL-RTN
                  THRU S3200-DJLB111-CALL-EXT
           END-IF
           .

       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   조회DC호출
      *-----------------------------------------------------------------
       S3100-DJL4111-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@  처리구분
           MOVE YNJL4111-PRCSS-DSTIC  TO  XDJL4111-I-PRCSS-DSTIC

      *@  기준일
           MOVE YNJL4111-BASE-YMD
             TO XDJL4111-I-BASE-YMD

130816*   관리대상구분
           MOVE YNJL4111-MGT-TAGET-DSTIC
             TO XDJL4111-I-MGT-TAGET-DSTIC

160923*    조회구분 1:당월 2:전체
           MOVE YNJL4111-INQURY-DSTIC
             TO XDJL4111-I-INQURY-DSTIC


      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4111 YCCOMMON-CA XDJL4111-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4001-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4111-OK
      *@      출력처리
               PERFORM S6000-OUTPUT-RTN
                  THRU S6000-OUTPUT-EXT
           ELSE
              #ERROR XDJL4111-R-ERRCD
                     XDJL4111-R-TREAT-CD
                     XDJL4111-R-STAT
           END-IF
           .

       S3100-DJL4111-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.

      *@4.1.1.1 출력라인수 조립
           MOVE XDJL4111-O-OUTPT-LINE-CNT1
             TO YPJL4111-OUTPT-LINE-CNT1

      *@4.1.1.2 그리드1 조립
      *@실행조건:WK-I > YPJL4111-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립 =
      *@SET(채무자번호1,채무자명1,관리부점1,관리한도금액1,
      *@토탈익스포져금액1,한도소진율1)
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4111-OUTPT-LINE-CNT1

      *        그리드１
               MOVE XDJL4111-O-GRID1(WK-I)
                 TO YPJL4111-GRID1  (WK-I)

         #USRLOG  'BBB' YPJL4111-MGT-LIMT-VALD-YMD(WK-I)

           END-PERFORM
           .
       S6000-OUTPUT-EXT.
           EXIT.

      *-----------------------------------------------------------------
130816*@   등록 및 변경,삭제DC호출
      *-----------------------------------------------------------------
       S3200-DJLB111-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@  처리구분
           MOVE YNJL4111-PRCSS-DSTIC
             TO XDJLB111-I-PRCSS-DSTIC
      *@  차주번호
           MOVE YNJL4111-BRWR-NO
             TO XDJLB111-I-BRWR-NO
130816*   예외사유구분코드
           MOVE YNJL4111-LIMT-EM-ECEPT-DSTCD
             TO XDJLB111-I-LIMT-EM-ECEPT-DSTCD
      *   예외사유
           MOVE YNJL4111-LIMT-EM-ECEPT-CTNT
             TO XDJLB111-I-LIMT-EM-ECEPT-CTNT

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB111 YCCOMMON-CA XDJLB111-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJLB001-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB111-OK
               MOVE CO-STAT-OK
                 TO YPJL4111-PRCSS-RSULT
           ELSE
               #ERROR XDJLB111-R-ERRCD
                      XDJLB111-R-TREAT-CD
                      XDJLB111-R-STAT
           END-IF
           .

       S3200-DJLB111-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04111000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
