      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4001 (AS채무자고객번호및고객명조회)
      *@처리유형  : AS
      *@처리개요  : 채무자고객번호및고객명조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081112: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091203: PC 삭제
      * YBH    :20150430: KB-PIN 처리
      * YBH    :20170209: KB-PIN 처리(2차)
      *정윤섭:20191122: 모기업법인고객정보추가
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4001.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/11/12.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4001 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *    DC INTERFACE COPYBOOK
       01  XDJL4001-CA.
           COPY  XDJL4001.
      *    출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4001-CA.
           COPY  YNJL4001.
      *    AS COPYBOOK
       01  YPJL4001-CA.
           COPY  YPJL4001.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4001-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4001-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4001-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호와 고객명이 동시에 입력되지 않기 때문에
      *    고객명을 SET해도 1차분리보관에 영향없음
      *    -고객번호 입력시 1차분리대상 에러발생
      *    -고객명   입력시 1차분리대상 에러 미발생
      *    고객번호유형구분
           MOVE CO-CHA-1               TO JICOM-CNO-PTRN-DSTIC
      *    고객번호
           MOVE YNJL4001-BRWR-NO       TO JICOM-CNO
      *    고객명
           MOVE YNJL4001-DBTRZ-NAME    TO JICOM-CUSTNM
170209*    KB-PIN
           MOVE YNJL4001-KB-PIN
             TO AACOM-CUST-IDNFR

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4001-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4001-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 PC호출
           PERFORM S3100-DJL4001-CALL-RTN
              THRU S3100-DJL4001-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL4001-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리PC입력파라미터=
      *@SET(처리구분,채무자번호,채무자고객명)

           MOVE YNJL4001-PRCSS-DSTIC   TO XDJL4001-I-PRCSS-DSTIC
           MOVE YNJL4001-BRWR-NO       TO XDJL4001-I-BRWR-NO
           MOVE YNJL4001-DBTRZ-NAME    TO XDJL4001-I-DBTRZ-NAME
170209     MOVE YNJL4001-KB-PIN
             TO XDJL4001-I-KB-PIN


      *@3.1.2 프로그램 호출
      *@처리내용:PC프로그램호출
           #DYCALL DJL4001 YCCOMMON-CA XDJL4001-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XPJL4001-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4001-OK
              CONTINUE
           ELSE
              #ERROR XDJL4001-R-ERRCD
                     XDJL4001-R-TREAT-CD
                     XDJL4001-R-STAT
           END-IF
           .
       S3100-DJL4001-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력라인수 조립
           MOVE XDJL4001-O-OUTPT-LINE-CNT1
             TO YPJL4001-OUTPT-LINE-CNT1

      *@4.2 그리드1 조립
      *@실행조건:WK-I > YPJL4001-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립 =
      *@SET(채무자번호,채무자고객명)
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4001-OUTPT-LINE-CNT1
      *        채무자번호
               MOVE XDJL4001-O-BRWR-NO(WK-I)
                 TO YPJL4001-BRWR-NO  (WK-I)

150430*        KB-PIN
               MOVE XDJL4001-O-KB-PIN(WK-I)
                 TO YPJL4001-KB-PIN  (WK-I)

      *        채무자고객명
               MOVE XDJL4001-O-DBTRZ-NAME(WK-I)
                 TO YPJL4001-DBTRZ-NAME  (WK-I)

191122*        모기업법인고객식별자
               MOVE XDJL4001-O-MAMA-CC-CUST-IDNFR(WK-I)
                 TO YPJL4001-MAMA-CC-CUST-IDNFR  (WK-I)

191122*        모기업법인고객명
               MOVE XDJL4001-O-MAMA-CC-CUST-NAME(WK-I)
                 TO YPJL4001-MAMA-CC-CUST-NAME  (WK-I)


           END-PERFORM
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 프로그램 종료
      *@처리내용:프로그램 정상종료
           #BOFMID 'V1KJL04001001'
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
