      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: AJL4010 (AS산업별TE한도설정)                  00030001
      *@처리유형  : AS                                                00040001
      *@처리개요  : 산업별 관리한도를 설정하고 조회하는 프  00050001
      *@            : 로그램이다                                      00060001
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20081215: 신규작성                                    00120001
      *김진태:20091102: 타팀　조치메세지　정비                      00120001
      *김진태:20091207: PC 삭제                                     00120001
      * YBH    :20200327: 엑셀일괄등록/삭제 거래 추가
      *=================================================================00130001
       IDENTIFICATION                  DIVISION.                        00140001
      *=================================================================00150001
       PROGRAM-ID.                     AJL4010.                         00160001
       AUTHOR.                         이동구.                        00170001
       DATE-WRITTEN.                   08/12/15.                        00180001
      *=================================================================00190001
       ENVIRONMENT                     DIVISION.                        00200001
      *=================================================================00210001
       CONFIGURATION                   SECTION.                         00220001
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================00230001
       DATA                            DIVISION.                        00240001
      *=================================================================00250001
       WORKING-STORAGE                 SECTION.                         00260001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4010 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
200327     03  CO-CHA-02               PIC  X(002) VALUE '02'.
200327     03  CO-CHA-03               PIC  X(002) VALUE '03'.
      *-----------------------------------------------------------------00420001
      * WORKING AREA                                                    00430001
      *-----------------------------------------------------------------00440001
       01  WK-AREA.                                                     00450001
           03  WK-I                    PIC S9(004) COMP.
      *-----------------------------------------------------------------00470001
      * PGM INTERFACE PARAMETER                                         00480001
      *-----------------------------------------------------------------00490001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   조회처리DC  INTERFACE                                       00500001
       01  XDJL4010-CA.                                                 00510001
           COPY  XDJL4010.                                              00520001
200327*   등록처리DC  INTERFACE
       01  XDJLB010-CA.
           COPY  XDJLB010.
      *   출력영역확보　및　초기화INTERFACE                           00540001
       01  XZUGOTMY-CA.                                                 00550001
           COPY  XZUGOTMY.                                              00560001
      *-----------------------------------------------------------------00570001
       LINKAGE                         SECTION.                         00580001
      *-----------------------------------------------------------------00590001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00600001
           COPY  YCCOMMON.                                              00610001
      *    AS COPYBOOK
       01  YNJL4010-CA.                                                 00630001
           COPY  YNJL4010.                                              00640001
      *    AS COPYBOOK
       01  YPJL4010-CA.                                                 00660001
           COPY  YPJL4010.                                              00670001
      *=================================================================00680001
       PROCEDURE                       DIVISION                         00690001

                                       USING       YCCOMMON-CA          00710001
                                                   YNJL4010-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------00730001
      *@  처리메인                                                    00740001
      *-----------------------------------------------------------------00750001
       S0000-MAIN-RTN.                                                  00760001
                                                                        00770001
      *@  초기화                                                      00780001
           PERFORM S1000-INITIALIZE-RTN                                 00790001
              THRU S1000-INITIALIZE-EXT                                 00800001
                                                                        00810001
      *@  업무처리                                                    00820001
           PERFORM S3000-PROCESS-RTN                                    00830001
              THRU S3000-PROCESS-EXT                                    00840001
                                                                        00850001
      *@  처리종료                                                    00860001
           PERFORM S9000-FINAL-RTN                                      00870001
              THRU S9000-FINAL-EXT                                      00880001
           .                                                            00890001
       S0000-MAIN-EXT.                                                  00900001
           EXIT.                                                        00910001
      *-----------------------------------------------------------------00920001
      *@  초기화                                                      00930001
      *-----------------------------------------------------------------00940001
       S1000-INITIALIZE-RTN.                                            00950001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA                                        00980001
                         XIJICOMM-IN
                         XDJL4010-IN                                    00990001
                         XZUGOTMY-IN                                    01000001

      *@1.2 출력영역 확보
           #GETOUT       YPJL4010-CA                                    01020001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01040001
           EXIT.                                                        01050001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK(01:조회/02:일괄등록/03:일괄삭제)
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4010-PRCSS-DSTIC = (CO-CHA-01 OR CO-CHA-02 OR
200327                                CO-CHA-03)
               CONTINUE
           ELSE
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

           IF YNJL4010-PRCSS-DSTIC = CO-CHA-01
      *@3.1   조회DC호출
               PERFORM S3100-DJL4010-CALL-RTN                           01110001
                  THRU S3100-DJL4010-CALL-EXT                           01120001
           ELSE
200327*@3.2   관리DC호출
               PERFORM S3200-DJLB010-CALL-RTN
                  THRU S3200-DJLB010-CALL-EXT
           END-IF
           .                                                            01130001
       S3000-PROCESS-EXT.                                               01140001
           EXIT.                                                        01150001
      *-----------------------------------------------------------------01160001
      *@   DC호출
      *-----------------------------------------------------------------01180001
       S3100-DJL4010-CALL-RTN.                                          01190001

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리PC입력파라미터=
      *@SET(처리구분,기준년월)
                                                                        01230002
           MOVE YNJL4010-PRCSS-DSTIC   TO XDJL4010-I-PRCSS-DSTIC        01240001
           MOVE YNJL4010-BASE-YM       TO XDJL4010-I-BASE-YM            01250001
                                                                        01260001
      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4010 YCCOMMON-CA XDJL4010-CA                      01290001
                                                                        01320001
      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4010-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4010-OK                                          01360001
      *@      출력처리
               PERFORM S6000-OUTPUT-RTN
                  THRU S6000-OUTPUT-EXT
           ELSE                                                         01380001
              #ERROR XDJL4010-R-ERRCD                                   01390001
                     XDJL4010-R-TREAT-CD                                01400001
                     XDJL4010-R-STAT                                    01410001
           END-IF                                                       01420001
           .                                                            01430001
       S3100-DJL4010-CALL-EXT.                                          01440001
           EXIT.                                                        01450001
      *-----------------------------------------------------------------01590001
      *@  출력처리                                                    01600001
      *-----------------------------------------------------------------01610001
       S6000-OUTPUT-RTN.                                                01620001
      *@4 출력처리

      *@4.1 출력라인수 조립
           MOVE XDJL4010-O-OUTPT-LINE-CNT1                              01640001
             TO YPJL4010-OUTPT-LINE-CNT1                                01650001

      *@4.2 그리드1 조립
      *@실행조건:WK-I > YPJL4010-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1                             01680001
                   UNTIL   WK-I > YPJL4010-OUTPT-LINE-CNT1              01690001
      *            그리드１                                           01710015
                   MOVE XDJL4010-O-GRID1(WK-I)                          01720001
                     TO YPJL4010-GRID1  (WK-I)                          01730001
           END-PERFORM                                                  01890001
           .                                                            01900001
       S6000-OUTPUT-EXT.                                                01910001
           EXIT.                                                        01920001

      *-----------------------------------------------------------------01170001
200327*@  산업별TE관리 DC호출
      *-----------------------------------------------------------------01190001
       S3200-DJLB010-CALL-RTN.                                          01200001

           INITIALIZE    XDJLB010-IN

           MOVE YNJL4010-PRCSS-DSTIC   TO XDJLB010-I-PRCSS-DSTIC        01270001
           MOVE YNJL4010-BASE-YM       TO XDJLB010-I-BASE-YM            01280001

      *   총라인수
           MOVE YNJL4010-TOTAL-LINE-CNT
             TO XDJLB010-I-TOTAL-LINE-CNT

           PERFORM VARYING WK-I FROM 1 BY 1 UNTIL WK-I > 1000
                        OR WK-I > YNJL4010-TOTAL-LINE-CNT
200327*        TEPEER구분
               MOVE YNJL4010-TE-PEER-DSTCD  (WK-I)
                 TO XDJLB010-I-TE-PEER-DSTCD(WK-I)
      *       산업평가등급구분
               MOVE YNJL4010-IDSTRY-V-GRD-DSTCD  (WK-I)
                 TO XDJLB010-I-IDSTRY-V-GRD-DSTCD(WK-I)
      *       산업별EAD금액
               MOVE YNJL4010-IDSTRY-PER-EAD-AMT  (WK-I)
                 TO XDJLB010-I-IDSTRY-PER-EAD-AMT(WK-I)
      *       가용EAD금액
               MOVE YNJL4010-AVL-EAD-AMT  (WK-I)
                 TO XDJLB010-I-AVL-EAD-AMT(WK-I)
      *       산업별조정비율
               MOVE YNJL4010-IDSTRY-P-ADJS-RATO  (WK-I)
                 TO XDJLB010-I-IDSTRY-P-ADJS-RATO(WK-I)
      *       산업토탈익스포져금액
               MOVE YNJL4010-IDSTRY-TE-AMT  (WK-I)
                 TO XDJLB010-I-IDSTRY-TE-AMT(WK-I)
200327*       산업관리한도금액
               MOVE YNJL4010-IDSTRY-MGT-CLAM  (WK-I)
                 TO XDJLB010-I-IDSTRY-MGT-CLAM(WK-I)
      *       국외산업관리한도금액
               MOVE YNJL4010-ABRD-I-MGT-CLAM  (WK-I)
                 TO XDJLB010-I-ABRD-I-MGT-CLAM(WK-I)
           END-PERFORM

      *@3.1.2 프로그램 호출
      *@처리내용:PC프로그램호출
           #DYCALL DJLB010 YCCOMMON-CA XDJLB010-CA                      01340001
                                                                        01370007
      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4021-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB010-OK                                          01410001
               MOVE XDJLB010-O-PRCSS-RSULT
                 TO YPJL4010-PRCSS-RSULT
           ELSE                                                         01430001
              #ERROR XDJLB010-R-ERRCD                                   01440001
                     XDJLB010-R-TREAT-CD                                01450001
                     XDJLB010-R-STAT                                    01460001
           END-IF                                                       01470001
           .                                                            01480001

       S3200-DJLB010-CALL-EXT.                                          01490001
           EXIT.                                                        01500001

      *-----------------------------------------------------------------01460001
      *@  처리종료                                                    01470001
      *-----------------------------------------------------------------01480001
       S9000-FINAL-RTN.                                                 01490001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04010000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.                                                 01520001
           EXIT.                                                        01530001
