      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4091 (AS최종설정현황조회)
      *@처리유형  : AS
      *@처리개요  : 최종설정현황조회하는 프로그램이다.
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090423: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091210: PC 삭제
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4091.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/04/23.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4091 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리PC  INTERFACE
       01  XDJL4091-CA.
           COPY  XDJL4091.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4091-CA.
           COPY  YNJL4091.
      *    AS COPYBOOK
       01  YPJL4091-CA.
           COPY  YPJL4091.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4091-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4091-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4091-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
170706*    고객번호(KB-PIN)
           MOVE YNJL4091-BRWR-NO       TO AACOM-CUST-IDNFR

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4091-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4091-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL4091-CALL-RTN
              THRU S3100-DJL4091-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL4091-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,고객구분,차주번호,신청번호)

      *    처리구분
           MOVE YNJL4091-PRCSS-DSTIC
             TO XDJL4091-I-PRCSS-DSTIC

      *    고객구분
           MOVE YNJL4091-CUST-DSTIC
             TO XDJL4091-I-CUST-DSTIC

      *    차주번호
           MOVE YNJL4091-BRWR-NO
             TO XDJL4091-I-BRWR-NO

      *    신청번호
           MOVE YNJL4091-APLCN-NO
             TO XDJL4091-I-APLCN-NO

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4091 YCCOMMON-CA XDJL4091-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4091-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4091-OK
              CONTINUE
           ELSE
              #ERROR XDJL4091-R-ERRCD
                     XDJL4091-R-TREAT-CD
                     XDJL4091-R-STAT
           END-IF
           .
       S3100-DJL4091-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립

      *    채무자명
           MOVE XDJL4091-O-DBTRZ-NAME
             TO YPJL4091-DBTRZ-NAME

      *    당행자기자본
           MOVE XDJL4091-O-OWBNK-ONCP
             TO YPJL4091-OWBNK-ONCP

      *    최종설정일
           MOVE XDJL4091-O-LAST-STUP-DD
             TO YPJL4091-LAST-STUP-DD

      *    한도설정유효일
           MOVE XDJL4091-O-LIMT-STUP-VALD-DD
             TO YPJL4091-LIMT-STUP-VALD-DD

      *    관리한도
           MOVE XDJL4091-O-MGT-LIMT
             TO YPJL4091-MGT-LIMT

      *    여신성관리한도
           MOVE XDJL4091-O-LNBZ-I-MGT-LIMT
             TO YPJL4091-LNBZ-I-MGT-LIMT

      *    시장성관리한도
           MOVE XDJL4091-O-MRKTY-MGT-LIMT
             TO YPJL4091-MRKTY-MGT-LIMT

      *    개별기업최고한도
           MOVE XDJL4091-O-IDIVI-C-HGST-LIMT
             TO YPJL4091-IDIVI-C-HGST-LIMT

      *    그룹별최고한도
           MOVE XDJL4091-O-GROUP-PER-HGST-LIMT
             TO YPJL4091-GROUP-PER-HGST-LIMT

      *    개별기업최고한도2
           MOVE XDJL4091-O-IDIVI-C-HGST-LIMT2
             TO YPJL4091-IDIVI-C-HGST-LIMT2

      *    제조금융구분
           MOVE XDJL4091-O-MNFC-FINAC-DSTIC
             TO YPJL4091-MNFC-FINAC-DSTIC
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@실행조건:XPJL4091-I-PRCSS-DSTIC = CO-CHA-01
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11009000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
