      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL409D (AS기업및그룹한도신청및승인조회)
      *@처리유형  : AS
      *@처리개요  : 승인서출력
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090514: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091210: PC  삭제
      * YBH    :20161216: TE관리한도 설정 추가
      * YBH    :20170706:  3개년 재무제표실적에 의한
      *                   기준한도 산출
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL409D.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/05/18.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL409D '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJL409D-CA.
           COPY  XDJL409D.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL409D-CA.
           COPY  YNJL409D.
      *    AS COPYBOOK
       01  YPJL409D-CA.
           COPY  YPJL409D.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL409D-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL409D-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL409D-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호(KB-PIN)
           MOVE YNJL409D-BRWR-NO       TO AACOM-CUST-IDNFR

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL409D-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL409D-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL409D-CALL-RTN
              THRU S3100-DJL409D-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL409D-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,고객구분,차주번호,신청번호,한도신청구분)

      *    처리구분
           MOVE YNJL409D-PRCSS-DSTIC
             TO XDJL409D-I-PRCSS-DSTIC

      *    고객구분
           MOVE YNJL409D-CUST-DSTIC
             TO XDJL409D-I-CUST-DSTIC

      *    차주번호
           MOVE YNJL409D-BRWR-NO
             TO XDJL409D-I-BRWR-NO

      *    신청번호
           MOVE YNJL409D-APLCN-NO
             TO XDJL409D-I-APLCN-NO

      *    한도신청구분
           MOVE YNJL409D-LIMT-APLCN-DSTIC
             TO XDJL409D-I-LIMT-APLCN-DSTIC

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL409D YCCOMMON-CA XDJL409D-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL409D-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL409D-OK
              CONTINUE
           ELSE
              #ERROR XDJL409D-R-ERRCD
                     XDJL409D-R-TREAT-CD
                     XDJL409D-R-STAT
           END-IF
           .
       S3100-DJL409D-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립

      *    승인년월일
           MOVE XDJL409D-O-ATHOR-YMD
             TO YPJL409D-ATHOR-YMD

      *    영업점명1
           MOVE XDJL409D-O-BBRN-NAME1
             TO YPJL409D-BBRN-NAME1

      *    영업점명2
           MOVE XDJL409D-O-BBRN-NAME2
             TO YPJL409D-BBRN-NAME2

      *    차주명
           MOVE XDJL409D-O-BRWR-NAME
             TO YPJL409D-BRWR-NAME

      *    차주번호
           MOVE XDJL409D-O-BRWR-NO
             TO YPJL409D-BRWR-NO

      *    기업신용등급
           MOVE XDJL409D-O-CORP-CRDRAT
             TO YPJL409D-CORP-CRDRAT

      *    그룹명
           MOVE XDJL409D-O-GROUP-NAME
             TO YPJL409D-GROUP-NAME

      *    그룹등급
           MOVE XDJL409D-O-GROUP-GRD
             TO YPJL409D-GROUP-GRD

      *    표준산업분류코드
           MOVE XDJL409D-O-STND-I-CLSFI-CD
             TO YPJL409D-STND-I-CLSFI-CD

      *    PEER코드
           MOVE XDJL409D-O-PEER-CD
             TO YPJL409D-PEER-CD

      *    IR등급
           MOVE XDJL409D-O-INRT-GRD
             TO YPJL409D-INRT-GRD

      *    승인번호
           MOVE XDJL409D-O-ATHOR-NO
             TO YPJL409D-ATHOR-NO

      *    직원번호
           MOVE XDJL409D-O-EMPID
             TO YPJL409D-EMPID

      *    직원명
           MOVE XDJL409D-O-EMNM
             TO YPJL409D-EMNM

      *    신청구분
           MOVE XDJL409D-O-APLCN-DSTIC
             TO YPJL409D-APLCN-DSTIC

      *    승인권자
           MOVE XDJL409D-O-ATRZ
             TO YPJL409D-ATRZ

      *    승인구분
           MOVE XDJL409D-O-ATHOR-DSTIC
             TO YPJL409D-ATHOR-DSTIC

      *    조건부승인조건
           MOVE XDJL409D-O-CNDT-ATHOR-CNDN
             TO YPJL409D-CNDT-ATHOR-CNDN

      *    기준한도
           MOVE XDJL409D-O-BASE-LIMT
             TO YPJL409D-BASE-LIMT

      *    한도설정유효일
           MOVE XDJL409D-O-LIMT-STUP-VALD-DD
             TO YPJL409D-LIMT-STUP-VALD-DD

      *    여신성관리한도
           MOVE XDJL409D-O-LNBZ-I-MGT-LIMT
             TO YPJL409D-LNBZ-I-MGT-LIMT

      *    시장성관리한도
           MOVE XDJL409D-O-MRKTY-MGT-LIMT
             TO YPJL409D-MRKTY-MGT-LIMT

      *    관리한도
           MOVE XDJL409D-O-MGT-LIMT
             TO YPJL409D-MGT-LIMT

      *    익스포져
           MOVE XDJL409D-O-EXPSR
             TO YPJL409D-EXPSR

      *    여신성관리한도(그룹)
           MOVE XDJL409D-O-LNBZ-I-MGT-LIMT1
             TO YPJL409D-LNBZ-I-MGT-LIMT1

      *    시장성관리한도(그룹)
           MOVE XDJL409D-O-MRKTY-MGT-LIMT1
             TO YPJL409D-MRKTY-MGT-LIMT1

      *    관리한도(그룹)
           MOVE XDJL409D-O-MGT-LIMT1
             TO YPJL409D-MGT-LIMT1

      *    익스포져(그룹)
           MOVE XDJL409D-O-EXPSR1
             TO YPJL409D-EXPSR1

      *    산업군명
           MOVE XDJL409D-O-IDSTRY-GROUP-NAME
             TO YPJL409D-IDSTRY-GROUP-NAME

      *    산업별관리한도
           MOVE XDJL409D-O-IDSTRY-PER-MGT-LIMT
             TO YPJL409D-IDSTRY-PER-MGT-LIMT

      *    산업별익스포져
           MOVE XDJL409D-O-IDSTRY-PER-EXPSR
             TO YPJL409D-IDSTRY-PER-EXPSR

161216*   상환능력기준한도
           MOVE XDJL409D-O-SOLVN-BASE-CLAM
             TO YPJL409D-SOLVN-BASE-CLAM

161216*   규모기준한도
           MOVE XDJL409D-O-SCAL-BASE-CLAM
             TO YPJL409D-SCAL-BASE-CLAM

161216*   기준한도2
           MOVE XDJL409D-O-BASE-LIMT2
             TO YPJL409D-BASE-LIMT2

161216*   관리한도2
           MOVE XDJL409D-O-MGT-LIMT2
             TO YPJL409D-MGT-LIMT2

161216*   기준한도초과여부
           MOVE XDJL409D-O-BASE-LIMT-EXCS-YN
             TO YPJL409D-BASE-LIMT-EXCS-YN

170706*   재무적용연수
           MOVE XDJL409D-O-FNAF-APLY-NOY
             TO YPJL409D-FNAF-APLY-NOY

161216*   한도승인사유구분
           MOVE XDJL409D-O-LIMT-A-RESN-DSTCD
             TO YPJL409D-LIMT-A-RESN-DSTCD

      *    변경전여신성관리한도
           MOVE XDJL409D-O-MODFI-BLI-MGT-LIMT
             TO YPJL409D-MODFI-BLI-MGT-LIMT

      *    변경전시장성관리한도
           MOVE XDJL409D-O-MODFI-BM-MGT-LIMT
             TO YPJL409D-MODFI-BM-MGT-LIMT

      *    합계1
           MOVE XDJL409D-O-SUM1
             TO YPJL409D-SUM1

      *    변경후여신성관리한도
           MOVE XDJL409D-O-MODFI-ALI-MGT-LIMT
             TO YPJL409D-MODFI-ALI-MGT-LIMT

      *    변경후시장성관리한도
           MOVE XDJL409D-O-MODFI-AM-MGT-LIMT
             TO YPJL409D-MODFI-AM-MGT-LIMT

      *    합계2
           MOVE XDJL409D-O-SUM2
             TO YPJL409D-SUM2

      *    승인사유
           MOVE XDJL409D-O-ATHOR-RESN
             TO YPJL409D-ATHOR-RESN
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04008000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
