      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4136 (AS대주주(특수관계인포함)에
      *                                    대한신용공여현황조회 )
      *@처리유형  : AS
      *@처리개요  : 당행 대주주(특수관계인 포함)에 대한
      *               신용공여 현황조회하는 프로그램이다
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *박정수:20240425: 신규작성
      *박정수:20240926: 컬럼 추가
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4136.
       AUTHOR.                         박정수.
       DATE-WRITTEN.                   24/04/25.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4136 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJL4136-CA.
           COPY  XDJL4136.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4136-CA.
           COPY  YNJL4136.
      *    AS COPYBOOK
       01  YPJL4136-CA.
           COPY  YPJL4136.
      *=================================================================
       PROCEDURE                       DIVISION

                                       USING       YCCOMMON-CA
                                                   YNJL4136-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4136-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4136-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4136-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4136-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@   기준년월일
           IF YNJL4136-BASE-YMD = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=

           MOVE YNJL4136-PRCSS-DSTIC   TO XDJL4136-I-PRCSS-DSTIC
           MOVE YNJL4136-BASE-YMD      TO XDJL4136-I-BASE-YMD
           MOVE YNJL4136-JRSDZ-BRNCD   TO XDJL4136-I-JRSDZ-BRNCD

      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4136 YCCOMMON-CA XDJL4136-CA

      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4136-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4136-OK
              CONTINUE
           ELSE
              #ERROR XDJL4136-R-ERRCD
                     XDJL4136-R-TREAT-CD
                     XDJL4136-R-STAT
           END-IF
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립
      *    업무규제자기자본
           MOVE  XDJL4136-O-BZWK-REGUL-ONCP
             TO  YPJL4136-BZWK-REGUL-ONCP

      *    자기자본기준년월
           MOVE  XDJL4136-O-ONCP-BASE-YM
             TO  YPJL4136-ONCP-BASE-YM

      *    대주주 신용공여한도
           MOVE  XDJL4136-O-STKLN-M-GRCR-LIMT
             TO  YPJL4136-STKLN-M-GRCR-LIMT

      *    대주주 신용공여잔액
           MOVE  XDJL4136-O-STKLN-MAIN-GRCR-BAL
             TO  YPJL4136-STKLN-MAIN-GRCR-BAL

      *    대주주 한도여유액
           MOVE  XDJL4136-O-STKLN-ML-SEXTR-AMT
             TO  YPJL4136-STKLN-ML-SEXTR-AMT

      *    자회사 신용공여한도
           MOVE  XDJL4136-O-SBCO-GRCR-LIMT
             TO  YPJL4136-SBCO-GRCR-LIMT

      *    자회사 신용공여잔액
           MOVE  XDJL4136-O-SBCO-GRCR-BAL
             TO  YPJL4136-SBCO-GRCR-BAL

      *    자회사 한도여유액
           MOVE  XDJL4136-O-SBCO-LIMT-SEXTR-AMT
             TO  YPJL4136-SBCO-LIMT-SEXTR-AMT

      *    전체 신용공여한도
           MOVE  XDJL4136-O-GRCR-LIMT
             TO  YPJL4136-GRCR-LIMT

      *    전체 신용공여잔액
           MOVE  XDJL4136-O-GRCR-BAL
             TO  YPJL4136-GRCR-BAL

      *    전체 한도여유액
           MOVE  XDJL4136-O-LIMT-SEXTR-AMT
             TO  YPJL4136-LIMT-SEXTR-AMT

      *@4.2 출력라인수 조립
           MOVE XDJL4136-O-OUTPT-LINE-CNT1
             TO YPJL4136-OUTPT-LINE-CNT1

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJL4136-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4136-OUTPT-LINE-CNT1
      *            그리드
                   MOVE XDJL4136-O-GRID1(WK-I)
                     TO YPJL4136-GRID1(WK-I)
           END-PERFORM
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04136000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
