      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: AJL4113 (EAD-과목별TE현황조회)                00030001
      *@처리유형  : AS                                                00040001
      *@처리개요  : 조회기준일과 채무자번호에 대한 자산의     00050001
      *@            : 상품코드별 구성현황을 조회하는 프로그램이 00060001
      *@            : 다                                              00070001
      *-----------------------------------------------------------------00080001
      *                 P R O G R A M   변　경　이　력                00090001
      *-----------------------------------------------------------------00100001
      *@성명 : 일자 : 변　경　내　용                              00110001
      * ----------------------------------------------------------------00120001
      *김진태:20101029: 신규작성                                    00130001
      *=================================================================00140001
       IDENTIFICATION                  DIVISION.                        00150001
      *=================================================================00160001
       PROGRAM-ID.                     AJL4113.                         00170001
       AUTHOR.                         김진태.                        00180001
       DATE-WRITTEN.                   10/10/29.                        00190001
      *=================================================================00210001
       ENVIRONMENT                     DIVISION.                        00220001
      *=================================================================00230001
       CONFIGURATION                   SECTION.                         00240001
       SOURCE-COMPUTER.                IBM-Z10.                         00250001
       OBJECT-COMPUTER.                IBM-Z10.                         00260001
      *=================================================================00280001
       DATA                            DIVISION.                        00290001
      *=================================================================00300001
       WORKING-STORAGE                 SECTION.                         00310001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4113'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
      *-----------------------------------------------------------------00510001
      * WORKING AREA                                                    00520001
      *-----------------------------------------------------------------00530001
       01  WK-AREA.                                                     00540001
           03  WK-I                    PIC  9(005) COMP.                00550001
      *-----------------------------------------------------------------00560001
      * PGM INTERFACE PARAMETER                                         00570001
      *-----------------------------------------------------------------00580001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리PC  INTERFACE
       01  XDJL4113-CA.                                                 00630001
           COPY  XDJL4113.                                              00640001
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.                                                 00600001
           COPY  XZUGOTMY.                                              00610001
      *-----------------------------------------------------------------00660001
       LINKAGE                         SECTION.                         00670001
      *-----------------------------------------------------------------00680001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00690001
           COPY  YCCOMMON.                                              00700001
      *    AS COPYBOOK
       01  YNJL4113-CA.                                                 00720001
           COPY  YNJL4113.                                              00730001
      *    AS COPYBOOK
       01  YPJL4113-CA.                                                 00750001
           COPY  YPJL4113.                                              00760001
      *=================================================================00780001
       PROCEDURE                       DIVISION                         00790001
                                       USING       YCCOMMON-CA          00800001
                                                   YNJL4113-CA
                                                   .
      *=================================================================00830001
      *-----------------------------------------------------------------00850001
      *@  처리메인                                                    00860001
      *-----------------------------------------------------------------00870001
       S0000-MAIN-RTN.                                                  00880001
                                                                        00890001
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            01050001
       S0000-MAIN-EXT.                                                  01070001
           EXIT.                                                        01080001
      *-----------------------------------------------------------------01090001
      *@  초기화                                                      01100001
      *-----------------------------------------------------------------01110001
       S1000-INITIALIZE-RTN.                                            01120001
                                                                        01130001
      *@출력영역확보 파라미터 및 결과코드 초기화              01140001
           INITIALIZE    WK-AREA                                        01150001
                         XIJICOMM-IN
                         XDJL4113-IN                                    01160001
                         XZUGOTMY-IN                                    01170001
      *@출력영역 확보                                               01180001
           #GETOUT       YPJL4113-CA                                    01190001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호유형구분
           MOVE CO-CHA-1               TO JICOM-CNO-PTRN-DSTIC
      *    고객번호
           MOVE YNJL4113-BRWR-NO       TO JICOM-CNO

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01220001
           EXIT.                                                        01230001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4113-PRCSS-DSTIC NOT = CO-CHA-01 AND
      *@ CO-CHA-02
      *@처리내용:처리구분 01,02 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4113-PRCSS-DSTIC NOT = CO-CHA-01 AND
                                         CO-CHA-02
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL4113-CALL-RTN                               01350001
              THRU S3100-DJL4113-CALL-EXT                               01360001
           .                                                            01370001
       S3000-PROCESS-EXT.                                               01390001
           EXIT.                                                        01400001
      *-----------------------------------------------------------------01410001
      *@   DC호출
      *-----------------------------------------------------------------01430001
       S3100-DJL4113-CALL-RTN.                                          01440001
      *@1 과목별TE현황조회

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,차주번호,기준년월일)
                                                                        01450001
           MOVE YNJL4113-PRCSS-DSTIC   TO XDJL4113-I-PRCSS-DSTIC        01460001
           MOVE YNJL4113-BRWR-NO       TO XDJL4113-I-BRWR-NO            01490001
           MOVE YNJL4113-BASE-YMD      TO XDJL4113-I-BASE-YMD
                                                                        01500001
      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4113 YCCOMMON-CA XDJL4113-CA                      01510001

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4013-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4113-OK                                          01550001
              CONTINUE                                                  01560001
           ELSE                                                         01570001
              #ERROR XDJL4113-R-ERRCD                                   01580001
                     XDJL4113-R-TREAT-CD                                01590001
                     XDJL4113-R-STAT                                    01600001
           END-IF                                                       01610001
           .                                                            01840001
       S3100-DJL4113-CALL-EXT.                                          01860001
           EXIT.                                                        01870001
      *-----------------------------------------------------------------02180001
      *@  출력처리                                                    021900
      *-----------------------------------------------------------------02200001
       S6000-OUTPUT-RTN.                                                02210001

      *@4 출력처리

      *@4.1 출력항목 조립

      *    채무자명
           MOVE XDJL4113-O-BRWR-NAME
             TO YPJL4113-BRWR-NAME
      *    TE기준한도
           MOVE XDJL4113-O-TE-BASE-LIMT
             TO YPJL4113-TE-BASE-LIMT
      *    기준한도산출일
           MOVE XDJL4113-O-BASE-LIMT-CMPTN-DD
             TO YPJL4113-BASE-LIMT-CMPTN-DD
      *    한도설정유효일
           MOVE XDJL4113-O-LIMT-STUP-VALD-DD
             TO YPJL4113-LIMT-STUP-VALD-DD
      *    여신성관리한도
           MOVE XDJL4113-O-LNBZ-I-MGT-LIMT
             TO YPJL4113-LNBZ-I-MGT-LIMT
      *    여신성한도기준TE
           MOVE XDJL4113-O-LNBZ-I-LIMT-BASE-TE
             TO YPJL4113-LNBZ-I-LIMT-BASE-TE
      *    여신성잔액기준TE
           MOVE XDJL4113-O-LNBZ-I-BAL-BASE-TE
             TO YPJL4113-LNBZ-I-BAL-BASE-TE
      *    여신성한도여유액
           MOVE XDJL4113-O-LNBZ-IL-SEXTR-AMT
             TO YPJL4113-LNBZ-IL-SEXTR-AMT
      *    시장성관리한도
           MOVE XDJL4113-O-MRKTY-MGT-LIMT
             TO YPJL4113-MRKTY-MGT-LIMT
      *    시장성한도기준TE
           MOVE XDJL4113-O-MRKTY-LIMT-BASE-TE
             TO YPJL4113-MRKTY-LIMT-BASE-TE
      *    시장성잔액기준TE
           MOVE XDJL4113-O-MRKTY-BAL-BASE-TE
             TO YPJL4113-MRKTY-BAL-BASE-TE
      *    시장성한도여유액
           MOVE XDJL4113-O-MRKTY-L-SEXTR-AMT
             TO YPJL4113-MRKTY-L-SEXTR-AMT
      *    관리한도
           MOVE XDJL4113-O-MGT-LIMT
             TO YPJL4113-MGT-LIMT
      *    한도기준TE
           MOVE XDJL4113-O-LIMT-BASE-TE
             TO YPJL4113-LIMT-BASE-TE
      *    잔액기준TE
           MOVE XDJL4113-O-BAL-BASE-TE
             TO YPJL4113-BAL-BASE-TE
      *    한도여유액
           MOVE XDJL4113-O-LIMT-SEXTR-AMT
             TO YPJL4113-LIMT-SEXTR-AMT
      *    (파생상품총거래한도)
           MOVE XDJL4113-O-DRVT-PT-TRAN-LIMT
             TO YPJL4113-DRVT-PT-TRAN-LIMT
      *    (파생상품Exposure)
           MOVE XDJL4113-O-DRVT-PRDCT-EXPSR
             TO YPJL4113-DRVT-PRDCT-EXPSR

      *@4.2 처리구분CHECK
      *@실행조건:YNJL4113-PRCSS-DSTIC = CO-CHA-01
      *@처리내용:처리구분 "01" 이면 그리드1 조립
           IF YNJL4113-PRCSS-DSTIC = CO-CHA-01

      *@4.2.1 출력라인수 조립
              MOVE XDJL4113-O-OUTPT-LINE-CNT1
                TO YPJL4113-OUTPT-LINE-CNT1

      *@4.2.2 그리드1 조립
      *@실행조건:WK-I > YPJL4113-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립 =
      *@SET(토탈익스포져항목구분1,한도통합계정과목코드1,
      *@계정과목명1,토탈익스포져자산구분코드1,
      *@명목액기준한도금액1,명목액기준잔액1
      *@토탈익스포져한도환산금액1,토탈익스포져잔액환산금액1
              PERFORM VARYING WK-I FROM 1 BY 1
                      UNTIL   WK-I > YPJL4113-OUTPT-LINE-CNT1

      *               토탈익스포져항목구분1
                      MOVE XDJL4113-O-TE-ITEM-DSTIC1    (WK-I)
                        TO YPJL4113-TE-ITEM-DSTIC1      (WK-I)
      *               상품코드1
                      MOVE XDJL4113-O-PRDCT-CD1         (WK-I)
                        TO YPJL4113-PRDCT-CD1           (WK-I)
      *               상품명1
                      MOVE XDJL4113-O-PRDCT-NAME1       (WK-I)
                        TO YPJL4113-PRDCT-NAME1         (WK-I)
      *               토탈익스포져자산구분코드1
                      MOVE XDJL4113-O-TE-ASST-DSTCD1    (WK-I)
                        TO YPJL4113-TE-ASST-DSTCD1      (WK-I)
      *               명목액기준한도금액1
                      MOVE XDJL4113-O-TTL-AMT-BASE-CLAM1(WK-I)
                        TO YPJL4113-TTL-AMT-BASE-CLAM1  (WK-I)
      *               명목액기준잔액1
                      MOVE XDJL4113-O-TTL-AMT-BASE-BAL1 (WK-I)
                        TO YPJL4113-TTL-AMT-BASE-BAL1   (WK-I)
      *               토탈익스포져한도환산금액1
                      MOVE XDJL4113-O-TE-LIMT-AUC1      (WK-I)
                        TO YPJL4113-TE-LIMT-AUC1        (WK-I)
      *               토탈익스포져잔액환산금액1
                      MOVE XDJL4113-O-TE-BAL-AUC1       (WK-I)
                        TO YPJL4113-TE-BAL-AUC1         (WK-I)

              END-PERFORM

      *@4.3 처리구분CHECK
      *@실행조건:YNJL4113-PRCSS-DSTIC = CO-CHA-02
      *@처리내용:처리구분 "02" 이면 그리드2 조립
           ELSE

      *@4.3.1 출력라인수 조립
              MOVE XDJL4113-O-OUTPT-LINE-CNT2
                TO YPJL4113-OUTPT-LINE-CNT2

      *@4.3.2 그리드2 조립
      *@실행조건:WK-I > YPJL4113-OUTPT-LINE-CNT2
      *@처리내용:그리드2 조립 =
      *@SET(토탈익스포져항목구분2,한도통합계정과목코드2,
      *@계정과목명2,토탈익스포져자산구분코드2,
      *@명목액기준한도금액2,명목액기준잔액2
      *@토탈익스포져한도환산금액2,토탈익스포져잔액환산금액2
              PERFORM VARYING WK-I FROM 1 BY 1
                      UNTIL   WK-I > YPJL4113-OUTPT-LINE-CNT2

      *               토탈익스포져항목구분2
                      MOVE XDJL4113-O-TE-ITEM-DSTIC2    (WK-I)
                        TO YPJL4113-TE-ITEM-DSTIC2      (WK-I)
      *               한도통합계정과목코드2
                      MOVE XDJL4113-O-PRDCT-CD2         (WK-I)
                        TO YPJL4113-PRDCT-CD2           (WK-I)
      *               계정과목명2
                      MOVE XDJL4113-O-PRDCT-NAME2       (WK-I)
                        TO YPJL4113-PRDCT-NAME2         (WK-I)
      *               토탈익스포져자산구분코드2
                      MOVE XDJL4113-O-TE-ASST-DSTCD2    (WK-I)
                        TO YPJL4113-TE-ASST-DSTCD2      (WK-I)
      *               명목액기준한도금액2
                      MOVE XDJL4113-O-TTL-AMT-BASE-CLAM2(WK-I)
                        TO YPJL4113-TTL-AMT-BASE-CLAM2  (WK-I)
      *               명목액기준잔액2
                      MOVE XDJL4113-O-TTL-AMT-BASE-BAL2 (WK-I)
                        TO YPJL4113-TTL-AMT-BASE-BAL2   (WK-I)
      *               토탈익스포져한도환산금액2
                      MOVE XDJL4113-O-TE-LIMT-AUC2      (WK-I)
                        TO YPJL4113-TE-LIMT-AUC2        (WK-I)
      *               토탈익스포져잔액환산금액2
                      MOVE XDJL4113-O-TE-BAL-AUC2       (WK-I)
                        TO YPJL4113-TE-BAL-AUC2         (WK-I)

              END-PERFORM
           END-IF
           .                                                            03340003
       S6000-OUTPUT-EXT.                                                03350001
           EXIT.                                                        03360001
      *-----------------------------------------------------------------01880001
      *@  처리종료                                                    01890001
      *-----------------------------------------------------------------01900001
       S9000-FINAL-RTN.                                                 01910001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04113000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK                                           01930001
           .                                                            01940001
       S9000-FINAL-EXT.                                                 01950001
           EXIT.                                                        01960001
