      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4027 (AS포괄신용공여한도과목별여신현황)
      *@처리유형  : AS
      *@처리개요  : 포괄신용공여한도 설정대상 기업의 기업여
      *@            : 신 현황을 과목별로 조회하는 프로그램이
      *@            : 다．
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *백현정:20110211:신규작성
      *백현정:20110603: TE여신성최고한도，최종적용포괄한도　추가
      *박정수:20220223: 사용액 산출방법 변경,
      *                 과거 데이터 조회 개선
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4027.
       AUTHOR.                         이동구.
       DATE-WRITTEN.                   11/02/11.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4027 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리PC  INTERFACE
       01  XDJL4027-CA.
           COPY  XDJL4027.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4027-CA.
           COPY  YNJL4027.
      *    AS COPYBOOK
       01  YPJL4027-CA.
           COPY  YPJL4027.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4027-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4027-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호
           MOVE YNJL4027-KB-PIN        TO AACOM-CUST-IDNFR

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4027-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4027-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

           INITIALIZE    XDJL4027-IN

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,차주번호,기준년월일)
           MOVE YNJL4027-PRCSS-DSTIC   TO XDJL4027-I-PRCSS-DSTIC
           MOVE YNJL4027-KB-PIN        TO XDJL4027-I-KB-PIN
           MOVE YNJL4027-BASE-YMD      TO XDJL4027-I-BASE-YMD

      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4027 YCCOMMON-CA XDJL4027-CA

      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4027-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4027-OK
              CONTINUE
           ELSE
              #ERROR XDJL4027-R-ERRCD
                     XDJL4027-R-TREAT-CD
                     XDJL4027-R-STAT
           END-IF
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJL4027-O-DBTRZ-NAME
             TO YPJL4027-DBTRZ-NAME
           MOVE XDJL4027-O-MGT-CLAM
             TO YPJL4027-MGT-CLAM
           MOVE XDJL4027-O-AFFLT-C-GROUP-NAME
             TO YPJL4027-AFFLT-C-GROUP-NAME
           MOVE XDJL4027-O-MGT-LIMT-VALD-YMD
             TO YPJL4027-MGT-LIMT-VALD-YMD
           MOVE XDJL4027-O-INLS-GRCR-LIMT-AUC
             TO YPJL4027-INLS-GRCR-LIMT-AUC
           MOVE XDJL4027-O-INTNL-CV-GRD-DSTCD
             TO YPJL4027-INTNL-CV-GRD-DSTCD
           MOVE XDJL4027-O-STND-IDSTRY-CD-NAME
             TO YPJL4027-STND-IDSTRY-CD-NAME
           MOVE XDJL4027-O-LIMT-SEXTR-AMT
             TO YPJL4027-LIMT-SEXTR-AMT
           MOVE XDJL4027-O-INTNL-CV-GRD-DSTCD1
             TO YPJL4027-INTNL-CV-GRD-DSTCD1
      * 2011.06.03 TE여신성최고한도　추가
           MOVE XDJL4027-O-LNBZ-I-HGST-LIMT
             TO YPJL4027-LNBZ-I-HGST-LIMT
      * 2011.06.03최종적용포괄한도　추가
           MOVE XDJL4027-O-LAST-INLS-LIMT
             TO YPJL4027-LAST-INLS-LIMT

      *@4.2 출력라인수 조립
           MOVE XDJL4027-O-OUTPT-LINE-CNT1
             TO YPJL4027-OUTPT-LINE-CNT1

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJL4027-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4027-OUTPT-LINE-CNT1

                   MOVE XDJL4027-O-GRID1(WK-I)
                     TO YPJL4027-GRID1(WK-I)
           END-PERFORM
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04027000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
