      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          0002
      *@프로그램명: AJL4041 (AS국가별정보조회)
      *@처리유형  : AS                                                0004
      *@처리개요  : 국가별 관리한도정보를 조회하는
      *@            : 이다                                            0006
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                0008
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------00110001
      *이동구:20090107: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091209: PC 삭제
      *김진태:20100408: COPYBOOK 변경
      *=================================================================00130001
       IDENTIFICATION                  DIVISION.                        00140001
      *=================================================================00150001
       PROGRAM-ID.                     AJL4041.                         00160001
       AUTHOR.                         이동구.                        0017
       DATE-WRITTEN.                   09/01/07.                        00180001
      *=================================================================00190001
       ENVIRONMENT                     DIVISION.                        00200001
      *=================================================================00210001
       CONFIGURATION                   SECTION.                         00220001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00230001
       DATA                            DIVISION.                        00240001
      *=================================================================00250001
       WORKING-STORAGE                 SECTION.                         00260001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4041 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------00420001
      * WORKING AREA                                                    00430001
      *-----------------------------------------------------------------00440001
       01  WK-AREA.                                                     00450001
           03  WK-I                    PIC  9(005) COMP.                00460001
      *-----------------------------------------------------------------00470001
      * PGM INTERFACE PARAMETER                                         00480001
      *-----------------------------------------------------------------00490001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           0050
       01  XDJL4041-CA.                                                 00510001
           COPY  XDJL4041.                                              00520001
      *   출력영역확보　및　초기화INTERFACE                           0053
       01  XZUGOTMY-CA.                                                 00540001
           COPY  XZUGOTMY.                                              00550001
      *-----------------------------------------------------------------00560001
       LINKAGE                         SECTION.                         00570001
      *-----------------------------------------------------------------00580001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00590001
           COPY  YCCOMMON.                                              00600001
      *    AS COPYBOOK
       01  YNJL4041-CA.                                                 00610001
           COPY  YNJL4041.                                              00620001
      *    AS COPYBOOK
       01  YPJL4041-CA.                                                 00630001
           COPY  YPJL4041.                                              00640001
      *=================================================================00650001
       PROCEDURE                       DIVISION                         00660001
                                       USING       YCCOMMON-CA          00680001
                                                   YNJL4041-CA
                                                   .
      *=================================================================00670001
      *-----------------------------------------------------------------00700001
      *@  처리메인                                                    0071
      *-----------------------------------------------------------------00720001
       S0000-MAIN-RTN.                                                  00730001
                                                                        00740001
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            00860001
       S0000-MAIN-EXT.                                                  00870001
           EXIT.                                                        00880001
      *-----------------------------------------------------------------00890001
      *@  초기화                                                      0090
      *-----------------------------------------------------------------00910001
       S1000-INITIALIZE-RTN.                                            00920001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4041-IN                                    00950001
                         XZUGOTMY-IN                                    00960001
                                                                        00970001
      *@1.2 출력영역 확보
           #GETOUT       YPJL4041-CA                                    00990001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01010001
           EXIT.                                                        01020001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4041-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4041-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------01030001
      *@  업무처리                                                    0104
      *-----------------------------------------------------------------01050001
       S3000-PROCESS-RTN.                                               01060001
      *@3 업무처리

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,기준년월,ISO국가코드)

           MOVE YNJL4041-PRCSS-DSTIC   TO XDJL4041-I-PRCSS-DSTIC        01100001
           MOVE YNJL4041-BASE-YM       TO XDJL4041-I-BASE-YM            01110001
           MOVE YNJL4041-ISO-NATNL-CD  TO XDJL4041-I-ISO-NATNL-CD       01120001
                                                                        01130001
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4041 YCCOMMON-CA XDJL4041-CA                      01160001
                                                                        01190001
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4041-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4041-OK                                          01230001
              CONTINUE                                                  01240001
           ELSE                                                         01250001
              #ERROR XDJL4041-R-ERRCD                                   01260001
                     XDJL4041-R-TREAT-CD                                01270001
                     XDJL4041-R-STAT                                    01280001
           END-IF                                                       01290001
           .                                                            01300001
       S3000-PROCESS-EXT.                                               01310001
           EXIT.                                                        01320001
      *-----------------------------------------------------------------01680000
      *@  출력처리                                                    01690000
      *-----------------------------------------------------------------01700000
       S6000-OUTPUT-RTN.                                                01710000
      *@4 출력처리

      *@4.1 국가명 조립
           MOVE XDJL4041-O-ENG-NATNL-NAME                               01880001
             TO YPJL4041-ENG-NATNL-NAME                                 01890001

      *@4.2 출력라인수 조립
           MOVE XDJL4041-O-OUTPT-LINE-CNT1                              01880001
             TO YPJL4041-OUTPT-LINE-CNT1                                01890001

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJL4037-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1                             01910001
                   UNTIL   WK-I > YPJL4041-OUTPT-LINE-CNT1              01920001
                   MOVE XDJL4041-O-GRID1(WK-I)                          01930000
                     TO YPJL4041-GRID1(WK-I)                            02630001
           END-PERFORM                                                  02640000
           .                                                            02650000
       S6000-OUTPUT-EXT.                                                02670000
           EXIT.                                                        02680000
      *-----------------------------------------------------------------01330001
      *@  처리종료                                                    0134
      *-----------------------------------------------------------------01350001
       S9000-FINAL-RTN.                                                 01360001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11041000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.                                                 01420001
           EXIT.                                                        01430001
