      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: AJL4030 (AS계열그룹조회)                        00030001
      *@처리유형  : AS                                                00040001
      *@처리개요  : 계열그룹 및 계열사를 등록하고 조회하는  00050001
      *@            : 프로그램이다                                    00060001
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20090108: 신규작성                                    00120001
      *김진태:20091102: 타팀　조치메세지　정비                      00120001
      *김진태:20091207: PC 삭제                                     00120001
      * YBH    :20200625: 집단평가등급 항목 추가
      *박정수:20221028:계열기업군코드 추가
      *=================================================================00130001
       IDENTIFICATION                  DIVISION.                        00140001
      *=================================================================00150001
       PROGRAM-ID.                     AJL4030.                         00160001
       AUTHOR.                         이동구.                        00170001
       DATE-WRITTEN.                   09/01/08.                        00180001
      *=================================================================00200001
       ENVIRONMENT                     DIVISION.                        00210001
      *=================================================================00220001
       CONFIGURATION                   SECTION.                         00230001
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================00250001
       DATA                            DIVISION.                        00260001
      *=================================================================00270001
       WORKING-STORAGE                 SECTION.                         00280001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4030 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------00470001
      * WORKING AREA                                                    00480001
      *-----------------------------------------------------------------00490001
       01  WK-AREA.                                                     00500001
           03  WK-I                    PIC  9(005) COMP.                00510001
      *-----------------------------------------------------------------00530001
      * PGM INTERFACE PARAMETER                                         00540001
      *-----------------------------------------------------------------00550001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           00560001
       01  XDJL4030-CA.                                                 00570001
           COPY  XDJL4030.                                              00580001
      *   출력영역확보　및　초기화INTERFACE                           00600001
       01  XZUGOTMY-CA.                                                 00610001
           COPY  XZUGOTMY.                                              00620001
      *-----------------------------------------------------------------00640001
       LINKAGE                         SECTION.                         00650001
      *-----------------------------------------------------------------00660001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00670001
           COPY  YCCOMMON.                                              00680001
      *    AS COPYBOOK
       01  YNJL4030-CA.                                                 00700001
           COPY  YNJL4030.                                              00710001
      *    AS COPYBOOK
       01  YPJL4030-CA.                                                 00730001
           COPY  YPJL4030.                                              00740001
      *=================================================================00760001
       PROCEDURE                       DIVISION                         00770001
                                       USING       YCCOMMON-CA          00780001
                                                   YNJL4030-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------00830001
      *@  처리메인                                                    00840001
      *-----------------------------------------------------------------00850001
       S0000-MAIN-RTN.                                                  00860001
                                                                        00870001
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            01030001
       S0000-MAIN-EXT.                                                  01050001
           EXIT.                                                        01060001
      *-----------------------------------------------------------------01070001
      *@  초기화                                                      01080001
      *-----------------------------------------------------------------01090001
       S1000-INITIALIZE-RTN.                                            01100001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA                                        01120001
                         XIJICOMM-IN
                         XDJL4030-IN                                    01130001
                         XZUGOTMY-IN                                    01140001
                                                                        01150001
      *@1.2 출력영역 확보
           #GETOUT       YPJL4030-CA                                    01170001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .                                                            01180001
       S1000-INITIALIZE-EXT.                                            01200001
           EXIT.                                                        01210001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4030-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4030-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------01280001
      *@  업무처리                                                    01290001
      *-----------------------------------------------------------------01300001
       S3000-PROCESS-RTN.                                               01310001
      *@3 업무처리

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,조회구분)
           MOVE YNJL4030-PRCSS-DSTIC   TO XDJL4030-I-PRCSS-DSTIC        01330001
           MOVE YNJL4030-INQURY-DSTIC  TO XDJL4030-I-INQURY-DSTIC       01340001
221028     MOVE YNJL4030-AFFLT-CORP-GROUP-CD
                                   TO XDJL4030-I-AFFLT-CORP-GROUP-CD
                                                                        01350001
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4030 YCCOMMON-CA XDJL4030-CA                      01360001
                                                                        01390001
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4030-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4030-OK                                          01400001
              CONTINUE                                                  01410001
           ELSE                                                         01420001
              #ERROR XDJL4030-R-ERRCD                                   01430001
                     XDJL4030-R-TREAT-CD                                01440001
                     XDJL4030-R-STAT                                    01450001
           END-IF                                                       01460001
           .                                                            01470001
       S3000-PROCESS-EXT.                                               01490001
           EXIT.                                                        01500001
      *-----------------------------------------------------------------01720001
      *@  출력처리                                                    01730001
      *-----------------------------------------------------------------01740001
       S6000-OUTPUT-RTN.                                                01750001
      *@4 출력처리

      *@4.1 출력라인수 조립
           MOVE XDJL4030-O-OUTPT-LINE-CNT1                              01770001
             TO YPJL4030-OUTPT-LINE-CNT1                                01780001

      *@4.2 그리드1 조립
      *@실행조건:WK-I > YPJL4030-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1                             01800001
                   UNTIL WK-I > YPJL4030-OUTPT-LINE-CNT1

                    MOVE XDJL4030-O-GRID1(WK-I)
                      TO YPJL4030-GRID1  (WK-I)

           END-PERFORM
           .                                                            02000001
       S6000-OUTPUT-EXT.                                                02020001
           EXIT.                                                        02030001
      *-----------------------------------------------------------------01510001
      *@  처리종료                                                    01520001
      *-----------------------------------------------------------------01530001
       S9000-FINAL-RTN.                                                 01540001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11030000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK                                           01560001
           .                                                            01570001
       S9000-FINAL-EXT.                                                 01590001
           EXIT.                                                        01600001
