      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4043 (AS보고서조회)
      *@처리유형  : AS
      *@처리개요  : 보고서조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090106: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091209: PC 삭제
      *김진태:20100409: COPYBOOK 변경
      *정윤섭:20200213: 경보발령 국가군 탭 삭제 및
      *                   탭 출력 내용 변경
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4043.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/01/06.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4043 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-05               PIC  X(002) VALUE '05'.
           03  CO-CHA-06               PIC  X(002) VALUE '06'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJL4043-CA.
           COPY  XDJL4043.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4043-CA.
           COPY  YNJL4043.
      *    AS COPYBOOK
       01  YPJL4043-CA.
           COPY  YPJL4043.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4043-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4043-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4043-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4043-PRCSS-DSTIC NOT = CO-CHA-01 AND
      *@ CO-CHA-02 AND CO-CHA-03
      *@처리내용:처리구분 01,02,03 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4043-PRCSS-DSTIC NOT = CO-CHA-01 AND
                                         CO-CHA-02 AND
200113* 경보발령 국가군 탭 삭제
      *                                  CO-CHA-03 AND
                                         CO-CHA-04 AND
                                         CO-CHA-05 AND
                                         CO-CHA-06
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL4043-CALL-RTN
              THRU S3100-DJL4043-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL4043-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,조회기준일자)

      *    처리구분
           MOVE YNJL4043-PRCSS-DSTIC
             TO XDJL4043-I-PRCSS-DSTIC
      *    조회기준일자
           MOVE YNJL4043-BASE-YMD
             TO XDJL4043-I-BASE-YMD

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4043 YCCOMMON-CA XDJL4043-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4043-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4043-OK
              CONTINUE
           ELSE
              #ERROR XDJL4043-R-ERRCD
                     XDJL4043-R-TREAT-CD
                     XDJL4043-R-STAT
           END-IF
           .
       S3100-DJL4043-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력라인수 조립
           MOVE XDJL4043-O-OUTPT-LINE-CNT1
             TO YPJL4043-OUTPT-LINE-CNT1
           MOVE XDJL4043-O-OUTPT-LINE-CNT2
             TO YPJL4043-OUTPT-LINE-CNT2
200113*    MOVE XDJL4043-O-OUTPT-LINE-CNT3
200113*      TO YPJL4043-OUTPT-LINE-CNT3
           MOVE XDJL4043-O-OUTPT-LINE-CNT4
             TO YPJL4043-OUTPT-LINE-CNT4
           MOVE XDJL4043-O-OUTPT-LINE-CNT5
             TO YPJL4043-OUTPT-LINE-CNT5
           MOVE XDJL4043-O-OUTPT-LINE-CNT6
             TO YPJL4043-OUTPT-LINE-CNT6

      *@4.2 그리드1 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립 =
      *@SET(지역,국가수,설정한도(A),금일운용잔액(B),금일운용
      *@(B/A),한도여유액(A-B))
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT1
      *            그리드１
                   MOVE XDJL4043-O-GRID1(WK-I)
                     TO YPJL4043-GRID1  (WK-I)
           END-PERFORM

      *@4.3 그리드2 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT2
      *@처리내용:그리드2 조립 =
      *@SET(Country Type,국가수,공여한도(A),한도사용액(B),
      *@한도소진율(B/A),한도여유액(A-B)
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT2
      *            그리드２
                   MOVE XDJL4043-O-GRID2(WK-I)
                     TO YPJL4043-GRID2  (WK-I)
           END-PERFORM

200113*경보발령 국가군 탭 삭제
      *@4.4 그리드3 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT3
      *@처리내용:그리드3 조립 =
      *@SET(국가,SP,Moodys,Fitch,공여한도(A),전월잔액,
      *@금일잔액(B),변동액,한도소진율(B/A),한도여유액(A-B)
      *    PERFORM VARYING WK-I FROM 1 BY 1
      *            UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT3
      *            그리드
      *            MOVE XDJL4043-O-GRID3(WK-I)
      *              TO YPJL4043-GRID3  (WK-I)
      *    END-PERFORM

      *@4.5 그리드4 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT4
      *@처리내용:그리드4 조립 =
      *@SET(ISO국가코드,국가,SP,Moodys,Fitch,당행등급,
      *@국가위험수준,한도,익스포져,한도소진율,
      *@한도여유액,전월말익스포져,전월말대비)
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT4
      *            그리드
                   MOVE XDJL4043-O-GRID4(WK-I)
                     TO YPJL4043-GRID4  (WK-I)
           END-PERFORM

      *@4.6 그리드5 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT5
      *@처리내용:그리드5 조립 =
      *@SET(ISO국가코드,국가,SP,Moodys,Fitch,당행등급,
      *@국가위험수준,한도,익스포져,한도소진율,
      *@한도여유액,전월말익스포져,전월말대비)
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT5
      *            그리드
                   MOVE XDJL4043-O-GRID5(WK-I)
                     TO YPJL4043-GRID5  (WK-I)
           END-PERFORM

      *@4.7 그리드6 조립
      *@실행조건:WK-I > YPJL4043-OUTPT-LINE-CNT6
      *@처리내용:그리드6 조립 =
      *@SET(상품명,전월말익스포져,전월말 비중(A),익스포져,
      *@비중(B),전월말 대비 비중 증감(B-A))
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4043-OUTPT-LINE-CNT6
      *            그리드
                   MOVE XDJL4043-O-GRID6(WK-I)
                     TO YPJL4043-GRID6  (WK-I)
           END-PERFORM
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04043000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
