      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: AJL4032 (AS동일차주신용공여조회)                00030001
      *@처리유형  : AS                                                00040001
      *@처리개요  : 동일차주(그룹)에 대한 신용공여한도,     00050001
      *@            : 신용공여금액, 한도여유금액을 조회하는 프  00060001
      *@            : 로그램이다                                      00070001
      *-----------------------------------------------------------------00080001
      *                 P R O G R A M   변　경　이　력                00090001
      *-----------------------------------------------------------------00100001
      *@성명 : 일자 : 변　경　내　용                              00110001
      * ----------------------------------------------------------------00120001
      *이동구:20090109: 신규작성                                    00130001
      *김진태:20091102: 타팀　조치메세지　정비                      00130001
      *김진태:20091208: PC 삭제                                     00130001
      *=================================================================00140001
       IDENTIFICATION                  DIVISION.                        00150001
      *=================================================================00160001
       PROGRAM-ID.                     AJL4032.                         00170001
       AUTHOR.                         이동구.                        00180001
       DATE-WRITTEN.                   09/01/09.                        00190001
      *=================================================================00200001
       ENVIRONMENT                     DIVISION.                        00210001
      *=================================================================00220001
       CONFIGURATION                   SECTION.                         00230001
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================00240001
       DATA                            DIVISION.                        00250001
      *=================================================================00260001
       WORKING-STORAGE                 SECTION.                         00270001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4032 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------00430001
      * WORKING AREA                                                    00440001
      *-----------------------------------------------------------------00450001
       01  WK-AREA.                                                     00460001
           03  WK-I                    PIC  9(005) COMP.                00470001
      *-----------------------------------------------------------------00480001
      * PGM INTERFACE PARAMETER                                         00490001
      *-----------------------------------------------------------------00500001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           00510001
       01  XDJL4032-CA.                                                 00520001
           COPY  XDJL4032.                                              00530001
      *   출력영역확보　및　초기화INTERFACE                           00540001
       01  XZUGOTMY-CA.                                                 00550001
           COPY  XZUGOTMY.                                              00560001
      *-----------------------------------------------------------------00570001
       LINKAGE                         SECTION.                         00580001
      *-----------------------------------------------------------------00590001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00600001
           COPY  YCCOMMON.                                              00610001
      *    AS COPYBOOK
       01 YNJL4032-CA.                                                  00620001
           COPY  YNJL4032.                                              00630001
      *    AS COPYBOOK
       01 YPJL4032-CA.                                                  00640001
           COPY  YPJL4032.                                              00650001
      *=================================================================00660001
       PROCEDURE                       DIVISION                         00670001
                                       USING       YCCOMMON-CA          00690001
                                                   YNJL4032-CA
                                                   .
      *=================================================================00680001
      *-----------------------------------------------------------------00710001
      *@  처리메인                                                    00720001
      *-----------------------------------------------------------------00730001
       S0000-MAIN-RTN.                                                  00740001
                                                                        00750001
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            00870001
       S0000-MAIN-EXT.                                                  00880001
           EXIT.                                                        00890001
      *-----------------------------------------------------------------00900001
      *@  초기화                                                      00910001
      *-----------------------------------------------------------------00920001
       S1000-INITIALIZE-RTN.                                            00930001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA                                        00950001
                         XIJICOMM-IN
                         XDJL4032-IN                                    00960001
                         XZUGOTMY-IN                                    00970001
                                                                        00980001
      *@1.2 출력영역 확보
           #GETOUT       YPJL4032-CA                                    01000001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .                                                            01010001
       S1000-INITIALIZE-EXT.                                            01020001
           EXIT.                                                        01030001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4032-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4032-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------01040001
      *@  업무처리                                                    01050001
      *-----------------------------------------------------------------01060001
       S3000-PROCESS-RTN.                                               01070001
      *@3 업무처리

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,계열기업군코드,기준년월)

           MOVE YNJL4032-PRCSS-DSTIC                                    01110001
             TO XDJL4032-I-PRCSS-DSTIC                                  01110001
           MOVE YNJL4032-AFFLT-CORP-GROUP-CD                            01120001
             TO XDJL4032-I-AFFLT-CORP-GROUP-CD                          01130001
           MOVE YNJL4032-BASE-YM                                        01140001
             TO XDJL4032-I-BASE-YM                                      01140001
                                                                        01150001
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4032 YCCOMMON-CA XDJL4032-CA                      01180001
                                                                        01210001
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4032-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4032-OK                                          01250001
              CONTINUE                                                  01260001
           ELSE                                                         01270001
              #ERROR XDJL4032-R-ERRCD                                   01280001
                     XDJL4032-R-TREAT-CD                                01290001
                     XDJL4032-R-STAT                                    01300001
           END-IF                                                       01310001
           .                                                            01320001
       S3000-PROCESS-EXT.                                               01330001
           EXIT.                                                        01340001
      *-----------------------------------------------------------------01750001
      *@  출력처리                                                    01760001
      *-----------------------------------------------------------------01770001
       S6000-OUTPUT-RTN.                                                01780001
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJL4032-O-CMGR-NAME                                    01800001
             TO YPJL4032-CMGR-NAME                                      01810001
           MOVE XDJL4032-O-ONCP-BSAMT                                   01820001
             TO YPJL4032-ONCP-BSAMT                                     01830001
           MOVE XDJL4032-O-CA-SCURTY-AUC                                01840001
             TO YPJL4032-CA-SCURTY-AUC                                  01850001
           MOVE XDJL4032-O-LIMT-SEXTR-AMT                               01860001
             TO YPJL4032-LIMT-SEXTR-AMT                                 01870001
           MOVE XDJL4032-O-ONCP-BSAMT1
             TO YPJL4032-ONCP-BSAMT1
           MOVE XDJL4032-O-ONCP-BASE-YM                                 01880001
             TO YPJL4032-ONCP-BASE-YM                                   01890001

      *@4.2 출력라인수 조립
           MOVE XDJL4032-O-OUTPT-LINE-CNT1                              01910001
             TO YPJL4032-OUTPT-LINE-CNT1                                01920001

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJL4032-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1                             01940001
                   UNTIL   WK-I > YPJL4032-OUTPT-LINE-CNT1              01950001
      *            그리드                                             01960001
                   MOVE XDJL4032-O-GRID1(WK-I)                          01980001
                     TO YPJL4032-GRID1  (WK-I)                          01990001
           END-PERFORM                                                  02130001
           .                                                            02140001
       S6000-OUTPUT-EXT.                                                02160001
           EXIT.                                                        02170001
      *-----------------------------------------------------------------01350001
      *@  처리종료                                                    01360001
      *-----------------------------------------------------------------01370001
       S9000-FINAL-RTN.                                                 01380001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04032000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK                                           01430001
           .                                                            01440001
       S9000-FINAL-EXT.                                                 01450001
           EXIT.                                                        01460001
