      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4130 (AS국별수기계좌관리)
      *@처리유형  : AS
      *@처리개요  : 국별수기계좌 조회 및 관리
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *최주원 : 20201202 : 신규작성
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4130.
       AUTHOR.                         최주원.
       DATE-WRITTEN.                   20/12/02.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *@에러메시지
      *처리구분 오류입니다
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
      *@조치메시지
      *전산업무담당자에게　문의바랍니다.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4130'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.

      *   조회처리DC  INTERFACE
       01  XDJL4581-CA.
           COPY  XDJL4581.

      *   등록처리DC  INTERFACE
       01  XDJLB581-CA.
           COPY  XDJLB581.

      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      *    AS COPYBOOK
       01  YNJL4130-CA.
           COPY  YNJL4130.

      *    AS COPYBOOK
       01  YPJL4130-CA.
           COPY  YPJL4130.
      *=================================================================
       PROCEDURE                       DIVISION

                                       USING       YCCOMMON-CA
                                                   YNJL4130-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT




      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4581-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4130-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK(01:조회/02:일괄등록/03:일괄삭제)
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4130-PRCSS-DSTIC = (CO-CHA-01 OR CO-CHA-02 OR
                                      CO-CHA-03)
               CONTINUE
           ELSE
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

           #USRLOG  "=================================================="
           #USRLOG  "*           INPUT AJL4130 DATA                   *"
           #USRLOG  "=================================================="
           #USRLOG  " PRCSS-DSTIC    : " YNJL4130-PRCSS-DSTIC
           #USRLOG  " BRNCD          : " YNJL4130-BRNCD
           #USRLOG  " TOTAL-CNT      : " YNJL4130-TOTAL-LINE-CNT
           #USRLOG  "=================================================="


      *    YNJL4130-PRCSS-DSTIC : 처리구분
      *    01 : 조회
      *    02 : (일괄or단건)등록/수정
      *    03 : (단건)삭제
           IF YNJL4130-PRCSS-DSTIC     = CO-CHA-01

      *@3.1   조회DC호출
               PERFORM S3100-DJL4581-CALL-RTN
                  THRU S3100-DJL4581-CALL-EXT
           ELSE

      *@3.2   관리DC호출
               PERFORM S3200-DJLB581-CALL-RTN
                  THRU S3200-DJLB581-CALL-EXT
           END-IF
           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   조회DC호출
      *-----------------------------------------------------------------
       S3100-DJL4581-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리PC입력파라미터=
      *@SET(처리구분,부점코드)

           MOVE YNJL4130-PRCSS-DSTIC   TO XDJL4581-I-PRCSS-DSTIC
           MOVE YNJL4130-BRNCD         TO XDJL4581-I-BRNCD


      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4581 YCCOMMON-CA XDJL4581-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4581-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4581-OK
      *@      출력처리
               PERFORM S6000-OUTPUT-RTN
                  THRU S6000-OUTPUT-EXT
           ELSE
              #ERROR XDJL4581-R-ERRCD
                     XDJL4581-R-TREAT-CD
                     XDJL4581-R-STAT
           END-IF
           .
       S3100-DJL4581-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  국별수기계좌관리DC호출
      *-----------------------------------------------------------------
       S3200-DJLB581-CALL-RTN.

           INITIALIZE    XDJLB581-IN

           MOVE YNJL4130-PRCSS-DSTIC   TO XDJLB581-I-PRCSS-DSTIC
           MOVE YNJL4130-BRNCD         TO XDJLB581-I-BRNCD

      *   총라인수
           MOVE YNJL4130-TOTAL-LINE-CNT
             TO XDJLB581-I-TOTAL-LINE-CNT

           PERFORM VARYING WK-I FROM 1 BY 1 UNTIL WK-I > 500
                        OR WK-I > YNJL4130-TOTAL-LINE-CNT

      *--     계좌번호
               MOVE  YNJL4130-ACNO (WK-I)
                 TO  XDJLB581-I-ACNO (WK-I)
      *--     고객식별자
               MOVE  YNJL4130-CUST-IDNFR (WK-I)
                 TO  XDJLB581-I-CUST-IDNFR (WK-I)
      *--     거래상대방
               MOVE  YNJL4130-TRAN-CNPRT (WK-I)
                 TO  XDJLB581-I-TRAN-CNPRT (WK-I)
      *--     상품대분류코드
               MOVE  YNJL4130-PRDCT-LAG-CLSFI-CD (WK-I)
                 TO  XDJLB581-I-PRDCT-LAG-CLSFI-CD (WK-I)
      *--     상품중분류코드
               MOVE  YNJL4130-PRDCT-MEDM-CLSFI-CD (WK-I)
                 TO  XDJLB581-I-PRDCT-MEDM-CLSFI-CD (WK-I)
      *--     상품템플릿코드
               MOVE  YNJL4130-PRDCT-TMPLT-CD (WK-I)
                 TO  XDJLB581-I-PRDCT-TMPLT-CD (WK-I)
      *--     상품번호
               MOVE  YNJL4130-PRDCT-NO (WK-I)
                 TO  XDJLB581-I-PRDCT-NO (WK-I)
      *--     ISO국가코드
               MOVE  YNJL4130-ISO-NATNL-CD (WK-I)
                 TO  XDJLB581-I-ISO-NATNL-CD (WK-I)
      *--     관리부점
               MOVE  YNJL4130-MGTBRN (WK-I)
                 TO  XDJLB581-I-MGTBRN (WK-I)
      *--     시작년월일
               MOVE  YNJL4130-START-YMD (WK-I)
                 TO  XDJLB581-I-START-YMD (WK-I)
      *--     만기년월일
               MOVE  YNJL4130-EXPIR-YMD (WK-I)
                 TO  XDJLB581-I-EXPIR-YMD (WK-I)
      *--     통화코드
               MOVE  YNJL4130-CNCYCD (WK-I)
                 TO  XDJLB581-I-CNCYCD (WK-I)
      *--     통화한도금액
               MOVE  YNJL4130-CRNCY-CLAM (WK-I)
                 TO  XDJLB581-I-CRNCY-CLAM (WK-I)
      *--     통화금일잔액
               MOVE  YNJL4130-CRNCY-TDD-BAL (WK-I)
                 TO  XDJLB581-I-CRNCY-TDD-BAL (WK-I)

           END-PERFORM

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB581 YCCOMMON-CA XDJLB581-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJLB581-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB581-OK
               MOVE XDJLB581-O-PRCSS-RSULT
                 TO YPJL4130-PRCSS-RSULT
           ELSE
              #ERROR XDJLB581-R-ERRCD
                     XDJLB581-R-TREAT-CD
                     XDJLB581-R-STAT
           END-IF
           .

       S3200-DJLB581-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

           #USRLOG  "=================================================="
           #USRLOG  "*           DJL4581 OUTPUT DATA                  *"
           #USRLOG  "=================================================="
           #USRLOG  " OUTPT-LINE-CNT1    : " XDJL4581-O-OUTPT-LINE-CNT1
           #USRLOG  "=================================================="

      *@4.1 출력항목 조립
           MOVE CO-STAT-OK
             TO YPJL4130-PRCSS-RSULT

      *@4.2 출력라인수 조립
           MOVE XDJL4581-O-OUTPT-LINE-CNT1
             TO YPJL4130-OUTPT-LINE-CNT1

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJL4130-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJL4130-OUTPT-LINE-CNT1
      *            그리드１
                   MOVE XDJL4581-O-GRID1(WK-I)
                     TO YPJL4130-GRID1  (WK-I)
           END-PERFORM

           .
       S6000-OUTPUT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04130000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
