      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4112 (EAD-계좌별TE현황조회)
      *@처리유형  : AS
      *@처리개요  : 계좌별TE현황조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20101029: 신규작성
      * YBH    :20180627: 한도계좌별TE현황 추가(STAND BY LC적용)
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4112.
       AUTHOR.                         김진태.
       DATE-WRITTEN.                   10/10/29.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4112 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJL4112-CA.
           COPY  XDJL4112.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4112-CA.
           COPY  YNJL4112.
      *    AS COPYBOOK
       01  YPJL4112-CA.
           COPY  YPJL4112.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4112-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL4112-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4112-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호유형구분
           MOVE CO-CHA-1               TO JICOM-CNO-PTRN-DSTIC
      *    고객번호
           MOVE YNJL4112-BRWR-NO       TO JICOM-CNO

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJL4112-PRCSS-DSTIC NOT = CO-CHA-01 AND
      *@ CO-CHA-02
      *@처리내용:처리구분 01,02 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4112-PRCSS-DSTIC NOT = CO-CHA-01 AND
                                         CO-CHA-02 AND
180627                                   CO-CHA-03
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL4112-CALL-RTN
              THRU S3100-DJL4112-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL4112-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,채무자번호,조회기준일자)

      *    처리구분
           MOVE YNJL4112-PRCSS-DSTIC
             TO XDJL4112-I-PRCSS-DSTIC

      *    채무자번호
           MOVE YNJL4112-BRWR-NO
             TO XDJL4112-I-BRWR-NO

      *    조회기준일자
           MOVE YNJL4112-BASE-YMD
             TO XDJL4112-I-BASE-YMD

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4112 YCCOMMON-CA XDJL4112-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4112-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4112-OK
              CONTINUE
           ELSE
              #ERROR XDJL4112-R-ERRCD
                     XDJL4112-R-TREAT-CD
                     XDJL4112-R-STAT
           END-IF
           .
       S3100-DJL4112-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립

      *    채무자명
           MOVE XDJL4112-O-BRWR-NAME
             TO YPJL4112-BRWR-NAME
      *    TE기준한도
           MOVE XDJL4112-O-TE-BASE-LIMT
             TO YPJL4112-TE-BASE-LIMT
      *    기준한도산출일
           MOVE XDJL4112-O-BASE-LIMT-CMPTN-DD
             TO YPJL4112-BASE-LIMT-CMPTN-DD
      *    한도설정유효일
           MOVE XDJL4112-O-LIMT-STUP-VALD-DD
             TO YPJL4112-LIMT-STUP-VALD-DD
      *    여신성관리한도
           MOVE XDJL4112-O-LNBZ-I-MGT-LIMT
             TO YPJL4112-LNBZ-I-MGT-LIMT
      *    여신성한도기준TE
           MOVE XDJL4112-O-LNBZ-I-LIMT-BASE-TE
             TO YPJL4112-LNBZ-I-LIMT-BASE-TE
      *    여신성잔액기준TE
           MOVE XDJL4112-O-LNBZ-I-BAL-BASE-TE
             TO YPJL4112-LNBZ-I-BAL-BASE-TE
      *    여신성한도여유액
           MOVE XDJL4112-O-LNBZ-IL-SEXTR-AMT
             TO YPJL4112-LNBZ-IL-SEXTR-AMT
      *    시장성관리한도
           MOVE XDJL4112-O-MRKTY-MGT-LIMT
             TO YPJL4112-MRKTY-MGT-LIMT
      *    시장성한도기준TE
           MOVE XDJL4112-O-MRKTY-LIMT-BASE-TE
             TO YPJL4112-MRKTY-LIMT-BASE-TE
      *    시장성잔액기준TE
           MOVE XDJL4112-O-MRKTY-BAL-BASE-TE
             TO YPJL4112-MRKTY-BAL-BASE-TE
      *    시장성한도여유액
           MOVE XDJL4112-O-MRKTY-L-SEXTR-AMT
             TO YPJL4112-MRKTY-L-SEXTR-AMT
      *    관리한도
           MOVE XDJL4112-O-MGT-LIMT
             TO YPJL4112-MGT-LIMT
      *    한도기준TE
           MOVE XDJL4112-O-LIMT-BASE-TE
             TO YPJL4112-LIMT-BASE-TE
      *    잔액기준TE
           MOVE XDJL4112-O-BAL-BASE-TE
             TO YPJL4112-BAL-BASE-TE
      *    한도여유액
           MOVE XDJL4112-O-LIMT-SEXTR-AMT
             TO YPJL4112-LIMT-SEXTR-AMT
      *    (파생상품총거래한도)
           MOVE XDJL4112-O-DRVT-PT-TRAN-LIMT
             TO YPJL4112-DRVT-PT-TRAN-LIMT
      *    (파생상품Exposure)
           MOVE XDJL4112-O-DRVT-PRDCT-EXPSR
             TO YPJL4112-DRVT-PRDCT-EXPSR

      *    출력라인수 조립
           MOVE XDJL4112-O-OUTPT-LINE-CNT
             TO YPJL4112-OUTPT-LINE-CNT

      *    GRID OUTPUT LOOP
           PERFORM VARYING WK-I FROM 1 BY 1
             UNTIL WK-I > YPJL4112-OUTPT-LINE-CNT

      *            그리드
                   MOVE XDJL4112-O-GRID(WK-I)
                     TO YPJL4112-GRID(WK-I)

           END-PERFORM

           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL04112000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
