      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJL4096 (AS표준산업코드별비율조회)
      *@처리유형  : AS
      *@처리개요  : 표준산업코드별비율조회
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20090506: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091210: PC 삭제
      * YBH    :20211029: 프로세스 개선
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJL4096.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   09/05/06.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJL4096 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
211029     03  CO-CHA-02               PIC  X(002) VALUE '02'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJL4096-CA.
           COPY  XDJL4096.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJL4096-CA.
           COPY  YNJL4096.
      *    AS COPYBOOK
       01  YPJL4096-CA.
           COPY  YPJL4096.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJL4096-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJL4096-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK(01:개별기업/02:그룹)
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJL4096-PRCSS-DSTIC = CO-CHA-01 OR CO-CHA-02
               CONTINUE
           ELSE
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJL4096-CALL-RTN
              THRU S3100-DJL4096-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJL4096-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,표준산업분류코드)
           INITIALIZE    XDJL4096-IN

      *    처리구분
           MOVE YNJL4096-PRCSS-DSTIC
             TO XDJL4096-I-PRCSS-DSTIC

      *    표준산업분류코드
           MOVE YNJL4096-STND-I-CLSFI-CD
             TO XDJL4096-I-STND-I-CLSFI-CD

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4096 YCCOMMON-CA XDJL4096-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL4096-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4096-OK
              CONTINUE
           ELSE
              #ERROR XDJL4096-R-ERRCD
                     XDJL4096-R-TREAT-CD
                     XDJL4096-R-STAT
           END-IF
           .
       S3100-DJL4096-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립

      *    표준산업분류코드명
           MOVE XDJL4096-O-STND-IC-CD-NAME
             TO YPJL4096-STND-IC-CD-NAME

211029*    TE산업분류코드
           MOVE XDJL4096-O-TE-IDSTRY-CLSFI-CD
             TO YPJL4096-TE-IDSTRY-CLSFI-CD

211029*    TE산업분류코드명
           MOVE XDJL4096-O-TE-I-CLSFI-CD-NAME
             TO YPJL4096-TE-I-CLSFI-CD-NAME

      *    가중평균이자율
           MOVE XDJL4096-O-WGHTG-AVGZ-IRT
             TO YPJL4096-WGHTG-AVGZ-IRT

211029*    자기자본산업적용비율
           MOVE XDJL4096-O-ONCP-I-APLY-RATO
             TO YPJL4096-ONCP-I-APLY-RATO

      *    차입금자기자본율
           MOVE XDJL4096-O-AMBR-ONCP-RT
             TO YPJL4096-AMBR-ONCP-RT

211029*    매출액산업적용비율
           MOVE XDJL4096-O-SALEPR-I-APLY-RATO
             TO YPJL4096-SALEPR-I-APLY-RATO

211029*    총자산산업적용비율
           MOVE XDJL4096-O-TOTAL-AI-APLY-RATO
             TO YPJL4096-TOTAL-AI-APLY-RATO

      *    차입금총자산비율
           MOVE XDJL4096-O-AMBR-T-ASST-RATO
             TO YPJL4096-AMBR-T-ASST-RATO
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11009000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
