      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          000200
      *@프로그램명: AJLB041 (AS국가별정보관리)                      0003
      *@처리유형  : AS                                                000400
      *@처리개요  : 국가별 관리한도정보를 등록하는 프로그램
      *@            : 이다                                            000600
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                000800
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00
      * ----------------------------------------------------------------00110001
      *이동구:20090108: 신규작성                                    0012
      *김진태:20091102: 타팀　조치메세지　정비                      0012
      *김진태:20091211: PC 삭제                                     0012
      *김진태:20100408: COPYBOOK 변경                               0012
      * YBH    :20200227: 지역 및 공통한도 추가
      *=================================================================00130001
       IDENTIFICATION                  DIVISION.                        00140001
      *=================================================================00150001
       PROGRAM-ID.                     AJLB041.                         00160001
       AUTHOR.                         이동구.                        001700
       DATE-WRITTEN.                   09/01/08.                        00180001
      *=================================================================00190001
       ENVIRONMENT                     DIVISION.                        00200001
      *=================================================================00210001
       CONFIGURATION                   SECTION.                         00220001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00230001
       DATA                            DIVISION.                        00240001
      *=================================================================00250001
       WORKING-STORAGE                 SECTION.                         00260001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB041 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00440001
           03  CO-CHA-03               PIC  X(002) VALUE '03'.          00450001
           03  CO-CHA-04               PIC  X(002) VALUE '04'.          00460001
200227     03  CO-CHA-05               PIC  X(002) VALUE '05'.
200227     03  CO-CHA-06               PIC  X(002) VALUE '06'.
                                                                        00470001
           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.           00480001
      *-----------------------------------------------------------------00490001
      * WORKING AREA                                                    00500001
      *-----------------------------------------------------------------00510001
       01  WK-AREA.                                                     00520001
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------00540001
      * PGM INTERFACE PARAMETER                                         00550001
      *-----------------------------------------------------------------00560001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           005700
       01  XDJLB041-CA.                                                 00580001
           COPY  XDJLB041.                                              00590001
      *   출력영역확보　및　초기화INTERFACE                           006000
       01  XZUGOTMY-CA.                                                 00610001
           COPY  XZUGOTMY.                                              00620001
      *-----------------------------------------------------------------00630001
       LINKAGE                         SECTION.                         00640001
      *-----------------------------------------------------------------00650001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00660001
           COPY  YCCOMMON.                                              00670001
      *    AS COPYBOOK
       01  YNJLB041-CA.                                                 00680001
           COPY  YNJLB041.                                              00690001
      *    AS COPYBOOK
       01  YPJLB041-CA.                                                 00700001
           COPY  YPJLB041.                                              00710001
      *=================================================================00720001
       PROCEDURE                       DIVISION                         00730001
                                       USING       YCCOMMON-CA          00750001
                                                   YNJLB041-CA
                                                   .
      *=================================================================00740003
      *-----------------------------------------------------------------00770001
      *@  처리메인                                                    007800
      *-----------------------------------------------------------------00790001
       S0000-MAIN-RTN.                                                  00800001
                                                                        00810001
      *@  초기화                                                      008200
           PERFORM S1000-INITIALIZE-RTN                                 00830001
              THRU S1000-INITIALIZE-EXT                                 00840001
                                                                        00850001
      *@  입력값　CHECK                                               008600
           PERFORM S2000-VALIDATION-RTN                                 00870001
              THRU S2000-VALIDATION-EXT                                 00880001
                                                                        00890001
      *@  업무처리                                                    009000
           PERFORM S3000-PROCESS-RTN                                    00910001
              THRU S3000-PROCESS-EXT                                    00920001
                                                                        00930001
      *@  출력처리                                                    009000
           PERFORM S6000-OUTPUT-RTN                                     00910001
              THRU S6000-OUTPUT-EXT                                     00920001
                                                                        00930001
      *@  처리종료                                                    009400
           PERFORM S9000-FINAL-RTN                                      00950001
              THRU S9000-FINAL-EXT                                      00960001
           .                                                            00970001
       S0000-MAIN-EXT.                                                  00980001
           EXIT.                                                        00990001
      *-----------------------------------------------------------------01000001
      *@  초기화                                                      010100
      *-----------------------------------------------------------------01020001
       S1000-INITIALIZE-RTN.                                            01030001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJLB041-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJLB041-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01120001
           EXIT.                                                        01130001
      *-----------------------------------------------------------------01140001
      *@  입력값검증                                                  011500
      *-----------------------------------------------------------------01160001
       S2000-VALIDATION-RTN.                                            01170001
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@처리내용:처리구분02/04아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB041-PRCSS-DSTIC NOT = CO-CHA-02 AND CO-CHA-04 AND
200227                                   CO-CHA-05 AND CO-CHA-06
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.                                            01260001
           EXIT.                                                        01270001
      *-----------------------------------------------------------------01280001
      *@  업무처리                                                    012900
      *-----------------------------------------------------------------01300001
       S3000-PROCESS-RTN.                                               01310001
      *@3 업무처리
                                                                        01330005
      *@3.1 입력파라미터 조립

           MOVE YNJLB041-CA            TO XDJLB041-IN                   01350001
                                                                        01360001
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB041 YCCOMMON-CA XDJLB041-CA                      01390001
                                                                        01420001
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJLB041-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB041-OK                                          01460001
              CONTINUE                                                  01470001
           ELSE                                                         01480001
              #ERROR XDJLB041-R-ERRCD                                   01490001
                     XDJLB041-R-TREAT-CD                                01500001
                     XDJLB041-R-STAT                                    01510001
           END-IF                                                       01520001
           .                                                            01550001
       S3000-PROCESS-EXT.                                               01560001
           EXIT.                                                        01570001
      *-----------------------------------------------------------------01930001
      *@  출력처리                                                    0194
      *-----------------------------------------------------------------01950001
       S6000-OUTPUT-RTN.                                                01960001
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJLB041-O-PRCSS-RSULT                                  01980001
             TO YPJLB041-PRCSS-RSULT
           .                                                            02090001
       S6000-OUTPUT-EXT.                                                02100001
           EXIT.                                                        02110001
      *-----------------------------------------------------------------01580001
      *@  처리종료                                                    015900
      *-----------------------------------------------------------------01600001
       S9000-FINAL-RTN.                                                 01610001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11041000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK                                           01660001
           .                                                            01670001
       S9000-FINAL-EXT.                                                 01680001
           EXIT.                                                        01690001
