      *=================================================================00010003
      *@업무명    : KJL     (Total Exposure)                          00020003
      *@프로그램명: AJLB049 (AS국별상품정보원장등록)                00030003
      *@처리유형  : AS                                                00040003
      *@처리개요  : 국별상품정보원장등록                            00050003
      *-----------------------------------------------------------------00060003
      *                 P R O G R A M   변　경　이　력                00070003
      *-----------------------------------------------------------------00080003
      *@성명 : 일자 : 변　경　내　용                              00090003
      * ----------------------------------------------------------------00100003
      *김진태:20100531: 신규작성                                    00110003
      *=================================================================00120003
       IDENTIFICATION                  DIVISION.                        00130003
      *=================================================================00140003
       PROGRAM-ID.                     AJLB049.                         00150003
       AUTHOR.                         김진태.                        00160003
       DATE-WRITTEN.                   10/05/31.                        00170003
      *=================================================================00180003
       ENVIRONMENT                     DIVISION.                        00190003
      *=================================================================00200003
       CONFIGURATION                   SECTION.                         00210003
       SOURCE-COMPUTER.                IBM-3090.                        00220003
       OBJECT-COMPUTER.                IBM-3090.                        00230003
      *=================================================================00240003
       DATA                            DIVISION.                        00250003
      *=================================================================00260003
       WORKING-STORAGE                 SECTION.                         00270003
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB049 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
      *-----------------------------------------------------------------00370003
      * WORKING AREA                                                    00380003
      *-----------------------------------------------------------------00390003
       01  WK-AREA.                                                     00400003
           03  WK-I                    PIC  9(005) COMP.                00410003
      *-----------------------------------------------------------------00420003
      * PGM INTERFACE PARAMETER                                         00430003
      *-----------------------------------------------------------------00440003
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리PC  INTERFACE                                           00450003
       01  XDJLB049-CA.                                                 00460003
           COPY  XDJLB049.                                              00470003
      *   출력영역확보　및　초기화INTERFACE                           00480003
       01  XZUGOTMY-CA.                                                 00490003
           COPY  XZUGOTMY.                                              00500003
      *-----------------------------------------------------------------00510003
       LINKAGE                         SECTION.                         00520003
      *-----------------------------------------------------------------00530003
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00540003
           COPY  YCCOMMON.                                              00550003
      *    AS COPYBOOK
       01  YNJLB049-CA.                                                 00560003
           COPY  YNJLB049.                                              00570003
      *    AS COPYBOOK
       01  YPJLB049-CA.                                                 00580003
           COPY  YPJLB049.                                              00590004
      *=================================================================00600003
       PROCEDURE                       DIVISION                         00610003
                                       USING       YCCOMMON-CA          00630003
                                                   YNJLB049-CA
                                                   .
      *=================================================================00620004
      *-----------------------------------------------------------------00650003
      *@  처리메인                                                    00660003
      *-----------------------------------------------------------------00670003
       S0000-MAIN-RTN.                                                  00680003
                                                                        00690003
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            00810003
       S0000-MAIN-EXT.                                                  00820003
           EXIT.                                                        00830003
      *-----------------------------------------------------------------00840003
      *@  초기화                                                      00850003
      *-----------------------------------------------------------------00860003
       S1000-INITIALIZE-RTN.                                            00870003
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJLB049-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJLB049-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            00960003
           EXIT.                                                        00970003
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJLB049-PRCSS-DSTIC NOT = CO-CHA-02 AND
      *@ CO-CHA-04
      *@처리내용:처리구분 01,02 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB049-PRCSS-DSTIC NOT = CO-CHA-02 AND
                                         CO-CHA-04
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJLB049-CALL-RTN                               01040003
              THRU S3100-DJLB049-CALL-EXT                               01050003
           .                                                            01060003
       S3000-PROCESS-EXT.                                               01070003
           EXIT.                                                        01080003
      *-----------------------------------------------------------------01090004
      *@   DC호출
      *-----------------------------------------------------------------01110004
       S3100-DJLB049-CALL-RTN.                                          01120003

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,조회기준년월,상품대분류코드,
      *@상품중분류코드,상품템플릿코드,상품번호,
      *@중분류구분,중분류명)

      *    처리구분                                                   01170003
           MOVE YNJLB049-PRCSS-DSTIC                                    01180003
             TO XDJLB049-I-PRCSS-DSTIC                                  01190003
                                                                        01200003
      *    조회기준년월                                               01210003
           MOVE YNJLB049-BASE-YM                                        01220003
             TO XDJLB049-I-BASE-YM                                      01230003
                                                                        01280003
      *    상품대분류코드                                             01330003
           MOVE YNJLB049-PRDCT-LAG-CLSFI-CD                             01340003
             TO XDJLB049-I-PRDCT-LAG-CLSFI-CD                           01350003
                                                                        01360003
      *    상품중분류코드                                             01370003
           MOVE YNJLB049-PRDCT-MEDM-CLSFI-CD                            01380003
             TO XDJLB049-I-PRDCT-MEDM-CLSFI-CD                          01390003

      *    상품템플릿코드                                             01370003
           MOVE YNJLB049-PRDCT-TMPLT-CD                                 01380003
             TO XDJLB049-I-PRDCT-TMPLT-CD                               01390003

      *    상품번호                                                   01370003
           MOVE YNJLB049-PRDCT-NO                                       01380003
             TO XDJLB049-I-PRDCT-NO                                     01390003
                                                                        01400003
      *    통합계정과목코드                                           01410003
           MOVE YNJLB049-INTGRA-TIACC-CD                                01420003
             TO XDJLB049-I-INTGRA-TIACC-CD                              01430003
                                                                        01440003
      *    중분류코드                                                 01410003
           MOVE YNJLB049-MEDM-CLSFI-CD                                  01420003
             TO XDJLB049-I-MEDM-CLSFI-CD                                01430003
                                                                        01440003
      *    중분류명                                                   01450003
           MOVE YNJLB049-MEDM-CLSFI-NAME                                01460003
             TO XDJLB049-I-MEDM-CLSFI-NAME                              01470003
                                                                        01880003
      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB049 YCCOMMON-CA XDJLB049-CA                      01910003
                                                                        01920003
      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJLB049-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB049-OK                                          01960003
              CONTINUE                                                  01970003
           ELSE                                                         01980003
              #ERROR XDJLB049-R-ERRCD                                   01990004
                     XDJLB049-R-TREAT-CD                                02000004
                     XDJLB049-R-STAT                                    02010004
           END-IF                                                       02020003
           .                                                            02030003
       S3100-DJLB049-CALL-EXT.                                          02040003
           EXIT.                                                        02050003
      *-----------------------------------------------------------------01930001
      *@  출력처리                                                    019400
      *-----------------------------------------------------------------01950001
       S6000-OUTPUT-RTN.                                                01960001
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJLB049-O-PRCSS-RSULT                                  01980001
             TO YPJLB049-PRCSS-RSULT
           .                                                            02090001
       S6000-OUTPUT-EXT.                                                02100001
           EXIT.                                                        02110001
      *-----------------------------------------------------------------02060003
      *@  처리종료                                                    02070003
      *-----------------------------------------------------------------02080003
       S9000-FINAL-RTN.                                                 02090003
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11049000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.                                                 02150003
           EXIT.                                                        02160003
