      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJLB276 (AS포괄신용공여한도적정성점검승인)
      *@처리유형  : AS
      *@처리개요  :포괄신용공여한도적정성점검승인
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *최주원 : 20210827 : 신규작성
      *박정수 : 20230330 : P20232237652 파일목록조회 추가
      *박정수 : 20240530 : 적정성점검구분 추가
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJLB276.
       AUTHOR.                         최주원.
       DATE-WRITTEN.                   21/08/27.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *@에러메시지
      *처리구분 오류입니다
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
      *조회조건값 오류입니다.
           03  CO-B0100505             PIC  X(008) VALUE 'B0100505'.
      *@조치메시지
      *전산업무담당자에게　문의바랍니다.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB276'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-B                PIC  X(001) VALUE 'B'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-05               PIC  X(002) VALUE '05'.
           03  CO-CHA-06               PIC  X(002) VALUE '06'.
230330     03  CO-CHA-07               PIC  X(002) VALUE '07'.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
      *        DJL0419
           03  WK-I                    PIC S9(004) COMP.
           03  WK-J                    PIC S9(004) COMP.
           03  WK-K                    PIC S9(004) COMP.
230330     03  WK-L                    PIC S9(004) COMP.

      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.

      *   조회처리DC  INTERFACE
       01  XDJL0419-CA.
           COPY  XDJL0419.

      *   등록처리DC  INTERFACE
       01  XDJL0B19-CA.
           COPY  XDJL0B19.

      *    IC고객번호검색
       01  XIAA0019-CA.
           COPY  XIAA0019.

      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      *    AS COPYBOOK
       01  YNJLB276-CA.
           COPY  YNJLB276.

      *    AS COPYBOOK
       01  YPJLB276-CA.
           COPY  YPJLB276.
      *=================================================================
       PROCEDURE                       DIVISION

                                       USING       YCCOMMON-CA
                                                   YNJLB276-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJL0419-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJLB276-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF

           .
       S1000-INITIALIZE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *     01:승인대상조회 / 02:승인의견조회 / 03:결의록탭조회
      *     04:의견등록 / 05:최종승인처리 / 06:불참처리
230330*     07:삭제
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB276-PRCSS-DSTIC     = ( CO-CHA-01 OR
                                           CO-CHA-02 OR
                                           CO-CHA-03 OR
                                           CO-CHA-04 OR
                                           CO-CHA-05 OR
                                           CO-CHA-06 OR
                                           CO-CHA-07 )
               CONTINUE
           ELSE
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

           .
       S2000-VALIDATION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

           #USRLOG  "=================================================="
           #USRLOG  "*           INPUT AJLB276 DATA                   *"
           #USRLOG  "=================================================="
           #USRLOG  " PRCSS-DSTIC    : " YNJLB276-PRCSS-DSTIC


      *    YNJLB276-PRCSS-DSTIC : 처리구분
      *     01:승인대상조회 / 02:승인의견조회 / 03:결의록탭조회
      *     04:의견등록 / 05:최종승인처리

           IF YNJLB276-PRCSS-DSTIC     = ( CO-CHA-01 OR
                                           CO-CHA-02 OR
                                           CO-CHA-03 )

           #USRLOG  "=================================================="
           #USRLOG  " PRGRS-STUS-DSTIC : " YNJLB276-PRGRS-STUS-DSTIC
           #USRLOG  " APLCN-YMD1       : " YNJLB276-APLCN-YMD1
           #USRLOG  " APLCN-YMD2       : " YNJLB276-APLCN-YMD2
           #USRLOG  " CUST-IDNFR       : " YNJLB276-INQURY-CUST-IDNFR
           #USRLOG  " CNGP-DSTIC       : " YNJLB276-CNGP-DSTIC
           #USRLOG  " ATHOR-CMMB-EMPID : " YNJLB276-ATHOR-CMMB-EMPID
           #USRLOG  "=================================================="

      *@3.1   조회DC호출
               PERFORM S3100-DJL0419-CALL-RTN
                  THRU S3100-DJL0419-CALL-EXT
           ELSE

           #USRLOG  "=================================================="
           #USRLOG  " CUST-IDNFR         : " YNJLB276-CUST-IDNFR
           #USRLOG  " LIMT-APLCN-NO      : " YNJLB276-LIMT-APLCN-NO
           #USRLOG  " LIMT-ATHOR-DSTIC   : " YNJLB276-LIMT-ATHOR-DSTIC
           #USRLOG  " ATHOR-OPIN-CTNT    : " YNJLB276-ATHOR-OPIN-CTNT
           #USRLOG  " LAST-L-ATHOR-DSTIC : " YNJLB276-LAST-L-ATHOR-DSTIC
           #USRLOG  "=================================================="

      *@3.2   관리DC호출
               PERFORM S3200-DJL0B19-CALL-RTN
                  THRU S3200-DJL0B19-CALL-EXT
           END-IF

           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@   포괄신용공여한도적정성점검승인조회 DC호출
      *-----------------------------------------------------------------
       S3100-DJL0419-CALL-RTN.

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리PC입력파라미터=
      *@SET(처리구분, 고객식별자, 담당심사역)
      *--     처리구분
           MOVE  YNJLB276-PRCSS-DSTIC
             TO  XDJL0419-I-PRCSS-DSTIC

      *--     진행상태구분
           MOVE  YNJLB276-PRGRS-STUS-DSTIC
             TO  XDJL0419-I-PRGRS-STUS-DSTIC
      *--     신청년월일1
           MOVE  YNJLB276-APLCN-YMD1
             TO  XDJL0419-I-APLCN-YMD1
      *--     신청년월일2
           MOVE  YNJLB276-APLCN-YMD2
             TO  XDJL0419-I-APLCN-YMD2
      *--     조회고객식별자
           MOVE  YNJLB276-INQURY-CUST-IDNFR
             TO  XDJL0419-I-INQURY-CUST-IDNFR
      *--     협의체구분
           MOVE  YNJLB276-CNGP-DSTIC
             TO  XDJL0419-I-CNGP-DSTIC
      *--     승인위원직원번호
           MOVE  YNJLB276-ATHOR-CMMB-EMPID
             TO  XDJL0419-I-ATHOR-CMMB-EMPID

      *--     고객식별자
           MOVE  YNJLB276-CUST-IDNFR
             TO  XDJL0419-I-CUST-IDNFR
      *--     한도신청번호
           MOVE  YNJLB276-LIMT-APLCN-NO
             TO  XDJL0419-I-LIMT-APLCN-NO

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL0419 YCCOMMON-CA XDJL0419-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL0419-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL0419-OK
      *@      출력처리
               PERFORM S3110-DJL0419-OUT-RTN
                  THRU S3110-DJL0419-OUT-EXT
           ELSE
              #ERROR XDJL0419-R-ERRCD
                     XDJL0419-R-TREAT-CD
                     XDJL0419-R-STAT
           END-IF

           .
       S3100-DJL0419-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S3110-DJL0419-OUT-RTN.
      *@4 출력처리

           #USRLOG  "=================================================="
           #USRLOG  "*           DJL0419 OUTPUT DATA                  *"
           #USRLOG  "=================================================="
           #USRLOG  " OUTPT-LINE-CNT1    : " XDJL0419-O-OUTPT-LINE-CNT1
           #USRLOG  " OUTPT-LINE-CNT2    : " XDJL0419-O-OUTPT-LINE-CNT2
           #USRLOG  " OUTPT-LINE-CNT3    : " XDJL0419-O-OUTPT-LINE-CNT3
           #USRLOG  "=================================================="

      *@4.1 출력항목 조립
           MOVE CO-STAT-OK
             TO YPJLB276-PRCSS-RSULT

      *--       출력라인수1
           MOVE  XDJL0419-O-OUTPT-LINE-CNT1
             TO  YPJLB276-OUTPT-LINE-CNT1

      *@4.3 그리드1 조립
      *@실행조건:WK-I > YPJLB276-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL   WK-I > YPJLB276-OUTPT-LINE-CNT1
      *            그리드１
                   MOVE XDJL0419-O-GRID1(WK-I)
                     TO YPJLB276-GRID1  (WK-I)
           END-PERFORM

      *@4.2 출력라인수 조립
           MOVE XDJL0419-O-OUTPT-LINE-CNT2
             TO YPJLB276-OUTPT-LINE-CNT2

      *@4.3 그리드2 조립
      *@실행조건:WK-J > YPJLB276-OUTPT-LINE-CNT2
      *@처리내용:그리드2 조립
           PERFORM VARYING WK-J FROM 1 BY 1
                   UNTIL   WK-J > YPJLB276-OUTPT-LINE-CNT2
      *            그리드2
                   MOVE XDJL0419-O-GRID2(WK-J)
                     TO YPJLB276-GRID2  (WK-J)

           END-PERFORM

      *@4.2 출력라인수 조립
           MOVE XDJL0419-O-OUTPT-LINE-CNT3
             TO YPJLB276-OUTPT-LINE-CNT3

230330*@4.3 그리드3 조립
      *@실행조건:WK-L > YPJLB276-OUTPT-LINE-CNT3
      *@처리내용:그리드3 조립
           PERFORM VARYING WK-L FROM 1 BY 1
                   UNTIL   WK-L > YPJLB276-OUTPT-LINE-CNT3
      *            그리드3
                   MOVE XDJL0419-O-GRID3(WK-L)
                     TO YPJLB276-GRID3  (WK-L)

           END-PERFORM


           IF   YNJLB276-INQURY-CUST-IDNFR  NOT = SPACE    AND
                YPJLB276-OUTPT-LINE-CNT1        > ZERO

      *          CALL - IC고객번호검색
                 PERFORM S7000-IAA0019-CALL-RTN
                    THRU S7000-IAA0019-CALL-EXT

           PERFORM VARYING WK-K FROM 1 BY 1
                   UNTIL   WK-K > YPJLB276-OUTPT-LINE-CNT1
      *            차주명
                 MOVE  XIAA0019-O-CUSTNM1
                   TO  YPJLB276-BRWR-NAME(WK-K)
           END-PERFORM

           END-IF

           .
       S3110-DJL0419-OUT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  포괄신용공여한도적정성점검대상승인 DC호출
      *-----------------------------------------------------------------
       S3200-DJL0B19-CALL-RTN.

      *    초기화
           INITIALIZE                  XDJL0B19-IN

      *--     처리구분
           MOVE  YNJLB276-PRCSS-DSTIC
             TO  XDJL0B19-I-PRCSS-DSTIC
      *--       승인위원직원번호
           MOVE  YNJLB276-ATHOR-CMMB-EMPID
             TO  XDJL0B19-I-ATHOR-CMMB-EMPID
      *--     고객식별자
           MOVE  YNJLB276-CUST-IDNFR
             TO  XDJL0B19-I-CUST-IDNFR
      *--     한도신청번호
           MOVE  YNJLB276-LIMT-APLCN-NO
             TO  XDJL0B19-I-LIMT-APLCN-NO
      *--     한도승인구분
           MOVE  YNJLB276-LIMT-ATHOR-DSTIC
             TO  XDJL0B19-I-LIMT-ATHOR-DSTIC
      *--     승인의견내용
           MOVE  YNJLB276-ATHOR-OPIN-CTNT
             TO  XDJL0B19-I-ATHOR-OPIN-CTNT
      *--     최종한도승인구분
           MOVE  YNJLB276-LAST-L-ATHOR-DSTIC
             TO  XDJL0B19-I-LAST-L-ATHOR-DSTIC

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL0B19 YCCOMMON-CA XDJL0B19-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJL0B19-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL0B19-OK
               MOVE XDJL0B19-O-PRCSS-RSULT
                 TO YPJLB276-PRCSS-RSULT
           ELSE
              #ERROR XDJL0B19-R-ERRCD
                     XDJL0B19-R-TREAT-CD
                     XDJL0B19-R-STAT
           END-IF
           .

       S3200-DJL0B19-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 고객정보 원장 READ
      *-----------------------------------------------------------------
       S7000-IAA0019-CALL-RTN.

           INITIALIZE                  XIAA0019-IN

      *@ 고객정보 원장   READ
      *@-- 영역구분
           MOVE CO-CHA-B
             TO XIAA0019-I-SCOP-DSTIC
      *@-- 고객식별자
           MOVE YNJLB276-INQURY-CUST-IDNFR
             TO XIAA0019-I-CUST-IDNFR

      *@-- 고객번호 검색  IC CALL
           #DYCALL   IAA0019  YCCOMMON-CA  XIAA0019-CA.

           IF  COND-XIAA0019-OK            OR
               COND-XIAA0019-NOTFOUND
               CONTINUE
           ELSE
              #ERROR   XIAA0019-R-ERRCD
                       XIAA0019-R-TREAT-CD
                       XIAA0019-R-STAT
           END-IF

      *    마침표
           .
       S7000-IAA0019-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11276000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
