      *=================================================================00010000
      *@업무명    : KJL     (Total Exposure)                          000200
      *@프로그램명: AJLB028 (AS계열사등록)                          0003
      *@처리유형  : AS                                                000400
      *@처리개요  : 그룹에 속한 계열사를 관리하는 프로그
      *@            : 램이다                                          000600
      *-----------------------------------------------------------------00070000
      *                 P R O G R A M   변　경　이　력                000800
      *-----------------------------------------------------------------00090000
      *@성명 : 일자 : 변　경　내　용                              00
      * ----------------------------------------------------------------00110000
      *이동구:20081128: 신규작성                                    0012
      *김진태:20091102: 타팀　조치메세지　정비                      0012
      *김진태:20091211: PC 삭제                                     0012
      *YBH     :20150430: 1단계 분리보관 처리
      *=================================================================00130000
       IDENTIFICATION                  DIVISION.                        00140000
      *=================================================================00150000
       PROGRAM-ID.                     AJLB028.                         00160000
       AUTHOR.                         이동구.                        001700
       DATE-WRITTEN.                   08/11/28.                        00180000
      *=================================================================00190000
       ENVIRONMENT                     DIVISION.                        00200000
      *=================================================================00210000
       CONFIGURATION                   SECTION.                         00220000
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00230000
       DATA                            DIVISION.                        00240000
      *=================================================================00250000
       WORKING-STORAGE                 SECTION.                         00260000
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3002122             PIC  X(008) VALUE 'B3002122'.
           03  CO-B0900135             PIC  X(008) VALUE 'B0900135'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB028 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00450000
           03  CO-CHA-04               PIC  X(002) VALUE '04'.          00470000
           03  CO-CHA-05               PIC  X(002) VALUE '05'.          00471010
                                                                        00480000
           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.           00490000
                                                                        00490110
           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00491010
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00492010
      *-----------------------------------------------------------------00500000
      * WORKING AREA                                                    00510000
      *-----------------------------------------------------------------00520000
       01  WK-AREA.                                                     00530000
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------00550000
      * PGM INTERFACE PARAMETER                                         00560000
      *-----------------------------------------------------------------00570000
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           005800
       01 XDJLB028-CA.                                                  00590000
           COPY  XDJLB028.                                              00600000
      *   출력영역확보　및　초기화INTERFACE                           006100
       01  XZUGOTMY-CA.                                                 00620000
           COPY  XZUGOTMY.                                              00630000
      *-----------------------------------------------------------------00640000
       LINKAGE                         SECTION.                         00650000
      *-----------------------------------------------------------------00660000
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00670000
           COPY  YCCOMMON.                                              00680000
      *    AS COPYBOOK
       01  YNJLB028-CA.                                                 00690000
           COPY  YNJLB028.                                              00700000
      *    AS COPYBOOK
       01  YPJLB028-CA.                                                 00710001
           COPY  YPJLB028.                                              00720001
      *=================================================================00730000
       PROCEDURE                       DIVISION                         00740000
                                       USING       YCCOMMON-CA          00760000
                                                   YNJLB028-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------00780000
      *@  처리메인                                                    007900
      *-----------------------------------------------------------------00800000
       S0000-MAIN-RTN.                                                  00810000
                                                                        00820000
      *@  초기화                                                      008300
           PERFORM S1000-INITIALIZE-RTN                                 00840002
              THRU S1000-INITIALIZE-EXT                                 00850002
                                                                        00860000
      *@  입력값　CHECK                                               008700
           PERFORM S2000-VALIDATION-RTN                                 00880002
              THRU S2000-VALIDATION-EXT                                 00890002
                                                                        00900000
      *@  업무처리                                                    009100
           PERFORM S3000-PROCESS-RTN                                    00920002
              THRU S3000-PROCESS-EXT                                    00930002
                                                                        00940000
      *@  출력처리                                                    009100
           PERFORM S6000-OUTPUT-RTN                                     00920002
              THRU S6000-OUTPUT-EXT                                     00930002
                                                                        00940000
      *@  처리종료                                                    009500
           PERFORM S9000-FINAL-RTN                                      00960002
              THRU S9000-FINAL-EXT                                      00970002
           .                                                            00980000
       S0000-MAIN-EXT.                                                  00990000
           EXIT.                                                        01000000
      *-----------------------------------------------------------------01010000
      *@  초기화                                                      010200
      *-----------------------------------------------------------------01030000
       S1000-INITIALIZE-RTN.                                            01040000
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJLB028-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJLB028-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호유형구분
           MOVE CO-CHA-1               TO JICOM-CNO-PTRN-DSTIC
      *    고객번호
           MOVE YNJLB028-BRWR-NO       TO JICOM-CNO
      *    고객명
140430*    고객명 SET하면 1차분리보관 대상 에러 안남
150430*     MOVE YNJLB028-DBTR-NAME     TO JICOM-CUSTNM

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01120000
           EXIT.                                                        01130000
      *-----------------------------------------------------------------01140000
      *@  입력값검증                                                  011500
      *-----------------------------------------------------------------01160000
       S2000-VALIDATION-RTN.                                            01170000
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJLB028-PRCSS-DSTIC NOT = CO-CHA-02 AND
      *@ CO-CHA-04 AND CO-CHA-05
      *@처리내용:처리구분 02,04,05 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB028-PRCSS-DSTIC NOT = CO-CHA-02 AND
                                         CO-CHA-04 AND
                                         CO-CHA-05
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@2.2 계열적용구분CHECK
      *@실행조건:YNJLB028-AFFLT-APLY-DSTCD NOT = CO-CHA-1
      *@ CO-CHA-2
      *@처리내용:처리구분 1,2 아닐경우 오류처리한다
      *@에러메시지:계열적용구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB028-AFFLT-APLY-DSTCD NOT = CO-CHA-1 AND
                                              CO-CHA-2
              #ERROR CO-B3002122 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@2.3 차주번호CHECK
      *@실행조건:YNJLB028-PRCSS-DSTIC = SPACE
      *@처리내용:처리구분 미입력일경우 오류처리한다
      *@에러메시지:채무자번호 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB028-BRWR-NO = SPACE
              #ERROR CO-B0900135 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .                                                            01390000
       S2000-VALIDATION-EXT.                                            01400000
           EXIT.                                                        01410000
      *-----------------------------------------------------------------01420000
      *@  업무처리                                                    014300
      *-----------------------------------------------------------------01440000
       S3000-PROCESS-RTN.                                               01450000
      *@3 업무처리
                                                                        01470007
      *@3.1 입력파라미터 조립

           MOVE YNJLB028-CA            TO XDJLB028-IN                   01490000
                                                                        01500000
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB028 YCCOMMON-CA XDJLB028-CA                      01530000
                                                                        01560000
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJLB028-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB028-OK                                          01600000
              CONTINUE                                                  01610000
           ELSE                                                         01620000
              #ERROR XDJLB028-R-ERRCD                                   01630008
                     XDJLB028-R-TREAT-CD                                01640000
                     XDJLB028-R-STAT                                    01650000
           END-IF                                                       01660000
           .                                                            01690000
       S3000-PROCESS-EXT.                                               01700000
           EXIT.                                                        01710000
      *-----------------------------------------------------------------01930001
      *@  출력처리                                                    0194
      *-----------------------------------------------------------------01950001
       S6000-OUTPUT-RTN.                                                01960001
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJLB028-O-PRCSS-RSULT                                  01980001
             TO YPJLB028-PRCSS-RSULT
           .                                                            02090001
       S6000-OUTPUT-EXT.                                                02100001
           EXIT.                                                        02110001
      *-----------------------------------------------------------------01720000
      *@  처리종료                                                    017300
      *-----------------------------------------------------------------01740000
       S9000-FINAL-RTN.                                                 01750000
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11028000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.                                                 01800000
           EXIT.                                                        01810000
