      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: AJLB272 (AS포괄신용공여한도산출저장)
      *@처리유형  : AS
      *@처리개요  : 포괄신용공여한도산출저장
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081224: 신규작성
      *김진태:20091102: 타팀　조치메세지　정비
      *김진태:20091211: PC 삭제
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     AJLB272.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/24.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB272 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE
       01  XDJLB272-CA.
           COPY  XDJLB272.
      *   출력영역확보　및　초기화INTERFACE
       01  XZUGOTMY-CA.
           COPY  XZUGOTMY.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    AS COPYBOOK
       01  YNJLB272-CA.
           COPY  YNJLB272.
      *    AS COPYBOOK
       01  YPJLB272-CA.
           COPY  YPJLB272.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   YNJLB272-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA
                         XIJICOMM-IN
                         XDJLB272-IN
                         XZUGOTMY-IN

      *@1.2 출력영역 확보
           #GETOUT       YPJLB272-CA

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
      *    고객번호유형구분
           MOVE CO-CHA-1               TO JICOM-CNO-PTRN-DSTIC
      *    고객번호
           MOVE YNJLB272-BRWR-NO       TO JICOM-CNO

           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@실행조건:YNJLB272-PRCSS-DSTIC NOT = CO-CHA-01
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF YNJLB272-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3100-DJLB272-CALL-RTN
              THRU S3100-DJLB272-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   DC호출
      *-----------------------------------------------------------------
       S3100-DJLB272-CALL-RTN.

      *@3.1.1 입력파라미터 조립

      *    처리구분
           MOVE YNJLB272-PRCSS-DSTIC
             TO XDJLB272-I-PRCSS-DSTIC
      *    fld채무자번호
           MOVE YNJLB272-BRWR-NO
             TO XDJLB272-I-BRWR-NO
      *    fld신청번호
           MOVE YNJLB272-LIMT-APLCN-NO
             TO XDJLB272-I-LIMT-APLCN-NO
      *    fld총자산2
           MOVE YNJLB272-AMND-TOTAL-ASST
             TO XDJLB272-I-AMND-TOTAL-ASST
      *    fld매출액2
           MOVE YNJLB272-AMND-SALEPR
             TO XDJLB272-I-AMND-SALEPR
      *    fld자기자본2
           MOVE YNJLB272-AMND-B-YR-ONCP-AMT
             TO XDJLB272-I-AMND-B-YR-ONCP-AMT
      *    fld금융차입금
           MOVE YNJLB272-AMND-FNCS-AMBR
             TO XDJLB272-I-AMND-FNCS-AMBR
      *    fld당행차입금
           MOVE YNJLB272-AMND-OWBNK-AMBR
             TO XDJLB272-I-AMND-OWBNK-AMBR
      *    fld영업흐름액
           MOVE YNJLB272-AMND-BZOPR-ACF
             TO XDJLB272-I-AMND-BZOPR-ACF
      *    fld평균이자율
           MOVE YNJLB272-AMND-ENTP-AVG-IRT
             TO XDJLB272-I-AMND-ENTP-AVG-IRT
      *    fld여신성한도
           MOVE YNJLB272-AMND-LI-ASST-CLAM
             TO XDJLB272-I-AMND-LI-ASST-CLAM
      *    fld자기자본한도2
           MOVE YNJLB272-AMND-O-CAPTL-BSAMT
             TO XDJLB272-I-AMND-O-CAPTL-BSAMT
      *    fld영업한도2
           MOVE YNJLB272-AMND-BA-BASE-CLAM
             TO XDJLB272-I-AMND-BA-BASE-CLAM
      *    fld포괄한도2
           MOVE YNJLB272-AMND-I-STUP-ABLAMT
             TO XDJLB272-I-AMND-I-STUP-ABLAMT
      *    fld신용등급지원비율
           MOVE YNJLB272-CRDRAT-SPORT-RATO
             TO XDJLB272-I-CRDRAT-SPORT-RATO

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB272 YCCOMMON-CA XDJLB272-CA

      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJLB272-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB272-OK
              CONTINUE
           ELSE
              #ERROR XDJLB272-R-ERRCD
                     XDJLB272-R-TREAT-CD
                     XDJLB272-R-STAT
           END-IF
           .
       S3100-DJLB272-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  출력처리
      *-----------------------------------------------------------------
       S6000-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력항목 조립

      *    처리결과
           MOVE XDJLB272-O-PRCSS-RSULT
             TO YPJLB272-PRCSS-RSULT
           .
       S6000-OUTPUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11027000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
