      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: AJLB130 (간접상품정보원장조회)                  00030001
      *@처리유형  : AS                                                00040001
      *@처리개요  : 간접상품정보원장을 조회하는 프로그램        00050001
      *-----------------------------------------------------------------00060001
      *                 P R O G R A M   변　경　이　력                00070001
      *-----------------------------------------------------------------00080001
      *@성명 : 일자 : 변　경　내　용                              00090001
      * ----------------------------------------------------------------00100001
      *정윤섭:20191008: 신규작성                                    00110001
      *=================================================================00120001
       IDENTIFICATION                  DIVISION.                        00130001
      *=================================================================00140001
       PROGRAM-ID.                     AJLB130.                         00150001
       AUTHOR.                         정윤섭.                        00160001
       DATE-WRITTEN.                   19/10/08.                        00170001
      *=================================================================00180001
       ENVIRONMENT                     DIVISION.                        00190001
      *=================================================================00200001
       CONFIGURATION                   SECTION.                         00210001
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.
      *=================================================================00220001
       DATA                            DIVISION.                        00230001
      *=================================================================00240001
       WORKING-STORAGE                 SECTION.                         00250001
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'AJLB130 '.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.

      *-----------------------------------------------------------------00410001
      * WORKING AREA                                                    00420001
      *-----------------------------------------------------------------00430001
       01  WK-AREA.                                                     00440001
           03  WK-I                    PIC  9(005) COMP.                00450001
      *-----------------------------------------------------------------00460001
      * PGM INTERFACE PARAMETER                                         00470001
      *-----------------------------------------------------------------00480001
      *    XIJICOMM INTERFACE
       01  XIJICOMM-CA.
           COPY  XIJICOMM.
      *   처리DC  INTERFACE                                           00490001
       01  XDJL4130-CA.                                                 00500001
           COPY  XDJL4130.                                              00510001
       01  XDJLB130-CA.                                                 00500001
           COPY  XDJLB130.
      *   출력영역확보　및　초기화INTERFACE                           00520001
       01  XZUGOTMY-CA.                                                 00530001
           COPY  XZUGOTMY.                                              00540001
      *-----------------------------------------------------------------00550001
       LINKAGE                         SECTION.                         00560001
      *-----------------------------------------------------------------00570001
      *    COMMON AREA
       01  YCCOMMON-CA.                                                 00580001
           COPY  YCCOMMON.                                              00590001
      *    AS COPYBOOK
       01  YNJLB130-CA.                                                 00600001
           COPY  YNJLB130.                                              00610001
      *    AS COPYBOOK
       01  YPJLB130-CA.                                                 00620001
           COPY  YPJLB130.                                              00630001
      *=================================================================00640001
       PROCEDURE                       DIVISION                         00650001
                                       USING       YCCOMMON-CA          00670001
                                                   YNJLB130-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------00690001
      *@  처리메인                                                    00700001
      *-----------------------------------------------------------------00710001
       S0000-MAIN-RTN.                                                  00720001
                                                                        00730001
      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  출력처리
           PERFORM S6000-OUTPUT-RTN
              THRU S6000-OUTPUT-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .                                                            00850001
       S0000-MAIN-EXT.                                                  00860001
           EXIT.                                                        00870001
      *-----------------------------------------------------------------00880001
      *@  초기화                                                      00890001
      *-----------------------------------------------------------------00900001
       S1000-INITIALIZE-RTN.                                            00910001
      *@1 초기화

      *@1.1 출력영역확보 파라미터 및 결과코드 초기화
           INITIALIZE    WK-AREA                                        00940001
                         XIJICOMM-IN
                         XDJL4130-IN                                    00950001
                         XZUGOTMY-IN                                    00960001
                                                                        00970001
      *@1.2 출력영역 확보
           #GETOUT       YPJLB130-CA                                    00990001

      *@1.3 COMMON AREA SETTING 공통IC프로그램 호출
           #DYCALL IJICOMM YCCOMMON-CA XIJICOMM-CA

      *@1.4 호출결과 확인
           IF COND-XIJICOMM-OK
              CONTINUE
           ELSE
              #ERROR XIJICOMM-R-ERRCD
                     XIJICOMM-R-TREAT-CD
                     XIJICOMM-R-STAT
           END-IF
           .
       S1000-INITIALIZE-EXT.                                            01010001
           EXIT.                                                        01020001
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *   처리구분에 따른 입력값 검증
           EVALUATE YNJLB130-PRCSS-DSTIC
           WHEN CO-CHA-01
           WHEN CO-CHA-02
           WHEN CO-CHA-04
                CONTINUE
           WHEN OTHER
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

                           .
       S2000-VALIDATION-EXT.
           EXIT.

      *-----------------------------------------------------------------01030001
      *@  업무처리                                                    01040001
      *-----------------------------------------------------------------01050001
       S3000-PROCESS-RTN.                                               01060001
      *@3 업무처리 조회 또는 등록삭제

           EVALUATE YNJLB130-PRCSS-DSTIC
           WHEN CO-CHA-01
      *#1     조회처리시
      *@1     조회 프로그램호출
               PERFORM S3100-DJL4130-CALL-RTN
                  THRU S3100-DJL4130-CALL-EXT
           WHEN CO-CHA-02
           WHEN CO-CHA-04
      *#1     등록/삭제처리시
      *@1     등록 삭제 프로그램호출
               PERFORM S3200-DJLB130-CALL-RTN
                  THRU S3200-DJLB130-CALL-EXT
           END-EVALUATE

                        .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------01700001
      *@  조회처리                                                    01710001
      *-----------------------------------------------------------------01720001
       S3100-DJL4130-CALL-RTN.

      *@3.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@SET(처리구분,기준년월,상품코드 )

           MOVE YNJLB130-PRCSS-DSTIC   TO XDJL4130-I-PRCSS-DSTIC        01100001
           MOVE YNJLB130-BASE-YM       TO XDJL4130-I-BASE-YM            01110001
           MOVE YNJLB130-PRDCT-CD      TO XDJL4130-I-PRDCT-CD           01120001
                                                                        01140001
      *@3.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJL4130 YCCOMMON-CA XDJL4130-CA                      01170001
                                                                        01200001
      *@3.3 처리결과CHECK
      *@실행조건:COND-XDJL4130-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJL4130-OK                                          01240001
              CONTINUE                                                  01250001
           ELSE                                                         01260001
              #ERROR XDJL4130-R-ERRCD                                   01270001
                     XDJL4130-R-TREAT-CD                                01280001
                     XDJL4130-R-STAT                                    01290001
           END-IF                                                       01300001
                              .                                         01310001
        S3100-DJL4130-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------01700001
      *@  등록 삭제 처리                                          01710001
      *-----------------------------------------------------------------01720001
       S3200-DJLB130-CALL-RTN.

      *@3 업무처리

      *@3.1 DC호출
           PERFORM S3210-DJLB130-CALL-RTN                               01040003
              THRU S3210-DJLB130-CALL-EXT

                             .
       S3200-DJLB130-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------01090004
      *@  등록 삭제 DC호출
      *-----------------------------------------------------------------
       S3210-DJLB130-CALL-RTN.                                          01120003

      *@3.1.1 입력파라미터 조립
      *@처리내용:처리DC입력파라미터=
      *@처리구분,기준년월,
      *@상품대분로코드,상품중분류코드,상품템플릿코드,
      *@상품번호,간접상품분류구분,간접상품분류구분명,
      *@간접상품명,간접TE환산율

      *    처리구분
           MOVE YNJLB130-PRCSS-DSTIC   TO XDJLB130-I-PRCSS-DSTIC        0001

      *    기준년월
           MOVE YNJLB130-BASE-YM       TO XDJLB130-I-BASE-YM

      *    상품대분류코드                                             01330003
           MOVE YNJLB130-PRDCT-LAG-CLSFI-CD                             01340003
             TO XDJLB130-I-PRDCT-LAG-CLSFI-CD                           01350003
                                                                        01360003
      *    상품중분류코드                                             01370003
           MOVE YNJLB130-PRDCT-MEDM-CLSFI-CD                            01380003
             TO XDJLB130-I-PRDCT-MEDM-CLSFI-CD                          01390003

      *    상품템플릿코드                                             01370003
           MOVE YNJLB130-PRDCT-TMPLT-CD                                 01380003
             TO XDJLB130-I-PRDCT-TMPLT-CD                               01390003

      *    상품번호                                                   01370003
           MOVE YNJLB130-PRDCT-NO                                       01380003
             TO XDJLB130-I-PRDCT-NO                                     01390003

      *    간접상품중분류구분
           MOVE YNJLB130-INDR-M-CLSFI-DSTCD
             TO XDJLB130-I-INDR-M-CLSFI-DSTCD

      *    간접상품중분류구분명
           MOVE YNJLB130-INDR-MC-DSTCD-NAME
             TO XDJLB130-I-INDR-MC-DSTCD-NAME

      *    간접상품명
           MOVE YNJLB130-INDR-PRDCT-NAME
             TO XDJLB130-I-INDR-PRDCT-NAME

      *    간접TE환산율
           MOVE YNJLB130-INDR-TE-UTCRT
             TO XDJLB130-I-INDR-TE-UTCRT

      *@3.1.2 프로그램 호출
      *@처리내용:DC프로그램호출
           #DYCALL DJLB130 YCCOMMON-CA XDJLB130-CA                      01910003
                                                                        01920003
      *@3.1.3 처리결과CHECK
      *@실행조건:COND-XDJLB130-OK
      *@처리내용:리턴코드가 정상(00) 아닐경우 오류처리한다
           IF COND-XDJLB130-OK                                          01960003
              CONTINUE                                                  01970003
           ELSE                                                         01980003
              #ERROR XDJLB130-R-ERRCD                                   01990004
                     XDJLB130-R-TREAT-CD                                02000004
                     XDJLB130-R-STAT                                    02010004
           END-IF                                                       02020003
                             .                                          02030003
       S3210-DJLB130-CALL-EXT.                                          02040003
           EXIT.


      *-----------------------------------------------------------------01700001
      *@  출력처리                                                    01710001
      *-----------------------------------------------------------------01720001
       S6000-OUTPUT-RTN.                                                01730001

           EVALUATE YNJLB130-PRCSS-DSTIC
           WHEN CO-CHA-01
      *#1     조회처리시
      *@1     조회 출력프로그램 호출
               PERFORM S6100-OUTPUT-RTN
                  THRU S6100-OUTPUT-EXT
           WHEN CO-CHA-02
           WHEN CO-CHA-04
      *#1     등록/삭제처리시
      *@1     등록삭제 출력프로그램호출
               PERFORM S6200-OUTPUT-RTN
                  THRU S6200-OUTPUT-EXT
           END-EVALUATE

      *@1 폼ID SET
           #BOFMID 'V1KJL11130000'

                       .
       S6000-OUTPUT-EXT.                                                02150001
           EXIT.                                                        02160001
      *-----------------------------------------------------------------01700001
      *@  출력처리 조회                                             01710001
      *-----------------------------------------------------------------01720001
       S6100-OUTPUT-RTN.
      *@4 출력처리

      *@4.1 출력라인수 조립
           MOVE XDJL4130-O-OUTPT-LINE-CNT1                              01750001
             TO YPJLB130-OUTPT-LINE-CNT1                                01760001

      *@4.2 그리드1 조립
      *@실행조건:WK-I > YPJLB130-OUTPT-LINE-CNT1
      *@처리내용:그리드1 조립
           PERFORM VARYING WK-I FROM 1 BY 1                             01780001
                   UNTIL   WK-I > YPJLB130-OUTPT-LINE-CNT1              01790001
                                                                        01800001
                   MOVE XDJL4130-O-GRID1             (WK-I)
                     TO YPJLB130-GRID1               (WK-I)
           END-PERFORM                                                  02130001

                       .
       S6100-OUTPUT-EXT.
               EXIT.

      *-----------------------------------------------------------------01700001
      *@  출력처리 등록삭제                                         01710001
      *-----------------------------------------------------------------01720001
       S6200-OUTPUT-RTN.                                                01960001
      *@4 출력처리

      *@4.1 출력항목 조립
           MOVE XDJLB130-O-PRCSS-RSULT                                  01980001
             TO YPJLB130-PRCSS-RSULT
           .                                                            02090001
       S6200-OUTPUT-EXT.                                                02100001
           EXIT.
      *-----------------------------------------------------------------01340001
      *@  처리종료                                                    01350001
      *-----------------------------------------------------------------01360001
       S9000-FINAL-RTN.                                                 01370001
      *@5 종료처리

      *@5.1 폼ID SET
      *@처리내용:화면폼ID SET
           #BOFMID 'V1KJL11130000'

      *@5.2 프로그램 종료
      *@처리내용:프로그램 정상종료
           #OKEXIT CO-STAT-OK                                           01420001
           .                                                            01430001
       S9000-FINAL-EXT.                                                 01440001
           EXIT.                                                        01450001
