      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4081 (DC신용공여이사회승인내역조회)
      *@처리유형  : DC
      *@처리개요  : 신용공여이사회승인내역조회하는 프로그램이다
      *@구현방법  : SQL ARRAY
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *박정수:20240425: 신규작성
      *박정수:20240926: 소관부서 권한 변경
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  이사회승인내역 기본   : THKJL0081            : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4081.
       AUTHOR.                         박정수.
       DATE-WRITTEN.                   24/04/25.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
      *    환율이 등록되어있지 않습니다.
           03  CO-B4400002             PIC  X(008) VALUE 'B4400002'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4081'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

240926     03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
240926     03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-06               PIC  X(002) VALUE '06'.
           03  CO-CHA-07               PIC  X(002) VALUE '07'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
           03  WK-EXHS-RT              PIC  9(005)V9999.
      *----
      *   매매기준환율
      *    N100단위통화여부
      *   환율고시단위구분
      *----
           03  WK-DEAL-BASE-EXRT       PIC  9(005)V9(002).
           03  WK-N100-UNIT-CRNCY-YN   PIC  X(0001).
           03  WK-HWGSCD               PIC  S9(0003) COMP-3.
      *----
      *    매매기준율환산   －잔액  (BS기준잔액)

           03  WK-TTL-AMT-BASE-CLAM    PIC S9(00018) COMP-3.
           03  WK-TTL-AMT-BASE-BAL     PIC S9(00018) COMP-3.
           03  WK-BS-BASE-BAL          PIC S9(00018) COMP-3.
           03  WK-BS-BAL               PIC S9(00018) COMP-3.
           03  WK-BS-BASE-CLAM         PIC S9(00018) COMP-3.
           03  WK-BRDC-ATHOR-WONC-AUC  PIC S9(00018) COMP-3.

240926     03  WK-JRSDZ-BRNCD          PIC  X(004).
  ::       03  WK-H-I-BRNCD1           PIC  X(004).
240926     03  WK-H-I-BRNCD2           PIC  X(004).

           03  WK-NEXT-KEY.
               05 WK-BRDC-ATHOR-NO     PIC  X(010).

           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * 기준환율정보 조회 Parameter
       01  XCJIEX01-CA.
           COPY  XCJIEX01.
      *신용공여이사회승인내역조회
       01  XQJL4081-CA.
           COPY  XQJL4081.

240926* FC COPYBOOK
       01  XFJL0001-CA.
           COPY  XFJL0001.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO INTERFACE PARAMETER
           COPY  YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      * DC COPYBOOK
       01  XDJL4081-CA.
           COPY  XDJL4081.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4081-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE WK-AREA
      *               SQLIO
                      YCDBSQLA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE XDJL4081-OUT
                      XDJL4081-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@   소관부서
           IF XDJL4081-I-JRSDZ-BRNCD = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@   신용공여이사회승인내역 조회
           PERFORM S3200-QJL4081-CALL-RTN
              THRU S3200-QJL4081-CALL-EXT

           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여이사회승인내역 조회
      *-----------------------------------------------------------------
       S3200-QJL4081-CALL-RTN.

      *@2.1 변수초기화
           INITIALIZE XQJL4081-IN

      *@2.2 호출변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL4081-I-GROUP-CO-CD

      *@   소관부점코드
           IF XDJL4081-I-JRSDZ-BRNCD = '9999'
               MOVE '%%%%'
                 TO XQJL4081-I-JRSDZ-BRNCD

               MOVE '1'
                 TO XQJL4081-I-BRN-DSTIC
           ELSE
               MOVE XDJL4081-I-JRSDZ-BRNCD
                 TO WK-JRSDZ-BRNCD

               PERFORM S6000-FJL0001-CALL-RTN
                  THRU S6000-FJL0001-CALL-EXT

               IF XFJL0001-O-BRNCD-VALDN-YN = CO-CHA-1
                   MOVE '2'
                     TO XQJL4081-I-BRN-DSTIC

                   MOVE WK-H-I-BRNCD1
                     TO XQJL4081-I-JRSDZ-BRNCD1

                   MOVE WK-H-I-BRNCD2
                     TO XQJL4081-I-JRSDZ-BRNCD2

                   MOVE SPACE
                     TO XQJL4081-I-JRSDZ-BRNCD

               ELSE
                   MOVE '1'
                     TO XQJL4081-I-BRN-DSTIC

                   MOVE WK-H-I-BRNCD1
                     TO XQJL4081-I-JRSDZ-BRNCD

                   MOVE SPACE
                     TO XQJL4081-I-JRSDZ-BRNCD1

                   MOVE SPACE
                     TO XQJL4081-I-JRSDZ-BRNCD2

               END-IF
           END-IF

      *@   고객식별자
           IF XDJL4081-I-CUST-IDNFR = SPACE
               MOVE '2'
                 TO XQJL4081-I-INQURY-DSTIC

               MOVE '%%%%%%%%%%'
                 TO XQJL4081-I-CUST-IDNFR

           ELSE
               MOVE '1'
                 TO XQJL4081-I-INQURY-DSTIC

               MOVE XDJL4081-I-CUST-IDNFR
                 TO XQJL4081-I-CUST-IDNFR
           END-IF

      *    이사회승인번호
           MOVE '%%%%%%%%%%'
             TO XQJL4081-I-BRDC-ATHOR-NO

      *    중단거래여부 확인
           IF  BICOM-DSCN-TRAN-DSTCD = '1' OR '2'

               MOVE BOCOM-BF-TDK-INFO-CTNT
                 TO WK-NEXT-KEY

      *        N이사회승인번호
               MOVE WK-BRDC-ATHOR-NO
                 TO XQJL4081-I-N-BRDC-ATHOR-NO

           END-IF

      *@2.3 프로그램 호출
           #DYSQLA QJL4081 XQJL4081-CA
      *@2.4 호출결과확인
           IF COND-DBSQL-OK OR COND-DBSQL-MRNF
              CONTINUE
           ELSE
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
              #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@2.5 출력변수 MOVE
           MOVE  DBSQL-SELECT-CNT
             TO  XDJL4081-O-PRSNT-NOITM1

           PERFORM VARYING WK-I FROM 1 BY 1 UNTIL WK-I > 100
                        OR WK-I > XDJL4081-O-PRSNT-NOITM1
      *         고객식별자
                MOVE XQJL4081-O-CUST-IDNFR(WK-I)
                  TO XDJL4081-O-CUST-IDNFR(WK-I)

      *         고객명
                MOVE XQJL4081-O-CUSTNM(WK-I)
                  TO XDJL4081-O-CUSTNM(WK-I)

      *         신용공여중분류코드
                MOVE XQJL4081-O-GRCR-MIDL-CLSFI-CD(WK-I)
                  TO XDJL4081-O-GRCR-MIDL-CLSFI-CD(WK-I)

      *         통화코드
                MOVE XQJL4081-O-CNCYCD(WK-I)
                  TO XDJL4081-O-CNCYCD(WK-I)

      *         이사회승인금액
                MOVE XQJL4081-O-BRDC-ATHOR-AMT(WK-I)
                  TO XDJL4081-O-BRDC-ATHOR-AMT(WK-I)

      *         원화가 아닐 경우
                IF XDJL4081-O-CNCYCD(WK-I) NOT= 'KRW'
      *             환율 조회
                    PERFORM S4000-CJIEX01-CALL-RTN
                       THRU S4000-CJIEX01-CALL-EXT

      *             이사회승인원화환산금액
                    MOVE WK-BRDC-ATHOR-WONC-AUC
                      TO XDJL4081-O-BRDC-ATHOR-WONC-AUC(WK-I)
                ELSE
      *             이사회승인원화환산금액
                    MOVE XDJL4081-O-BRDC-ATHOR-AMT(WK-I)
                      TO XDJL4081-O-BRDC-ATHOR-WONC-AUC(WK-I)

                END-IF

      *         이사회승인년월일
                MOVE XQJL4081-O-BRDC-ATHOR-YMD(WK-I)
                  TO XDJL4081-O-BRDC-ATHOR-YMD(WK-I)

      *         이사회승인유효년월일
                MOVE XQJL4081-O-BRDC-ATHOR-VALD-YMD(WK-I)
                  TO XDJL4081-O-BRDC-ATHOR-VALD-YMD(WK-I)

      *         소관부점코드
                MOVE XQJL4081-O-JRSDZ-BRNCD(WK-I)
                  TO XDJL4081-O-JRSDZ-BRNCD(WK-I)

      *         소관부점명
                MOVE XQJL4081-O-JRSD-BRNZ-NAME(WK-I)
                  TO XDJL4081-O-JRSD-BRNZ-NAME(WK-I)

      *         비고
                MOVE XQJL4081-O-RMARK(WK-I)
                  TO XDJL4081-O-RMARK(WK-I)

      *         이사회승인번호
                MOVE XQJL4081-O-BRDC-ATHOR-NO(WK-I)
                  TO XDJL4081-O-BRDC-ATHOR-NO(WK-I)

      *         이사회승인금리내용
                MOVE XQJL4081-O-BRDC-ATHOR-IRT-CTNT(WK-I)
                  TO XDJL4081-O-BRDC-ATHOR-IRT-CTNT(WK-I)

           END-PERFORM

           IF  DBSQL-SELECT-CNT > 100
      *        N이사회승인번호
               MOVE XQJL4081-O-BRDC-ATHOR-NO(WK-I)
                 TO WK-BRDC-ATHOR-NO


               #DSCNTR 2 WK-NEXT-KEY
           END-IF
           .
       S3200-QJL4081-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  환율 조회
      *-----------------------------------------------------------------
       S4000-CJIEX01-CALL-RTN.

           INITIALIZE       XCJIEX01-CA

      *---처리조건 데이터 MOVE
      *   구분코드
      *   그룹회사코드
      *   출력구분코드
      *   유효년월일－기준년월일
      *   통화코드
      *   환율적용회차
      *----
           MOVE  '1'                     TO  XCJIEX01-I-DSTCD
           MOVE  BICOM-GROUP-CO-CD       TO  XCJIEX01-I-GROUP-CO-CD
           MOVE  '1'                     TO  XCJIEX01-I-OUTPT-DSTCD
           MOVE  BICOM-TRAN-BASE-YMD     TO  XCJIEX01-I-BASE-YMD
           MOVE  XDJL4081-O-CNCYCD(WK-I) TO  XCJIEX01-I-CNCYCD
           MOVE  1                       TO  XCJIEX01-I-EXRT-APLY-NTH

      * 공통 UTILITY CALL
          #DYCALL   CJIEX01  YCCOMMON-CA  XCJIEX01-CA

      * RETURN 정보 확인
           IF XCJIEX01-R-STAT    =  ZEROS
      *----
      *     매매기준환율
      *     전신환매도환율
      *      N100단위통화여부
      *----
             MOVE XCJIEX01-O-DEAL-BASE-EXRT(1)  TO WK-DEAL-BASE-EXRT
             MOVE XCJIEX01-O-N100-UNIT-CRNCY-YN(1)
                  TO  WK-N100-UNIT-CRNCY-YN
           ELSE
      *해당통화가　없으면 전영업일 1회차 환율 적용
               IF  XCJIEX01-R-STAT  =  '07'
                   INITIALIZE       XCJIEX01-CA

                   MOVE  '1'
                     TO  XCJIEX01-I-DSTCD
                   MOVE  BICOM-GROUP-CO-CD
                     TO  XCJIEX01-I-GROUP-CO-CD
                   MOVE  '1'
                     TO  XCJIEX01-I-OUTPT-DSTCD
                   MOVE  JICOM-BF-BZOPR-YMD
                     TO  XCJIEX01-I-BASE-YMD
                   MOVE  XDJL4081-O-CNCYCD(WK-I)
                     TO  XCJIEX01-I-CNCYCD
                   MOVE  1
                     TO  XCJIEX01-I-EXRT-APLY-NTH

      * 공통 UTILITY CALL
                   #DYCALL   CJIEX01  YCCOMMON-CA  XCJIEX01-CA

      * RETURN 정보 확인
                   IF XCJIEX01-R-STAT    =  ZEROS

                       MOVE XCJIEX01-O-DEAL-BASE-EXRT(1)
                         TO WK-DEAL-BASE-EXRT
                       MOVE XCJIEX01-O-N100-UNIT-CRNCY-YN(1)
                         TO WK-N100-UNIT-CRNCY-YN
                   ELSE
                       MOVE 0
                         TO WK-DEAL-BASE-EXRT

                       MOVE '0'
                         TO WK-N100-UNIT-CRNCY-YN
                   END-IF
               ELSE
                   #ERROR CO-B4400002 CO-UKJL0036 CO-STAT-ERROR
               END-IF

           END-IF

      *환율고시단위구분
           IF  WK-N100-UNIT-CRNCY-YN = '1'
               MOVE 100       TO WK-HWGSCD
           ELSE
               MOVE 1         TO WK-HWGSCD
           END-IF

      * 매매기준율환산 ( 이사회승인원화환산금액)
           COMPUTE   WK-BRDC-ATHOR-WONC-AUC
                  =  XDJL4081-O-BRDC-ATHOR-AMT(WK-I)
                  *  WK-DEAL-BASE-EXRT
                  /  WK-HWGSCD

           .
       S4000-CJIEX01-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
240926*@  부점정보 추출
      *-----------------------------------------------------------------
       S6000-FJL0001-CALL-RTN.

      *@   변수초기화
           INITIALIZE                      XFJL0001-IN

      *@   조회구분
           MOVE  CO-CHA-04             TO  XFJL0001-I-INQURY-DSTCD

      *    소관부점코드
           MOVE  WK-JRSDZ-BRNCD        TO  XFJL0001-I-BRNCD

      *@   FC CALL
           #DYCALL  FJL0001  YCCOMMON-CA  XFJL0001-CA

      *@   처리결과확인
           IF  XFJL0001-R-STAT  =  CO-STAT-OK
               MOVE  XFJL0001-O-BRNCD(1)   TO   WK-H-I-BRNCD1
               MOVE  XFJL0001-O-BRNCD(2)   TO   WK-H-I-BRNCD2
           END-IF
           .

       S6000-FJL0001-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@   정상종료
           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
