      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: DJL4023 (DC본부부서기준값조회)                  00030001
      *@처리유형  : DC                                                00040001
      *@처리개요  : 자기자본 정보 및 가중치 정보를 조회   00050001
      *@            : 처리하는 프로그램이다                         00060001
      *@구현방법  : SQL ARRAY                                         00061009
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20090120: 신규작성                                    00120001
      *김진태:20090402: 프로그램수정                                00121009
      *김진태:20091208: 에러메세지정비                              00121009
      *김진태:20100507: 렌탈업기준한도적용배수추가                  00121009
      * YBH    :20140718: 자기자본기준,영업활동현금흐름액기준
      *                   한도액계산시 신용등급지원비율 기준변경
      * YBH    :20150226: 장기자산SUB-LIMIT조회 추가
      * YBH    :20210408: 2.장기자산SUB-LIMIT등록을 장외파생상품
      *                     SUB-LIMIT등록으로 변경
      *최주원:20211000:탭추가1 산업분류별적용비율
      *                탭추가2 금융업종평균자기자본비율
      *=================================================================00130001
      ******************************************************************00131009
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00133009
      **  ------------------------- ------------------------------------00134009
      **  신용등급별가중치        : THKJL0045            : R          00135011
      **  한은업종가중치          : THKJL0047            : R          00135112
      **  TE자기자본기본          : THKJL0049            : R          00135212
150226**  THKJL0063        : SUB한도관리                 : R
211000**  THKJL0046        : 산업분류가중치기본                 : R
211000**  THKJL0050        : 금융기관자기자본비율                 : R
      ******************************************************************00136009
       IDENTIFICATION                  DIVISION.                        00210001
      *=================================================================00220001
       PROGRAM-ID.                     DJL4023.                         00230001
       AUTHOR.                         이동구.                        00240001
       DATE-WRITTEN.                   09/01/20.                        00250001
      *=================================================================00270001
       ENVIRONMENT                     DIVISION.                        00280001
      *=================================================================00290001
       CONFIGURATION                   SECTION.                         00300001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00320001
       DATA                            DIVISION.                        00330001
      *=================================================================00340001
       WORKING-STORAGE                 SECTION.                         00350001
      *-----------------------------------------------------------------00361009
      *CONSTANT ERROR AREA                                              00362009
      *-----------------------------------------------------------------00363009
       01  CO-ERROR-AREA.                                               00364009
      *에러메시지정의                                                 00365009
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00366009
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00367009
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00368009
      *조치메시지정의                                                 00369009
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00369109
      *-----------------------------------------------------------------00490001
      * CONSTANT AREA                                                   00500001
      *-----------------------------------------------------------------00510001
       01  CO-AREA.                                                     00520001
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4023'.     00530001
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00540001
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00550001
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00560001
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00570001
                                                                        00580001

           03  CO-MAX-CNT              PIC  9(005) VALUE 100.
           03  CO-NUM-100              PIC  9(005) VALUE 100.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00660001

           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00670013
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00680013
           03  CO-CHA-3                PIC  X(001) VALUE '3'.           00690013
           03  CO-CHA-4                PIC  X(001) VALUE '4'.           00700013
140718     03  CO-CHA-5                PIC  X(001) VALUE '5'.           00700013
      *-----------------------------------------------------------------00810001
      * WORKING AREA                                                    00820001
      *-----------------------------------------------------------------00830001
       01  WK-AREA.                                                     00840001
           03  WK-I                    PIC S9(004) COMP.                00850001
           03  WK-1                    PIC S9(004) COMP.                00860011
           03  WK-2                    PIC S9(004) COMP.                00870011
           03  WK-3                    PIC S9(004) COMP.                00880011
           03  WK-4                    PIC S9(004) COMP.                00890011
140718     03  WK-5                    PIC S9(004) COMP.                00890011

211000     03  WK-J                    PIC S9(004) COMP.
211000     03  WK-K                    PIC S9(004) COMP.

      *    NEXT KEY 항목정의
           03  WK-BF-KEY.
               05  WK-BF-TE-IDSTRY-CLSFI-CD         PIC  X(003).
           03  WK-AF-KEY.
               05  WK-AF-TE-IDSTRY-CLSFI-CD         PIC  X(003).

      *-----------------------------------------------------------------01040001
      * PGM INTERFACE PARAMETER                                         01050001
      *-----------------------------------------------------------------01060001
      * TE자기자본정보조회                                            01110009
       01  XQJL0231-CA.                                                 01120001
           COPY  XQJL0231.                                              01130001
                                                                        01180001
      *신용등급가중치 정보조회                                      01190001
       01  XQJL0232-CA.                                                 01200001
           COPY  XQJL0232.                                              01210001
                                                                        01220001
      *한은업종가중치정보원장조회                                     01230001
       01  XQJL0233-CA.                                                 01240001
           COPY  XQJL0233.                                              01250001
                                                                        01260001
      *기준한도적용배수정보원장조회                                   01270001
       01  XQJL0234-CA.                                                 01280001
           COPY  XQJL0234.                                              01290001

211000*산업분류 적용비율 조회
       01  XQJL0235-CA.
           COPY  XQJL0235.

211000*금융업종평균 자기자본비율 조회
       01  XQJL0236-CA.
           COPY  XQJL0236.

      *-----------------------------------------------------------------01310001
      * DBIO SQLIO INTERFACE PARAMETER                                  01320001
      *-----------------------------------------------------------------01330001
      * SQLIO INTERFACE PARAMETER                                       01340001
           COPY  YCDBSQLA.                                              01350001
           COPY  YCDBIOCA.                                              00900003

150226*    SUB한도관리　테이블(KEY)                                   009200
       01  TKJL0063-KEY.                                                00930000
           COPY  TKJL0063.                                              00940000
      *    SUB한도관리　테이블(RECORD)                                009500
       01  TRJL0063-REC.                                                00960000
           COPY  TRJL0063.                                              00970000

      *-----------------------------------------------------------------01370001
       LINKAGE                         SECTION.                         01380001
      *-----------------------------------------------------------------01390001
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 01400001
           COPY  YCCOMMON.                                              01410001
      * DC COPYBOOK                                                     01420001
       01  XDJL4023-CA.                                                 01430001
           COPY  XDJL4023.                                              01440001
      *=================================================================01460001
       PROCEDURE                       DIVISION                         01470001
                                       USING       YCCOMMON-CA          01480001
                                                   XDJL4023-CA          01490001
                                                   .                    01500001
      *=================================================================01510001
                                                                        01520001
      *-----------------------------------------------------------------01530001
      *@  처리메인                                                    01540001
      *-----------------------------------------------------------------01550001
       S0000-MAIN-RTN.                                                  01560001
                                                                        01570001
      *@  초기화                                                      01580001
           PERFORM S1000-INITIALIZE-RTN                                 01590010
              THRU S1000-INITIALIZE-EXT                                 01600010
                                                                        01610001
      *@  입력값　CHECK                                               01620001
           PERFORM S2000-VALIDATION-RTN                                 01630010
              THRU S2000-VALIDATION-EXT                                 01640010
                                                                        01650001
      *@  업무처리                                                    01660001
           PERFORM S3000-PROCESS-RTN                                    01670010
              THRU S3000-PROCESS-EXT                                    01680010
                                                                        01690001
      *@  처리종료                                                    01700001
           PERFORM S9000-FINAL-RTN                                      01710010
              THRU S9000-FINAL-EXT                                      01720010
           .                                                            01730001
       S0000-MAIN-EXT.                                                  01750001
           EXIT.                                                        01760001
      *-----------------------------------------------------------------01770001
      *@  초기화                                                      01780001
      *-----------------------------------------------------------------01790001
       S1000-INITIALIZE-RTN.                                            01800001
                                                                        01810001
      *@   WK-AREA 및　프로그램파라미터　초기화                       01820001
           INITIALIZE WK-AREA                                           01830001
      *               SQLIO                                             01840005
                      YCDBSQLA-CA                                       01850005
      *               DBIO
                      YCDBIOCA-CA                                       01850014
                                                                        01930001
      *@  출력영역　및　결과코드　초기화                              01940001
           INITIALIZE XDJL4023-OUT                                      01950001
                      XDJL4023-RETURN                                   01960001
           .                                                            01970001
       S1000-INITIALIZE-EXT.                                            01990001
           EXIT.                                                        02000001
      *-----------------------------------------------------------------02010001
      *@  입력값검증                                                  02020001
      *-----------------------------------------------------------------02030001
       S2000-VALIDATION-RTN.                                            02040001
                                                                        02050009
           IF XDJL4023-I-PRCSS-DSTIC NOT = CO-CHA-01                    02051009
      * 에러메세지 : 처리구분오류입니다．                           02052009
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02053009
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              02054009
           END-IF                                                       02055009
                                                                        02090009
      *@   BIS기준년월                                                02091009
           IF XDJL4023-I-BASE-YM1 = SPACE                               02092009
      * 에러메세지 : 필수항목미입력오류입니다．                     02093009
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02094009
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02095009
           END-IF                                                       02096009
                                                                        02096109
      *@   동일인외화기준년월                                         02097009
           IF XDJL4023-I-BASE-YM2 = SPACE                               02098009
      * 에러메세지 : 필수항목미입력오류입니다．                     02099009
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02100009
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02110009
           END-IF                                                       02120009
           .                                                            02250001
       S2000-VALIDATION-EXT.                                            02270001
           EXIT.                                                        02280001
      *-----------------------------------------------------------------02290001
      *@  업무처리                                                    02300001
      *-----------------------------------------------------------------02310001
       S3000-PROCESS-RTN.                                               02320001
                                                                        02330010
      *@1  BIS자기자본정보　조회                                      02330110
           PERFORM S3100-QJL0231-CALL-RTN                               02331010
              THRU S3100-QJL0231-CALL-EXT                               02332010
                                                                        02333010
      *@2  동일인외화자기자본정보　조회                               02334010
           PERFORM S3200-QJL0231-CALL-RTN                               02335010
              THRU S3200-QJL0231-CALL-EXT                               02336010
                                                                        02337010
      *@3  신용등급별가중치　조회                                     02338011
           PERFORM S3300-QJL0232-CALL-RTN                               02339011
              THRU S3300-QJL0232-CALL-EXT                               02340011
                                                                        02350011
      *@4  한은업종가중치　조회                                       02360012
           PERFORM S3400-QJL0233-CALL-RTN                               02361012
              THRU S3400-QJL0233-CALL-EXT                               02362012
                                                                        02363012
      *@5  기준한도적용배수　조회                                     02364014
           PERFORM S3500-QJL0234-CALL-RTN                               02365014
              THRU S3500-QJL0234-CALL-EXT                               02366014

150226*@  장외파생상품 SUB한도 조회
           PERFORM S3600-RJL0063-CALL-RTN                               02365014
              THRU S3600-RJL0063-CALL-EXT                               02366014

211000*@   산업분류 적용비율 조회
           PERFORM S3700-QJL0235-CALL-RTN
              THRU S3700-QJL0235-CALL-EXT

211000*@   금융업종평균 자기자본비율 조회
           PERFORM S3700-QJL0236-CALL-RTN
              THRU S3700-QJL0236-CALL-EXT

           .                                                            02400001

       S3000-PROCESS-EXT.                                               02420001
           EXIT.                                                        02430001

      *-----------------------------------------------------------------02431010
      *@  BIS자기자본정보　조회                                       02432010
      *-----------------------------------------------------------------02433010
       S3100-QJL0231-CALL-RTN.                                          02434010
                                                                        02435010
      *@1.1 변수초기화                                                02436010
           INITIALIZE XQJL0231-IN                                       02437010
      *@1.2 호출변수 MOVE                                             02438010
      *@   그룹회사코드                                               02439010
           MOVE BICOM-GROUP-CO-CD                                       02439110
             TO XQJL0231-I-GROUP-CO-CD                                  02439210
      *@   기준년월                                                   02439310
           MOVE XDJL4023-I-BASE-YM1                                     02439410
             TO XQJL0231-I-BASE-YM                                      02439510
      *@   자기자본구분                                               02439610
           MOVE CO-CHA-1                                                02439710
             TO XQJL0231-I-ONCP-DSTCD                                   02439811
      *@1.3 프로그램 호출                                           02439910
           #DYSQLA QJL0231 XQJL0231-CA                                  02440010
      *@1.4 호출결과확인                                              02440110
           IF COND-DBSQL-OK                                             02440210
      *@      BIS자기자본                                             02440310
              MOVE XQJL0231-O-ONCP-BSAMT                                02440410
                TO XDJL4023-O-BIS-BASE-ONCP                             02440510
      *@      BIS기준년월                                             02440610
              MOVE XQJL0231-O-BASE-YM                                   02440710
                TO XDJL4023-O-BASE-YM1                                  02440810
           ELSE                                                         02440910
      *@      BIS자기자본                                             02441010
              MOVE ZEROS                                                02441110
                TO XDJL4023-O-BIS-BASE-ONCP                             02441210
      *@      BIS기준년월                                             02441310
              MOVE SPACE                                                02441410
                TO XDJL4023-O-BASE-YM1                                  02441510
           END-IF                                                       02441710
           .                                                            02441810
       S3100-QJL0231-CALL-EXT.                                          02441910
           EXIT.                                                        02442010
      *-----------------------------------------------------------------02442110
      *@  동일인외화자기자본정보　조회                                02442210
      *-----------------------------------------------------------------02442310
       S3200-QJL0231-CALL-RTN.                                          02442410
                                                                        02442510
      *@2.1 변수초기화                                                02442610
           INITIALIZE XQJL0231-IN                                       02442710
      *@2.2 호출변수 MOVE                                             02442810
      *@   그룹회사코드                                               02442910
           MOVE BICOM-GROUP-CO-CD                                       02443010
             TO XQJL0231-I-GROUP-CO-CD                                  02443110
      *@   기준년월                                                   02443210
           MOVE XDJL4023-I-BASE-YM2                                     02443310
             TO XQJL0231-I-BASE-YM                                      02443410
      *@   자기자본구분                                               02443510
           MOVE CO-CHA-2                                                02443610
             TO XQJL0231-I-ONCP-DSTCD                                   02443711
      *@2.3 프로그램 호출                                           02443810
           #DYSQLA QJL0231 XQJL0231-CA                                  02443910
      *@2.4 호출결과확인                                              02444010
           IF COND-DBSQL-OK                                             02444110
      *@      동일인외화자기자본정보                                  02444210
              MOVE XQJL0231-O-ONCP-BSAMT                                02444310
                TO XDJL4023-O-SMPSN-FC-ONCP                             02444410
      *@      동일인외화기준년월                                      02444510
              MOVE XQJL0231-O-BASE-YM                                   02444610
                TO XDJL4023-O-BASE-YM2                                  02444710
           ELSE                                                         02444810
      *@      BIS자기자본                                             02444910
              MOVE ZEROS                                                02445010
                TO XDJL4023-O-SMPSN-FC-ONCP                             02445110
      *@      BIS기준년월                                             02445210
              MOVE SPACE                                                02445310
                TO XDJL4023-O-BASE-YM2                                  02445410
           END-IF                                                       02445510
           .                                                            02445610
       S3200-QJL0231-CALL-EXT.                                          02445710
           EXIT.                                                        02445810
      *-----------------------------------------------------------------02445911
      *@ 신용등급별가중치　조회                                       02446011
      *-----------------------------------------------------------------02447011
       S3300-QJL0232-CALL-RTN.                                          02448011
                                                                        02449011
      *@3.1 변수초기화                                                02450011
           INITIALIZE XQJL0232-IN                                       02460011
                                                                        02470011
      *@3.2 변수 MOVE                                                 02480011
      *@   그룹회사코드                                               02490011
           MOVE BICOM-GROUP-CO-CD                                       02500011
             TO XQJL0232-I-GROUP-CO-CD                                  02510011
      *@   기준년월                                                   02520011
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                02530011
             TO XQJL0232-I-BASE-YM                                      02540011
                                                                        02580011
      *@3.3 프로그램　호출                                            02590011
           #DYSQLA QJL0232 XQJL0232-CA                                  02600011
                                                                        02610011
      *@3.4 호출결과　확인                                            02620011
           EVALUATE TRUE                                                02630011
               WHEN COND-DBSQL-OK                                       02640011
               WHEN COND-DBSQL-MRNF
                    CONTINUE                                            02650011
               WHEN OTHER                                               02670011
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02680011
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02690011
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02700011
           END-EVALUATE                                                 02710011
                                                                        02720011
      *@3.5 출력변수 MOVE                                             02730011
                                                                        02735011
           PERFORM VARYING WK-I FROM 1 BY 1                             02736011
             UNTIL WK-I > DBSQL-SELECT-CNT                              02737011
                                                                        02737111
      *@           한도기업구분별　분기작업                           02737211
                   EVALUATE XQJL0232-O-LIMT-CORP-DSTCD(WK-I)            02737311
      *@               개별기업（기타）                               02737411
                       WHEN CO-CHA-1                                    02737511
                            ADD 1 TO WK-1                               02737611
      *@                    신용등급                                  02737711
                            MOVE XQJL0232-O-INTNL-CV-GRD-DSTCD(WK-I)    02737811
                              TO XDJL4023-O-INTNL-CV-GRD-DSTCD1(WK-1)   02737911
      *@                    지원비율                                  02738011
                            MOVE XQJL0232-O-SPORT-RATO(WK-I)            02738111
                              TO XDJL4023-O-SPORT-RATO1(WK-1)           02738211
      *@                    상환예상비율                              02738311
                            MOVE XQJL0232-O-RPAY-ANTICI-RATO(WK-I)      02738411
                              TO XDJL4023-O-RPAY-ANTICI-RATO1(WK-1)     02738511
      *@               그룹                                           02738611
                       WHEN CO-CHA-2                                    02738711
                            ADD 1 TO WK-2                               02738811
      *@                    신용등급                                  02738911
                            MOVE XQJL0232-O-INTNL-CV-GRD-DSTCD(WK-I)    02739011
                              TO XDJL4023-O-INTNL-CV-GRD-DSTCD2(WK-2)   02739111
      *@                    지원비율                                  02739211
                            MOVE XQJL0232-O-SPORT-RATO(WK-I)            02739311
                              TO XDJL4023-O-SPORT-RATO2(WK-2)           02739411
      *@                    상환예상비율                              02739511
                            MOVE XQJL0232-O-RPAY-ANTICI-RATO(WK-I)      02739611
                              TO XDJL4023-O-RPAY-ANTICI-RATO2(WK-2)     02739711
      *@               개별기업（건설업）                             02739811
                       WHEN CO-CHA-3                                    02739911
                            ADD 1 TO WK-3                               02740011
      *@                    신용등급                                  02740111
                            MOVE XQJL0232-O-INTNL-CV-GRD-DSTCD(WK-I)    02740211
                              TO XDJL4023-O-INTNL-CV-GRD-DSTCD3(WK-3)   02740311
      *@                    지원비율                                  02740411
                            MOVE XQJL0232-O-SPORT-RATO(WK-I)            02740511
                              TO XDJL4023-O-SPORT-RATO3(WK-3)           02740611
      *@                    상환예상비율                              02740711
                            MOVE XQJL0232-O-RPAY-ANTICI-RATO(WK-I)      02740811
                              TO XDJL4023-O-RPAY-ANTICI-RATO3(WK-3)     02740911
      *@               개별기업（조선업）                             02741011
                       WHEN CO-CHA-4                                    02741111
                            ADD 1 TO WK-4                               02741211
      *@                    신용등급                                  02741311
                            MOVE XQJL0232-O-INTNL-CV-GRD-DSTCD(WK-I)    02741411
                              TO XDJL4023-O-INTNL-CV-GRD-DSTCD4(WK-4)   02741511
      *@                    지원비율                                  02741611
                            MOVE XQJL0232-O-SPORT-RATO(WK-I)            02741711
                              TO XDJL4023-O-SPORT-RATO4(WK-4)           02741811
      *@                    상환예상비율                              02741911
                            MOVE XQJL0232-O-RPAY-ANTICI-RATO(WK-I)      02742011
                              TO XDJL4023-O-RPAY-ANTICI-RATO4(WK-4)     02742111
140718*@               포괄신용등급계산용 지원비율                  02741011
                       WHEN CO-CHA-5
                            ADD 1
                             TO WK-5
      *@                    신용등급                                  02741311
                            MOVE XQJL0232-O-INTNL-CV-GRD-DSTCD(WK-I)    02741411
                              TO XDJL4023-O-INTNL-CV-GRD-DSTCD5(WK-5)   02741511
      *@                    지원비율                                  02741611
                            MOVE XQJL0232-O-SPORT-RATO(WK-I)            02741711
                              TO XDJL4023-O-SPORT-RATO5(WK-5)           02741811
                       WHEN OTHER                                       02742211
                            CONTINUE                                    02742311
                   END-EVALUATE                                         02742411
                                                                        02743011
           END-PERFORM                                                  02745811
                                                                        02745911
      *@   출력건수                                                   02746011
           MOVE WK-1                                                    02746111
             TO XDJL4023-O-OUTPT-LINE-CNT1                              02746211
           MOVE WK-2                                                    02746311
             TO XDJL4023-O-OUTPT-LINE-CNT2                              02746411
           MOVE WK-3                                                    02746511
             TO XDJL4023-O-OUTPT-LINE-CNT3                              02746611
           MOVE WK-4                                                    02746711
             TO XDJL4023-O-OUTPT-LINE-CNT4                              02746811
140718     MOVE WK-5                                                    02746711
             TO XDJL4023-O-OUTPT-LINE-CNT5
           .                                                            02746911

       S3300-QJL0232-CALL-EXT.                                          02747011
           EXIT.                                                        02747111

      *-----------------------------------------------------------------02747212
      *@ 한은업종가중치　조회                                         02747312
      *-----------------------------------------------------------------02747412
       S3400-QJL0233-CALL-RTN.                                          02747512
                                                                        02747612
      *@4.1 변수초기화                                                02747712
           INITIALIZE XQJL0233-IN                                       02747812
                                                                        02747912
      *@4.2 변수 MOVE                                                 02748012
      *@   그룹회사코드                                               02749012
           MOVE BICOM-GROUP-CO-CD                                       02750012
             TO XQJL0233-I-GROUP-CO-CD                                  02760012
      *@   기준년월                                                   02770012
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                02780012
             TO XQJL0233-I-BASE-YM                                      02790012
                                                                        02830012
      *@4.3 프로그램　호출                                            02840012
           #DYSQLA QJL0233 XQJL0233-CA                                  02850012
                                                                        02860012
      *@4.4 호출결과　확인                                            02870012
           EVALUATE TRUE                                                02880012
               WHEN COND-DBSQL-OK                                       02890012
               WHEN COND-DBSQL-MRNF                                     02900012
                    CONTINUE                                            02910012
               WHEN OTHER                                               02920012
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02930012
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02940012
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02950012
           END-EVALUATE                                                 02960012
                                                                        02970012
      *@4.5 출력변수 MOVE                                             02980012
                                                                        02990012
      *@   출력건수                                                   03000012
           MOVE DBSQL-SELECT-CNT                                        03010012
             TO XDJL4023-O-OUTPT-LINE-CNT6                              03020012
                                                                        03030012
           PERFORM VARYING WK-I FROM 1 BY 1                             03040012
             UNTIL WK-I > XDJL4023-O-OUTPT-LINE-CNT6                    03050012
      *@           기준년월                                           03060012
                   MOVE XQJL0233-O-BASE-YM(WK-I)                        03070012
                     TO XDJL4023-O-BASE-YM6(WK-I)                       03080012
      *@           한은매칭코드                                       03090012
                   MOVE XQJL0233-O-BOK-MTCN-CD(WK-I)                    03100012
                     TO XDJL4023-O-BOK-MTCN-CD6(WK-I)                   03110012
      *@           한은매칭명                                         03120012
                   MOVE XQJL0233-O-BOK-MTCN-NAME(WK-I)                  03130012
                     TO XDJL4023-O-BOK-MTCN-NAME6(WK-I)                 03140012
      *@           업종가중평균율                                     03150012
                   MOVE XQJL0233-O-BZTYP-WGHTG-AVG-RT(WK-I)             03160012
                     TO XDJL4023-O-BZTYP-WGHTG-AVG-RT6(WK-I)            03170012
      *@           차입금매출액비율                                   03180012
                   MOVE XQJL0233-O-AMBR-SALEPR-RATO(WK-I)               03190012
                     TO XDJL4023-O-AMBR-SALEPR-RATO6(WK-I)              03200012
      *@           차입금자기자본율                                   03210012
                   MOVE XQJL0233-O-AMBR-ONCP-RT(WK-I)                   03220012
                     TO XDJL4023-O-AMBR-ONCP-RT6(WK-I)                  03230012
      *@           차입금총자산비율                                   03240012
                   MOVE XQJL0233-O-AMBR-T-ASST-RATO(WK-I)               03250012
                     TO XDJL4023-O-AMBR-T-ASST-RATO6(WK-I)              03260012
           END-PERFORM                                                  03750012
           .                                                            03760012
       S3400-QJL0233-CALL-EXT.                                          03770012
           EXIT.                                                        03780012
      *-----------------------------------------------------------------03790014
      *@  기준한도적용배수　조회                                      03800014
      *-----------------------------------------------------------------03810014
       S3500-QJL0234-CALL-RTN.                                          03820014
                                                                        03830014
      *@5.1 변수초기화                                                03840014
           INITIALIZE XQJL0234-IN                                       03850014
      *@5.2 호출변수 MOVE                                             03860014
      *@   그룹회사코드                                               03870014
           MOVE BICOM-GROUP-CO-CD                                       03880014
             TO XQJL0234-I-GROUP-CO-CD                                  03890014
      *@5.3 프로그램 호출                                           03960014
           #DYSQLA QJL0234 XQJL0234-CA                                  03970014
      *@5.4 호출결과확인                                              03980016
           EVALUATE TRUE                                                03981016
               WHEN COND-DBSQL-OK                                       03982016
      *@            건설업적용배수                                    03982116
                    MOVE XQJL0234-O-MLPL-RT-BULID                       03982216
                      TO XDJL4023-O-CNST-A-USAG-MLPL                    03982316
      *@            조선업적용배수                                    03982416
                    MOVE XQJL0234-O-MLPL-RT-SHIP                        03982516
                      TO XDJL4023-O-CREW-AA-USAG-MLPL                   03982616
      *@            렌탈업적용배수                                    03982416
                    MOVE XQJL0234-O-RENTL-O-APLY-MLPL                   03982516
                      TO XDJL4023-O-RENTL-O-APLY-MLPL                   03982616
               WHEN COND-DBSQL-MRNF                                     03982016
      *@            건설업적용배수                                    03982116
                    MOVE ZERO                                           03982216
                      TO XDJL4023-O-CNST-A-USAG-MLPL                    03982316
      *@            조선업적용배수                                    03982416
                    MOVE ZERO                                           03982516
                      TO XDJL4023-O-CREW-AA-USAG-MLPL                   03982616
      *@            렌탈업적용배수                                    03982416
                    MOVE ZERO                                           03982516
                      TO XDJL4023-O-RENTL-O-APLY-MLPL                   03982616
               WHEN OTHER                                               03985016
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03986016
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03987016
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03988016
           END-EVALUATE                                                 03989016
           .                                                            04140014
       S3500-QJL0234-CALL-EXT.                                          04150014
           EXIT.                                                        04160014

      *-----------------------------------------------------------------03790014
150226*@  장외파생상품 SUB한도 조회
      *-----------------------------------------------------------------03810014
       S3600-RJL0063-CALL-RTN.                                          03820014
                                                                        03830014
      *@1.1.1 변수초기화                                              025410
           INITIALIZE TKJL0063-KEY                                      02541109
                      TRJL0063-REC                                      02541209

      *@1.1.2 변수 MOVE                                               025413
      *@  그룹회사코드                                                025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0063-PK-GROUP-CO-CD                                  02541609
      *@  기준년월                                                    025417
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO KJL0063-PK-BASE-YM                                      02541909
210408*@   SUB한도구분(3:장외파생상품)
           MOVE '3'                                                     02545009
             TO KJL0063-PK-SUB-LIMT-DSTCD

      *@1.1.3 프로그램　호출                                          025423
           #DYDBIO SELECT-CMD-Y TKJL0063-PK TRJL0063-REC                02542409

      *@1.1.4 호출결과확인                                            025425
           EVALUATE TRUE                                                02542609
           WHEN COND-DBIO-OK                                            02542709
      *        SUB한도금액
               COMPUTE XDJL4023-O-SUB-CLAM =
                       RJL0063-SUB-CLAM / 1000000
           WHEN COND-DBIO-MRNF
               MOVE ZERO
                 TO XDJL4023-O-SUB-CLAM
           WHEN OTHER                                                   02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   0254
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               0254
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709
           .                                                            02543809

       S3600-RJL0063-CALL-EXT.                                          04150014
           EXIT.                                                        04160014

      *-----------------------------------------------------------------
211000*@ 산업분류 적용비율 조회
      *-----------------------------------------------------------------
       S3700-QJL0235-CALL-RTN.

      *@   변수초기화
           INITIALIZE                  XQJL0235-IN

      *@    변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL0235-I-GROUP-CO-CD
      *    기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL0235-I-BASE-YM

      *@   한도신청번호 - NEXT KEY
      *@   자동거래일경우 NEXT KEY 처리한다
           IF BICOM-DSCN-TRAN-DSTCD = CO-CHA-1 OR CO-CHA-2

           #USRLOG  "=================================================="
           #USRLOG  "*                 NEXT    KEY                    *"
           #USRLOG  "=================================================="

              MOVE BOCOM-BF-TDK-INFO-CTNT
                TO WK-BF-KEY
              MOVE WK-BF-TE-IDSTRY-CLSFI-CD
                TO XQJL0235-I-TE-IDSTRY-CLSFI-CD

           #USRLOG  " TE-IDSTRY-CLSFI-CD : "
           XQJL0235-I-TE-IDSTRY-CLSFI-CD
           #USRLOG  "=================================================="
           END-IF

      *@1.3 프로그램　호출
           #DYSQLA QJL0235 XQJL0235-CA

      *@1.4 호출결과　확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러일경우
      *@에러메세지 : 테이블SELECT오류입니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@1.5 출력변수 MOVE
           IF DBSQL-SELECT-CNT         > CO-MAX-CNT
              MOVE CO-MAX-CNT
                TO XDJL4023-O-OUTPT-LINE-CNT7
           ELSE
              MOVE DBSQL-SELECT-CNT
                TO XDJL4023-O-OUTPT-LINE-CNT7
           END-IF

           PERFORM VARYING WK-J FROM 1 BY 1
             UNTIL WK-J > XDJL4023-O-OUTPT-LINE-CNT7

      *--         기준년월
                   MOVE  XQJL0235-O-BASE-YM (WK-J)
                     TO  XDJL4023-O-BASE-YM7 (WK-J)
      *--         TE산업분류코드
                   MOVE  XQJL0235-O-TE-IDSTRY-CLSFI-CD (WK-J)
                     TO  XDJL4023-O-TE-IDSTRY-CLSFI-CD (WK-J)
      *--         TE산업분류코드명
                   MOVE  XQJL0235-O-TE-I-CLSFI-CD-NAME (WK-J)
                     TO  XDJL4023-O-TE-I-CLSFI-CD-NAME (WK-J)
      *--         TE자기자본비율
                   MOVE  XQJL0235-O-TE-ONCP-RATO (WK-J)
                     TO  XDJL4023-O-TE-ONCP-RATO (WK-J)
      *--         TE매출액비율
                   MOVE  XQJL0235-O-TE-SALEPR-RATO (WK-J)
                     TO  XDJL4023-O-TE-SALEPR-RATO (WK-J)
      *--         TE총자산비율
                   MOVE  XQJL0235-O-TE-TOTAL-ASST-RATO (WK-J)
                     TO  XDJL4023-O-TE-TOTAL-ASST-RATO (WK-J)

           END-PERFORM

           #USRLOG  "=================================================="
           #USRLOG  " DBSQL-SELECT-CNT : " DBSQL-SELECT-CNT
           #USRLOG  "=================================================="

           IF DBSQL-SELECT-CNT         > CO-NUM-100

           #USRLOG  " XQJL0235-O-TE-IDSTRY-CLSFI-CD(100) : "
                      XQJL0235-O-TE-IDSTRY-CLSFI-CD(100)

              MOVE XQJL0235-O-TE-IDSTRY-CLSFI-CD(100)
                TO WK-AF-TE-IDSTRY-CLSFI-CD

              #DSCNTR 2 WK-AF-KEY
           END-IF

           .
       S3700-QJL0235-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
211000*@ 금융업종평균 자기자본비율 조회
      *-----------------------------------------------------------------
       S3700-QJL0236-CALL-RTN.

      *@   변수초기화
           INITIALIZE                  XQJL0236-IN

      *@    변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL0236-I-GROUP-CO-CD
      *    기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL0236-I-BASE-YM

      *@1.3 프로그램　호출
           #DYSQLA QJL0236 XQJL0236-CA

      *@1.4 호출결과　확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러일경우
      *@에러메세지 : 테이블SELECT오류입니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@1.5 출력변수 MOVE
           IF DBSQL-SELECT-CNT         > CO-MAX-CNT
              MOVE CO-MAX-CNT
                TO XDJL4023-O-OUTPT-LINE-CNT8
           ELSE
              MOVE DBSQL-SELECT-CNT
                TO XDJL4023-O-OUTPT-LINE-CNT8
           END-IF

           PERFORM VARYING WK-K FROM 1 BY 1
             UNTIL WK-K > XDJL4023-O-OUTPT-LINE-CNT8

      *            기준년월
                   MOVE  XQJL0236-O-BASE-YM(WK-K)
                     TO  XDJL4023-O-BASE-YM8(WK-K)
      *            한신평재무업종구분
                   MOVE  XQJL0236-O-KIS-F-BZTYP-DSTCD(WK-K)
                     TO  XDJL4023-O-KIS-FZ-BZTYP-DSTIC(WK-K)
      *            금융자기자본비율
                   MOVE  XQJL0236-O-FINAC-ONCP-RATO(WK-K)
                     TO  XDJL4023-O-FINAC-ONCP-RATO(WK-K)
      *            등록직원번호
                   MOVE  XQJL0236-O-REGI-EMPID(WK-K)
                     TO  XDJL4023-O-REGI-EMPID(WK-K)
      *            등록년월일
                   MOVE  XQJL0236-O-REGI-YMD(WK-K)
                     TO  XDJL4023-O-REGI-YMD(WK-K)

           END-PERFORM

           .
       S3700-QJL0236-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------05490001
      *@  처리종료                                                    05500001
      *-----------------------------------------------------------------05510001
       S9000-FINAL-RTN.                                                 05520001
      *@   정상종료                                                   05530001
           #OKEXIT  CO-STAT-OK                                          05540001
           .                                                            05550001
       S9000-FINAL-EXT.                                                 05570001
           EXIT.                                                        05580001
