      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: DJL4021 (DC표준산업코드정보원장)                00030001
      *@처리유형  : DC                                                00040001
      *@처리개요  : 표준산업코드를 등록, 수정, 삭제 처리하  00050001
      *@            : 는 프로그램이다                               00060001
      *@구현방법  : OPEN-FETCH-CLOSE
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20081216: 신규작성                                    00120001
      *김진태:20090702: 프로그램수정                                00120001
      *김진태:20091130: 에러메세지정비                              00120001
      *김진태:20091130: ARRAY 축소 3000 => 2000                     00120001
      * YBH    :20171117: 표준산업코드LIKE 처리
      *최주원:20211005:항목추가 TE산업분류코드
      *=================================================================00130001
      ******************************************************************00140001
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형 00160001
      **  ----------------   -------------------------------------------00170001
      **  표준산업코드   : THKJL0044                     : XRXX       00180001
      ******************************************************************00200001
       IDENTIFICATION                  DIVISION.                        00210001
      *=================================================================00220001
       PROGRAM-ID.                     DJL4021.                         00230001
       AUTHOR.                         이동구.                        00240001
       DATE-WRITTEN.                   08/12/16.                        00250001
                                                                        00260001
      *=================================================================00270001
       ENVIRONMENT                     DIVISION.                        00280001
      *=================================================================00290001
       CONFIGURATION                   SECTION.                         00300001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00320001
       DATA                            DIVISION.                        00330001
      *=================================================================00340001
       WORKING-STORAGE                 SECTION.                         00350001
                                                                        00360001
      *-----------------------------------------------------------------00370001
      *CONSTANT ERROR AREA                                              00380001
      *-----------------------------------------------------------------00390001
       01  CO-ERROR-AREA.                                               00400001
      *에러메시지정의                                                 00410015
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00420015
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00430015
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200220             PIC  X(008) VALUE 'B4200220'.
           03  CO-B4200231             PIC  X(008) VALUE 'B4200231'.
      *조치메시지정의                                                 00450015
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00460015
      *-----------------------------------------------------------------00490001
      * CONSTANT AREA                                                   00500001
      *-----------------------------------------------------------------00510001
       01  CO-AREA.                                                     00520001
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4021'.     00530001
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00540001
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00550001
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00560001
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00570001
                                                                        00580001
           03  CO-MAX-CNT              PIC  9(005) VALUE 2000.          00590002

           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00740001
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00750001

           03  CO-CHA-01               PIC  X(002) VALUE '01'.

           03  CO-CHA-Y                PIC  X(001) VALUE '1'.
           03  CO-CHA-N                PIC  X(001) VALUE '0'.
           03  CO-NUM-5                PIC  9(001) VALUE  5.
      *-----------------------------------------------------------------00620001
      * WORKING AREA                                                    00630001
      *-----------------------------------------------------------------00640001
       01  WK-AREA.                                                     00650001
           03  WK-I                    PIC  9(004) COMP.                00660001
           03  WK-BIT                  PIC  X(001).                     00670001
           03  WK-CUR-CNT              PIC  9(005) COMP.                00680015
           03  WK-LEN                  PIC  9(003).
      *-----------------------------------------------------------------00690001
      * PGM INTERFACE PARAMETER                                         00700001
      *-----------------------------------------------------------------00710001
      * SQLIO COPYBOOK
       01  XQJL0211-CA.                                                 00720001
           COPY  XQJL0211.                                              00730001
      *-----------------------------------------------------------------00780001
      * DBIO SQLIO INTERFACE PARAMETER                                  00790001
      *-----------------------------------------------------------------00800001
      * SQLIO
           COPY  YCDBSQLA.                                              00820001
      *-----------------------------------------------------------------00840001
       LINKAGE                         SECTION.                         00850001
      *-----------------------------------------------------------------00860001
      * COMMON COPYBOOK
       01  YCCOMMON-CA.                                                 00870001
           COPY  YCCOMMON.                                              00880001
                                                                        00890001
      * DC COPYBOOK
       01 XDJL4021-CA.                                                  00900001
           COPY  XDJL4021.                                              00910001
      *=================================================================00930001
       PROCEDURE                       DIVISION                         00940001
                                       USING       YCCOMMON-CA          00950001
                                                   XDJL4021-CA          00960001
                                                   .                    00970001
      *=================================================================00980001
                                                                        00990001
      *-----------------------------------------------------------------01000001
      *@  처리메인                                                    01010001
      *-----------------------------------------------------------------01020001
       S0000-MAIN-RTN.                                                  01030001
                                                                        01040001
      *@  초기화                                                      01050001
           PERFORM S1000-INITIALIZE-RTN                                 01060001
              THRU S1000-INITIALIZE-EXT                                 01070001
                                                                        01080001
      *@  입력값　CHECK                                               01090001
           PERFORM S2000-VALIDATION-RTN                                 01100015
              THRU S2000-VALIDATION-EXT                                 01110015
                                                                        01120001
      *@  업무처리                                                    01130001
           PERFORM S3000-PROCESS-RTN                                    01140015
              THRU S3000-PROCESS-EXT                                    01150015
                                                                        01160001
      *@  출력처리                                                    01170001
           PERFORM S6000-OUTPUT-SET-RTN                                 01180015
              THRU S6000-OUTPUT-SET-EXT                                 01190015
                                                                        01200001
      *@  처리종료                                                    01210001
           PERFORM S9000-FINAL-RTN                                      01220015
              THRU S9000-FINAL-EXT                                      01230015
           .                                                            01240001
       S0000-MAIN-EXT.                                                  01260001
           EXIT.                                                        01270001
      *-----------------------------------------------------------------01280001
      *@  초기화                                                      01290001
      *-----------------------------------------------------------------01300001
       S1000-INITIALIZE-RTN.                                            01310001
      *@   WK-AREA 및　프로그램파라미터　초기화                       01320001
           INITIALIZE WK-AREA                                           01330001
      *               SQLIO
                      YCDBSQLA-CA                                       01350006
                                                                        01380001
      *@  출력영역　및　결과코드　초기화                              01390001
           INITIALIZE XDJL4021-OUT                                      01400001
                      XDJL4021-RETURN                                   01410001
           .                                                            01420001
       S1000-INITIALIZE-EXT.                                            01440001
           EXIT.                                                        01450001
      *-----------------------------------------------------------------01460001
      *@  입력값검증                                                  01470001
      *-----------------------------------------------------------------01480001
       S2000-VALIDATION-RTN.                                            01490001
                                                                        01500001
      *@   1 DC필수입력파라미터 검증
      *@   1.1 처리구분코드체크
      *@   실행조건 : 입력.처리구분코드=01
      *@   처리내용 : 에러처리
           IF XDJL4021-I-PRCSS-DSTIC NOT = CO-CHA-01
      *@에러메세지 : 처리구분오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@   1 DC필수입력파라미터 검증
      *@   1.2 기준년월체크
      *@   실행조건 : 입력.기준년월=SPACE
      *@   처리내용 : 에러처리
           IF XDJL4021-I-BASE-YM = SPACE
      *@에러메세지 : 필수항목미입력오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .                                                            01580001
       S2000-VALIDATION-EXT.                                            01600001
           EXIT.                                                        01610001
      *-----------------------------------------------------------------01620001
      *@  업무처리                                                    01630001
      *-----------------------------------------------------------------01640001
       S3000-PROCESS-RTN.                                               01650001

      *@1  표준산업분류코드조회                                       01660016
           PERFORM S3100-QJL0211-CALL-RTN                               01670001
              THRU S3100-QJL0211-CALL-EXT                               01680001
           .                                                            01730001
       S3000-PROCESS-EXT.                                               01750001
           EXIT.                                                        01760001
      *-----------------------------------------------------------------01850001
      *@ 표준산업분류코드조회                                         01860001
      *-----------------------------------------------------------------01870001
       S3100-QJL0211-CALL-RTN.                                          01880001
                                                                        01890001
      *@   SQLIO OPEN
           PERFORM S3110-QJL0211-OPEN-RTN                               04300022
              THRU S3110-QJL0211-OPEN-EXT                               04310022
                                                                        04320022
           MOVE CO-CHA-Y                                                04330022
             TO WK-BIT                                                  04340022
                                                                        04350022
      *@   SQLIO FETCH
           PERFORM UNTIL WK-BIT     = CO-CHA-N OR                       04360022
                         WK-CUR-CNT = CO-MAX-CNT                        04370022
      *@      SQLIO FETCH CALL
              PERFORM S3120-QJL0211-FETCH-RTN                           04380022
                 THRU S3120-QJL0211-FETCH-EXT                           04390022
           END-PERFORM                                                  04400022
                                                                        04410022
      *@   SQLIO CLOSE
           PERFORM S3130-QJL0211-CLOSE-RTN                              04420022
              THRU S3130-QJL0211-CLOSE-EXT                              04430022
                                                                        04440022
           MOVE WK-CUR-CNT                                              04450022
             TO XDJL4021-O-OUTPT-LINE-CNT1                              04460022
           .                                                            01940001
       S3100-QJL0211-CALL-EXT.                                          01960001
           EXIT.                                                        01970001
      *-----------------------------------------------------------------04500022
      *@  SQLIO QJL0211 OPEN                                            04510022
      *-----------------------------------------------------------------04520022
       S3110-QJL0211-OPEN-RTN.                                          04530022
                                                                        04540022
      *@   변수초기화
           INITIALIZE XQJL0211-IN

      *@    변수 MOVE
      *@   그룹회사코드                                               01860024
           MOVE BICOM-GROUP-CO-CD                                       01870024
             TO XQJL0211-I-GROUP-CO-CD                                  01880024
      *@   기준년월                                                   01940024
           MOVE XDJL4021-I-BASE-YM                                      01950024
             TO XQJL0211-I-BASE-YM                                      01960024

171117*@   유효문자뒤의　공백을　카운트한다
           INSPECT FUNCTION REVERSE(XDJL4021-I-NEW-SI-CLSFI-CD)
           TALLYING WK-LEN FOR LEADING SPACE

      *@   유효문자뒤의　모든　공백을　％로　채움
           IF WK-LEN NOT = ZERO
               MOVE ALL '%'
                 TO XDJL4021-I-NEW-SI-CLSFI-CD(CO-NUM-5 - WK-LEN + 1 :
                                               WK-LEN)
           END-IF

      *@   표준산업분류코드
           MOVE XDJL4021-I-NEW-SI-CLSFI-CD
             TO XQJL0211-I-NEW-SI-CLSFI-CD

      *@   SQLIO CALL
           #DYSQLA QJL0211 OPEN XQJL0211-CA                             04680022
                                                                        04690022
      *@   호출결과확인
           EVALUATE TRUE                                                04700022
               WHEN COND-DBSQL-OK                                       04710022
                    CONTINUE                                            04720022
               WHEN OTHER                                               04730022
      *@원장오픈에러일경우
      *@에러메세지 : 테이블 OPEN 오류입니다．                     04740022
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              04750022
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        04760022
           END-EVALUATE                                                 04770022
           .                                                            04780022
       S3110-QJL0211-OPEN-EXT.                                          04790022
           EXIT.                                                        04800022
      *-----------------------------------------------------------------04810022
      *@  SQLIO QJL0211 FETCH                                           04820022
      *-----------------------------------------------------------------04830022
       S3120-QJL0211-FETCH-RTN.                                         04840022
                                                                        04850022
      *@   SQLIO FETCH                                                  04860022
           #DYSQLA QJL0211 FETCH XQJL0211-CA                            04870022
      *@   결과확인                                                   04880022
           EVALUATE TRUE                                                04890022
               WHEN COND-DBSQL-OK                                       04900022
      *@            OUTPUT ROUTINE CALL
                    PERFORM S6000-OUTPUT-SET-RTN                        04910022
                       THRU S6000-OUTPUT-SET-EXT                        04920022
               WHEN COND-DBSQL-MRNF                                     04930022
                    MOVE CO-CHA-N TO WK-BIT                             04940022
               WHEN OTHER                                               04950022
      *@원장패치에러일경우
      *@에러메세지 : 테이블 FETCH 오류입니다．                    04960022
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              04970022
                    #ERROR CO-B4200220 CO-UKJL0036 CO-STAT-ERROR        04980022
           END-EVALUATE                                                 04990022
           .                                                            05000022
       S3120-QJL0211-FETCH-EXT.                                         05010022
           EXIT.                                                        05020022
      *-----------------------------------------------------------------05030022
      *@  SQLIO QJL0211 CLOSE                                           05040022
      *-----------------------------------------------------------------05050022
       S3130-QJL0211-CLOSE-RTN.                                         05060022
                                                                        05070022
      *@   SQLIO CLOSE                                                  05080022
           #DYSQLA QJL0211 CLOSE XQJL0211-CA                            05090022
      *@   결과확인                                                   05100022
           EVALUATE TRUE                                                05110022
               WHEN COND-DBSQL-OK                                       05120022
                    CONTINUE                                            05130022
               WHEN OTHER                                               05140022
      *@원장클로즈에러일경우
      *@에러메세지 : 테이블 CLOSE 오류입니다．                    05150022
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05160022
                    #ERROR CO-B4200231 CO-UKJL0036 CO-STAT-ERROR        05170022
           END-EVALUATE                                                 05180022
           .                                                            05190022
       S3130-QJL0211-CLOSE-EXT.                                         05200022
           EXIT.                                                        05210022
      *-----------------------------------------------------------------07750022
      *@ 표준산업코드　출력　조립                                     07760022
      *-----------------------------------------------------------------07770022
       S6000-OUTPUT-SET-RTN.                                            07780022
                                                                        07790022
      *@   OUTPUT 출력
           PERFORM VARYING WK-I FROM 1 BY 1                             07800022
                   UNTIL WK-I > DBSQL-SELECT-CNT                        07810022
                                                                        07820022
               ADD 1 TO WK-CUR-CNT                                      07830022
                                                                        07840022
               MOVE  XQJL0211-O-NEW-SI-CLSFI-CD            (WK-I)
                 TO  XDJL4021-O-NEW-SI-CLSFI-CD            (WK-CUR-CNT)
               MOVE  XQJL0211-O-STND-IDSTRY-CD-NAME        (WK-I)
                 TO  XDJL4021-O-STND-IDSTRY-CD-NAME        (WK-CUR-CNT)
               MOVE  XQJL0211-O-TE-PEER-DSTCD              (WK-I)
                 TO  XDJL4021-O-PEER-DSTCD                 (WK-CUR-CNT)
               MOVE  XQJL0211-O-PEER-CD-NAME               (WK-I)
                 TO  XDJL4021-O-PEER-CD-NAME               (WK-CUR-CNT)
               MOVE  XQJL0211-O-LAG-CLSFI-BZTYP-CD         (WK-I)
                 TO  XDJL4021-O-LAG-CLSFI-BZTYP-CD         (WK-CUR-CNT)
               MOVE  XQJL0211-O-LAG-C-BZTYP-CD-NAME        (WK-I)
                 TO  XDJL4021-O-LAG-C-BZTYP-CD-NAME        (WK-CUR-CNT)
               MOVE  XQJL0211-O-IDSTRY-V-GRD-DSTCD         (WK-I)
                 TO  XDJL4021-O-IDSTRY-V-GRD-DSTCD         (WK-CUR-CNT)
               MOVE  XQJL0211-O-INRT-GRD-VALUA-YMD         (WK-I)
                 TO  XDJL4021-O-INRT-GRD-VALUA-YMD         (WK-CUR-CNT)
               MOVE  XQJL0211-O-BOK-MTCN-CD                (WK-I)
                 TO  XDJL4021-O-BOK-MTCN-CD                (WK-CUR-CNT)
171117         MOVE  XQJL0211-O-SUB-BZTYP-CD               (WK-I)
                 TO  XDJL4021-O-SUB-BZTYP-CD               (WK-CUR-CNT)
171117         MOVE  XQJL0211-O-SUB-BZTYP-CD-NAME          (WK-I)
                 TO  XDJL4021-O-SUB-BZTYP-CD-NAME          (WK-CUR-CNT)
211005         MOVE  XQJL0211-O-TE-IDSTRY-CLSFI-CD         (WK-I)
                 TO  XDJL4021-O-TE-IDSTRY-CLSFI-CD         (WK-CUR-CNT)
           END-PERFORM                                                  08210022
           .                                                            08220022
       S6000-OUTPUT-SET-EXT.                                            08230022
           EXIT.                                                        08240022
      *-----------------------------------------------------------------02770001
      *@  처리종료                                                    02780001
      *-----------------------------------------------------------------02790001
       S9000-FINAL-RTN.                                                 02800001
      *@정상종료                                                      02810001
           #OKEXIT  CO-STAT-OK.                                         02820001
                                                                        02830001
       S9000-FINAL-EXT.                                                 02840001
           EXIT.                                                        02850001
