      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020030
      *@프로그램명: DJL409A (기업및그룹한도신청및승인조회)          00030030
      *@처리유형  : DC                                                00040030
      *@처리개요  : 설정신청조회                                    00050030
      *-----------------------------------------------------------------00060001
      *                 P R O G R A M   변　경　이　력                00070030
      *-----------------------------------------------------------------00080001
      *@성명 : 일자 : 변　경　내　용                              00090030
      * ----------------------------------------------------------------00100001
      *김진태:20090513: 신규작성                                    00110030
      *김진태:20091008: 지역본부부점코드컬럼삭제 THKJL0015          00110030
      *김진태:20091008: CJIDT03 => CJIDT16                            00110030
      *김진태:20091210: 에러메세지정비                              00110030
      *김진태:20100212: 공통유틸리티경고리턴코드처리                00110030
      *김진태:20101105: SQLIO변경 - THKJL0129,THKJL0135             00110030
      * YBH    :20150818: 조치메시지 정비
      * PJH    :20170201:  KB-PIN전환（２차）
      * YBH    :20170615:  3개년 재무제표실적에 의한
      *                   기준한도 산출
      *박정수:20241205: 관리한도 설정해제 추가
      *=================================================================00120001
      ******************************************************************00130001
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00150030
      **  ------------------------- ------------------------------------00160001
      **  한도신청승인의견        : THKJL0006            : R          00170030
      **  차주관리한도기본        : THKJL0011            : R          00170030
      **  그룹관리한도기본        : THKJL0012            : R          00170030
      **  그룹사기본              : THKJL0013            : R          00170030
      **  계열사기본              : THKJL0014            : R          00170030
      **  채무자고객기본          : THKJL0015            : R          00180030
      **  간접보증인익스포져일집계: THKJL0031            : R          00180030
      **  그룹익스포져일집계      : THKJL0035            : R          00180030
      **  산업등급별익스포져일집계: THKJL0039            : R          00180030
      **  표준산업코드목록        : THKJL0044            : R          00180030
      ******************************************************************00240001
       IDENTIFICATION                  DIVISION.                        00250001
      *=================================================================00260001
       PROGRAM-ID.                     DJL409A.                         00270001
       AUTHOR.                         김진태.                        00280030
       DATE-WRITTEN.                   09/04/23.                        00290001
      *=================================================================00300001
       ENVIRONMENT                     DIVISION.                        00310001
      *=================================================================00320001
       CONFIGURATION                   SECTION.                         00330001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00340001
       DATA                            DIVISION.                        00350001
      *=================================================================00360001
       WORKING-STORAGE                 SECTION.                         00370001
      *-----------------------------------------------------------------00380001
      *CONSTANT ERROR AREA                                              00390001
      *-----------------------------------------------------------------00400001
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B4200066             PIC  X(008) VALUE 'B4200066'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
150818     03  CO-UKJL0038             PIC  X(008) VALUE 'UKJL0038'.
      *-----------------------------------------------------------------00460001
      * CONSTANT AREA                                                   00470001
      *-----------------------------------------------------------------00480001
       01  CO-AREA.                                                     00490001
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL409A'.     00500001
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00510001
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00520001
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00530001
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00540001
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.          00550001
                                                                        00560001
           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00570001
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00570001
241205     03  CO-CHA-8                PIC  X(001) VALUE '8'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00650069
           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00650069
           03  CO-CHA-07               PIC  X(002) VALUE '07'.          00650069

      *-----------------------------------------------------------------00740001
      * WORKING AREA                                                    00750001
      *-----------------------------------------------------------------00760001
       01  WK-AREA.                                                     00770001
           03  FILLER                  PIC  X(001).                     00780001
      *-----------------------------------------------------------------00850001
      * PGM INTERFACE PARAMETER                                         00860001
      *-----------------------------------------------------------------00870001
      *전영업일추출매크로                                             00990030
       01  XCJIDT16-CA.                                                 01000001
           COPY    XCJIDT16.                                            01010001
      *그룹명및그룹신용등급조회                                       00990030
       01  XQJL0098-CA.                                                 01000001
           COPY    XQJL0098.                                            01010001
      *개별기업관리한도조회                                           00990030
       01  XQJL0099-CA.                                                 01000001
           COPY    XQJL0099.                                            01010001
      *개별기업간접익스포져조회                                       00990030
       01  XQJL009A-CA.                                                 01000001
           COPY    XQJL009A.                                            01010001
      *개별기업직접익스포져조회                                       00990030
       01  XQJL009B-CA.                                                 01000001
           COPY    XQJL009B.                                            01010001
      *그룹관리한도조회                                               00990030
       01  XQJL009C-CA.                                                 01000001
           COPY    XQJL009C.                                            01010001
      *그룹익스포져조회                                               00990030
       01  XQJL009D-CA.                                                 01000001
           COPY    XQJL009D.                                            01010001
      *포트폴리오조회                                                 00990030
       01  XQJL009E-CA.                                                 01000001
           COPY    XQJL009E.                                            01010001
      *여신성／시장성관리한도조회                                     00990030
       01  XQJL009F-CA.                                                 01000001
           COPY    XQJL009F.                                            01010001
      *설정신청조회（신청번호있음）                                   00990030
       01  XQJL009G-CA.                                                 01000001
           COPY    XQJL009G.                                            01010001
      *포트폴리오조회（신청번호있음）                                 00990030
       01  XQJL009I-CA.                                                 01000001
           COPY    XQJL009I.                                            01010001
      *그룹명／그룹신용등급조회                                       00990030
       01  XQJL009L-CA.                                                 01000001
           COPY    XQJL009L.                                            01010001
      *그룹관리한도조회                                               00990030
       01  XQJL009M-CA.                                                 01000001
           COPY    XQJL009M.                                            01010001
      *그룹익스포져조회                                               00990030
       01  XQJL009N-CA.                                                 01000001
           COPY    XQJL009N.                                            01010001
      *한도전용신청조회                                               00990030
       01  XQJL009O-CA.                                                 01000001
           COPY    XQJL009O.                                            01010001
      *부점명조회
       01  XCJIBR01-CA.
           COPY    XCJIBR01.
      *직원명조회
       01  XCJIHR01-CA.
           COPY    XCJIHR01.
      *-----------------------------------------------------------------01860001
      * DBIO SQLIO INTERFACE PARAMETER                                  01870001
      *-----------------------------------------------------------------01880001
      * DBIO  INTERFACE PARAMETER
           COPY    YCDBSQLA.                                            01890001
      * SQLIO INTERFACE PARAMETER
           COPY    YCDBIOCA.                                            01900001
      *-----------------------------------------------------------------01910001
      * TABLE ACCESS INTERFACE PARAMETER                                01920001
      * LIBRARY : KJL.DDB2.DBCOPY                                       01930001
      *-----------------------------------------------------------------01940001
      * DBIO ACCESS KEY관리                                           01950030
      *-----------------------------------------------------------------01960001
      * KEY COPYBOOK
       01  TKJL0006-KEY.                                                02050001
           COPY    TKJL0006.                                            02060001
      * RECORD COPYBOOK
       01  TRJL0006-REC.                                                02070001
           COPY    TRJL0006.                                            02080001
      * KEY COPYBOOK
       01  TKJL0015-KEY.                                                02050001
           COPY    TKJL0015.                                            02060001
      * RECORD COPYBOOK
       01  TRJL0015-REC.                                                02070001
           COPY    TRJL0015.                                            02080001
      *-----------------------------------------------------------------02210001
       LINKAGE                         SECTION.                         02220001
      *-----------------------------------------------------------------02230001
      * COMMON COPYBOOK
       01  YCCOMMON-CA.                                                 02240001
           COPY    YCCOMMON.                                            02250001
      * DC COPYBOOK
       01  XDJL409A-CA.                                                 02260001
           COPY    XDJL409A.                                            02270001
      *=================================================================02280001
       PROCEDURE                       DIVISION                         02290001
                                       USING       YCCOMMON-CA          02300001
                                                   XDJL409A-CA          02310001
                                                   .                    02320001
      *=================================================================02330001
      *-----------------------------------------------------------------02340001
      *@  처리메인                                                    02350030
      *-----------------------------------------------------------------02360001
       S0000-MAIN-RTN.                                                  02370001
                                                                        02380001
      *@  초기화                                                      02390030
           PERFORM S1000-INITIALIZE-RTN                                 02400001
              THRU S1000-INITIALIZE-EXT                                 02410001
                                                                        02420001
      *@  입력값　CHECK                                               02430030
           PERFORM S2000-VALIDATION-RTN                                 02440001
              THRU S2000-VALIDATION-EXT                                 02450001
                                                                        02460001
      *@  업무처리                                                    02470030
           PERFORM S3000-PROCESS-RTN                                    02480001
              THRU S3000-PROCESS-EXT                                    02490001
                                                                        02500001
      *@  처리종료                                                    02510030
           PERFORM S9000-FINAL-RTN                                      02520001
              THRU S9000-FINAL-EXT                                      02530001
           .                                                            02540001
       S0000-MAIN-EXT.                                                  02550001
           EXIT.                                                        02560001
      *-----------------------------------------------------------------02570001
      *@  초기화                                                      02580030
      *-----------------------------------------------------------------02590001
       S1000-INITIALIZE-RTN.                                            02600001
                                                                        02610001
      *@   WK-AREA 및　프로그램파라미터　초기화                       02620030
           INITIALIZE WK-AREA                                           02630001
      *               DBIO
                      YCDBIOCA-CA                                       02640001
      *               SQLIO
                      YCDBSQLA-CA                                       02650001
                                                                        02660001
      *@  출력영역　및　결과코드　초기화                              02670030
           INITIALIZE XDJL409A-OUT                                      02680001
                      XDJL409A-RETURN                                   02690001
           .                                                            02700001
       S1000-INITIALIZE-EXT.                                            02710001
           EXIT.                                                        02720001
      *-----------------------------------------------------------------02730001
      *@  입력값검증                                                  02740030
      *-----------------------------------------------------------------02750001
       S2000-VALIDATION-RTN.                                            02760001
                                                                        02770001
      *@처리구분체크
           IF XDJL409A-I-PRCSS-DSTIC = CO-CHA-01 OR
                                       CO-CHA-02
              CONTINUE
           ELSE
      * 에러메세지 : 처리구분오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@고객구분
           IF XDJL409A-I-CUST-DSTIC = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@차주번호
           IF XDJL409A-I-KB-PIN = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .                                                            02880001
       S2000-VALIDATION-EXT.                                            02890001
           EXIT.                                                        02900001
      *-----------------------------------------------------------------03120001
      *@  업무처리                                                    03130030
      *-----------------------------------------------------------------03140001
       S3000-PROCESS-RTN.                                               03150001
                                                                        03160001
      *@1  신청번호유무에　따른　분기
           IF XDJL409A-I-PRCSS-DSTIC = CO-CHA-01
      *@   신청번호없을경우처리
              PERFORM S3100-APLCNO-NO-RTN
                 THRU S3100-APLCNO-NO-EXT
           ELSE
      *@   신청번호있을경우처리
              PERFORM S3200-APLCNO-OK-RTN
                 THRU S3200-APLCNO-OK-EXT
           END-IF
           .                                                            03380001
       S3000-PROCESS-EXT.                                               03390001
           EXIT.                                                        03400001
      *-----------------------------------------------------------------
      *@  신청번호없을때　설정신청조회
      *-----------------------------------------------------------------
       S3100-APLCNO-NO-RTN.

      *@   고객구분이　개별기업일경우
           IF XDJL409A-I-CUST-DSTIC = CO-CHA-1
      *@      개별
              PERFORM S3110-INDIVIDUAL-SELECT-RTN
                 THRU S3110-INDIVIDUAL-SELECT-EXT
      *@   고객구분이　그룹일경우
           ELSE
      *@      그룹
              PERFORM S3120-GROUP-SELECT-RTN
                 THRU S3120-GROUP-SELECT-EXT
           END-IF
           .
       S3100-APLCNO-NO-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호없음　＋　개별기업　설정신청조회
      *-----------------------------------------------------------------
       S3110-INDIVIDUAL-SELECT-RTN.

      *@   차주정보기본조회
           PERFORM S3111-THKJL0015-SELECT-RTN
              THRU S3111-THKJL0015-SELECT-EXT

      *@   그룹명및그룹신용등급조회
           PERFORM S3112-QJL0098-CALL-RTN
              THRU S3112-QJL0098-CALL-EXT

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XDJL409A-I-LIMT-APLCN-DSTIC = CO-CHA-1 OR CO-CHA-8
      *@      관리한도조회
              PERFORM S3113-QJL0099-CALL-RTN
                 THRU S3113-QJL0099-CALL-EXT
      *@      간접익스포져조회
              PERFORM S3114-QJL009A-CALL-RTN
                 THRU S3114-QJL009A-CALL-EXT
      *@      직접익스포져조회
              PERFORM S3115-QJL009B-CALL-RTN
                 THRU S3115-QJL009B-CALL-EXT
      *@      그룹관리한도조회
              PERFORM S3116-QJL009C-CALL-RTN
                 THRU S3116-QJL009C-CALL-EXT
      *@      그룹익스포져조회
              PERFORM S3117-QJL009D-CALL-RTN
                 THRU S3117-QJL009D-CALL-EXT
      *@      포트폴리오조회
              PERFORM S3118-QJL009E-CALL-RTN
                 THRU S3118-QJL009E-CALL-EXT
      *@   한도전용신청일경우
           ELSE
      *@      변경전／후　여신성／시장성관리한도　조회
              PERFORM S3119-QJL009F-CALL-RTN
                 THRU S3119-QJL009F-CALL-EXT
           END-IF

      *@   데이터출력
           PERFORM S311A-DATA-PUT-RTN
              THRU S311A-DATA-PUT-EXT
           .
       S3110-INDIVIDUAL-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  차주정보기본조회
      *-----------------------------------------------------------------
       S3111-THKJL0015-SELECT-RTN.

      *@   변수초기화
           INITIALIZE TKJL0015-KEY
                      TRJL0015-REC
      *@   변수 MOVE
           MOVE BICOM-GROUP-CO-CD  TO KJL0015-PK-GROUP-CO-CD
170201     MOVE XDJL409A-I-KB-PIN
             TO KJL0015-PK-CUST-IDNFR
      *@   DBIO CALL
           #DYDBIO SELECT-CMD-N TKJL0015-PK TRJL0015-REC
      *@   처리결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
               WHEN COND-DBIO-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3111-THKJL0015-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹명및그룹신용등급조회
      *-----------------------------------------------------------------
       S3112-QJL0098-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL0098-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL0098-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL0098-I-BASE-YM
170201*@   고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL0098-I-KB-PIN
      *@   SQLIO CALL
           #DYSQLA QJL0098 XQJL0098-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3112-QJL0098-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  개별기업관리한도조회
      *-----------------------------------------------------------------
       S3113-QJL0099-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL0099-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL0099-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL0099-I-BASE-YM
170201*@   고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL0099-I-KB-PIN
      *@   관리한도유효년월일
           MOVE BICOM-TRAN-BASE-YMD
             TO XQJL0099-I-MGT-LIMT-VALD-YMD
      *@   SQLIO CALL
           #DYSQLA QJL0099 XQJL0099-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3113-QJL0099-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  간접익스포져조회
      *-----------------------------------------------------------------
       S3114-QJL009A-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009A-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009A-I-GROUP-CO-CD
      *@   기준일
           MOVE JICOM-BF-BZOPR-YMD(7:2)
             TO XQJL009A-I-BASE-DD
      *@   기준년월
           MOVE JICOM-BF-BZOPR-YMD(1:6)
             TO XQJL009A-I-BASE-YM
170201*@   담보보증고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL009A-I-SCURTY-G-KB-PIN
      *@   SQLIO CALL
           #DYSQLA QJL009A XQJL009A-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3114-QJL009A-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  직접익스포져조회
      *-----------------------------------------------------------------
       S3115-QJL009B-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009B-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009B-I-GROUP-CO-CD
      *@   기준일
           MOVE JICOM-BF-BZOPR-YMD(7:2)
             TO XQJL009B-I-BASE-DD
      *@   기준년월
           MOVE JICOM-BF-BZOPR-YMD(1:6)
             TO XQJL009B-I-BASE-YM
170201*@   고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL009B-I-KB-PIN
      *@   SQLIO CALL
           #DYSQLA QJL009B XQJL009B-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3115-QJL009B-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹관리한도조회
      *-----------------------------------------------------------------
       S3116-QJL009C-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009C-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009C-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL009C-I-BASE-YM
170201*@   차주고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL009C-I-KB-PIN
      *@   관리한도유효년월일
           MOVE BICOM-TRAN-BASE-YMD
             TO XQJL009C-I-MGT-LIMT-VALD-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009C XQJL009C-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3116-QJL009C-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹익스포져조회
      *-----------------------------------------------------------------
       S3117-QJL009D-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009D-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009D-I-GROUP-CO-CD
      *@   기준년월일
           MOVE JICOM-BF-BZOPR-YMD
             TO XQJL009D-I-BASE-YMD
      *@   계열기업군코드
           MOVE XQJL009C-O-AFFLT-CORP-GROUP-CD
             TO XQJL009D-I-AFFLT-CORP-GROUP-CD
      *@   SQLIO CALL
           #DYSQLA QJL009D XQJL009D-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3117-QJL009D-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  포트폴리오조회
      *-----------------------------------------------------------------
       S3118-QJL009E-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009E-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009E-I-GROUP-CO-CD
      *@   기준년월(전영업년월일)
           MOVE JICOM-BF-BZOPR-YMD(1:6)
             TO XQJL009E-I-BASE-YM
      *@   신표준산업분류코드
           MOVE RJL0015-NEW-SI-CLSFI-CD
             TO XQJL009E-I-NEW-SI-CLSFI-CD
      *@   기준년월일
           MOVE JICOM-BF-BZOPR-YMD
             TO XQJL009E-I-BASE-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009E XQJL009E-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    CONTINUE
               WHEN COND-DBSQL-MRNF
                    MOVE '해당사항없음'
                      TO XQJL009E-O-LAG-C-BZTYP-CD-NAME
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3118-QJL009E-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  변경전／후　여신성／시장성　관리한도　조회
      *-----------------------------------------------------------------
       S3119-QJL009F-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009F-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009F-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL009F-I-BASE-YM
170201*@   고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL009F-I-KB-PIN
      *@   관리한도유효년월일
           MOVE BICOM-TRAN-BASE-YMD
             TO XQJL009F-I-MGT-LIMT-VALD-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009F XQJL009F-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3119-QJL009F-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호없음　＋　개별기업　데이터　출력
      *-----------------------------------------------------------------
       S311A-DATA-PUT-RTN.

241205*@   한도신청구분
           MOVE XDJL409A-I-LIMT-APLCN-DSTIC
             TO XDJL409A-O-LIMT-APLCN-DSTIC

      *@   대표자명
           MOVE RJL0015-BRWR-RPRS-NAME
             TO XDJL409A-O-RPRS-NAME

      *@   기업신용등급
           IF RJL0015-INTNL-CV-GRD-DSTCD = '0000'
              MOVE SPACE
                TO XDJL409A-O-CORP-CRDRAT
           ELSE
              MOVE RJL0015-INTNL-CV-GRD-DSTCD
                TO XDJL409A-O-CORP-CRDRAT
           END-IF

      *@   표준산업분류코드
           IF RJL0015-NEW-SI-CLSFI-CD = '00000'
              MOVE SPACE
                TO XDJL409A-O-STND-I-CLSFI-CD
           ELSE
              MOVE RJL0015-NEW-SI-CLSFI-CD
                TO XDJL409A-O-STND-I-CLSFI-CD
           END-IF

      *@   그룹명
           MOVE XQJL0098-O-AFFLT-C-GROUP-NAME
             TO XDJL409A-O-GROUP-NAME

      *@   그룹등급
           MOVE XQJL0098-O-CMGR-CRTDSCD
             TO XDJL409A-O-GROUP-GRD

      *@   부점코드
           MOVE BICOM-BRNCD
             TO XDJL409A-O-BBRN-CD

      *@   부점명
           MOVE JICOM-BRN-HANGL-NAME
             TO XDJL409A-O-BBRN-NAME

      *@   직원번호
           MOVE BICOM-USER-EMPID
             TO XDJL409A-O-EMPID

      *@   직원명
           MOVE JICOM-USER-NAME
             TO XDJL409A-O-EMNM

241205*@   관리한도설정일경우 관리한도설정해제 추가
           IF XDJL409A-I-LIMT-APLCN-DSTIC = CO-CHA-1 OR CO-CHA-8
      *@      개별기업관리한도
              COMPUTE XDJL409A-O-IDIVI-CORP-MGT-LIMT
                    = XQJL0099-O-MGT-CLAM / 1000000
      *@      개별기업익스포져
              COMPUTE XDJL409A-O-IDIVI-CORP-EXPSR
                    = (XQJL009A-O-INDR-EXPSR-AMT +
                       XQJL009B-O-TE-LIMT-AUC) / 1000000
      *@      그룹관리한도
              COMPUTE XDJL409A-O-GROUP-MGT-LIMT
                    = XQJL009C-O-MGT-CLAM / 1000000
      *@      그룹익스포져
              COMPUTE XDJL409A-O-GROUP-EXPSR
                    = XQJL009D-O-TE-LIMT-AUC / 1000000
      *@      산업군명
              MOVE XQJL009E-O-LAG-C-BZTYP-CD-NAME
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              COMPUTE XDJL409A-O-IDSTRY-PER-MGT-LIMT
                    = XQJL009E-O-IDSTRY-MGT-CLAM / 1000000
      *@      산업익스포져
              COMPUTE XDJL409A-O-IDSTRY-PER-EXPSR
                    = XQJL009E-O-TE-LIMT-AUC / 1000000
      *@      변경전여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BLI-MGT-LIMT
      *@      변경전시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BM-MGT-LIMT
      *@      변경후여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-ALI-MGT-LIMT
      *@      변경후시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-AM-MGT-LIMT
           ELSE
      *@      한도전용일경우
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              MOVE ZERO
                TO XDJL409A-O-GROUP-MGT-LIMT
      *@      그룹익스포져
              MOVE ZERO
                TO XDJL409A-O-GROUP-EXPSR
      *@      산업군명
              MOVE SPACE
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              COMPUTE XDJL409A-O-MODFI-BLI-MGT-LIMT
                    = XQJL009F-O-LNBZ-I-MGT-CLAM / 1000000
      *@      변경전시장성관리한도
              COMPUTE XDJL409A-O-MODFI-BM-MGT-LIMT
                    = XQJL009F-O-MRKTY-MGT-CLAM / 1000000
      *@      변경후여신성관리한도
              COMPUTE XDJL409A-O-MODFI-ALI-MGT-LIMT
                    = XQJL009F-O-MODFI-ALI-MGT-LIMT / 1000000
      *@      변경후시장성관리한도
              COMPUTE XDJL409A-O-MODFI-AM-MGT-LIMT
                    = XQJL009F-O-MODFI-AM-MGT-LIMT / 1000000
           END-IF

      *@   신청사유
           MOVE SPACE
             TO XDJL409A-O-APLCN-RESN
           .
       S311A-DATA-PUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호없음　＋　그룹　설정신청조회
      *-----------------------------------------------------------------
       S3120-GROUP-SELECT-RTN.

      *@   그룹명및그룹신용등급조회
           PERFORM S3121-QJL009L-CALL-RTN
              THRU S3121-QJL009L-CALL-EXT

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XDJL409A-I-LIMT-APLCN-DSTIC = CO-CHA-1 OR CO-CHA-8
      *@      그룹관리한도조회
              PERFORM S3122-QJL009M-CALL-RTN
                 THRU S3122-QJL009M-CALL-EXT
      *@      그룹익스포져조회
              PERFORM S3123-QJL009N-CALL-RTN
                 THRU S3123-QJL009N-CALL-EXT
      *@   한도전용신청일경우
           ELSE
      *@      변경전／후　여신성／시장성관리한도　조회
              PERFORM S3124-QJL009O-CALL-RTN
                 THRU S3124-QJL009O-CALL-EXT
           END-IF

      *@   데이터출력
           PERFORM S312A-DATA-PUT-RTN
              THRU S312A-DATA-PUT-EXT
           .
       S3120-GROUP-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹명및그룹신용등급조회
      *-----------------------------------------------------------------
       S3121-QJL009L-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009L-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009L-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL009L-I-BASE-YM
      *@   계열기업군코드
           MOVE XDJL409A-I-KB-PIN(1:5)
             TO XQJL009L-I-AFFLT-CORP-GROUP-CD
      *@   SQLIO CALL
           #DYSQLA QJL009L XQJL009L-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3121-QJL009L-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹관리한도조회
      *-----------------------------------------------------------------
       S3122-QJL009M-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009M-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009M-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL009M-I-BASE-YM
      *@   계열기업군코드
           MOVE XDJL409A-I-KB-PIN(1:5)
             TO XQJL009M-I-AFFLT-CORP-GROUP-CD
      *@   관리한도유효년월일
           MOVE BICOM-TRAN-BASE-YMD
             TO XQJL009M-I-MGT-LIMT-VALD-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009M XQJL009M-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3122-QJL009M-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹익스포져조회
      *-----------------------------------------------------------------
       S3123-QJL009N-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009N-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009N-I-GROUP-CO-CD
      *@   기준년월일
           MOVE JICOM-BF-BZOPR-YMD
             TO XQJL009N-I-BASE-YMD
      *@   계열기업군코드
           MOVE XDJL409A-I-KB-PIN(1:5)
             TO XQJL009N-I-AFFLT-CORP-GROUP-CD
      *@   SQLIO CALL
           #DYSQLA QJL009N XQJL009N-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3123-QJL009N-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  그룹의　변경전／후　여신성／시장성　관리한도　조회
      *-----------------------------------------------------------------
       S3124-QJL009O-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009O-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009O-I-GROUP-CO-CD
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO XQJL009O-I-BASE-YM
      *@   계열기업군코드
           MOVE XDJL409A-I-KB-PIN(1:5)
             TO XQJL009O-I-AFFLT-CORP-GROUP-CD
      *@   관리한도유효년월일
           MOVE BICOM-TRAN-BASE-YMD
             TO XQJL009O-I-MGT-LIMT-VALD-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009O XQJL009O-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3124-QJL009O-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호없음　＋　그룹　데이터　출력
      *-----------------------------------------------------------------
       S312A-DATA-PUT-RTN.

241205*@   한도신청구분
           MOVE XDJL409A-I-LIMT-APLCN-DSTIC
             TO XDJL409A-O-LIMT-APLCN-DSTIC


      *@   대표자명
           MOVE SPACE
             TO XDJL409A-O-RPRS-NAME

      *@   기업신용등급
           MOVE SPACE
             TO XDJL409A-O-CORP-CRDRAT

      *@   표준산업분류코드
           MOVE SPACE
             TO XDJL409A-O-STND-I-CLSFI-CD

      *@   그룹명
           MOVE XQJL009L-O-AFFLT-C-GROUP-NAME
             TO XDJL409A-O-GROUP-NAME

      *@   그룹등급
           MOVE XQJL009L-O-CMGR-CRTDSCD
             TO XDJL409A-O-GROUP-GRD

      *@   부점코드
           MOVE BICOM-BRNCD
             TO XDJL409A-O-BBRN-CD

      *@   부점명
           MOVE JICOM-BRN-HANGL-NAME
             TO XDJL409A-O-BBRN-NAME

      *@   직원번호
           MOVE BICOM-USER-EMPID
             TO XDJL409A-O-EMPID

      *@   직원명
           MOVE JICOM-USER-NAME
             TO XDJL409A-O-EMNM

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XDJL409A-I-LIMT-APLCN-DSTIC = CO-CHA-1 OR CO-CHA-8
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              COMPUTE XDJL409A-O-GROUP-MGT-LIMT
                    = XQJL009M-O-MGT-CLAM / 1000000
      *@      그룹익스포져
              COMPUTE XDJL409A-O-GROUP-EXPSR
                    = XQJL009N-O-TE-LIMT-AUC / 1000000
      *@      산업군명
              MOVE '해당사항없음'
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BLI-MGT-LIMT
      *@      변경전시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BM-MGT-LIMT
      *@      변경후여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-ALI-MGT-LIMT
      *@      변경후시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-AM-MGT-LIMT
      *@   한도전용일경우
           ELSE
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              MOVE ZERO
                TO XDJL409A-O-GROUP-MGT-LIMT
      *@      그룹익스포져
              MOVE ZERO
                TO XDJL409A-O-GROUP-EXPSR
      *@      산업군명
              MOVE SPACE
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              COMPUTE XDJL409A-O-MODFI-BLI-MGT-LIMT
                    = XQJL009O-O-LNBZ-I-MGT-CLAM / 1000000
      *@      변경전시장성관리한도
              COMPUTE XDJL409A-O-MODFI-BM-MGT-LIMT
                    = XQJL009O-O-MRKTY-MGT-CLAM / 1000000
      *@      변경후여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-ALI-MGT-LIMT
      *@      변경후시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-AM-MGT-LIMT
           END-IF

      *@   신청사유
           MOVE SPACE
             TO XDJL409A-O-APLCN-RESN
           .
       S312A-DATA-PUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호있을때　설정신청조회
      *-----------------------------------------------------------------
       S3200-APLCNO-OK-RTN.

      *@   SQLIO CALL
           PERFORM S3210-QJL009G-CALL-RTN
              THRU S3210-QJL009G-CALL-EXT

      *@   고객구분이　개별기업일경우
           IF XDJL409A-I-CUST-DSTIC = CO-CHA-1
      *@      개별
              PERFORM S3220-INDIVIDUAL-SELECT-RTN
                 THRU S3220-INDIVIDUAL-SELECT-EXT
      *@   고객구분이　그룹일경우
           ELSE
      *@      그룹
              PERFORM S3230-GROUP-SELECT-RTN
                 THRU S3230-GROUP-SELECT-EXT
           END-IF
           .
       S3200-APLCNO-OK-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  설정신청조회（신청번호있음）
      *-----------------------------------------------------------------
       S3210-QJL009G-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009G-IN
      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009G-I-GROUP-CO-CD
      *@   한도신청번호
           MOVE XDJL409A-I-APLCN-NO
             TO XQJL009G-I-LIMT-APLCN-NO
170201*@   고객식별자
           MOVE XDJL409A-I-KB-PIN
             TO XQJL009G-I-KB-PIN
      *@   SQLIO CALL
           #DYSQLA QJL009G XQJL009G-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    CONTINUE
               WHEN COND-DBSQL-MRNF
      *@원장NOT FOUND인경우
      *@에러메세지 : 데이터가 존재하지 않습니다.
      *@조치메세지 : 해당 신청정보가 존재하지 않습니다.
150818              #ERROR CO-B4200066 CO-UKJL0038 CO-STAT-ERROR
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3210-QJL009G-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호있음　＋　개별기업　설정신청조회
      *-----------------------------------------------------------------
       S3220-INDIVIDUAL-SELECT-RTN.

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XQJL009G-O-LIMT-A-KND-DSTCD = CO-CHA-1 OR CO-CHA-8
      *@      포트폴리오조회
              PERFORM S3221-QJL009I-CALL-RTN
                 THRU S3221-QJL009I-CALL-EXT
           END-IF

      *@   신청사유조회
           PERFORM S3300-THKJL0006-SELECT-RTN
              THRU S3300-THKJL0006-SELECT-EXT

      *@   데이터출력
           PERFORM S322A-DATA-PUT-RTN
              THRU S322A-DATA-PUT-EXT
           .
       S3220-INDIVIDUAL-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  포트폴리오조회（신청번호있음）
      *-----------------------------------------------------------------
       S3221-QJL009I-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL009I-IN

      *@   전영업년월일구하기
           PERFORM S3222-CJIDT16-CALL-RTN
              THRU S3222-CJIDT16-CALL-EXT

      *@   변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL009I-I-GROUP-CO-CD
      *@   기준년월
           MOVE XCJIDT16-O-BF-BZOPR-YMD(1:6)
             TO XQJL009I-I-BASE-YM
      *@   신표준산업분류코드
           MOVE XQJL009G-O-NEW-SI-CLSFI-CD
             TO XQJL009I-I-NEW-SI-CLSFI-CD
      *@   기준년월일
           MOVE XCJIDT16-O-BF-BZOPR-YMD
             TO XQJL009I-I-BASE-YMD
      *@   SQLIO CALL
           #DYSQLA QJL009I XQJL009I-CA
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    CONTINUE
               WHEN COND-DBSQL-MRNF
                    MOVE '해당사항없음'
                      TO XQJL009I-O-LAG-C-BZTYP-CD-NAME
                    MOVE ZERO
                      TO XQJL009I-O-IDSTRY-MGT-CLAM
                    MOVE ZERO
                      TO XQJL009I-O-TE-LIMT-AUC
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3221-QJL009I-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  전영업년월일을 구한다.
      *-----------------------------------------------------------------
       S3222-CJIDT16-CALL-RTN.

      *@    초기화
           INITIALIZE XCJIDT16-IN
      *@    호출변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD TO XCJIDT16-I-GROUP-CO-CD
      *@   기준년월일
           MOVE XQJL009G-O-APLCN-YMD TO  XCJIDT16-I-YMD
      *@   구분코드
           MOVE CO-CHA-1             TO  XCJIDT16-I-DSTCD
      *@    공통 UTILITY CALL
           #DYCALL CJIDT16 YCCOMMON-CA XCJIDT16-CA
      *@    호출결과　확인
           IF XCJIDT16-R-STAT = ZEROS
              CONTINUE
           ELSE
              #ERROR XCJIDT16-R-ERRCD
                     XCJIDT16-R-TREAT-CD
                     XCJIDT16-R-STAT
           END-IF
           .
       S3222-CJIDT16-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호있음　＋　개별기업　데이터　출력
      *-----------------------------------------------------------------
       S322A-DATA-PUT-RTN.

      *@   한도신청구분
           MOVE XQJL009G-O-LIMT-A-KND-DSTCD
             TO XDJL409A-O-LIMT-APLCN-DSTIC

      *@   대표자명
           MOVE XQJL009G-O-RPRS-NAME
             TO XDJL409A-O-RPRS-NAME

      *@   기업신용등급
           MOVE XQJL009G-O-INTNL-CV-GRD-DSTCD
             TO XDJL409A-O-CORP-CRDRAT

      *@   표준산업분류코드
           MOVE XQJL009G-O-NEW-SI-CLSFI-CD
             TO XDJL409A-O-STND-I-CLSFI-CD

      *@   그룹명
           MOVE XQJL009G-O-HANGL-GROUP-NAME
             TO XDJL409A-O-GROUP-NAME

      *@   그룹등급
           MOVE XQJL009G-O-CMGR-CRTDSCD
             TO XDJL409A-O-GROUP-GRD

      *@   부점코드
           MOVE XQJL009G-O-APLCN-BRNCD
             TO XDJL409A-O-BBRN-CD

      *@   부점명 CALL
           PERFORM S3400-CJIBR01-CALL-RTN
              THRU S3400-CJIBR01-CALL-EXT

      *@   부점명
           MOVE XCJIBR01-O-BRN-HANGL-NAME
             TO XDJL409A-O-BBRN-NAME

      *@   직원번호
           MOVE XQJL009G-O-APLCN-EMPID
             TO XDJL409A-O-EMPID

      *@   직원명 CALL
           PERFORM S3500-CJIHR01-CALL-RTN
              THRU S3500-CJIHR01-CALL-EXT

      *@   직원명
           MOVE XCJIHR01-O-EMP-HANGL-FNAME
             TO XDJL409A-O-EMNM

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XQJL009G-O-LIMT-A-KND-DSTCD = CO-CHA-1 OR CO-CHA-8
      *@      개별기업관리한도
              COMPUTE XDJL409A-O-IDIVI-CORP-MGT-LIMT
                    = XQJL009G-O-CORP-TE-MGT-CLAM / 1000000
      *@      개별기업익스포져
              COMPUTE XDJL409A-O-IDIVI-CORP-EXPSR
                    = XQJL009G-O-CORP-TE-AMT / 1000000
      *@      그룹관리한도
              COMPUTE XDJL409A-O-GROUP-MGT-LIMT
                    = XQJL009G-O-GROUP-TE-MGT-CLAM / 1000000
      *@      그룹익스포져
              COMPUTE XDJL409A-O-GROUP-EXPSR
                    = XQJL009G-O-GROUP-TE-AMT / 1000000
      *@      산업군명
              MOVE XQJL009I-O-LAG-C-BZTYP-CD-NAME
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              COMPUTE XDJL409A-O-IDSTRY-PER-MGT-LIMT
                    = XQJL009I-O-IDSTRY-MGT-CLAM / 1000000
      *@      산업익스포져
              COMPUTE XDJL409A-O-IDSTRY-PER-EXPSR
                    = XQJL009I-O-TE-LIMT-AUC / 1000000
      *@      변경전여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BLI-MGT-LIMT
      *@      변경전시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BM-MGT-LIMT
      *@      변경후여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-ALI-MGT-LIMT
      *@      변경후시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-AM-MGT-LIMT
      *@   한도전용일경우
           ELSE
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              MOVE ZERO
                TO XDJL409A-O-GROUP-MGT-LIMT
      *@      그룹익스포져
              MOVE ZERO
                TO XDJL409A-O-GROUP-EXPSR
      *@      산업군명
              MOVE SPACE
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              COMPUTE XDJL409A-O-MODFI-BLI-MGT-LIMT
                    = XQJL009G-O-BF-LNBZ-INCLIN-ASST / 1000000
      *@      변경전시장성관리한도
              COMPUTE XDJL409A-O-MODFI-BM-MGT-LIMT
                    = XQJL009G-O-BF-MRKTY-ASST / 1000000
      *@      변경후여신성관리한도
              COMPUTE XDJL409A-O-MODFI-ALI-MGT-LIMT
                    = XQJL009G-O-AF-LNBZ-INCLIN-ASST / 1000000
      *@      변경후시장성관리한도
              COMPUTE XDJL409A-O-MODFI-AM-MGT-LIMT
                    = XQJL009G-O-AF-MRKTY-ASST / 1000000
           END-IF

      *@   신청사유
           MOVE RJL0006-APLCN-RESN-CTNT
             TO XDJL409A-O-APLCN-RESN
           .
       S322A-DATA-PUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호있음　＋　그룹　설정신청조회
      *-----------------------------------------------------------------
       S3230-GROUP-SELECT-RTN.

      *@   신청사유조회
           PERFORM S3300-THKJL0006-SELECT-RTN
              THRU S3300-THKJL0006-SELECT-EXT

      *@   데이터출력
           PERFORM S323A-DATA-PUT-RTN
              THRU S323A-DATA-PUT-EXT
           .
       S3230-GROUP-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청번호있음　＋　그룹　데이터　출력
      *-----------------------------------------------------------------
       S323A-DATA-PUT-RTN.

      *@   한도신청구분
           MOVE XQJL009G-O-LIMT-A-KND-DSTCD
             TO XDJL409A-O-LIMT-APLCN-DSTIC

      *@   대표자명
           MOVE XQJL009G-O-RPRS-NAME
             TO XDJL409A-O-RPRS-NAME

      *@   기업신용등급
           MOVE XQJL009G-O-INTNL-CV-GRD-DSTCD
             TO XDJL409A-O-CORP-CRDRAT

      *@   표준산업분류코드
           MOVE XQJL009G-O-NEW-SI-CLSFI-CD
             TO XDJL409A-O-STND-I-CLSFI-CD

      *@   그룹명
           MOVE XQJL009G-O-HANGL-GROUP-NAME
             TO XDJL409A-O-GROUP-NAME

      *@   그룹등급
           MOVE XQJL009G-O-CMGR-CRTDSCD
             TO XDJL409A-O-GROUP-GRD

      *@   부점코드
           MOVE XQJL009G-O-APLCN-BRNCD
             TO XDJL409A-O-BBRN-CD

      *@   부점명 CALL
           PERFORM S3400-CJIBR01-CALL-RTN
              THRU S3400-CJIBR01-CALL-EXT

      *@   부점명
           MOVE XCJIBR01-O-BRN-HANGL-NAME
             TO XDJL409A-O-BBRN-NAME

      *@   직원번호
           MOVE XQJL009G-O-APLCN-EMPID
             TO XDJL409A-O-EMPID

      *@   직원명 CALL
           PERFORM S3500-CJIHR01-CALL-RTN
              THRU S3500-CJIHR01-CALL-EXT

      *@   직원명
           MOVE XCJIHR01-O-EMP-HANGL-FNAME
             TO XDJL409A-O-EMNM

241205*@   관리한도설정, 관리한도설정해제일경우
           IF XQJL009G-O-LIMT-A-KND-DSTCD = CO-CHA-1 OR CO-CHA-8
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              COMPUTE XDJL409A-O-GROUP-MGT-LIMT
                    = XQJL009G-O-GROUP-TE-MGT-CLAM / 1000000
      *@      그룹익스포져
              COMPUTE XDJL409A-O-GROUP-EXPSR
                    = XQJL009G-O-GROUP-TE-AMT / 1000000
      *@      산업군명
              MOVE '해당사항없음'
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BLI-MGT-LIMT
      *@      변경전시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-BM-MGT-LIMT
      *@      변경후여신성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-ALI-MGT-LIMT
      *@      변경후시장성관리한도
              MOVE ZERO
                TO XDJL409A-O-MODFI-AM-MGT-LIMT
      *@   한도전용일경우
           ELSE
      *@      개별기업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-MGT-LIMT
      *@      개별기업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDIVI-CORP-EXPSR
      *@      그룹관리한도
              MOVE ZERO
                TO XDJL409A-O-GROUP-MGT-LIMT
      *@      그룹익스포져
              MOVE ZERO
                TO XDJL409A-O-GROUP-EXPSR
      *@      산업군명
              MOVE SPACE
                TO XDJL409A-O-IDSTRY-GROUP-NAME
      *@      산업관리한도
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-MGT-LIMT
      *@      산업익스포져
              MOVE ZERO
                TO XDJL409A-O-IDSTRY-PER-EXPSR
      *@      변경전여신성관리한도
              COMPUTE XDJL409A-O-MODFI-BLI-MGT-LIMT
                    = XQJL009G-O-BF-LNBZ-INCLIN-ASST / 1000000
      *@      변경전시장성관리한도
              COMPUTE XDJL409A-O-MODFI-BM-MGT-LIMT
                    = XQJL009G-O-BF-MRKTY-ASST / 1000000
      *@      변경후여신성관리한도
              COMPUTE XDJL409A-O-MODFI-ALI-MGT-LIMT
                    = XQJL009G-O-AF-LNBZ-INCLIN-ASST / 1000000
      *@      변경후시장성관리한도
              COMPUTE XDJL409A-O-MODFI-AM-MGT-LIMT
                    = XQJL009G-O-AF-MRKTY-ASST / 1000000
           END-IF

      *@   신청사유
           MOVE RJL0006-APLCN-RESN-CTNT
             TO XDJL409A-O-APLCN-RESN
           .
       S323A-DATA-PUT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청사유조회
      *-----------------------------------------------------------------
       S3300-THKJL0006-SELECT-RTN.

      *@   변수초기화
           INITIALIZE TKJL0006-KEY
                      TRJL0006-REC
      *@   변수 MOVE
           MOVE BICOM-GROUP-CO-CD   TO KJL0006-PK-GROUP-CO-CD
           MOVE XDJL409A-I-APLCN-NO TO KJL0006-PK-LIMT-APLCN-NO
      *@   DBIO CALL
           #DYDBIO SELECT-CMD-N TKJL0006-PK TRJL0006-REC
      *@   처리결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
               WHEN COND-DBIO-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3300-THKJL0006-SELECT-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  부실점명 조회
      *-----------------------------------------------------------------
       S3400-CJIBR01-CALL-RTN.

      *@   초기화
           INITIALIZE XCJIBR01-IN
      *@  부실점명 조회
           MOVE BICOM-GROUP-CO-CD      TO  XCJIBR01-I-GROUP-CO-CD
           MOVE XQJL009G-O-APLCN-BRNCD TO  XCJIBR01-I-BRNCD
           MOVE BICOM-TRAN-BASE-YMD    TO  XCJIBR01-I-YMD
      *@   UTILITY CALL
           #DYCALL CJIBR01 YCCOMMON-CA XCJIBR01-CA
      *@  호출결과확인
      *@  호출결과가경고인경우도정상처리한다
      *@  폐쇠점인경우리턴코드０７（경고）
           IF XCJIBR01-R-STAT = ZEROS OR CO-CHA-07
              CONTINUE
           ELSE
              #ERROR XCJIBR01-R-ERRCD
                     XCJIBR01-R-TREAT-CD
                     XCJIBR01-R-STAT
           END-IF
           .
       S3400-CJIBR01-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  직원한글성명을 구한다
      *-----------------------------------------------------------------
       S3500-CJIHR01-CALL-RTN.

      *@   초기화
           INITIALIZE XCJIHR01-IN
      *@직원한글성명을 구한다.
           MOVE BICOM-GROUP-CO-CD      TO  XCJIHR01-I-GROUP-CO-CD
           MOVE XQJL009G-O-APLCN-EMPID TO  XCJIHR01-I-EMPID
      *@   UTILITY CALL
           #DYCALL CJIHR01 YCCOMMON-CA XCJIHR01-CA
      *@   호출결과확인
           IF XCJIHR01-R-STAT = ZEROS
              CONTINUE
           ELSE
              #ERROR XCJIHR01-R-ERRCD
                     XCJIHR01-R-TREAT-CD
                     XCJIHR01-R-STAT
           END-IF
           .
       S3500-CJIHR01-CALL-EXT.
           EXIT.
                                                                        01810024
      *-----------------------------------------------------------------32250001
      *@  처리종료                                                    32260030
      *-----------------------------------------------------------------32270001
       S9000-FINAL-RTN.                                                 32280001
      *@3 종료처리                                                    32290030
                                                                        32300001
      *@3.1 프로그램 종료                                           32310030
      *@처리내용 : 프로그램을 정상 종료 함                    32320030
                                                                        32330001
           #OKEXIT  CO-STAT-OK                                          32340001
           .                                                            32350001
       S9000-FINAL-EXT.                                                 32360001
           EXIT.                                                        32370001
