      *=================================================================00010005
      *@업무명    : KJL     (Total Exposure)                          00020005
      *@프로그램명: DJL4038 (자회사및대주주조회)                    00030005
      *@처리유형  : DC                                                00040005
      *@처리개요  : 자회사및대주주조회                              00050005
      *@구현방법  : SQL ARRAY                                         00051006
      *-----------------------------------------------------------------00060005
      *                 P R O G R A M   변　경　이　력                00070005
      *-----------------------------------------------------------------00080005
      *@성명 : 일자 : 변　경　내　용                              00090005
      * ----------------------------------------------------------------00100005
      *이동구:20090113: 신규작성                                    00110005
      *김진태:20090414: 프로그램수정                                00111006
      *김진태:20091209: 에러메세지정비                              00111006
      *박주희:20170201:  KB-PIN전환
      *박정수:20230907: 등록상태 추가
      *=================================================================00120005
      ******************************************************************00130005
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00150005
      **  ------------------------- ------------------------------------00160005
      **  채무자고객기본          : THKJL0015            : R          00170006
      **  자회사대주주기본        : THKJL0042            : R          00171006
      ******************************************************************00190005
       IDENTIFICATION                  DIVISION.                        00200005
      *=================================================================00210005
       PROGRAM-ID.                     DJL4038.                         00220005
       AUTHOR.                         이동구.                        00230005
       DATE-WRITTEN.                   09/01/13.                        00240005
      *=================================================================00260005
       ENVIRONMENT                     DIVISION.                        00270005
      *=================================================================00280005
       CONFIGURATION                   SECTION.                         00290005
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00310005
       DATA                            DIVISION.                        00320005
      *=================================================================00330005
       WORKING-STORAGE                 SECTION.                         00340005
      *-----------------------------------------------------------------00360005
      *CONSTANT ERROR AREA                                              00370005
      *-----------------------------------------------------------------00380005
       01  CO-ERROR-AREA.                                               00381006
      *에러메시지정의                                                 00382006
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00383006
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00384006
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00385006
      *조치메시지정의                                                 00386006
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00387006
      *-----------------------------------------------------------------00430005
      * CONSTANT AREA                                                   00440005
      *-----------------------------------------------------------------00450005
       01  CO-AREA.                                                     00460005
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4038'.     00470005
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00480005
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00490005
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00500005
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00510005
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.          00520005
                                                                        00530005
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00532006
      *-----------------------------------------------------------------00640005
      * WORKING AREA                                                    00650005
      *-----------------------------------------------------------------00660005
       01  WK-AREA.                                                     00670005
           03  WK-I                    PIC  9(005) COMP.                00680006
      *-----------------------------------------------------------------00790005
      * PGM INTERFACE PARAMETER                                         00800005
      *-----------------------------------------------------------------00810005
      *자회사대주주조회                                               00880005
       01  XQJL0381-CA.                                                 00890005
           COPY  XQJL0381.                                              00900005
      *-----------------------------------------------------------------00920005
      * DBIO SQLIO INTERFACE PARAMETER                                  00930005
      *-----------------------------------------------------------------00940005
      * SQLIO INTERFACE PARAMETER                                       00950005
           COPY  YCDBSQLA.                                              00960005
      *-----------------------------------------------------------------00980005
       LINKAGE                         SECTION.                         00990005
      *-----------------------------------------------------------------01000005
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 01010005
           COPY  YCCOMMON.                                              01020005
      * DC COPYBOOK                                                     01030005
       01  XDJL4038-CA.                                                 01040005
           COPY  XDJL4038.                                              01050005
      *=================================================================01070005
       PROCEDURE                       DIVISION                         01080005
                                       USING       YCCOMMON-CA          01090005
                                                   XDJL4038-CA          01100005
                                                   .                    01110005
      *=================================================================01120005
                                                                        01130005
      *-----------------------------------------------------------------01140005
      *@  처리메인                                                    01150005
      *-----------------------------------------------------------------01160005
       S0000-MAIN-RTN.                                                  01170005
                                                                        01180005
      *@  초기화                                                      01190005
           PERFORM  S1000-INITIALIZE-RTN                                01200005
              THRU  S1000-INITIALIZE-EXT                                01210005
                                                                        01220005
      *@  입력값　CHECK                                               01230005
           PERFORM  S2000-VALIDATION-RTN                                01240005
              THRU  S2000-VALIDATION-EXT                                01250005
                                                                        01260005
      *@  업무처리                                                    01270005
           PERFORM  S3000-PROCESS-RTN                                   01280005
              THRU  S3000-PROCESS-EXT                                   01290005
                                                                        01300005
      *@  처리종료                                                    01350005
           PERFORM  S9000-FINAL-RTN                                     01360005
              THRU  S9000-FINAL-EXT                                     01370005
           .                                                            01380005
       S0000-MAIN-EXT.                                                  01400005
           EXIT.                                                        01410005
      *-----------------------------------------------------------------01420005
      *@  초기화                                                      01430005
      *-----------------------------------------------------------------01440005
       S1000-INITIALIZE-RTN.                                            01450005
                                                                        01460005
      *@   WK-AREA 및　프로그램파라미터　초기화                       01470005
           INITIALIZE WK-AREA                                           01480005
      *               SQLIO                                             01490005
                      YCDBSQLA-CA                                       01500005
                                                                        01540005
      *@  출력영역　및　결과코드　초기화                              01550005
           INITIALIZE XDJL4038-OUT                                      01560005
                      XDJL4038-RETURN                                   01570005
           .                                                            01580005
       S1000-INITIALIZE-EXT.                                            01600005
           EXIT.                                                        01610005
      *-----------------------------------------------------------------01620005
      *@  입력값검증                                                  01630005
      *-----------------------------------------------------------------01640005
       S2000-VALIDATION-RTN.                                            01650005
                                                                        01660006
      *@   처리구분                                                   01661006
           IF XDJL4038-I-PRCSS-DSTIC = CO-CHA-01                        01662006
              CONTINUE                                                  01663006
           ELSE                                                         01664006
      * 에러메세지 : 처리구분오류입니다．                           01665006
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01666006
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01667006
           END-IF                                                       01668006
                                                                        01669006
      *@   자회사대주주구분                                           01700006
           IF XDJL4038-I-SBCO-L-SKHDR-DSTCD = SPACE                     01710006
      * 에러메세지 : 필수항목미입력오류입니다．                     01711006
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01712006
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01713006
           END-IF                                                       01714006
           .                                                            01740005
       S2000-VALIDATION-EXT.                                            01760005
           EXIT.                                                        01770005
      *-----------------------------------------------------------------01780005
      *@  업무처리                                                    01790005
      *-----------------------------------------------------------------01800005
       S3000-PROCESS-RTN.                                               01810005
                                                                        01820006
      *@1  자회사대주주조회                                           01821006
           PERFORM S3100-QJL0381-CALL-RTN                               01822006
              THRU S3100-QJL0381-CALL-EXT                               01823006
           .                                                            01890005
       S3000-PROCESS-EXT.                                               01910005
           EXIT.                                                        01920005
      *-----------------------------------------------------------------01921006
      *@ 신용공여자기자본기본정보조회                                 01922006
      *-----------------------------------------------------------------01923006
       S3100-QJL0381-CALL-RTN.                                          01924006
                                                                        01925006
      *@1.1 변수초기화                                                01926006
           INITIALIZE XQJL0381-IN                                       01927006
                                                                        01928006
      *@1.2 변수 MOVE                                                 01929006
      *@   그룹회사코드                                               01929106
           MOVE BICOM-GROUP-CO-CD                                       01929206
             TO XQJL0381-I-GROUP-CO-CD                                  01929306
      *@   기준년월                                                   01929406
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                01929506
             TO XQJL0381-I-BASE-YM                                      01929606
      *@   자회사대주주구분                                           01929706
           MOVE XDJL4038-I-SBCO-L-SKHDR-DSTCD                           01929806
             TO XQJL0381-I-SBCO-L-SKHDR-DSTCD
      *@   등록상태
           MOVE XDJL4038-I-REGI-STUS
             TO XQJL0381-I-REGI-STUS
                                                                        01930006
      *@1.3 프로그램　호출                                            01930106
           #DYSQLA QJL0381 XQJL0381-CA                                  01930206
                                                                        01930306
      *@1.4 호출결과　확인                                            01930406
           EVALUATE TRUE                                                01930506
               WHEN COND-DBSQL-OK                                       01930606
               WHEN COND-DBSQL-MRNF                                     01930706
                    CONTINUE                                            01930806
               WHEN OTHER                                               01930906
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01931006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01931106
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        01931206
           END-EVALUATE                                                 01931306
                                                                        01931406
      *@1.5 출력변수 MOVE                                             01931506
                                                                        01931606
      *@   출력건수                                                   01931706
           MOVE DBSQL-SELECT-CNT                                        01931806
             TO XDJL4038-O-OUTPT-LINE-CNT1                              01931906
                                                                        01932006
           PERFORM VARYING WK-I FROM 1 BY 1                             01932106
             UNTIL WK-I > XDJL4038-O-OUTPT-LINE-CNT1                    01932206
                                                                        01932306
170201*@           고객식별자                                         01932406
                   MOVE XQJL0381-O-CUST-IDNFR             (WK-I)        01932506
                     TO XDJL4038-O-BRWR-NO                (WK-I)        01932606
      *@           차주명                                             01932706
                   MOVE XQJL0381-O-DBTRZ-NAME             (WK-I)        01932806
                     TO XDJL4038-O-DBTRZ-NAME             (WK-I)        01932906
      *@           등록일자                                           01933006
                   MOVE XQJL0381-O-REGI-YMD               (WK-I)        01933106
                     TO XDJL4038-O-REGI-YMD               (WK-I)        01933206
      *@           출자금액                                           01933306
                   MOVE XQJL0381-O-LAG-SKHDR-AMFN         (WK-I)        01933406
                     TO XDJL4038-O-LAG-SKHDR-AMFN         (WK-I)        01933506
      *@           해제일자                                           01933606
                   MOVE XQJL0381-O-REVOC-YMD              (WK-I)        01933706
                     TO XDJL4038-O-TERMI-YMD              (WK-I)        01933806
                                                                        01934806
           END-PERFORM                                                  01934906
           .                                                            01935006
       S3100-QJL0381-CALL-EXT.                                          01935106
           EXIT.                                                        01936006
      *-----------------------------------------------------------------02960005
      *@  처리종료                                                    02970005
      *-----------------------------------------------------------------02980005
       S9000-FINAL-RTN.                                                 02990005
      *@3 종료처리                                                    03000005
                                                                        03010005
      *@3.1 프로그램 종료                                           03020005
      *@처리내용 : 프로그램을 정상 종료 함                    03030005
                                                                        03040005
           #OKEXIT  CO-STAT-OK                                          03050005
           .                                                            03060005
       S9000-FINAL-EXT.                                                 03080005
           EXIT.                                                        03090005
