      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4115 ( EAD그룹별ＴＥ현황조회)
      *@처리유형  : DC
      *@처리개요  : EAD그룹별ＴＥ현황을조회한다
      *@구현방법  : OPEN-FETCH-CLOSE
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081231: 신규작성
      *김진태:20090619: 프로그램수정
      *김진태:20090917: 그룹등급４바이트＝＞３바이트로변경
      *                   ＳＱＬＩＯ및ＣＯＰＹＢＯＯＫ변경
      *김진태:20091119: 에러메세지정비
      *김진태:20091120: 간접계정과목변경에따른프로그램변경
      *                   그룹ＴＥ에서는직접과간접계정이동일
      *                   하게들어가있어서직／간접구분을위해
      *                   계정코드가하드코딩되어있음
      *                   ＴＯ－ＢＥ에서는직／간접상품정보를
      *                   다르게관리함으로별도의ＳＱＬＩＯ를
      *                   추가하여사용함
      *                   즉，２０１０－０２－１６기준으로
      *                   서로다른ＳＱＬＩＯ를사용함
      *김진태:20100720: 합계를고려하여MAX COUNT를９９９건으로변경
      *백현정:20101120:  EAD신규작성
      * YBH    :20130927: TE일일배치작업　진행중이면
      *                  ＇진행중＇사용자　메세지　띄움
      * YBH    :20150818: 조치메시지 정비
      *박정수:20241024: 중단거래 추가
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  그룹관리한도월보기본    : THKJL0012            : R
      **  그룹사기본              : THKJL0013            : R
      **  계정코드목록            : THKJL0018            : R
      **  간접익스포져계정코드목록: THKJL0019            : R
      **  그룹익스포져일실적      : THKJL0035            : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4115.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/31.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200220             PIC  X(008) VALUE 'B4200220'.
           03  CO-B4200231             PIC  X(008) VALUE 'B4200231'.
      *        전산업무담당자에게　문의하시기　바랍니다．
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
150818     03  CO-B3800205             PIC  X(008) VALUE 'B3800205'.
150818     03  CO-UKJL0037             PIC  X(008) VALUE 'UKJL0037'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4115'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.

           03  CO-MAX-CNT              PIC  9(005) VALUE 100.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.

           03  CO-CHA-Y                PIC  X(001) VALUE '1'.
           03  CO-CHA-N                PIC  X(001) VALUE '0'.

130927     03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
           03  WK-BIT                  PIC  X(001).
           03  WK-CUR-CNT              PIC  9(005) COMP.
           03  WK-EXHS-RT              PIC  9(005)V9999.
      *    NEXT KEY 항목정의
           03  WK-BF-KEY.
               05  WK-BF-GROUP-RANKG   PIC  9(003).
               05  WK-BF-GROUP-CD      PIC  X(006).
           03  WK-AF-KEY.
               05  WK-AF-GROUP-RANKG   PIC  9(003).
               05  WK-AF-GROUP-CD      PIC  X(006).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * 그룹별ＴＥ현황 SQLIO COPYBOOK
       01  XQJL1151-CA.
           COPY    XQJL1151.
130927*   토탈익스포져일일배치작업결과　조회
       01  XQJLI056-CA.
           COPY    XQJLI056.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO INTERFACE PARAMETER
           COPY    YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      * COMMON COPYBOOK
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      * DC COPYBOOK
       01  XDJL4115-CA.
           COPY  XDJL4115.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4115-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE       WK-AREA
      * SQLIO COMMUNICATION AREA
                            YCDBSQLA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE       XDJL4115-OUT
                            XDJL4115-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@   처리구분
           IF XDJL4115-I-PRCSS-DSTIC = CO-CHA-01
              CONTINUE
           ELSE
      * 에러메세지 : 처리구분오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@   기준년월일
           IF XDJL4115-I-BASE-YMD = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF

           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

130927*@1 토탈익스포져일일배치작업결과　조회
      *@  진행중이면　＇진행중＇　사용자　메세지띄움
           PERFORM S3900-QJLI056-CALL-RTN
              THRU S3900-QJLI056-CALL-EXT

      *@1  개별그룹익스포져　조회
            PERFORM S3100-QJL1151-CALL-RTN
               THRU S3100-QJL1151-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
130927*@ 토탈익스포져일일배치작업결과　조회
      *-----------------------------------------------------------------
       S3900-QJLI056-CALL-RTN.

      *@1 초기화
           INITIALIZE    XQJLI056-IN

      *@1 입력파라미터 조립
      *@  처리내용:SQLIO(QJLI056)입력파라메타=
      *@   SET(그룹회사코드,토탈익스포져업무구분,배치작업완료여부)

      *    그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJLI056-I-GROUP-CO-CD

      *    토탈익스포져업무구분
           MOVE CO-CHA-1
             TO XQJLI056-I-TE-BZWK-DSTCD

      *    배치작업완료여부
           MOVE CO-CHA-1
             TO XQJLI056-I-BTCH-FNSH-YN

      *@1  SLQIO프로그램 호출
      *@  처리내용:QJLI056프로그램을 호출한다
      *@  관련테이블:THKJLLOG1 접근유형:READ
           #DYSQLA QJLI056 XQJLI056-CA

      *@1 호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    IF XQJLI056-O-BTCH-FNSH-YN = CO-CHA-0
      *#2정상이지만 배치가 종료되기 전이면
      *@에러메세지 : 거래가능시간 오류입니다.
      *@조치메세지 : 토탈익스포져 작업 중입니다.
150818                 #ERROR CO-B3800205 CO-UKJL0037 CO-STAT-ERROR
                    END-IF
               WHEN COND-DBSQL-MRNF
      *#2원장NOT FOUND인경우
      *@에러메세지 : 거래가능시간 오류입니다.
      *@조치메세지 : 토탈익스포져 작업 중입니다.
150818              #ERROR CO-B3800205 CO-UKJL0037 CO-STAT-ERROR
               WHEN OTHER
      *#2원장조회에러인경우
      *@2에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .

       S3900-QJLI056-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  개별그룹익스포져　조회
      *-----------------------------------------------------------------
       S3100-QJL1151-CALL-RTN.

      *@   초기화
           INITIALIZE XQJL1151-IN

      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL1151-I-GROUP-CO-CD
      *@   기준년월일
           MOVE XDJL4115-I-BASE-YMD
             TO XQJL1151-I-BASE-YMD
      *@   그룹순위１
           MOVE XDJL4115-I-GROUP-RANKG1
             TO XQJL1151-I-GROUP-RANKG1
      *@   그룹순위２
           MOVE XDJL4115-I-GROUP-RANKG2
             TO XQJL1151-I-GROUP-RANKG2
      *    그룹등급
           IF XDJL4115-I-GROUP-GRD = '999'
               MOVE  ALL '%'
                 TO  XQJL1151-I-GROUP-GRD
           ELSE
               MOVE  XDJL4115-I-GROUP-GRD
                 TO  XQJL1151-I-GROUP-GRD
           END-IF
      *    관리한도1
           MOVE  XDJL4115-I-MGT-CLAM1
             TO  XQJL1151-I-MGT-CLAM1
      *    관리한도2
           MOVE  XDJL4115-I-MGT-CLAM2
             TO  XQJL1151-I-MGT-CLAM2

      *@   그룹코드 - NEXT KEY
      *@   자동거래일경우 NEXT KEY 처리한다
           IF BICOM-DSCN-TRAN-DSTCD = CO-CHA-1 OR CO-CHA-2
              MOVE BOCOM-BF-TDK-INFO-CTNT
                TO WK-BF-KEY
      *       그룹순위
              MOVE WK-BF-GROUP-RANKG
                TO XQJL1151-I-N-GROUP-RANKG
      *       그룹코드
              MOVE WK-BF-GROUP-CD
                TO XQJL1151-I-N-GROUP-CD
           END-IF

      *@   SQLIO OPEN
           #DYSQLA QJL1151 XQJL1151-CA

      *@   결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    PERFORM S6000-OUTPUT-SET-RTN
                       THRU S6000-OUTPUT-SET-EXT
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@커서패치에러인경우
      *@에러메세지 : 테이블 FETCH 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B4200220 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3100-QJL1151-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 그룹별익스포져　출력　조립
      *-----------------------------------------------------------------
       S6000-OUTPUT-SET-RTN.

           IF DBSQL-SELECT-CNT > CO-MAX-CNT
              MOVE CO-MAX-CNT
                TO XDJL4115-O-OUTPT-LINE-CNT1
           ELSE
              MOVE DBSQL-SELECT-CNT
                TO XDJL4115-O-OUTPT-LINE-CNT1
           END-IF

      *@   OUTPUT LOOP
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL WK-I > XDJL4115-O-OUTPT-LINE-CNT1

      *@       그룹순위
               MOVE XQJL1151-O-GROUP-RANKG(WK-I)
                 TO XDJL4115-O-GROUP-RANKG(WK-I)
      *@       그룹코드
               MOVE XQJL1151-O-GROUP-CD(WK-I)
                 TO XDJL4115-O-GROUP-CD(WK-I)
      *@       그룹명
               MOVE XQJL1151-O-GROUP-NAME(WK-I)
                 TO XDJL4115-O-GROUP-NAME(WK-I)
      *@       그룹등급
               MOVE XQJL1151-O-GROUP-GRD(WK-I)
                 TO XDJL4115-O-GROUP-GRD(WK-I)
      *@       그룹관리한도
               MOVE XQJL1151-O-GROUP-MGT-LIMT(WK-I)
                 TO XDJL4115-O-GROUP-MGT-LIMT(WK-I)
      *@       명목액직접한도
               MOVE XQJL1151-O-TTL-AMT-DRCT-LIMT(WK-I)
                 TO XDJL4115-O-TTL-AMT-DRCT-LIMT(WK-I)
      *@       명목액간접한도
               MOVE XQJL1151-O-TTL-AMT-INDR-LIMT(WK-I)
                 TO XDJL4115-O-TTL-AMT-INDR-LIMT(WK-I)
      *@       명목액기준합계한도
               MOVE XQJL1151-O-TTL-AB-SUM-LIMT(WK-I)
                 TO XDJL4115-O-TTL-AB-SUM-LIMT(WK-I)
      *@       명목액직접잔액
               MOVE XQJL1151-O-TTL-AMT-DRCT-BAL(WK-I)
                 TO XDJL4115-O-TTL-AMT-DRCT-BAL(WK-I)
      *@       명목액간접잔액
               MOVE XQJL1151-O-TTL-AMT-INDR-BAL(WK-I)
                 TO XDJL4115-O-TTL-AMT-INDR-BAL(WK-I)
      *@       명목액기준합계잔액
               MOVE XQJL1151-O-TTL-AMT-BASE-BALSUM(WK-I)
                 TO XDJL4115-O-TTL-A-BASE-BALSUM(WK-I)
      *@       직접한도금액
               MOVE XQJL1151-O-DRCT-CLAM(WK-I)
                 TO XDJL4115-O-DRCT-CLAM(WK-I)
      *@       간접한도금액
               MOVE XQJL1151-O-INDR-CLAM(WK-I)
                 TO XDJL4115-O-INDR-CLAM(WK-I)
      *@       합계한도기준금액
               MOVE XQJL1151-O-SUM-LIMT-BSAMT(WK-I)
                 TO XDJL4115-O-SUM-LIMT-BSAMT(WK-I)
      *@       소진율
               MOVE XQJL1151-O-EXHS-RT(WK-I)
                 TO XDJL4115-O-EXHS-RT(WK-I)

           END-PERFORM

           #USRLOG %T15 XQJL1151-O-GROUP-MGT-LIMT(DBSQL-SELECT-CNT)

      *@   NEXT DATA KEY SET
      *@  실행조건:DBSQL-SELECT-CNT > CO-MAX-CNT
      *@  처리내용:중단거래 대비한 마지막 KEY 항목 SET
           IF DBSQL-SELECT-CNT > CO-MAX-CNT
      *      그룹순위
              MOVE  XQJL1151-O-GROUP-RANKG(WK-I)
                TO  WK-AF-GROUP-RANKG
      *      그룹코드
              MOVE  XQJL1151-O-GROUP-CD(WK-I)
                TO  WK-AF-GROUP-CD
              #DSCNTR 2 WK-AF-KEY
           END-IF
           .
       S6000-OUTPUT-SET-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@3 종료처리

      *@3.1 프로그램 종료
      *@처리내용 : 프로그램을 정상 종료 함

           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
