      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020030
      *@프로그램명: DJL4098 (기업및그룹한도신청및승인조회)          00030030
      *@처리유형  : DC                                                00040030
      *@처리개요  : 개별그룹신용등급별지원비율조회                  00050030
      *-----------------------------------------------------------------00060001
      *                 P R O G R A M   변　경　이　력                00070030
      *-----------------------------------------------------------------00080001
      *@성명 : 일자 : 변　경　내　용                              00090030
      * ----------------------------------------------------------------00100001
      *김진태:20090511: 신규작성                                    00110030
      *김진태:20091210: 에러메세지정비                              00110030
      *=================================================================00120001
      ******************************************************************00130001
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00150030
      **  ------------------------- ------------------------------------00160001
      **  신용등급별가중치        : THKJL0045            : R          00170030
      ******************************************************************00240001
       IDENTIFICATION                  DIVISION.                        00250001
      *=================================================================00260001
       PROGRAM-ID.                     DJL4098.                         00270001
       AUTHOR.                         김진태.                        00280030
       DATE-WRITTEN.                   09/04/23.                        00290001
      *=================================================================00300001
       ENVIRONMENT                     DIVISION.                        00310001
      *=================================================================00320001
       CONFIGURATION                   SECTION.                         00330001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00340001
       DATA                            DIVISION.                        00350001
      *=================================================================00360001
       WORKING-STORAGE                 SECTION.                         00370001
      *-----------------------------------------------------------------00380001
      *CONSTANT ERROR AREA                                              00390001
      *-----------------------------------------------------------------00400001
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------00460001
      * CONSTANT AREA                                                   00470001
      *-----------------------------------------------------------------00480001
       01  CO-AREA.                                                     00490001
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4098'.     00500001
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00510001
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00520001
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00530001
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00540001
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.          00550001
                                                                        00560001
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00650069

           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00650069
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00650069
           03  CO-CHA-3                PIC  X(001) VALUE '3'.           00650069
           03  CO-CHA-4                PIC  X(001) VALUE '4'.           00650069
      *-----------------------------------------------------------------00740001
      * WORKING AREA                                                    00750001
      *-----------------------------------------------------------------00760001
       01  WK-AREA.                                                     00770001
           03  WK-I                    PIC  9(005) COMP.                00780001
           03  WK-HANCD                PIC  X(001).                     00780001
      *-----------------------------------------------------------------00850001
      * PGM INTERFACE PARAMETER                                         00860001
      *-----------------------------------------------------------------00870001
      *-----------------------------------------------------------------01860001
      * DBIO SQLIO INTERFACE PARAMETER                                  01870001
      *-----------------------------------------------------------------01880001
      * DBIO INTERFACE PARAMETER                                        01890001
           COPY    YCDBIOCA.                                            01900001
      *-----------------------------------------------------------------01910001
      * TABLE ACCESS INTERFACE PARAMETER                                01920001
      * LIBRARY : KJL.DDB2.DBCOPY                                       01930001
      *-----------------------------------------------------------------01940001
      * DBIO ACCESS KEY관리                                           01950030
      *-----------------------------------------------------------------01960001
      * TABLE KEY COPYBOOK
       01  TKJL0045-KEY.                                                02050001
           COPY    TKJL0045.                                            02060001
      * TABLE RECORD COPYBOOK
       01  TRJL0045-REC.                                                02070001
           COPY    TRJL0045.                                            02080001
      *-----------------------------------------------------------------02210001
       LINKAGE                         SECTION.                         02220001
      *-----------------------------------------------------------------02230001
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 02240001
           COPY    YCCOMMON.                                            02250001
      * DC COPYBOOK
       01  XDJL4098-CA.                                                 02260001
           COPY    XDJL4098.                                            02270001
      *=================================================================02280001
       PROCEDURE                       DIVISION                         02290001
                                       USING       YCCOMMON-CA          02300001
                                                   XDJL4098-CA          02310001
                                                   .                    02320001
      *=================================================================02330001
      *-----------------------------------------------------------------02340001
      *@  처리메인                                                    02350030
      *-----------------------------------------------------------------02360001
       S0000-MAIN-RTN.                                                  02370001
                                                                        02380001
      *@   초기화                                                     02390030
           PERFORM S1000-INITIALIZE-RTN                                 02400001
              THRU S1000-INITIALIZE-EXT                                 02410001
                                                                        02420001
      *@   입력값　CHECK                                              02430030
           PERFORM S2000-VALIDATION-RTN                                 02440001
              THRU S2000-VALIDATION-EXT                                 02450001
                                                                        02460001
      *@   업무처리                                                   02470030
           PERFORM S3000-PROCESS-RTN                                    02480001
              THRU S3000-PROCESS-EXT                                    02490001
                                                                        02500001
      *@   처리종료                                                   02510030
           PERFORM S9000-FINAL-RTN                                      02520001
              THRU S9000-FINAL-EXT                                      02530001
           .                                                            02540001
       S0000-MAIN-EXT.                                                  02550001
           EXIT.                                                        02560001
      *-----------------------------------------------------------------02570001
      *@  초기화                                                      02580030
      *-----------------------------------------------------------------02590001
       S1000-INITIALIZE-RTN.                                            02600001
                                                                        02610001
      *@   WK-AREA 및　프로그램파라미터　초기화                       02620030
           INITIALIZE WK-AREA                                           02630001
      *               DBIO                                              02640001
                      YCDBIOCA-CA                                       02650001
                                                                        02660001
      *@  출력영역　및　결과코드　초기화                              02670030
           INITIALIZE XDJL4098-OUT                                      02680001
                      XDJL4098-RETURN                                   02690001
           .                                                            02700001
       S1000-INITIALIZE-EXT.                                            02710001
           EXIT.                                                        02720001
      *-----------------------------------------------------------------02730001
      *@  입력값검증                                                  02740030
      *-----------------------------------------------------------------02750001
       S2000-VALIDATION-RTN.                                            02760001
                                                                        02770001
      *@처리구분체크
           IF XDJL4098-I-PRCSS-DSTIC = CO-CHA-01
              CONTINUE
           ELSE
      * 에러메세지 : 처리구분오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@고객구분
           IF XDJL4098-I-CUST-DSTIC = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@신용등급
           IF XDJL4098-I-CRDRAT = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .                                                            02880001
       S2000-VALIDATION-EXT.                                            02890001
           EXIT.                                                        02900001
      *-----------------------------------------------------------------03120001
      *@  업무처리                                                    03130030
      *-----------------------------------------------------------------03140001
       S3000-PROCESS-RTN.                                               03150001
                                                                        03160001
      *@   개별기업일경우
           IF XDJL4098-I-CUST-DSTIC = CO-CHA-1
      *@      건설업일경우
              IF XDJL4098-I-STND-I-CLSFI-CD(1:3) = '411' OR
                 XDJL4098-I-STND-I-CLSFI-CD(1:3) = '412' OR
                 XDJL4098-I-STND-I-CLSFI-CD(1:2) = '42'

                 MOVE CO-CHA-3
                   TO WK-HANCD

              ELSE
      *@      조선업일경우
              IF XDJL4098-I-STND-I-CLSFI-CD(1:4) = '3111' OR
                 XDJL4098-I-STND-I-CLSFI-CD(1:4) = '3112'

                 MOVE CO-CHA-4
                   TO WK-HANCD
      *@      일반제조업일경우
              ELSE
                 MOVE CO-CHA-1
                   TO WK-HANCD
              END-IF
              END-IF
      *@   그룹일경우
           ELSE
              MOVE CO-CHA-2
                TO WK-HANCD
           END-IF

      *@1  신용등급별지원비율조회
           PERFORM S3100-THKJL0045-SELECT-RTN
              THRU S3100-THKJL0045-SELECT-EXT
           .                                                            03380001
       S3000-PROCESS-EXT.                                               03390001
           EXIT.                                                        03400001
      *-----------------------------------------------------------------04380013
      *@  신용등급별지원비율조회                                      04390015
      *-----------------------------------------------------------------04400013
       S3100-THKJL0045-SELECT-RTN.                                      04410013
                                                                        04420015
      *@   변수초기화
           INITIALIZE TKJL0045-KEY                                      06110069
                      TRJL0045-REC                                      06120069

      *@   변수MOVE
      *@   그룹사코드
           MOVE BICOM-GROUP-CO-CD                                       06170001
             TO KJL0045-PK-GROUP-CO-CD                                  06170001
      *@   기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                06180001
             TO KJL0045-PK-BASE-YM                                      06190001
      *@   한도기업구분
           MOVE WK-HANCD                                                06200001
             TO KJL0045-PK-LIMT-CORP-DSTCD                              06210001
      *@   내부신용가등급구분
           MOVE XDJL4098-I-CRDRAT                                       06200001
             TO KJL0045-PK-INTNL-CV-GRD-DSTCD                           06210001
                                                                        06220001
      *@   DBIO CALL
           #DYDBIO SELECT-CMD-N TKJL0045-PK TRJL0045-REC                06230001
                                                                        06240001
      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    MOVE RJL0045-SPORT-RATO
                      TO XDJL4098-O-CRDRAT-P-SPORT-RATO
               WHEN OTHER                                               06560001
                    MOVE ZERO
                      TO XDJL4098-O-CRDRAT-P-SPORT-RATO
           END-EVALUATE                                                 06600001
           .                                                            04810013
       S3100-THKJL0045-SELECT-EXT.                                      04820013
           EXIT.                                                        04830013
      *-----------------------------------------------------------------32250001
      *@  처리종료                                                    32260030
      *-----------------------------------------------------------------32270001
       S9000-FINAL-RTN.                                                 32280001
      *@3 종료처리                                                    32290030
                                                                        32300001
      *@3.1 프로그램 종료                                           32310030
      *@처리내용 : 프로그램을 정상 종료 함                    32320030
                                                                        32330001
           #OKEXIT  CO-STAT-OK                                          32340001
           .                                                            32350001
       S9000-FINAL-EXT.                                                 32360001
           EXIT.                                                        32370001
