      *=================================================================00010000
      *@업무명    : KJL     (Total Exposure)                          00020000
      *@프로그램명: DJL4046 (DC최고한도관리제외대상차주조회)        00030000
      *@처리유형  : DC                                                00040000
      *@처리개요  : 최고한도관리제외대상차주조회처리하는 프       00050000
      *@            : 로그램이다                                      00060000
      *@구현방법  : OPEN-FETCH-CLOSE                                  00060000
      *-----------------------------------------------------------------00070000
      *                 P R O G R A M   변　경　이　력                00080000
      *-----------------------------------------------------------------00090000
      *@성명 : 일자 : 변　경　내　용                              00100000
      * ----------------------------------------------------------------00110000
      *이동구:20081114: 신규작성                                    00120000
      *김진태:20090718: 프로그램수정                                00120000
      *김진태:20091128: 에러메세지정비                              00120000
      *김진태:20091128: ARRAY 축소 3000 => 1000                     00120000
      *YBH     :20150430: KB-PIN 처리
      *PJH     :20170529: KB-PIN 처리（３차）암호화
      *=================================================================00130000
      ******************************************************************00140000
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형 00160000
      **  ----------------   -------------------------------------------00170000
      ** 최고한도제외대상: THKJL0059                     : XRXX       00180000
      ******************************************************************00200000
       IDENTIFICATION                  DIVISION.                        00210000
      *=================================================================00220000
       PROGRAM-ID.                     DJL4046.                         00230000
       AUTHOR.                         이동구.                        00240000
       DATE-WRITTEN.                   08/11/14.                        00250000
      *=================================================================00270000
       ENVIRONMENT                     DIVISION.                        00280000
      *=================================================================00290000
       CONFIGURATION                   SECTION.                         00300000
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00320000
       DATA                            DIVISION.                        00330000
      *=================================================================00340000
       WORKING-STORAGE                 SECTION.                         00350000
      *-----------------------------------------------------------------00360000
      *CONSTANT ERROR AREA                                              00370000
      *-----------------------------------------------------------------00380000
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200220             PIC  X(008) VALUE 'B4200220'.
           03  CO-B4200231             PIC  X(008) VALUE 'B4200231'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------00470000
      * CONSTANT AREA                                                   00480000
      *-----------------------------------------------------------------00490000
       01  CO-AREA.                                                     00500000
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4046'.     00510000
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00520000
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00530000
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00540000
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00550000
                                                                        00560000
           03  CO-MAX-CNT              PIC  9(005) VALUE 1000.
           03  CO-NUM-13               PIC  9(002) VALUE 13.            00580005

           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00600000
                                                                        00610000
           03  CO-CHA-Y                PIC  X(001) VALUE '1'.           00620006
           03  CO-CHA-N                PIC  X(001) VALUE '0'.           00630006
      *-----------------------------------------------------------------00670000
      * WORKING AREA                                                    00680000
      *-----------------------------------------------------------------00690000
       01  WK-AREA.                                                     00700000
           03  WK-I                    PIC S9(004) COMP.                00710000
           03  WK-LEN                  PIC  9(005).
           03  WK-BIT                  PIC  X(001).                     00720000
           03  WK-CUR-CNT              PIC S9(004) COMP.                00730000
170201     03  WK-SELECT-CNT           PIC  9(005).                     00730000
      *-----------------------------------------------------------------00780000
      * PGM INTERFACE PARAMETER                                         00790000
      *-----------------------------------------------------------------00800000
      *최고한도제외대상차주조회 SQLIO COPYBOOK                        00810000
       01  XQJL0461-CA.                                                 00820000
           COPY    XQJL0461.                                            00830000
      *-----------------------------------------------------------------00850000
      * DBIO SQLIO INTERFACE PARAMETER                                  00860000
      *-----------------------------------------------------------------00870000
      * SQLIO INTERFACE PARAMETER                                       00880000
           COPY    YCDBSQLA.                                            00890000
      *-----------------------------------------------------------------00910000
       LINKAGE                         SECTION.                         00920000
      *-----------------------------------------------------------------00930000
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 00950000
           COPY  YCCOMMON.                                              00960000
      * DC COPYBOOK                                                     00970000
       01 XDJL4046-CA.                                                  00980000
           COPY  XDJL4046.                                              00990000
      *=================================================================01020000
       PROCEDURE                       DIVISION                         01030000
                                       USING       YCCOMMON-CA          01040000
                                                   XDJL4046-CA          01050000
                                                   .                    01060000
      *=================================================================01070000
                                                                        01080000
      *-----------------------------------------------------------------01090000
      *@  처리메인                                                    01100000
      *-----------------------------------------------------------------01110000
       S0000-MAIN-RTN.                                                  01120000
                                                                        01130000
      *@  초기화                                                      01140000
           PERFORM S1000-INITIALIZE-RTN                                 01150000
              THRU S1000-INITIALIZE-EXT                                 01160000
                                                                        01170000
      *@  입력값　CHECK                                               01180000
           PERFORM S2000-VALIDATION-RTN                                 01190000
              THRU S2000-VALIDATION-EXT                                 01200000
                                                                        01210000
      *@  업무처리                                                    01220000
           PERFORM S3000-PROCESS-RTN                                    01230000
              THRU S3000-PROCESS-EXT                                    01240000
                                                                        01290000
      *@  처리종료                                                    01300000
           PERFORM S9000-FINAL-RTN                                      01310000
              THRU S9000-FINAL-EXT                                      01320000
           .                                                            01330000
       S0000-MAIN-EXT.                                                  01340000
           EXIT.                                                        01350000
      *-----------------------------------------------------------------01370000
      *@  초기화                                                      01380000
      *-----------------------------------------------------------------01390000
       S1000-INITIALIZE-RTN.                                            01400000
      *@   WK-AREA 및　프로그램파라미터　초기화                       01410000
           INITIALIZE WK-AREA                                           01420000
      *               SQLIO                                             01430008
                      YCDBSQLA-CA                                       01440008
                                                                        01460000
      *@  출력영역　및　결과코드　초기화                              01470000
           INITIALIZE XDJL4046-OUT                                      01480000
                      XDJL4046-RETURN                                   01490000
           .                                                            01500000
       S1000-INITIALIZE-EXT.                                            01520000
           EXIT.                                                        01530000
      *-----------------------------------------------------------------01540000
      *@  입력값검증                                                  01550000
      *-----------------------------------------------------------------01560000
       S2000-VALIDATION-RTN.                                            01570000
      *@1 DC입력파라미터 검증                                       01580000
                                                                        01590000
      *@1.1 처리구분 체크                                           01600000
      *@처리내용 : IF 처리구분<>조회이면 에러처리               01610000
                                                                        01620000
           IF XDJL4046-I-PRCSS-DSTIC NOT = CO-CHA-01
      *@에러메세지 : 처리구분오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .                                                            01660000
       S2000-VALIDATION-EXT.                                            01680000
           EXIT.                                                        01690000
      *-----------------------------------------------------------------01700000
      *@  업무처리                                                    01710000
      *-----------------------------------------------------------------01720000
       S3000-PROCESS-RTN.                                               01730000

      *@   최고한도관리제외대상차주조회                               01740000
           PERFORM S3100-QJL0461-CALL-RTN                               01750000
              THRU S3100-QJL0461-CALL-EXT                               01760000
           .                                                            01810000
       S3000-PROCESS-EXT.                                               01830000
           EXIT.                                                        01840000
      *-----------------------------------------------------------------01810024
      *@ 최고한도관리제외대상차주조회                                 01820024
      *-----------------------------------------------------------------01830024
       S3100-QJL0461-CALL-RTN.                                          01840024
                                                                        01850024
      *@   SQLIO OPEN CALL ROUTINE
           PERFORM S3110-QJL0461-OPEN-RTN                               02187307
              THRU S3110-QJL0461-OPEN-EXT                               02187407
                                                                        02187507
           MOVE CO-CHA-Y                                                02187607
             TO WK-BIT                                                  02187707
                                                                        02187807
      *@   SQLIO FETCH LOOP
           PERFORM UNTIL WK-BIT     = CO-CHA-N OR                       02187907
                         WK-CUR-CNT = CO-MAX-CNT                        02188007
      *@      SQLIO FETCH CALL ROUTINE
              PERFORM S3120-QJL0461-FETCH-RTN                           02188107
                 THRU S3120-QJL0461-FETCH-EXT                           02188207
           END-PERFORM                                                  02188307
                                                                        02188407
      *@   SQLIO CLOSE CALL ROUTINE
           PERFORM S3130-QJL0461-CLOSE-RTN                              02188507
              THRU S3130-QJL0461-CLOSE-EXT                              02188607
                                                                        02188707
           MOVE WK-CUR-CNT                                              02188807
             TO XDJL4046-O-OUTPT-LINE-CNT1                              02188907
           .                                                            01980024
       S3100-QJL0461-CALL-EXT.                                          01990024
           EXIT.                                                        02000024
      *-----------------------------------------------------------------02189307
      *@  SQLIO QJL0461 OPEN                                            02189407
      *-----------------------------------------------------------------02189507
       S3110-QJL0461-OPEN-RTN.                                          02189607
                                                                        02189707
      *@    변수초기화
           INITIALIZE XQJL0461-IN

      *@   변수 MOVE
      *@   그룹회사코드                                               01860024
           MOVE BICOM-GROUP-CO-CD                                       01870024
             TO XQJL0461-I-GROUP-CO-CD                                  01880024

170201*@   KB-PIN                                                       01900024
((         IF   XDJL4046-I-BRWR-NO NOT= SPACE
170529          MOVE XDJL4046-I-BRWR-NO                                 01910024
                  TO XQJL0461-I-KB-PIN                                  01920024
           ELSE

      *@      유효문자 뒤의 모든 공백을 '%' 로 채워준다
      *@      유효문자　뒤의　공백을 COUNT
               MOVE ZERO
                  TO WK-LEN
               INSPECT FUNCTION REVERSE(XDJL4046-I-BRWR-NO)
               TALLYING WK-LEN FOR LEADING SPACE
      *@      유효문자　뒤의　모든공백을 '%'  로　채움
               IF   WK-LEN             NOT = ZERO
                    MOVE ALL '%'
                      TO XDJL4046-I-BRWR-NO(CO-NUM-13 - WK-LEN + 1
                                                      : WK-LEN)
               END-IF

      *@   차주번호                                                   01900024
               MOVE XDJL4046-I-BRWR-NO                                  01910024
                 TO XQJL0461-I-KB-PIN                                   01920024
))         END-IF

      *@   SQLIO CALL
           #DYSQLA QJL0461 OPEN XQJL0461-CA                             02191107
                                                                        02191207
      *@   결과확인
           EVALUATE TRUE                                                02191307
               WHEN COND-DBSQL-OK                                       02191407
                    CONTINUE                                            02191507
               WHEN OTHER                                               02191607
      *@커서오픈에러인경우
      *@에러메세지 : 테이블 OPEN 오류입니다．                     02191707
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02191807
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02191907
           END-EVALUATE                                                 02192007
           .                                                            02192107
       S3110-QJL0461-OPEN-EXT.                                          02192207
           EXIT.                                                        02192307
      *-----------------------------------------------------------------02192407
      *@  SQLIO QJL0461 FETCH                                           02192507
      *-----------------------------------------------------------------02192607
       S3120-QJL0461-FETCH-RTN.                                         02192707
                                                                        02192807
      *@   SQLIO FETCH                                                  02192907
           #DYSQLA QJL0461 FETCH XQJL0461-CA                            02193007

      *@   결과확인                                                   02193107
           EVALUATE TRUE                                                02193207
               WHEN COND-DBSQL-OK                                       02193307
      *@            OUTPUT CALL ROUTINE
                    PERFORM S3140-OUTPUT-SET-RTN                        02193407
                       THRU S3140-OUTPUT-SET-EXT                        02193507
               WHEN COND-DBSQL-MRNF                                     02193607
                    MOVE CO-CHA-N TO WK-BIT                             02193707
               WHEN OTHER                                               02193807
      *@커서패치에러인경우
      *@에러메세지 : 테이블 FETCH 오류입니다．                    02193907
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02194007
                    #ERROR CO-B4200220 CO-UKJL0036 CO-STAT-ERROR        02194107
           END-EVALUATE                                                 02194207
           .                                                            02194307
       S3120-QJL0461-FETCH-EXT.                                         02194407
           EXIT.                                                        02194507
      *-----------------------------------------------------------------02194607
      *@  SQLIO QJL0461 CLOSE                                           02194707
      *-----------------------------------------------------------------02194807
       S3130-QJL0461-CLOSE-RTN.                                         02194907
                                                                        02195007
      *@   SQLIO CLOSE                                                  02195107
           #DYSQLA QJL0461 CLOSE XQJL0461-CA                            02195207

      *@   결과확인                                                   02195307
           EVALUATE TRUE                                                02195407
               WHEN COND-DBSQL-OK                                       02195507
                    CONTINUE                                            02195607
               WHEN OTHER                                               02195707
      *@커서클로즈에러인경우
      *@에러메세지 : 테이블 CLOSE 오류입니다．                    02195807
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02195907
                    #ERROR CO-B4200231 CO-UKJL0036 CO-STAT-ERROR        02196007
           END-EVALUATE                                                 02196107
           .                                                            02196207
       S3130-QJL0461-CLOSE-EXT.                                         02196307
           EXIT.                                                        02196407
      *-----------------------------------------------------------------02196507
      *@ 최고한도관리제외대상차주조회출력                             02196607
      *-----------------------------------------------------------------02196707
       S3140-OUTPUT-SET-RTN.                                            02196807
                                                                        02196907
170201     MOVE DBSQL-SELECT-CNT                                        02196907
170201       TO WK-SELECT-CNT                                           02196907
                                                                        02196907
      *@   OUTPUT DATA LOOP
           PERFORM VARYING WK-I FROM 1 BY 1                             02197007
170201             UNTIL WK-I > WK-SELECT-CNT                           02197107
                                                                        02197207
               ADD 1 TO WK-CUR-CNT                                      02197307
                                                                        02197407
      *@       차주번호                                               02790024
170529         MOVE XQJL0461-O-CUST-IDNFR(WK-I)                         02800024
                 TO XDJL4046-O-BRWR-NO(WK-CUR-CNT)                      02810024
150430*        KB-PIN
               MOVE XQJL0461-O-CUST-IDNFR(WK-I)
                 TO XDJL4046-O-KB-PIN(WK-CUR-CNT)
      *@       채무자명                                               02820024
               MOVE XQJL0461-O-DBTRZ-NAME(WK-I)                         02800024
                 TO XDJL4046-O-DBTRZ-NAME(WK-CUR-CNT)                   02810024
      *@       제외사유                                               02850024
               MOVE XQJL0461-O-ECLUD-RESN(WK-I)                         02800024
                 TO XDJL4046-O-ECLUD-RESN(WK-CUR-CNT)                   02810024
      *@       등록년월일                                             02890024
               MOVE XQJL0461-O-REGI-YMD(WK-I)                           02800024
                 TO XDJL4046-O-REGI-YMD(WK-CUR-CNT)                     02810024
                                                                        02201807
           END-PERFORM                                                  02201907
           .                                                            02202007
       S3140-OUTPUT-SET-EXT.                                            02202107
           EXIT.                                                        02202207
      *-----------------------------------------------------------------02840000
      *@  처리종료                                                    02850000
      *-----------------------------------------------------------------02860000
       S9000-FINAL-RTN.                                                 02870000
      *@정상종료                                                      02880000
           #OKEXIT  CO-STAT-OK                                          02890000
           .                                                            02900000
       S9000-FINAL-EXT.                                                 02920000
           EXIT.                                                        02930000
