      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: DJL4036 (DC자회사신용공여조회)                  00030001
      *@처리유형  : DC                                                00040001
      *@처리개요  : 당행 자회사의 신용공여 현황을 조회처리  00050001
      *@            : 하는 프로그램이다                             00060001
      *@구현방법  : SQL ARRAY                                         00061005
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20090112: 신규작성                                    00120001
      *김진태:20090326: 프로그램수정                                00121005
      *김진태:20091209: 에러메세지정비                              00121005
      *김진태:20100212: 공통유틸리티경고리턴코드처리                00121005
      *박주희:20170201:  KB-PIN 전환（２차）　　　　　              00121005
      *=================================================================00130001
      ******************************************************************00131005
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00133005
      **  ------------------------- ------------------------------------00134005
      **  차주익스포져월집계      : THKJL0034            : R          00136005
      **  TE자기자본기본          : THKJL0049            : R          00137005
      **  채무자고객기본          : THKJL0015            : R          00138005
      **  자회사대주주기본        : THKJL0042            : R          00138105
      ******************************************************************00139005
       IDENTIFICATION                  DIVISION.                        00210001
      *=================================================================00220001
       PROGRAM-ID.                     DJL4036.                         00230001
       AUTHOR.                         이동구.                        00240001
       DATE-WRITTEN.                   09/01/12.                        00250001
                                                                        00260001
      *=================================================================00270001
       ENVIRONMENT                     DIVISION.                        00280001
      *=================================================================00290001
       CONFIGURATION                   SECTION.                         00300001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00320001
       DATA                            DIVISION.                        00330001
      *=================================================================00340001
       WORKING-STORAGE                 SECTION.                         00350001
      *-----------------------------------------------------------------00361005
      *CONSTANT ERROR AREA                                              00362005
      *-----------------------------------------------------------------00363005
       01  CO-ERROR-AREA.                                               00364005
      *에러메시지정의                                                 00365005
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00366005
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00367005
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00368005
      *조치메시지정의                                                 00369005
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00369105
      *-----------------------------------------------------------------00369205
      * CONSTANT AREA                                                   00369305
      *-----------------------------------------------------------------00369405
       01  CO-AREA.                                                     00369505
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4034'.     00369605
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00369705
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00369805
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00369905
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00370005
                                                                        00380005
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00400005
           03  CO-CHA-06               PIC  X(002) VALUE '06'.          00400005
           03  CO-CHA-07               PIC  X(002) VALUE '07'.          00400005
      *-----------------------------------------------------------------00640001
      * WORKING AREA                                                    00650001
      *-----------------------------------------------------------------00660001
       01  WK-AREA.                                                     00670001
           03  WK-I                    PIC  9(005) COMP.                00680005
           03  WK-EXHS-RT              PIC  9(005)V9999.
      *-----------------------------------------------------------------00790001
      * PGM INTERFACE PARAMETER                                         00800001
      *-----------------------------------------------------------------00810001
      *월말산출PARAMETER                                              00820005
       01  XCJIDT05-CA.                                                 00830005
           COPY XCJIDT05.                                               00840005
      *자회사신용공여조회（헤더）                                     00880001
       01  XQJL0361-CA.                                                 00890001
           COPY  XQJL0361.                                              00900001
      *자회사신용공여조회（그리드）                                   00910001
       01  XQJL0362-CA.                                                 00920001
           COPY  XQJL0362.                                              00930001
      *-----------------------------------------------------------------00950001
      * DBIO SQLIO INTERFACE PARAMETER                                  00960001
      *-----------------------------------------------------------------00970001
      * SQLIO INTERFACE PARAMETER                                       00980001
           COPY  YCDBSQLA.                                              00990001
      *-----------------------------------------------------------------01010001
       LINKAGE                         SECTION.                         01020001
      *-----------------------------------------------------------------01030001
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 01040001
           COPY  YCCOMMON.                                              01050001
      * DC COPYBOOK                                                     01060001
       01  XDJL4036-CA.                                                 01070001
           COPY  XDJL4036.                                              01080001
      *=================================================================01100001
       PROCEDURE                       DIVISION                         01110001
                                       USING       YCCOMMON-CA          01120001
                                                   XDJL4036-CA          01130001
                                                   .                    01140001
      *=================================================================01150001
                                                                        01160001
      *-----------------------------------------------------------------01170001
      *@  처리메인                                                    01180001
      *-----------------------------------------------------------------01190001
       S0000-MAIN-RTN.                                                  01200001
                                                                        01210001
      *@  초기화                                                      01220001
           PERFORM S1000-INITIALIZE-RTN                                 01230001
              THRU S1000-INITIALIZE-EXT                                 01240001
                                                                        01250001
      *@  입력값　CHECK                                               01260001
           PERFORM S2000-VALIDATION-RTN                                 01270001
              THRU S2000-VALIDATION-EXT                                 01280001
                                                                        01290001
      *@  업무처리                                                    01300001
           PERFORM S3000-PROCESS-RTN                                    01310001
              THRU S3000-PROCESS-EXT                                    01320001
                                                                        01330001
      *@  처리종료                                                    01380001
           PERFORM S9000-FINAL-RTN                                      01390001
              THRU S9000-FINAL-EXT                                      01400001
           .                                                            01410001
       S0000-MAIN-EXT.                                                  01430001
           EXIT.                                                        01440001
      *-----------------------------------------------------------------01450001
      *@  초기화                                                      01460001
      *-----------------------------------------------------------------01470001
       S1000-INITIALIZE-RTN.                                            01480001
                                                                        01490001
      *@   WK-AREA 및　프로그램파라미터　초기화                       01500001
           INITIALIZE WK-AREA                                           01510001
      *               SQLIO                                             01520001
                      YCDBSQLA-CA                                       01530001
                                                                        01580001
      *@  출력영역　및　결과코드　초기화                              01590001
           INITIALIZE XDJL4036-OUT                                      01600001
                      XDJL4036-RETURN                                   01610001
           .                                                            01620001
       S1000-INITIALIZE-EXT.                                            01640001
           EXIT.                                                        01650001
      *-----------------------------------------------------------------01660001
      *@  입력값검증                                                  01670001
      *-----------------------------------------------------------------01680001
       S2000-VALIDATION-RTN.                                            01690001
                                                                        01700005
      *@   처리구분                                                   01701005
           IF XDJL4036-I-PRCSS-DSTIC = CO-CHA-01                        01702005
              CONTINUE                                                  01703005
           ELSE                                                         01704005
      * 에러메세지 : 처리구분오류입니다．                           01705005
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01706005
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01707005
           END-IF                                                       01708005
                                                                        01709705
      *@   기준년월                                                   01709805
           IF XDJL4036-I-BASE-YM = SPACE                                01709905
      * 에러메세지 : 필수항목미입력오류입니다．                     01710005
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01710105
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01710205
           END-IF                                                       01710305
           .                                                            01780001
       S2000-VALIDATION-EXT.                                            01800001
           EXIT.                                                        01810001
      *-----------------------------------------------------------------01820001
      *@  업무처리                                                    01830001
      *-----------------------------------------------------------------01840001
       S3000-PROCESS-RTN.                                               01850001
                                                                        01850105
      *@1  월말일　추출                                               01851005
           PERFORM S3100-CJIDT05-CALL-RTN                               01852005
              THRU S3100-CJIDT05-CALL-EXT                               01853005
                                                                        01854005
      *@2  현재설정현황　추출                                         01855005
           PERFORM S3200-QJL0361-CALL-RTN                               01856005
              THRU S3200-QJL0361-CALL-EXT                               01857005
                                                                        01858005
      *@3  자회사신용공여조회                                         01859005
           PERFORM S3300-QJL0362-CALL-RTN                               01859105
              THRU S3300-QJL0362-CALL-EXT                               01859205
           .                                                            01859305
       S3000-PROCESS-EXT.                                               01950001
           EXIT.                                                        01960001
      *-----------------------------------------------------------------01961005
      *@  월말일　추출                                                01962005
      *-----------------------------------------------------------------01963005
       S3100-CJIDT05-CALL-RTN.                                          01964005
                                                                        01965005
      *@1.1 초기화                                                    01965105
           INITIALIZE  XCJIDT05-IN                                      01966005
      *@1.2 호출변수 MOVE                                             01967005
      *@   그룹회사코드                                               01968005
           MOVE BICOM-GROUP-CO-CD                                       01969005
             TO XCJIDT05-I-GROUP-CO-CD                                  01969105
      *@   기준년월일                                                 01969205
           MOVE XDJL4036-I-BASE-YM                                      01969305
             TO XCJIDT05-I-YMD(1:6)                                     01969405
           MOVE CO-CHA-01                                               01969505
             TO XCJIDT05-I-YMD(7:2)                                     01969605
      *@1.3 프로그램호출                                              01970005
           #DYCALL CJIDT05 YCCOMMON-CA XCJIDT05-CA                      01970105
      *@1.4 호출결과확인                                              01970205
      *@  호출결과가경고인경우도정상처리한다
      *@  입력일자가월말인경우０６（경고）
      *@  입력일자가년말인경우０７（경고）
           IF XCJIDT05-R-STAT = ZEROS     OR                            01970305
                                CO-CHA-06 OR
                                CO-CHA-07
              CONTINUE                                                  01970505
           ELSE                                                         01970605
              #ERROR XCJIDT05-R-ERRCD                                   01970705
                     XCJIDT05-R-TREAT-CD                                01970805
                     XCJIDT05-R-STAT                                    01970905
           END-IF                                                       01971005
           .                                                            01971105
       S3100-CJIDT05-CALL-EXT.                                          01971205
           EXIT.                                                        01971305
      *-----------------------------------------------------------------01971405
      *@  현재설정현황　추출                                          01971505
      *-----------------------------------------------------------------01971605
       S3200-QJL0361-CALL-RTN.                                          01971705
                                                                        01971805
      *@2.1 변수초기화                                                01971905
           INITIALIZE XQJL0361-IN                                       01972005
      *@2.2 호출변수 MOVE                                             01972105
      *@   그룹회사코드                                               01972205
           MOVE BICOM-GROUP-CO-CD                                       01972305
             TO XQJL0361-I-GROUP-CO-CD                                  01972405
      *@   기준년월                                                   01972505
           MOVE XDJL4036-I-BASE-YM                                      01972605
             TO XQJL0361-I-BASE-YM                                      01972705
      *@   월말년월일                                                 01972805
           MOVE XCJIDT05-O-ENMN-YMD                                     01972905
             TO XQJL0361-I-ENMN-YMD                                     01973005
      *@2.3 프로그램 호출                                           01973105
           #DYSQLA QJL0361 XQJL0361-CA                                  01973205
      *@2.4 호출결과확인                                              01973305
           IF COND-DBSQL-OK OR COND-DBSQL-MRNF                          01973405
              CONTINUE                                                  01973505
           ELSE                                                         01973605
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01973705
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01973805
              #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR              01973905
           END-IF                                                       01974005

      *@2.5 출력변수 MOVE                                             01974105
      *@신용공여한도                                                  01974205
           COMPUTE XDJL4036-O-GRCR-LIMT                                 01974305
                 = XQJL0361-O-GRCR-LIMT / 1000000                       01974405
      *@신용공여잔액                                                  01974505
           COMPUTE XDJL4036-O-GRCR-BAL                                  01974605
                 = XQJL0361-O-GRCR-BAL / 1000000                        01974705
      *@한도여유액                                                    01974805
           COMPUTE XDJL4036-O-LIMT-SEXTR-AMT                            01974905
                 = XQJL0361-O-LIMT-SEXTR-AMT / 1000000                  01975005
      *@업무규제자기자본                                              01975105
           COMPUTE XDJL4036-O-BZWK-REGUL-ONCP                           01975205
                 = XQJL0361-O-BZWK-REGUL-ONCP / 1000000                 01975305
      *@자기자본기준년월                                              01975405
           MOVE XQJL0361-O-ONCP-BASE-YM                                 01975505
             TO XDJL4036-O-ONCP-BASE-YM                                 01975605
           .                                                            01975705
       S3200-QJL0361-CALL-EXT.                                          01975805
           EXIT.                                                        01975905
      *-----------------------------------------------------------------01976005
      *@ 자회사신용공여조회                                           01976105
      *-----------------------------------------------------------------01976205
       S3300-QJL0362-CALL-RTN.                                          01976305
                                                                        01976405
      *@3.1 변수초기화                                                01976505
           INITIALIZE XQJL0362-IN                                       01976605
                                                                        01976705
      *@3.2 변수 MOVE                                                 01976805
      *@   그룹회사코드                                               01976905
           MOVE BICOM-GROUP-CO-CD                                       01977005
             TO XQJL0362-I-GROUP-CO-CD                                  01977105
      *@   기준년월                                                   01977205
           MOVE XDJL4036-I-BASE-YM                                      01977305
             TO XQJL0362-I-BASE-YM                                      01977405
      *@   월말년월일                                                 01977505
           MOVE XCJIDT05-O-ENMN-YMD                                     01977605
             TO XQJL0362-I-ENMN-YMD                                     01977705
                                                                        01977805
      *@3.3 프로그램　호출                                            01977905
           #DYSQLA QJL0362 XQJL0362-CA                                  01978005
                                                                        01978105
      *@3.4 호출결과　확인                                            01978205
           EVALUATE TRUE                                                01978305
               WHEN COND-DBSQL-OK                                       01978405
               WHEN COND-DBSQL-MRNF                                     01978505
                    CONTINUE                                            01978605
               WHEN OTHER                                               01978705
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01978805
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01978905
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        01979005
           END-EVALUATE                                                 01979105
                                                                        01979205
      *@3.5 출력변수 MOVE                                             01979305
                                                                        01979405
      *@   출력건수                                                   01979505
           MOVE DBSQL-SELECT-CNT                                        01979605
             TO XDJL4036-O-OUTPT-LINE-CNT1                              01979705
                                                                        01979805
           PERFORM VARYING WK-I FROM 1 BY 1                             01979905
             UNTIL WK-I > XDJL4036-O-OUTPT-LINE-CNT1                    01980005
      *@       채무자번호                                             01980105
               MOVE XQJL0362-O-CUST-IDNFR(WK-I)                         01980205
                 TO XDJL4036-O-BRWR-NO1(WK-I)                           01980305
      *@       채무자명                                               01980405
               MOVE XQJL0362-O-DBTRZ-NAME(WK-I)                         01980505
                 TO XDJL4036-O-DBTR-NAME1(WK-I)                         01980605
      *@       신용공여한도（개별）                                   01980705
               COMPUTE XDJL4036-O-CA-AMT1(WK-I)                         01980805
                     = XDJL4036-O-GRCR-LIMT / 2                         01980905
      *@       은행기준                                               01981205
               COMPUTE XDJL4036-O-BS-BASE-BAL1(WK-I)                    01981305
                     = XQJL0362-O-BS-BASE-BAL(WK-I) / 1000000           01981405
      *@       금감원기준                                             01981505
               COMPUTE XDJL4036-O-CA-SCURTY-AUC1(WK-I)                  01981605
                     = XQJL0362-O-CA-SCURTY-AUC(WK-I) / 1000000         01981705
      *@       제외자산금액                                           01981805
               COMPUTE XDJL4036-O-ECLUD-ASAM1(WK-I)                     01981905
                     = XQJL0362-O-ECLUD-ASAM(WK-I) / 1000000            01982005
      *@       공여율                                                 06630022
               IF XDJL4036-O-CA-SCURTY-AUC1(WK-I) = ZERO OR
                  XDJL4036-O-CA-AMT1(WK-I)        = ZERO
                  MOVE ZERO
                    TO XDJL4036-O-GVNG-RATO1(WK-I)
               ELSE
                  COMPUTE WK-EXHS-RT
                        = (XDJL4036-O-CA-SCURTY-AUC1(WK-I) /
                           XDJL4036-O-CA-AMT1(WK-I))

                  COMPUTE XDJL4036-O-GVNG-RATO1(WK-I)
                        = WK-EXHS-RT * 100
               END-IF

           END-PERFORM                                                  01983105
           .                                                            01983205
       S3300-QJL0362-CALL-EXT.                                          01983305
           EXIT.                                                        01983405

      *-----------------------------------------------------------------03790001
      *@  처리종료                                                    03800001
      *-----------------------------------------------------------------03810001
       S9000-FINAL-RTN.                                                 03820001
      *@   정상종료                                                   03830001
           #OKEXIT  CO-STAT-OK                                          03840001
           .                                                            03850001
       S9000-FINAL-EXT.                                                 03870001
           EXIT.                                                        03880001
