      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4150 (DC국별수기계좌조회)
      *@처리유형  : DC
      *@처리개요  : 국별수기국적 조회하는 프로그램이다.
      *@구현방법  :
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *박정수:20250515: 신규작성
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **  THKJL0026 : 국별수기국적계좌관리               : R
      **  THKJL0055 : 국별익스포져계좌명세               : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4150.
       AUTHOR.                         박정수.
       DATE-WRITTEN.                   25/05/15.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *에러메시지
      *처리구분코드 오류입니다.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
      *필수항목 오류입니다.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
      *데이터를 검색할 수 없습니다.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
      *조치메시지
      *전산업무담당자에게 문의바랍니다.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4150'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-MAX-CNT              PIC  9(005) VALUE 100.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.

           03  CO-CHA-Y                PIC  X(001) VALUE '1'.
           03  CO-CHA-N                PIC  X(001) VALUE '0'.

           03  CO-CHA-PCENT            PIC  X(004) VALUE '%%%%'.
           03  CO-CHA-9999             PIC  X(004) VALUE '9999'.

           03  CO-NUM-100              PIC  9(003) VALUE 100.
           03  CO-NUM-101              PIC  9(003) VALUE 101.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
           03  WK-BIT                  PIC  X(001).

      *    NEXT KEY 항목정의
           03  WK-BF-KEY.
               05  WK-BF-ACNO          PIC  X(020).
           03  WK-AF-KEY.
               05  WK-AF-ACNO          PIC  X(020).

      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO COPYBOOK
       01  XQJL4150-CA.
           COPY    XQJL4150.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO
           COPY  YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    DC COPYBOOK
       01  XDJL4150-CA.
           COPY  XDJL4150.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4150-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE WK-AREA
      *               SQLIO
                      YCDBSQLA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE XDJL4150-OUT
                      XDJL4150-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@   1 DC필수입력파라미터 검증
      *@   1.1 처리구분코드체크
      *@   실행조건 : 입력.처리구분코드=01
      *@   처리내용 : 에러처리
           IF XDJL4150-I-PRCSS-DSTIC NOT = CO-CHA-01
      *@에러메세지 : 처리구분오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@1  국별수기국적조회
           PERFORM S3100-QJL4150-CALL-RTN
              THRU S3100-QJL4150-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@ 국별수기국적조회
      *-----------------------------------------------------------------
       S3100-QJL4150-CALL-RTN.

      *@   변수초기화
           INITIALIZE XQJL4150-IN

      *@    변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL4150-I-GROUP-CO-CD

      *@   기준년월일(전영업일)
           MOVE JICOM-BF-BZOPR-YMD
             TO XQJL4150-I-BASE-YMD

      *@   계좌번호 - NEXT KEY
      *@   자동거래일경우 NEXT KEY 처리한다
           IF BICOM-DSCN-TRAN-DSTCD = CO-CHA-1 OR CO-CHA-2

           #USRLOG  "=================================================="
           #USRLOG  "*                 NEXT    KEY                    *"
           #USRLOG  "=================================================="

              MOVE BOCOM-BF-TDK-INFO-CTNT
                TO WK-BF-KEY
              MOVE WK-BF-ACNO
                TO XQJL4150-I-ACNO

           #USRLOG  " WK-BF-ACNO : " WK-BF-ACNO
           #USRLOG  "=================================================="
           END-IF

      *@1.3 프로그램　호출
           #DYSQLA QJL4150 XQJL4150-CA

      *@1.4 호출결과　확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장조회에러일경우
      *@에러메세지 : 테이블SELECT오류입니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@1.5 출력변수 MOVE
           IF DBSQL-SELECT-CNT > CO-MAX-CNT
              MOVE CO-MAX-CNT
                TO XDJL4150-O-PRSNT-NOITM1
           ELSE
              MOVE DBSQL-SELECT-CNT
                TO XDJL4150-O-PRSNT-NOITM1
           END-IF

           PERFORM VARYING WK-I FROM 1 BY 1
             UNTIL WK-I > XDJL4150-O-PRSNT-NOITM1

      *            계좌번호
               MOVE  XQJL4150-O-ACNO (WK-I)
                 TO  XDJL4150-O-ACNO (WK-I)

      *            ISO국가코드
               MOVE  XQJL4150-O-ISO-NATNL-CD(WK-I)
                 TO  XDJL4150-O-ISO-NATNL-CD(WK-I)

      *            USD한도
               MOVE  XQJL4150-O-USD-CLAM(WK-I)
                 TO  XDJL4150-O-USD-CLAM(WK-I)

      *            ISO국가코드2
               MOVE  XQJL4150-O-ISO-NATNL-CD2(WK-I)
                 TO  XDJL4150-O-ISO-NATNL-CD2(WK-I)

      *            등록년월일
               MOVE  XQJL4150-O-REGI-YMD(WK-I)
                 TO  XDJL4150-O-REGI-YMD(WK-I)

      *            등록직원번호
               MOVE  XQJL4150-O-REGI-EMPID(WK-I)
                 TO  XDJL4150-O-REGI-EMPID(WK-I)

      *            등록직원명
               MOVE  XQJL4150-O-REGI-EMNM(WK-I)
                 TO  XDJL4150-O-REGI-EMNM(WK-I)

           END-PERFORM

           #USRLOG  "=================================================="
           #USRLOG  " DBSQL-SELECT-CNT : " DBSQL-SELECT-CNT
           #USRLOG  " XQJL4150-O-ACNO(100) : " XQJL4150-O-ACNO(100)
           #USRLOG  "=================================================="

           IF DBSQL-SELECT-CNT > CO-NUM-100
              MOVE XQJL4150-O-ACNO(100)
                TO WK-AF-ACNO
              #DSCNTR 2 WK-AF-KEY
           END-IF

           .
       S3100-QJL4150-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

      *@정상종료
           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
