      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4124 ( EAD포괄신용공여한도설정대상)
      *@처리유형  : DC
      *@처리개요  : EAD포괄신용공여한도설정대상
      *@구현방법  : OPEN-FETCH-CLOSE
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081215: 신규작성
      *김진태:20090707: 프로그램수정
      *김진태:20091128: 에러메세지정비
      *김진태:20091128: ARRAY 축소 3000 => 1000
      *김진태:20100212: 공통유틸리티경고리턴코드처리
      *백현정:20101120: EAD신규작성
      *백현정:20110128: ARRAY 증가 1000 => 2000
      *백현정:20110331:신용등급（개별／그룹），설정일，최고한도추가
      *백현정:20110603:채무자번호　입력값　추가
      *백현정:20110603:포괄신용공여한도（당초／최종），소진율변경
      * YBH    :20131010: TE일일배치작업　진행중이면
      *                  ＇진행중＇사용자　메세지　띄움
      * PJH    :20170215: KB-PIN 전환
      * PJH    :20170629: KB-PIN 전환（３차）
      * YBH    :20180405: 중단거래 추가
      * YBH    :20220324: 사용액 산출방법 변경
      * YBH    :20220324: 별도전결권 항목 추가
      *박정수:20230914:산업평가등급구분,한도승인권자구분 추가
      *박정수:20230523:역만기일 산출 방식 변경
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      ** CP차주관리한도기본       : THKJL0010            : R
      ** 그룹사기본               : THKJL0013            : R
      ** 채무자고객기본           : THKJL0015            : R
      ** 차주익스포져일실적       : THKJL0129            : R
      ** 부점기본                 : THKJIBR01            : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4124.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/15.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200220             PIC  X(008) VALUE 'B4200220'.
           03  CO-B4200231             PIC  X(008) VALUE 'B4200231'.
131010     03  CO-B3800083             PIC  X(008) VALUE 'B3800083'.
      *        전산업무담당자에게　문의하시기　바랍니다．
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4124'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.

           03  CO-MAX-CNT              PIC  9(005) VALUE 2000.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.
           03  CO-CHA-N                PIC  X(001) VALUE 'N'.
           03  CO-CHA-9999             PIC  X(004) VALUE '9999'.

131010     03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.
           03  CO-CHA-3                PIC  X(001) VALUE '3'.

131010 01  CO-CSTMSG.
      *사용자메시지
           03  CO-MSG1                 PIC  X(032) VALUE
           '토탈익스포져　작업　중입니다．'.
           03  CO-MSG4                 PIC  X(050) VALUE
           '잠시후　다시　조회하십시오．'.
           03  CO-SUBMSG               PIC  X(050) VALUE
           '토탈익스포져　조회　오류'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC S9(004) COMP.
           03  WK-CUR-CNT              PIC S9(004) COMP.
           03  WK-EXHS-RT              PIC  9(005)V9999.
      *조립　사용자　메세지
131010     03  WK-MSG                  PIC  X(100).
220324     03  WK-BASEYMD              PIC  X(008).

180405     03  WK-NEXT-KEY.
               05 WK-STUP-STUS         PIC  X(010).
               05 WK-CUST-IDNFR        PIC  X(010).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *부점명조회
       01  XCJIBR01-CA.
           COPY    XCJIBR01.
      *전체+설정+미설정
       01  XQJL1241-CA.
           COPY    XQJL1241.
131010*   토탈익스포져일일배치작업결과　조회
       01  XQJLI056-CA.
           COPY    XQJLI056.
220324* 만기일/역만기일 산출 Parameter
       01  XCJIIL03-CA.
           COPY    XCJIIL03.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
170629* DBIOV INTERFACE PARAMETER
           COPY    YCDBIOCA.
      * SQLIO INTERFACE PARAMETER
           COPY    YCDBSQLA.
      *-----------------------------------------------------------------01020022
      * TABLE ACCESS INTERFACE PARAMETER                                01030022
      * LIBRARY : KJL.DDB2.DBCOPY                                       01040022
      *-----------------------------------------------------------------00810000
      * DBIO ACCESS KEY관리                                           008200
170629*채무자고객기본　테이블(KEY)                                    009200
       01  TKJL0015-KEY.                                                00930000
           COPY  TKJL0015.                                              00940000
170629*채무자고객기본　테이블(RECORD)                                 009200
       01  TRJL0015-REC.                                                00960000
           COPY  TRJL0015.                                              00970000
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      * COMMON COPYBOOK
       01  YCCOMMON-CA.
           COPY  YCCOMMON.

      * DC COPYBOOK
       01  XDJL4124-CA.
           COPY  XDJL4124.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4124-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE WK-AREA
      *               SQLIO
                      YCDBSQLA-CA
170629                YCDBIOCA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE XDJL4124-OUT
                      XDJL4124-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@   처리구분                                                   01871007
           IF XDJL4124-I-PRCSS-DSTIC = CO-CHA-01                        01872007
              CONTINUE                                                  01874007
           ELSE                                                         01875007
      * 에러메세지 : 처리구분오류입니다．                           01876007
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01877007
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01878007
           END-IF                                                       01879007

      *@   부점코드                                                   01879207
           IF XDJL4124-I-BRNCD = SPACE                                  01879307
      * 에러메세지 : 필수항목미입력오류입니다．                     01879407
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01879507
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01879607
           END-IF                                                       01879707
                                                                        01879807
      *@   기준년월일                                                 01879207
           IF XDJL4124-I-BASE-YMD = SPACE                               01879307
      * 에러메세지 : 필수항목미입력오류입니다．                     01879407
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01879507
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01879607
           END-IF                                                       01879707

      *@   조회구분                                                   01879207
           IF XDJL4124-I-INQURY-DSTIC = SPACE                           01879307
      * 에러메세지 : 필수항목미입력오류입니다．                     01879407
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01879507
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01879607
           END-IF                                                       01879707
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

131010*@1 토탈익스포져일일배치작업결과　조회
      *@  진행중이면　＇진행중＇　사용자　메세지띄움
           PERFORM S3900-QJLI056-CALL-RTN
              THRU S3900-QJLI056-CALL-EXT

      *@0  차주명　추출
           IF XDJL4124-I-KB-PIN  NOT = SPACE
170629        PERFORM S3300-THKJL0015-SELECT-RTN
                 THRU S3300-THKJL0015-SELECT-EXT
           END-IF

      *@1     부점명조회
           IF XDJL4124-I-BRNCD = CO-CHA-9999
              MOVE '부점전체'
                TO XDJL4124-O-BRN-NAME
           ELSE
              PERFORM S3100-CJIBR01-CALL-RTN
                 THRU S3100-CJIBR01-CALL-EXT
           END-IF

220324*@   거래일 1개월전 날짜 구함
           PERFORM S3100-CJIIL03-CALL-RTN
              THRU S3100-CJIIL03-CALL-EXT

      *@3  프로세스처리
           PERFORM S3200-PROCESS-RTN
              THRU S3200-PROCESS-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
131010*@ 토탈익스포져일일배치작업결과　조회
      *-----------------------------------------------------------------
       S3900-QJLI056-CALL-RTN.

      *@1 초기화
           INITIALIZE    XQJLI056-IN

      *@1 입력파라미터 조립
      *@  처리내용:SQLIO(QJLI056)입력파라메타=
      *@   SET(그룹회사코드,토탈익스포져업무구분,배치작업완료여부)

      *    그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJLI056-I-GROUP-CO-CD

      *    토탈익스포져업무구분
           MOVE CO-CHA-1
             TO XQJLI056-I-TE-BZWK-DSTCD

      *    배치작업완료여부
           MOVE CO-CHA-1
             TO XQJLI056-I-BTCH-FNSH-YN

      *@1  SLQIO프로그램 호출
      *@  처리내용:QJLI056프로그램을 호출한다
      *@  관련테이블:THKJLLOG1 접근유형:READ
           #DYSQLA QJLI056 XQJLI056-CA

      *@1 호출결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
                    IF XQJLI056-O-BTCH-FNSH-YN = CO-CHA-0
      *#2정상이지만 배치가 종료되기 전이면
      *@2             NOT FOUND로 처리
      *               잠시후　거래메세지
                       STRING CO-MSG1
                              CO-MSG4
                       DELIMITED BY SIZE INTO  WK-MSG

      *               사용자　메세지　에러　발생
                       #CSTMSG WK-MSG       CO-SUBMSG
      *@2원장FOUND인경우
      *@토탈익스포져일일배치작업결과（진행중）이면　사용자메세지띄움
      *@에러메세지 : 지정된　처리작업이　가능하지　않습니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                       #ERROR CO-B3800083 CO-UKJL0036 CO-STAT-ERROR
                    END-IF
               WHEN COND-DBSQL-MRNF
      *#2원장NOT FOUND인경우
      *           잠시후　거래메세지
                   STRING CO-MSG1
                          CO-MSG4
                   DELIMITED BY SIZE INTO  WK-MSG

      *           사용자　메세지　에러　발생
                   #CSTMSG WK-MSG       CO-SUBMSG
      *@2토탈익스포져일일배치작업결과（진행중）이면　사용자메세지띄움
      *@에러메세지 : 지정된　처리작업이　가능하지　않습니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3800083 CO-UKJL0036 CO-STAT-ERROR
               WHEN OTHER
      *#2원장조회에러인경우
      *@2에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .

       S3900-QJLI056-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  부점명을조회한다
      *-----------------------------------------------------------------
       S3100-CJIBR01-CALL-RTN.

      *@1.1 초기화
           INITIALIZE XCJIBR01-IN

      *@1.2 변수 MOVE
           MOVE BICOM-GROUP-CO-CD
             TO XCJIBR01-I-GROUP-CO-CD
           MOVE XDJL4124-I-BRNCD
             TO XCJIBR01-I-BRNCD
           MOVE BICOM-TRAN-BASE-YMD
             TO XCJIBR01-I-YMD

      *@1.3 프로그램호출
           #DYCALL CJIBR01 YCCOMMON-CA XCJIBR01-CA

      *@1.4 호출결과확인
      *@  호출결과가경고인경우도정상처리한다
      *@  폐쇠점인경우리턴코드０７（경고）
           IF COND-XCJIBR01-OK OR COND-XCJIBR01-WARN
               MOVE XCJIBR01-O-BRN-HANGL-NAME
                 TO XDJL4124-O-BRN-NAME
           ELSE
               #ERROR XCJIBR01-R-ERRCD
                      XCJIBR01-R-TREAT-CD
                      XCJIBR01-R-STAT
           END-IF
           .
       S3100-CJIBR01-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
220324*@  만기일/역만기일 산출(거래일 1개월전 날짜 구함)
      *-----------------------------------------------------------------
       S3100-CJIIL03-CALL-RTN.

           INITIALIZE     XCJIIL03-IN

      *    그룹회사코드
           MOVE  BICOM-GROUP-CO-CD
             TO  XCJIIL03-I-GROUP-CO-CD
      *    구분코드
           MOVE  '4'
             TO  XCJIIL03-I-DSTCD
      *    년월일
           MOVE  JICOM-BF-BZOPR-YMD
            TO   XCJIIL03-I-YMD
      *    일수/월수
           MOVE  1
             TO  XCJIIL03-I-NODAY-NOMN

      *@1 공통 UTILITY CALL
           #DYCALL     CJIIL03  YCCOMMON-CA  XCJIIL03-CA

      *@1 RETURN 정보 확인
           IF  XCJIIL03-R-STAT    =  ZEROS
      *        거래일 1개월전 날짜
               MOVE  XCJIIL03-O-YMD
                 TO  WK-BASEYMD
           ELSE
               #ERROR XCJIIL03-R-ERRCD
                      XCJIIL03-R-TREAT-CD
                      XCJIIL03-R-STAT
           END-IF
           .

       S3100-CJIIL03-CALL-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 포괄한도설정대상조회
      *-----------------------------------------------------------------
       S3200-PROCESS-RTN.

      *@   조회구분 1 - 전체, 2 - 설정, 3 - 미설정
      *@   SQLIO SELECT
           PERFORM S3210-XQJL1241-SELECT-RTN
              THRU S3210-XQJL1241-SELECT-EXT

           MOVE WK-CUR-CNT
             TO XDJL4124-O-OUTPT-LINE-CNT1
           .
       S3200-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@   SELECT
      *-----------------------------------------------------------------
       S3210-XQJL1241-SELECT-RTN.

      *@   초기화
           INITIALIZE XQJL1241-IN

      *@   변수 MOVE
220324*@   월말구분(1:일,2:월)
           IF WK-BASEYMD < XDJL4124-I-BASE-YMD
               MOVE '1'
                 TO XQJL1241-I-ENMN-DSTIC
           ELSE
               MOVE '2'
                 TO XQJL1241-I-ENMN-DSTIC
           END-IF

      *@  그룹회사구분코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL1241-I-GROUP-CO-CD

      *@   기준년월일
           MOVE XDJL4124-I-BASE-YMD
             TO XQJL1241-I-BASE-YMD

220324*@   KB-PIN
           IF XDJL4124-I-KB-PIN = SPACE
               MOVE ALL '%'
                 TO XQJL1241-I-KB-PIN
           ELSE
               MOVE XDJL4124-I-KB-PIN
                 TO XQJL1241-I-KB-PIN
           END-IF

      *@   부점코드
           IF XDJL4124-I-BRNCD = CO-CHA-9999
               MOVE SPACES
                 TO XQJL1241-I-BRNCD1
               MOVE XDJL4124-I-BRNCD
                 TO XQJL1241-I-BRNCD2
           ELSE
               MOVE XDJL4124-I-BRNCD
                 TO XQJL1241-I-BRNCD1
               MOVE XDJL4124-I-BRNCD
                 TO XQJL1241-I-BRNCD2
           END-IF

220324*    조회구분
           MOVE XDJL4124-I-INQURY-DSTIC
             TO XQJL1241-I-INQURY-DSTIC

           IF BICOM-DSCN-TRAN-DSTCD = '1' OR '2'
180405*        중단키
               MOVE BOCOM-BF-TDK-INFO-CTNT
                 TO WK-NEXT-KEY
      *        설정상태
               MOVE WK-STUP-STUS
                 TO XQJL1241-I-STUP-STUS
      *        고객식별자
               MOVE WK-CUST-IDNFR
                 TO XQJL1241-I-CUST-IDNFR
           END-IF

      *@   SQLIO SELECT
           #DYSQLA QJL1241 SELECT XQJL1241-CA

      *@   결과확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
180405*@            출력파라미터 조립
                    PERFORM S3221-OUTPUT-SET-RTN
                       THRU S3221-OUTPUT-SET-EXT
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@원장오픈에러인경우
      *@에러메세지 : 테이블 OPEN 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3210-XQJL1241-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@ 출력파라미터 SET
      *-----------------------------------------------------------------
       S3221-OUTPUT-SET-RTN.

      *@   OUTPUT DATA PUT LOOP
           PERFORM VARYING WK-I FROM 1 BY 1
                   UNTIL WK-I > DBSQL-SELECT-CNT
180405                OR WK-I > 100

               ADD 1 TO WK-CUR-CNT

      *@       부점코드
               MOVE XQJL1241-O-BRNCD(WK-I)
                 TO XDJL4124-O-BRNCD(WK-CUR-CNT)

      *@       부점명
               MOVE XQJL1241-O-BRN-NAME(WK-I)
                 TO XDJL4124-O-BRN-NAME1(WK-CUR-CNT)

      *@       차주번호
               MOVE XQJL1241-O-CUST-IDNFR(WK-I)
                 TO XDJL4124-O-BRWR-NO(WK-CUR-CNT)

      *@       차주명
               MOVE XQJL1241-O-BRWR-NAME(WK-I)
                 TO XDJL4124-O-BRWR-NAME(WK-CUR-CNT)

      *@       그룹명
               MOVE XQJL1241-O-GROUP-NAME(WK-I)
                 TO XDJL4124-O-GROUP-NAME(WK-CUR-CNT)

      *@       신용등급（신청시）
               MOVE XQJL1241-O-CRDRAT1(WK-I)
                 TO XDJL4124-O-CRDRAT1(WK-CUR-CNT)

      *@       신용등급（최근）
               MOVE XQJL1241-O-CRDRAT2(WK-I)
                 TO XDJL4124-O-CRDRAT2(WK-CUR-CNT)

      *@       그룹등급（신청시）
               MOVE XQJL1241-O-GROUP-GRD1(WK-I)
                 TO XDJL4124-O-GROUP-GRD1(WK-CUR-CNT)

      *@       그룹등급（최근）
               MOVE XQJL1241-O-GROUP-GRD2(WK-I)
                 TO XDJL4124-O-GROUP-GRD2(WK-CUR-CNT)

230914*@       산업평가등급구분(신청시)
               MOVE XQJL1241-O-IDSTRY-V-GRD-DSTCD1(WK-I)
                 TO XDJL4124-O-IDSTRY-V-GRD-DSTCD1(WK-CUR-CNT)

230914*@       산업평가등급구분(최근)
               MOVE XQJL1241-O-IDSTRY-V-GRD-DSTCD2(WK-I)
                 TO XDJL4124-O-IDSTRY-V-GRD-DSTCD2(WK-CUR-CNT)

      *@       관리한도설정년월일
               MOVE XQJL1241-O-MGT-LIMT-STUP-YMD(WK-I)
                 TO XDJL4124-O-MGT-LIMT-APLCN-YMD(WK-CUR-CNT)

      *@       설정상태
               MOVE XQJL1241-O-STUP-STUS(WK-I)
                 TO XDJL4124-O-STUP-STUS(WK-CUR-CNT)

230914*@       한도승인권자구분
               MOVE XQJL1241-O-LIMT-ATRZ-DSTCD(WK-I)
                 TO XDJL4124-O-LIMT-ATRZ-DSTCD(WK-CUR-CNT)

      *@       관리한도유효년월일
               MOVE XQJL1241-O-MGT-LIMT-VALD-YMD(WK-I)
                 TO XDJL4124-O-MGT-LIMT-VALD-YMD(WK-CUR-CNT)

220324*    포괄신용관리한도가 0이 아니면(설정상태:설정)이면
               IF XQJL1241-O-INLS-LIMT(WK-I) NOT = ZERO
      *@           여신성자산최고한도＝여신성한도－간접익스포져
                   COMPUTE XDJL4124-O-LNBZ-IA-HGST-LIMT(WK-CUR-CNT)
                         = FUNCTION MAX(
                           XQJL1241-O-LNBZ-IA-HGST-LIMT(WK-I) / 1000000,
                           0)

      *@           포괄한도
                   COMPUTE XDJL4124-O-INLS-LIMT(WK-CUR-CNT)
                         = XQJL1241-O-INLS-LIMT(WK-I) / 1000000

      *@           2011.06.03추가
      *@          최종포괄한도= MIN(여신성최고한도,포괄한도)
                   COMPUTE XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT)
                         = FUNCTION MAX(
                           FUNCTION MIN(
                           XDJL4124-O-LNBZ-IA-HGST-LIMT(WK-CUR-CNT),
                           XDJL4124-O-INLS-LIMT(WK-CUR-CNT)), 0)

220324*@       기사용액= MIN(사용액, 최종적용 포괄신용공여한도)
                   COMPUTE XDJL4124-O-PRVIUS-AMUS(WK-CUR-CNT)
                         = FUNCTION MAX(
                           FUNCTION MIN(
                           XQJL1241-O-PRVIUS-AMUS(WK-I) / 1000000,
                           XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT)), 0)

      *@           2011.06.03변경
      *@          소진율=최종포괄한도로　소진율　계산으로　변경
                   INITIALIZE WK-EXHS-RT

                   IF XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT) > 0
                       COMPUTE WK-EXHS-RT
                             = XDJL4124-O-PRVIUS-AMUS(WK-CUR-CNT) /
                               XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT)

                       COMPUTE XDJL4124-O-EXHS-RT(WK-CUR-CNT)
                             = FUNCTION MAX(
                               FUNCTION MIN(
                               WK-EXHS-RT * 100, 999.99), 0)
      *@           그렇지않은경우　０으로　산출
                   ELSE
                       MOVE ZERO
                         TO XDJL4124-O-EXHS-RT(WK-CUR-CNT)
                   END-IF

220324*           별도전결권적용소진율
                   INITIALIZE WK-EXHS-RT

                   IF XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT) > 0
                       COMPUTE WK-EXHS-RT
                             = (XQJL1241-O-SEPA-DAR-APLY-AMT(WK-I)
                             /  1000000)
                             / XDJL4124-O-LAST-INLS-LIMT(WK-CUR-CNT)

                       COMPUTE XDJL4124-O-SEPA-D-APLY-EXHS-RT
                               (WK-CUR-CNT)
                             = FUNCTION MAX(
                               FUNCTION MIN(
                               WK-EXHS-RT * 100, 999.99), 0)
      *@           그렇지않은경우　０으로　산출
                   ELSE
                       MOVE ZERO
                         TO XDJL4124-O-SEPA-D-APLY-EXHS-RT(WK-CUR-CNT)
                   END-IF

               END-IF

211001*            점검승인년월일
               MOVE XQJL1241-O-CHKUP-ATHOR-YMD(WK-I)
                 TO XDJL4124-O-CHKUP-ATHOR-YMD(WK-CUR-CNT)

           END-PERFORM

180405     IF  DBSQL-SELECT-CNT > 100
      *        설정상태
               MOVE  XQJL1241-O-STUP-STUS(WK-I)
                 TO  WK-STUP-STUS
      *        고객식별자
               MOVE  XQJL1241-O-CUST-IDNFR(WK-I)
                 TO  WK-CUST-IDNFR

               #DSCNTR 2 WK-NEXT-KEY
           END-IF
           .

       S3221-OUTPUT-SET-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  채무자명추출
      *-----------------------------------------------------------------
       S3300-THKJL0015-SELECT-RTN.

      *@초기화　　　　                                                025534
           INITIALIZE TKJL0015-KEY                                      02541109
                      TRJL0015-REC                                      02541209
      *@   그룹회사코드                                               025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0015-PK-GROUP-CO-CD                                  02541609
      *@   고객식별자                                                 025417
           MOVE XDJL4124-I-KB-PIN
             TO KJL0015-PK-CUST-IDNFR                                   02541909

           #DYDBIO SELECT-CMD-Y TKJL0015-PK TRJL0015-REC                02542409

           EVALUATE TRUE                                                02542609
               WHEN COND-DBIO-OK                                        02542709
                    MOVE RJL0015-DBTRZ-NAME                             02610022
                      TO XDJL4124-O-BRWR-NAME1                          02620022
               WHEN COND-DBIO-MRNF                                      02543009
                    CONTINUE
               WHEN OTHER                                               02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   0254
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               0254
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709
           .
       S3300-THKJL0015-SELECT-EXT.
           EXIT.                                                        02543809

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@3 종료처리

      *@3.1 프로그램 종료
      *@처리내용 : 프로그램을 정상 종료 함

           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
