      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4116 ( EAD그룹등급별익스포져현황조회)
      *@처리유형  : DC
      *@처리개요  : EAD개별그룹Total Exposure현황조회
      *@구현방법  : SQL ARRAY
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081207: 신규작성
      *김진태:20090325: 프로그램수정
      *김진태:20090626: 프로그램수정
      *김진태:20091208: 에러메세지정비
      *백현정:20101020:  EAD신규작성
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  그룹관리한도기본        : THKJL0012            : R
      **  그룹사기본              : THKJL0013            : R
      **  그룹익스포져일집계      : THKJL0035            : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4116.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/07.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.

      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900002             PIC  X(008) VALUE 'B3900002'.
           03  CO-B4200223             PIC  X(008) VALUE 'B4200223'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4116'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.

           03  CO-SUM                  PIC  X(006) VALUE '합계'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
           03  WK-EXHS-RT              PIC  9(005)V9999.
           03  WK-SUM-EXHS-RT          PIC  9(005)V9999.
           03  WK-SUM.
               05 WK-TAGET-GROUP-CNT   PIC  9(015).
               05 WK-MGT-CLAM          PIC  9(015).
               05 WK-TTL-AMT-BASE-CLAM PIC  9(015).
               05 WK-TTL-AMT-BASE-BAL  PIC  9(015).
               05 WK-TE-LIMT-AUC       PIC  9(015).
               05 WK-TE-BAL-AUC        PIC  9(015).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO COPYBOOK
       01  XQJL1161-CA.
           COPY    XQJL1161.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO INTERFACE PARAMETER
           COPY    YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    공통 AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    DC COPYBOOK AREA
       01  XDJL4116-CA.
           COPY  XDJL4116.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4116-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE       WK-AREA
                            YCDBSQLA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE       XDJL4116-OUT
                            XDJL4116-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

           IF XDJL4116-I-PRCSS-DSTIC NOT = CO-CHA-01
      * 에러메세지 : 처리구분오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@   1 DC필수입력파라미터 검증
      *@   1.2 기준년월체크
      *@   실행조건 : 입력.기준년월=SPACE
      *@   처리내용 : 에러처리
           IF XDJL4116-I-BASE-YMD = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@1  그룹등급별TE현황조회
           PERFORM S3100-QJL1161-CALL-RTN
              THRU S3100-QJL1161-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@ 그룹등급별TE현황조회
      *-----------------------------------------------------------------
       S3100-QJL1161-CALL-RTN.

      *@    변수초기화
           INITIALIZE XQJL1161-IN

      *@    변수 MOVE
      *    그룹회사코드                                               01860024
           MOVE BICOM-GROUP-CO-CD                                       01870024
             TO XQJL1161-I-GROUP-CO-CD                                  01880024
      *    기준년월일                                                 01940024
           MOVE XDJL4116-I-BASE-YMD                                     01950024
             TO XQJL1161-I-BASE-YMD                                     01960024
      *    계열기업순위１                                             01940024
           MOVE XDJL4116-I-AFFLT-CORP-RANKG1                            01950024
             TO XQJL1161-I-AFFLT-CORP-RANKG1                            01960024
      *    계열기업순위２                                             01940024
           MOVE XDJL4116-I-AFFLT-CORP-RANKG2                            01950024
             TO XQJL1161-I-AFFLT-CORP-RANKG2                            01960024

      *@   프로그램　호출
           #DYSQLA QJL1161 XQJL1161-CA

      *@   호출결과　확인
           EVALUATE TRUE
               WHEN COND-DBSQL-OK
               WHEN COND-DBSQL-MRNF
                    CONTINUE
               WHEN OTHER
      *@테이블조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B4200223 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@   출력변수 MOVE

      *@   출력건수                                                   02660024
           MOVE DBSQL-SELECT-CNT                                        02670024
             TO XDJL4116-O-OUTPT-LINE-CNT1                              02680024

           PERFORM VARYING WK-I FROM 1 BY 1                             02730024
             UNTIL WK-I > XDJL4116-O-OUTPT-LINE-CNT1                    02740024
      *@       그룹신용등급
               MOVE XQJL1161-O-CMGR-CRTDSCD(WK-I)
                 TO XDJL4116-O-INTNL-CV-GRD-DSTCD(WK-I)
      *@       대상그룹수
               MOVE XQJL1161-O-TAGET-GROUP-CNT(WK-I)
                 TO XDJL4116-O-TAGET-GROUP-CNT(WK-I)
      *@       그룹관리한도
               COMPUTE XDJL4116-O-MGT-CLAM(WK-I)
                     = XQJL1161-O-MGT-CLAM(WK-I) / 1000000
      *@       명목액기준한도
               COMPUTE XDJL4116-O-TTL-AMT-BASE-CLAM(WK-I)
                     = XQJL1161-O-TTL-AMT-BASE-CLAM(WK-I) / 1000000
      *@       명목액기준잔액
               COMPUTE XDJL4116-O-TTL-AMT-BASE-BAL(WK-I)
                     = XQJL1161-O-TTL-AMT-BASE-BAL(WK-I) / 1000000
      *@       한도기준TE
               COMPUTE XDJL4116-O-TE-LIMT-AUC(WK-I)
                     = XQJL1161-O-TE-LIMT-AUC(WK-I) / 1000000
      *@       잔액기준TE
               COMPUTE XDJL4116-O-TE-BAL-AUC(WK-I)
                     = XQJL1161-O-TE-BAL-AUC(WK-I) / 1000000
      *@       소진율
      *@       그룹관리한도가　０보다　크면　산출
               IF XDJL4116-O-MGT-CLAM(WK-I) > 0
                  COMPUTE WK-EXHS-RT
                        = XDJL4116-O-TE-LIMT-AUC(WK-I) /
                          XDJL4116-O-MGT-CLAM(WK-I)
                  COMPUTE XDJL4116-O-EXHS-RT(WK-I)
                        = WK-EXHS-RT * 100
      *@       그렇지않은경우　０으로　산출
               ELSE
                  MOVE ZERO
                    TO XDJL4116-O-EXHS-RT(WK-I)
               END-IF

      *@합계처리
      *@       대상그룹수
               ADD XDJL4116-O-TAGET-GROUP-CNT(WK-I)
                TO WK-TAGET-GROUP-CNT
      *@       그룹관리한도
               ADD XDJL4116-O-MGT-CLAM(WK-I)
                TO WK-MGT-CLAM
      *@       명목기준한도
               ADD XDJL4116-O-TTL-AMT-BASE-CLAM(WK-I)
                TO WK-TTL-AMT-BASE-CLAM
      *@       명목기준잔액
               ADD XDJL4116-O-TTL-AMT-BASE-BAL(WK-I)
                TO WK-TTL-AMT-BASE-BAL
      *@       한도기준TE
               ADD XDJL4116-O-TE-LIMT-AUC(WK-I)
                TO WK-TE-LIMT-AUC
      *@       잔액기준TE
               ADD XDJL4116-O-TE-BAL-AUC(WK-I)
                TO WK-TE-BAL-AUC
           END-PERFORM

           IF DBSQL-SELECT-CNT > ZEROS
      *@      총건수
              MOVE WK-I
                TO XDJL4116-O-OUTPT-LINE-CNT1
      *@      그룹신용등급
              MOVE CO-SUM
                TO XDJL4116-O-INTNL-CV-GRD-DSTCD(WK-I)
      *@      대상그룹수
              MOVE WK-TAGET-GROUP-CNT
                TO XDJL4116-O-TAGET-GROUP-CNT(WK-I)
      *@      그룹관리한도
              MOVE WK-MGT-CLAM
                TO XDJL4116-O-MGT-CLAM(WK-I)
      *@      명목액기준한도
              MOVE WK-TTL-AMT-BASE-CLAM
                TO XDJL4116-O-TTL-AMT-BASE-CLAM(WK-I)
      *@      명목액기준잔액
              MOVE WK-TTL-AMT-BASE-BAL
                TO XDJL4116-O-TTL-AMT-BASE-BAL(WK-I)
      *@      한도기준TE
              MOVE WK-TE-LIMT-AUC
                TO XDJL4116-O-TE-LIMT-AUC(WK-I)
      *@      잔액기준TE
              MOVE WK-TE-BAL-AUC
                TO XDJL4116-O-TE-BAL-AUC(WK-I)
      *@      소진율
      *@       그룹관리한도가　０보다　크면　산출
               IF XDJL4116-O-MGT-CLAM(WK-I) > 0
                  COMPUTE WK-SUM-EXHS-RT
                        = XDJL4116-O-TE-LIMT-AUC(WK-I) /
                          XDJL4116-O-MGT-CLAM(WK-I)
                  COMPUTE XDJL4116-O-EXHS-RT(WK-I)
                        = WK-SUM-EXHS-RT * 100
      *@       그렇지않은경우　０으로　산출
               ELSE
                  MOVE ZERO
                    TO XDJL4116-O-EXHS-RT(WK-I)
               END-IF
           END-IF
           .
       S3100-QJL1161-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@3 종료처리

      *@3.1 프로그램 종료
      *@처리내용 : 프로그램을 정상 종료 함

           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
