      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: DJL4034 (DC동일인신용공여조회)                  00030001
      *@처리유형  : DC                                                00040001
      *@처리개요  : 동일기업에 대한 신용공여한도, 신용공여금  00050001
      *@            : 액, 한도여유금액을 조회할 수 있는 프  00060001
      *@            : 로그램이다                                      00070001
      *@구현방법  : SQL ARRAY(300)                                    00071005
      *-----------------------------------------------------------------00080001
      *                 P R O G R A M   변　경　이　력                00090001
      *-----------------------------------------------------------------00100001
      *@성명 : 일자 : 변　경　내　용                              00110001
      * ----------------------------------------------------------------00120001
      *이동구:20090109: 신규작성                                    00130001
      *김진태:20090325: 프로그램수정                                00131005
      *김진태:20091208: 에러메세지정비                              00131005
      *김진태:20091208: DBIO => SQLIO(QJLZ001) 변경                 00131005
170201*박주희:20170201: KB-PIN 전환（２차）　　　　                 00131005
170629*박주희:20170629: KB-PIN 전환（３차）　　　　                 00131005
      *=================================================================00140001
      ******************************************************************00141005
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00143005
      **  ------------------------- ------------------------------------00144005
      **  상품코드목록            : THKJL0018            : R          00145005
      **  차주익스포져월집계      : THKJL0034            : R          00146005
      **  TE자기자본기본          : THKJL0049            : R          00147005
      **  채무자고객기본          : THKJL0015            : R          00148005
      ******************************************************************00149605
       IDENTIFICATION                  DIVISION.                        00220001
      *=================================================================00230001
       PROGRAM-ID.                     DJL4034.                         00240001
       AUTHOR.                         이동구.                        00250001
       DATE-WRITTEN.                   09/01/09.                        00260001
      *=================================================================00280001
       ENVIRONMENT                     DIVISION.                        00290001
      *=================================================================00300001
       CONFIGURATION                   SECTION.                         00310001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00330001
       DATA                            DIVISION.                        00340001
      *=================================================================00350001
       WORKING-STORAGE                 SECTION.                         00360001
      *-----------------------------------------------------------------00380001
      *CONSTANT ERROR AREA                                              00390001
      *-----------------------------------------------------------------00400001
       01  CO-ERROR-AREA.                                               00401005
      *에러메시지정의                                                 00402005
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00403005
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00404005
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00405005
      *조치메시지정의                                                 00406005
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00407005
      *-----------------------------------------------------------------00450001
      * CONSTANT AREA                                                   00460001
      *-----------------------------------------------------------------00470001
       01  CO-AREA.                                                     00480001
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4034'.     00490001
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00500001
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00510001
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00520001
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00530001
                                                                        00540001
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00580001
      *-----------------------------------------------------------------00640001
      * WORKING AREA                                                    00650001
      *-----------------------------------------------------------------00660001
       01  WK-AREA.                                                     00670001
           03  WK-I                    PIC  9(005) COMP.                00680005
      *-----------------------------------------------------------------00820001
      * PGM INTERFACE PARAMETER                                         00830001
      *-----------------------------------------------------------------00840001
      *동일인신용공여헤더조회                                         00880001
       01  XQJL0341-CA.                                                 00890001
           COPY  XQJL0341.                                              00900001
      *동일인신용공여조회                                             00910001
       01  XQJL0342-CA.                                                 00920001
           COPY  XQJL0342.                                              00930001
      *-----------------------------------------------------------------00980001
      * DBIO SQLIO INTERFACE PARAMETER                                  00990001
      *-----------------------------------------------------------------01000001
      * DBIO
           COPY  YCDBIOCA.                                              01020001
      * SQLIO
           COPY  YCDBSQLA.                                              01020001
      *-----------------------------------------------------------------01021005
      * TABLE ACCESS INTERFACE PARAMETER                                01022005
      * LIBRARY : KJL.DDB2.DBCOPY                                       01023005
      *-----------------------------------------------------------------00810000
      * DBIO ACCESS KEY관리                                           008200
170626*채무자고객기본　테이블(KEY)                                    009200
       01  TKJL0015-KEY.                                                00930000
           COPY  TKJL0015.                                              00940000
170626*채무자고객기본　테이블(RECORD)                                 009200
       01  TRJL0015-REC.                                                00960000
           COPY  TRJL0015.                                              00970000
      *-----------------------------------------------------------------01024005
      * DBIO ACCESS KEY관리                                           01025005
      *-----------------------------------------------------------------01026005
      *-----------------------------------------------------------------01040001
       LINKAGE                         SECTION.                         01050001
      *-----------------------------------------------------------------01060001
      * COMMON COPYBOOK
       01  YCCOMMON-CA.                                                 01070001
           COPY  YCCOMMON.                                              01080001
                                                                        01090001
      * DC COPYBOOK
       01  XDJL4034-CA.                                                 01100001
           COPY  XDJL4034.                                              01110001
      *=================================================================01130001
       PROCEDURE                       DIVISION                         01140001
                                       USING       YCCOMMON-CA          01150001
                                                   XDJL4034-CA          01160001
                                                   .                    01170001
      *=================================================================01180001
                                                                        01190001
      *-----------------------------------------------------------------01200001
      *@  처리메인                                                    01210001
      *-----------------------------------------------------------------01220001
       S0000-MAIN-RTN.                                                  01230001
                                                                        01240001
      *@  초기화                                                      01250001
           PERFORM  S1000-INITIALIZE-RTN                                01260001
              THRU  S1000-INITIALIZE-EXT                                01270001
                                                                        01280001
      *@  입력값　CHECK                                               01290001
           PERFORM  S2000-VALIDATION-RTN                                01300001
              THRU  S2000-VALIDATION-EXT                                01310001
                                                                        01320001
      *@  업무처리                                                    01330001
           PERFORM  S3000-PROCESS-RTN                                   01340001
              THRU  S3000-PROCESS-EXT                                   01350001
                                                                        01360001
      *@  처리종료                                                    01410001
           PERFORM  S9000-FINAL-RTN                                     01420001
              THRU  S9000-FINAL-EXT                                     01430001
           .                                                            01440001
       S0000-MAIN-EXT.                                                  01460001
           EXIT.                                                        01470001
      *-----------------------------------------------------------------01480001
      *@  초기화                                                      01490001
      *-----------------------------------------------------------------01500001
       S1000-INITIALIZE-RTN.                                            01510001
                                                                        01520001
      *@   WK-AREA 및　프로그램파라미터　초기화                       01530001
           INITIALIZE WK-AREA                                           01540001
      *               SQLIO
                      YCDBSQLA-CA                                       01560002
                      YCDBIOCA-CA                                       01560002
                                                                        01610001
      *@  출력영역　및　결과코드　초기화                              01620001
           INITIALIZE XDJL4034-OUT                                      01630001
                      XDJL4034-RETURN                                   01640001
           .                                                            01650001
       S1000-INITIALIZE-EXT.                                            01670001
           EXIT.                                                        01680001
      *-----------------------------------------------------------------01690001
      *@  입력값검증                                                  01700001
      *-----------------------------------------------------------------01710001
       S2000-VALIDATION-RTN.                                            01720001
                                                                        01720105
      *@   처리구분                                                   01721005
           IF XDJL4034-I-PRCSS-DSTIC = CO-CHA-01                        01722005
              CONTINUE                                                  01724005
           ELSE                                                         01725005
      * 에러메세지 : 처리구분오류입니다．                           01726005
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01727005
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01728005
           END-IF                                                       01729005
                                                                        01729105
      *@   채무자번호                                                 01729205
           IF XDJL4034-I-BRWR-NO = SPACE                                01729305
      * 에러메세지 : 필수항목미입력오류입니다．                     01729405
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01729505
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01729605
           END-IF                                                       01729705
                                                                        01729805
      *@   기준년월                                                   01729905
           IF XDJL4034-I-BASE-YM = SPACE                                01730005
      * 에러메세지 : 필수항목미입력오류입니다．                     01730105
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01730205
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01730305
           END-IF                                                       01730405
           .                                                            01850001
       S2000-VALIDATION-EXT.                                            01870001
           EXIT.                                                        01880001
      *-----------------------------------------------------------------01890001
      *@  업무처리                                                    01900001
      *-----------------------------------------------------------------01910001
       S3000-PROCESS-RTN.                                               01920001
                                                                        01920105
      *@1  차주명　추출                                               01921005
170626     PERFORM S3100-THKJL0015-SELECT-RTN                           02072007
              THRU S3100-THKJL0015-SELECT-EXT                           02073007
                                                                        01923105
      *@2  현재설정현황　추출                                         01924005
           PERFORM S3200-QJL0341-CALL-RTN                               01925007
              THRU S3200-QJL0341-CALL-EXT                               01926007
                                                                        01926106
      *@3  동일인신용공여조회                                         01927006
           PERFORM S3300-QJL0342-CALL-RTN                               01928007
              THRU S3300-QJL0342-CALL-EXT                               01929007
           .                                                            02000001
       S3000-PROCESS-EXT.                                               02020001
           EXIT.                                                        02030001
      *-----------------------------------------------------------------
      *@  채무자명추출
      *-----------------------------------------------------------------
       S3100-THKJL0015-SELECT-RTN.

      *@초기화　　　　                                                025534
           INITIALIZE TKJL0015-KEY                                      02541109
                      TRJL0015-REC                                      02541209
      *@   그룹회사코드                                               025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0015-PK-GROUP-CO-CD                                  02541609
      *@   고객식별자                                                 025417
           MOVE XDJL4034-I-BRWR-NO                                      02541809
             TO KJL0015-PK-CUST-IDNFR                                   02541909

           #DYDBIO SELECT-CMD-Y TKJL0015-PK TRJL0015-REC                02542409

           EVALUATE TRUE                                                02542609
               WHEN COND-DBIO-OK                                        02542709
                    MOVE RJL0015-DBTRZ-NAME                             02610022
                      TO XDJL4034-O-DBTRZ-NAME                          02620022
               WHEN COND-DBIO-MRNF                                      02543009
                    CONTINUE
               WHEN OTHER                                               02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   0254
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               0254
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709
           .
       S3100-THKJL0015-SELECT-EXT.
           EXIT.                                                        02543809
      *-----------------------------------------------------------------02040705
      *@  현재설정현황　추출                                          02040805
      *-----------------------------------------------------------------02040905
       S3200-QJL0341-CALL-RTN.                                          02041005
                                                                        02041105
      *@2.1 변수초기화                                                02041205
           INITIALIZE XQJL0341-IN                                       02041305
      *@2.2 호출변수 MOVE                                             02041405
      *@   그룹회사코드                                               02041805
           MOVE BICOM-GROUP-CO-CD                                       02041905
             TO XQJL0341-I-GROUP-CO-CD                                  02042005
      *@   기준년월                                                   02042105
           MOVE XDJL4034-I-BASE-YM                                      02042205
             TO XQJL0341-I-BASE-YM                                      02042305
170201*@   고객식별자                                                 02042405
170629     MOVE XDJL4034-I-BRWR-NO                                      02042505
             TO XQJL0341-I-KB-PIN                                       02042605
      *@2.3 프로그램 호출                                           02042705
           #DYSQLA QJL0341 XQJL0341-CA                                  02042805
      *@2.4 호출결과확인                                              02042905
           IF COND-DBSQL-OK OR COND-DBSQL-MRNF                          02043005
              CONTINUE                                                  02043105
           ELSE                                                         02043205
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02043305
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02043405
              #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR              02043505
           END-IF                                                       02043605
      *@2.5 출력변수 MOVE                                             02043705
      *@신용공여한도                                                  02043805
           COMPUTE XDJL4034-O-GRCR-LIMT                                 02043906
                 = XQJL0341-O-GRCR-LIMT / 1000000                       02044006
      *@신용공여잔액                                                  02044305
           COMPUTE XDJL4034-O-GRCR-BAL                                  02044406
                 = XQJL0341-O-GRCR-BAL / 1000000                        02044506
      *@한도여유액                                                    02044805
           COMPUTE XDJL4034-O-LIMT-SEXTR-AMT                            02044906
                 = XQJL0341-O-LIMT-SEXTR-AMT / 1000000                  02045006
      *@업무규제자기자본                                              02045305
           COMPUTE XDJL4034-O-BZWK-REGUL-ONCP                           02045406
                 = XQJL0341-O-BZWK-REGUL-ONCP / 1000000                 02045506
      *@자기자본기준년월                                              02045805
           MOVE XQJL0341-O-ONCP-BASE-YM                                 02045905
             TO XDJL4034-O-ONCP-BASE-YM                                 02046005
           .                                                            02046105
       S3200-QJL0341-CALL-EXT.                                          02046205
           EXIT.                                                        02046305
      *-----------------------------------------------------------------02046406
      *@ 동일인신용공여조회                                           02046506
      *-----------------------------------------------------------------02046606
       S3300-QJL0342-CALL-RTN.                                          02046706
                                                                        02046806
      *@3.1 변수초기화                                                02046906
           INITIALIZE XQJL0342-IN                                       02047006
                                                                        02047106
      *@3.2 변수 MOVE                                                 02047206
      *@   그룹회사코드                                               02047306
           MOVE BICOM-GROUP-CO-CD                                       02047406
             TO XQJL0342-I-GROUP-CO-CD                                  02047506
      *@   기준년월                                                   02047606
           MOVE XDJL4034-I-BASE-YM                                      02047706
             TO XQJL0342-I-BASE-YM                                      02047806
170201*@   고객식별자                                                 02047906
170629     MOVE XDJL4034-I-BRWR-NO                                      02048006
             TO XQJL0342-I-KB-PIN                                       02048106
                                                                        02048206
      *@3.3 프로그램　호출                                            02048306
           #DYSQLA QJL0342 XQJL0342-CA                                  02048406
                                                                        02048506
      *@2.4 호출결과　확인                                            02048606
           EVALUATE TRUE                                                02048706
               WHEN COND-DBSQL-OK                                       02048806
               WHEN COND-DBSQL-MRNF                                     02048906
                    CONTINUE                                            02049006
               WHEN OTHER                                               02049106
      *@원장조회에러인경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02049206
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02049306
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02049406
           END-EVALUATE                                                 02049506
                                                                        02049606
      *@3.5 출력변수 MOVE                                             02049706
                                                                        02049806
      *@   출력건수                                                   02049906
           MOVE DBSQL-SELECT-CNT                                        02050006
             TO XDJL4034-O-OUTPT-LINE-CNT1                              02050106
                                                                        02050206
           PERFORM VARYING WK-I FROM 1 BY 1                             02050306
             UNTIL WK-I > XDJL4034-O-OUTPT-LINE-CNT1                    02050406
      *@       상품코드                                               02050506
               MOVE XQJL0342-O-PRDCT-CD(WK-I)                           02050606
                 TO XDJL4034-O-PRDCT-CD(WK-I)                           02050706
      *@       상품명                                                 02050806
               MOVE XQJL0342-O-PRDCT-NAME(WK-I)                         02050906
                 TO XDJL4034-O-PRDCT-NAME(WK-I)                         02051006
      *@       대상여부                                               02051106
               MOVE XQJL0342-O-CA-TAGET-ACITM-NM(WK-I)                  02051206
                 TO XDJL4034-O-RPTNG-TAGET(WK-I)                        02051306
      *@       BS기준잔액                                             02051406
               COMPUTE XDJL4034-O-BS-BASE-BAL(WK-I)                     02051506
                     = XQJL0342-O-BS-BASE-BAL(WK-I) / 1000000           02051606
      *@       CA담보환산금액                                         02051906
               COMPUTE XDJL4034-O-CA-SCURTY-AUC(WK-I)                   02052006
                     = XQJL0342-O-CA-SCURTY-AUC(WK-I) / 1000000         02052106
      *@       제외자산금액                                           02052406
               COMPUTE XDJL4034-O-ECLUD-ASAM(WK-I)                      02052506
                     = XQJL0342-O-ECLUD-ASAM(WK-I) / 1000000            02052606
           END-PERFORM                                                  02055006
           .                                                            02055106
       S3300-QJL0342-CALL-EXT.                                          02055206
           EXIT.                                                        02055306
      *-----------------------------------------------------------------03770001
      *@  처리종료                                                    03780001
      *-----------------------------------------------------------------03790001
       S9000-FINAL-RTN.                                                 03800001
      *@정상종료                                                      03810001
           #OKEXIT  CO-STAT-OK                                          03820001
           .                                                            03830001
       S9000-FINAL-EXT.                                                 03850001
           EXIT.                                                        03860001
