      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4051 (SUB-LIMIT관리조회)
      *@처리유형  : DC
      *@처리개요  : SUB-LIMIT관리조회
      *@구현방법  : OPEN-FETCH-CLOSE
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *백현정:20110304: 신규작성
      *YBH     :20150226: 장기자산 추가
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  SUB한도집계           : THKJL0064            : XRXX
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4051.
       AUTHOR.                         백현정.
       DATE-WRITTEN.                   08/11/26.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4051'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SUB한도집계조회
       01  XQJL0511-CA.
           COPY  XQJL0511.
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *    SQLIO INTERFACE PARAMETER
           COPY  YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      *    COMMON AREA
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      *    DC COPYBOOK
       01  XDJL4051-CA.
           COPY  XDJL4051.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4051-CA
                                                   .
      *=================================================================
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           IF XDJL4051-I-PRCSS-DSTIC = CO-CHA-01
      *       SUB한도집계조회
              PERFORM S3000-PROCESS-RTN
                 THRU S3000-PROCESS-EXT

      *       출력처리
              PERFORM S6000-OUTPUT-SET-RTN
                 THRU S6000-OUTPUT-SET-EXT
           END-IF

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
      *@1 초기화

      *@1.1 WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE    WK-AREA

      *@1.2 DBIO SQLIO INTERFACE PARAMETER　초기화
           INITIALIZE    YCDBSQLA-CA

      *@1.3 출력영역　및　결과코드　초기화
           INITIALIZE    XDJL4051-OUT
                         XDJL4051-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
      *@2 입력값검증

      *@2.1 처리구분CHECK
      *@처리내용:처리구분 "01" 아닐경우 오류처리한다
      *@에러메시지:처리구분 오류입니다
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF XDJL4051-I-PRCSS-DSTIC NOT = CO-CHA-01
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@2.2 기준년월일미입력CHECK
      *@실행조건:XDJL4051-I-BASE-YMD = SPACE
      *@처리내용:기준년월일미입력일경우 오류처리한다
      *@에러메시지:필수항목미입력오류입니다.
      *@조치메시지:전산업무담당자에게　문의바랍니다.
           IF XDJL4051-I-BASE-YMD = SPACE
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리－익스포져총괄조회
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
      *@3 업무처리

      *@3.1 SUB한도집계조회
           PERFORM S3100-QJL0511-CALL-RTN
              THRU S3100-QJL0511-CALL-EXT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  SUB한도집계조회
      *-----------------------------------------------------------------
       S3100-QJL0511-CALL-RTN.

      *@3.2.1 초기화
           INITIALIZE    XQJL0511-IN

      *@3.2.2 입력파라미터 조립
      *@처리내용:SQLIO(QJL0511)입력파라메타=
      *@SET(그룹회사구분코드,기준년월일)

      *    그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL0511-I-GROUP-CO-CD
      *    기준년월일
           MOVE XDJL4051-I-BASE-YMD
             TO XQJL0511-I-BASE-YMD

      *@3.2.3 SLQIO프로그램 호출
      *@처리내용:QJL0511프로그램을 호출한다
      *@관련테이블:THKJL0064(SUB한도집계) 접근유형:READ
           #DYSQLA QJL0511 XQJL0511-CA

      *@3.2.4 호출결과확인
      *@실행조건:COND-DBSQL-OK OR COND-DBSQL-MRNF
      *@처리내용:CONTINUE
           IF COND-DBSQL-OK OR COND-DBSQL-MRNF
              CONTINUE
      *@3.2.5 호출결과 확인
      *@실행조건:ELSE
      *@처리내용:오류처리한다.
      *@에러메세지 : 테이블SELECT오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
           ELSE
              #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S3100-QJL0511-CALL-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@ 출력파라미터 SET
      *-----------------------------------------------------------------
       S6000-OUTPUT-SET-RTN.
      *@4 출력처리

      *@4.1부동산PF출력처리
      *@부동산PF한도금액
           MOVE XQJL0511-O-SUB-CLAM1
             TO XDJL4051-O-SUB-CLAM1
      *@부동산PF대출잔액
           MOVE XQJL0511-O-SUB-BAL1
             TO XDJL4051-O-SUB-BAL1
      *@부동산PF소진율
           MOVE XQJL0511-O-EXHS-RT1
             TO XDJL4051-O-EXHS-RT1
      *@부동산PF한도여유액
           MOVE XQJL0511-O-LIMT-SEXTR-AMT1
             TO XDJL4051-O-LIMT-SEXTR-AMT1

      *@4.2장외파생명목　출력처리
      *@장외파생명목한도금액
           MOVE XQJL0511-O-SUB-CLAM2
             TO XDJL4051-O-SUB-CLAM2
      *@장외파생명목대출잔액
           MOVE XQJL0511-O-SUB-BAL2
             TO XDJL4051-O-SUB-BAL2
      *@장외파생명목소진율
           MOVE XQJL0511-O-EXHS-RT2
             TO XDJL4051-O-EXHS-RT2
      *@장외파생명목한도여유액
           MOVE XQJL0511-O-LIMT-SEXTR-AMT2
             TO XDJL4051-O-LIMT-SEXTR-AMT2

      *@4.3장외파생익스포져　출력처리
      *@장외파생익스포져한도금액
           MOVE XQJL0511-O-SUB-CLAM3
             TO XDJL4051-O-SUB-CLAM3
      *@장외파생익스포져대출잔액
           MOVE XQJL0511-O-SUB-BAL3
             TO XDJL4051-O-SUB-BAL3
      *@장외파생익스포져소진율
           MOVE XQJL0511-O-EXHS-RT3
             TO XDJL4051-O-EXHS-RT3
      *@장외파생익스포져한도여유액
           MOVE XQJL0511-O-LIMT-SEXTR-AMT3
             TO XDJL4051-O-LIMT-SEXTR-AMT3

      *@4.4장기자산　출력처리
150226*   장기자산한도금액
           MOVE XQJL0511-O-SUB-CLAM4
             TO XDJL4051-O-SUB-CLAM4
150226*   장기자산잔액
           MOVE XQJL0511-O-SUB-BAL4
             TO XDJL4051-O-SUB-BAL4
150226*   장기자산소진율
           MOVE XQJL0511-O-EXHS-RT4
             TO XDJL4051-O-EXHS-RT4
150226*   장기자산여유액
           MOVE XQJL0511-O-LIMT-SEXTR-AMT4
             TO XDJL4051-O-LIMT-SEXTR-AMT4
           .

       S6000-OUTPUT-SET-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@5 종료처리

      *@5.1 프로그램 종료
      *@처리내용:프로그램을 정상 종료 함
           #OKEXIT CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
