      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJL4085 (DC신용공여계좌조회)
      *@처리유형  : DC
      *@처리개요  : 신용공여계좌를 조회하는 프로그램이다.
      *@구현방법  : SQL ARRAY
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *박정수:20240425: 신규작성
      *박정수:20240926: 컬럼 추가
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  차주익스포져월집계      : THKJL0034            : R
      **  TE자기자본기본          : THKJL0049            : R
      **  채무자고객기본          : THKJL0015            : R
      **  자회사대주주기본        : THKJL0042            : R
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJL4085.
       AUTHOR.                         박정수.
       DATE-WRITTEN.                   24/04/25.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
      *에러메시지정의
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
      *    환율이 등록되어있지 않습니다.
           03  CO-B4400002             PIC  X(008) VALUE 'B4400002'.
      *조치메시지정의
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4085'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-07               PIC  X(002) VALUE '07'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-I                    PIC  9(005) COMP.
           03  WK-J                    PIC  9(005) COMP.
           03  WK-EXHS-RT              PIC  9(005)V9999.
      *----
      *   매매기준환율
      *    N100단위통화여부
      *   환율고시단위구분
      *----
           03  WK-DEAL-BASE-EXRT       PIC  9(005)V9(002).
           03  WK-N100-UNIT-CRNCY-YN   PIC  X(0001).
           03  WK-HWGSCD               PIC  S9(0003) COMP-3.
      *----
      *    매매기준율환산   －잔액  (BS기준잔액)

           03  WK-TTL-AMT-BASE-CLAM    PIC S9(00018) COMP-3.
           03  WK-TTL-AMT-BASE-BAL     PIC S9(00018) COMP-3.
           03  WK-BS-BASE-BAL          PIC S9(00018) COMP-3.
           03  WK-BS-BAL               PIC S9(00018) COMP-3.
           03  WK-BS-BASE-CLAM         PIC S9(00018) COMP-3.
           03  WK-BRDC-ATHOR-WONC-AUC  PIC S9(00018) COMP-3.

           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *신용공여계좌조회
       01  XQJL4085-CA.
           COPY  XQJL4085.


      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * SQLIO INTERFACE PARAMETER
           COPY  YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      * DC COPYBOOK
       01  XDJL4085-CA.
           COPY  XDJL4085.
      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJL4085-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE WK-AREA
      *               SQLIO
                      YCDBSQLA-CA

      *@  출력영역　및　결과코드　초기화
           INITIALIZE XDJL4085-OUT
                      XDJL4085-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@   고객식별자
           IF XDJL4085-I-CUST-IDNFR = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.
           IF XDJL4085-I-PRCSS-DSTIC = CO-CHA-01
      *@      신용공여 계좌 조회
               PERFORM S3100-QJL4085-CALL-RTN
                  THRU S3100-QJL4085-CALL-EXT

           END-IF
           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여계좌 조회
      *-----------------------------------------------------------------
       S3100-QJL4085-CALL-RTN.

      *@2.1 변수초기화
           INITIALIZE XQJL4085-IN

      *@2.2 호출변수 MOVE
      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO XQJL4085-I-GROUP-CO-CD

      *@   고객식별자
           MOVE XDJL4085-I-CUST-IDNFR
             TO XQJL4085-I-CUST-IDNFR

      *@   이사회승인번호
           MOVE XDJL4085-I-BRDC-ATHOR-NO
             TO XQJL4085-I-BRDC-ATHOR-NO

      *@   기준년월일
           MOVE JICOM-BF-BZOPR-YMD
             TO XQJL4085-I-BASE-YMD


      *@2.3 프로그램 호출
           #DYSQLA QJL4085 XQJL4085-CA

      *@2.4 호출결과확인
           IF COND-DBSQL-OK OR COND-DBSQL-MRNF
              CONTINUE
           ELSE
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
              #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-IF

      *@2.5 출력변수 MOVE
           MOVE  DBSQL-SELECT-CNT
             TO  XDJL4085-O-PRSNT-NOITM2

           PERFORM VARYING WK-I FROM 1 BY 1 UNTIL WK-I > 100
                        OR WK-I > XDJL4085-O-PRSNT-NOITM2

      *         계좌번호
                MOVE XQJL4085-O-ACNO(WK-I)
                  TO XDJL4085-O-ACNO(WK-I)

      *         약정계좌번호
                MOVE XQJL4085-O-AGRE-ACNO(WK-I)
                  TO XDJL4085-O-AGRE-ACNO(WK-I)

      *         수기계좌여부가 1이면
                IF XQJL4085-O-HWRT-ACN-YN(WK-I) = '1'

      *             통합계정과목코드
                    MOVE XQJL4085-O-INTGRA-TIACC-CD(WK-I)
                      TO XDJL4085-O-INTGRA-TIACC-CD(WK-I)

                ELSE

      *             상품코드
                    MOVE XQJL4085-O-PRDCT-CD(WK-I)
                      TO XDJL4085-O-INTGRA-TIACC-CD(WK-I)

                END-IF

      *         상품명
                MOVE XQJL4085-O-PRDCT-NAME(WK-I)
                  TO XDJL4085-O-PRDCT-NAME(WK-I)

      *         통화코드
                MOVE XQJL4085-O-CNCYCD(WK-I)
                  TO XDJL4085-O-CNCYCD(WK-I)

      *         통화한도
                MOVE XQJL4085-O-CRNCY-CLAM(WK-I)
                  TO XDJL4085-O-CRNCY-CLAM(WK-I)

      *         통화잔액
                MOVE XQJL4085-O-CRNCY-BAL(WK-I)
                  TO XDJL4085-O-CRNCY-BAL(WK-I)

      *         신용공여익스포져금액
                MOVE XQJL4085-O-GRCR-EXPSR-AMT(WK-I)
                  TO XDJL4085-O-GRCR-EXPSR-AMT(WK-I)

      *         시작년월일
                MOVE XQJL4085-O-START-YMD(WK-I)
                  TO XDJL4085-O-START-YMD(WK-I)

      *         만기년월일
                MOVE XQJL4085-O-EXPIR-YMD(WK-I)
                  TO XDJL4085-O-EXPIR-YMD(WK-I)

      *         금리내용
                MOVE XQJL4085-O-IRTZ-CTNT(WK-I)
                  TO XDJL4085-O-IRTZ-CTNT(WK-I)

      *         담보형태구분
                MOVE XQJL4085-O-SCURTY-FORM-DSTCD(WK-I)
                  TO XDJL4085-O-SCURTY-FORM-DSTCD(WK-I)

      *         담보설정금액
                MOVE XQJL4085-O-SCURTY-SETAMT(WK-I)
                  TO XDJL4085-O-SCURTY-SETAMT(WK-I)

240926*         취급부점코드
                MOVE XQJL4085-O-HNDLN-BRNCD(WK-I)
                  TO XDJL4085-O-HNDLN-BRNCD(WK-I)

  ::  *         취급부점명
                MOVE XQJL4085-O-HNDLN-BRN-NAME(WK-I)
                  TO XDJL4085-O-HNDLN-BRN-NAME(WK-I)

240926*         대출취급형태구분
                MOVE XQJL4085-O-LN-HNDLN-FORM-DSTCD(WK-I)
                  TO XDJL4085-O-LN-HNDLN-FORM-DSTCD(WK-I)

      *         수기계좌여부
                MOVE XQJL4085-O-HWRT-ACN-YN(WK-I)
                  TO XDJL4085-O-HWRT-ACN-YN(WK-I)

      *         등록여부
                MOVE XQJL4085-O-REGI-YN(WK-I)
                  TO XDJL4085-O-REGI-YN(WK-I)

           END-PERFORM
           .
       S3100-QJL4085-CALL-EXT.
           EXIT.


      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@   정상종료
           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
