      *=================================================================00010018
      *@업무명    : KJL     (Total Exposure)                          00020018
      *@프로그램명: DJL4041 (국가별정보조회)                        00030018
      *@처리유형  : DC                                                00040018
      *@처리개요  : 국가별정보조회                                  00050018
      *@구현방법  : SQL ARRAY(300)                                    00051022
      *-----------------------------------------------------------------00060018
      *                 P R O G R A M   변　경　이　력                00070018
      *-----------------------------------------------------------------00080018
      *@성명 : 일자 : 변　경　내　용                              00090018
      * ----------------------------------------------------------------00100018
      *이동구:20090107: 신규작성                                    00110018
      *김진태:20090327: 프로그램수정                                00111022
      *김진태:20091209: 에러메세지정비                              00111022
      *김진태:20100115: 테이블컬럼변경                              00111022
      *김진태:20100408: TABLE/COPYBOOK 변경                         00111022
      * YBH    :20200227: 지역 및 공통한도 추가
      *=================================================================00120018
      ******************************************************************00130018
      **  TABLE-SYNONYM             : 테이블명           : 접근유형 00150018
      **  ------------------------- ------------------------------------00160018
      **  국별부점별한도기본      : THKJL0056            : R          00170022
      ******************************************************************00190018
       IDENTIFICATION                  DIVISION.                        00200018
      *=================================================================00210018
       PROGRAM-ID.                     DJL4041.                         00220018
       AUTHOR.                         이동구.                        00230018
       DATE-WRITTEN.                   09/01/07.                        00240018
      *=================================================================00260018
       ENVIRONMENT                     DIVISION.                        00270018
      *=================================================================00280018
       CONFIGURATION                   SECTION.                         00290018
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00310018
       DATA                            DIVISION.                        00320018
      *=================================================================00330018
       WORKING-STORAGE                 SECTION.                         00340018
      *-----------------------------------------------------------------00351022
      *CONSTANT ERROR AREA                                              00352022
      *-----------------------------------------------------------------00353022
       01  CO-ERROR-AREA.                                               00354022
      *에러메시지정의                                                 00355022
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00356022
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00357022
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00358022
      *조치메시지정의                                                 00359022
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00359122
      *-----------------------------------------------------------------00430018
      * CONSTANT AREA                                                   00440018
      *-----------------------------------------------------------------00450018
       01  CO-AREA.                                                     00460018
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJL4041'.     00470018
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00480018
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00490018
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00500018
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00510018
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.          00520018
                                                                        00530018
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00560018
      *-----------------------------------------------------------------00600018
      * WORKING AREA                                                    00610018
      *-----------------------------------------------------------------00620018
       01  WK-AREA.                                                     00630018
           03  WK-I                    PIC S9(004) COMP.
      *-----------------------------------------------------------------00760018
      * PGM INTERFACE PARAMETER                                         00770018
      *-----------------------------------------------------------------00780018
      *국가명조회                                                     00801022
       01  XQJLZ003-CA.                                                 00810022
           COPY  XQJLZ003.                                              00820022
      *국별한도원장조회                                               00801022
       01  XQJL0411-CA.                                                 00810022
           COPY  XQJL0411.                                              00820022
      *-----------------------------------------------------------------01040007
      * TABLE ACCESS INTERFACE PARAMETER                                01050007
      * LIBRARY : KJL.DDB2.DBCOPY                                       01060007
      *-----------------------------------------------------------------01070007
      * DBIO ACCESS KEY관리                                           01080007
      *-----------------------------------------------------------------01090007
      *-----------------------------------------------------------------00850018
      * DBIO SQLIO INTERFACE PARAMETER                                  00860018
      *-----------------------------------------------------------------00870018
      * SQLIO INTERFACE PARAMETER                                       00880018
           COPY  YCDBSQLA.                                              00890018
      *-----------------------------------------------------------------00910018
       LINKAGE                         SECTION.                         00920018
      *-----------------------------------------------------------------00930018
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 00940018
           COPY  YCCOMMON.                                              00950018
      * DC COPYBOOK                                                     00960018
       01  XDJL4041-CA.                                                 00970018
           COPY  XDJL4041.                                              00980018
      *=================================================================01000018
       PROCEDURE                       DIVISION                         01010018
                                       USING       YCCOMMON-CA          01020018
                                                   XDJL4041-CA          01030018
                                                   .                    01040018
      *=================================================================01050018
                                                                        01060018
      *-----------------------------------------------------------------01070018
      *@  처리메인                                                    01080018
      *-----------------------------------------------------------------01090018
       S0000-MAIN-RTN.                                                  01100018
                                                                        01110018
      *@  초기화                                                      01120018
           PERFORM S1000-INITIALIZE-RTN                                 01130018
              THRU S1000-INITIALIZE-EXT                                 01140018
                                                                        01150018
      *@  입력값　CHECK                                               01160018
           PERFORM S2000-VALIDATION-RTN                                 01170018
              THRU S2000-VALIDATION-EXT                                 01180018
                                                                        01190018
      *@  업무처리                                                    01200018
           PERFORM S3000-PROCESS-RTN                                    01210018
              THRU S3000-PROCESS-EXT                                    01220018
                                                                        01270018
      *@  처리종료                                                    01280018
           PERFORM S9000-FINAL-RTN                                      01290018
              THRU S9000-FINAL-EXT                                      01300018
           .                                                            01310018
       S0000-MAIN-EXT.                                                  01330018
           EXIT.                                                        01340018
      *-----------------------------------------------------------------01350018
      *@  초기화                                                      01360018
      *-----------------------------------------------------------------01370018
       S1000-INITIALIZE-RTN.                                            01380018
                                                                        01390018
      *@WK-AREA및　프로그램파라미터　초기화                           01400018
           INITIALIZE WK-AREA                                           01410018
      *               SQLIO                                             01420021
                      YCDBSQLA-CA                                       01430021
      *@출력영역　및　결과코드　초기화                                01460018
           INITIALIZE XDJL4041-OUT                                      01470018
                      XDJL4041-RETURN                                   01480018
           .                                                            01490018
       S1000-INITIALIZE-EXT.                                            01510018
           EXIT.                                                        01520018
      *-----------------------------------------------------------------01530018
      *@  입력값검증                                                  01540018
      *-----------------------------------------------------------------01550018
       S2000-VALIDATION-RTN.                                            01560018
                                                                        01570022
      *@   처리구분                                                   01571022
           IF XDJL4041-I-PRCSS-DSTIC = CO-CHA-01                        01572022
              CONTINUE                                                  01573022
           ELSE                                                         01574022
      * 에러메세지 : 처리구분오류입니다．                           01575022
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01576022
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01577022
           END-IF                                                       01578022
                                                                        01579022
      *@   조회기준년월                                               01579822
           IF XDJL4041-I-BASE-YM = SPACE                                01579922
      * 에러메세지 : 필수항목미입력오류입니다．                     01580022
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01580122
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01580222
           END-IF                                                       01580322
           .                                                            01650018
       S2000-VALIDATION-EXT.                                            01670018
           EXIT.                                                        01680018
      *-----------------------------------------------------------------01690018
      *@  업무처리                                                    01700018
      *-----------------------------------------------------------------01710018
       S3000-PROCESS-RTN.                                               01720018
                                                                        01730022
      *@1  국가명　추출                                               01735022
           PERFORM S3100-QJLZ003-CALL-RTN                               01736022
              THRU S3100-QJLZ003-CALL-EXT                               01737022
                                                                        01738022
      *@2  국가별정보조회                                             01739022
           PERFORM S3200-QJL0411-CALL-RTN                               01739122
              THRU S3200-QJL0411-CALL-EXT                               01739222
           .                                                            01790018
       S3000-PROCESS-EXT.                                               01810018
           EXIT.                                                        01820018
      *-----------------------------------------------------------------02171007
      *@  국가명　조회                                                02172007
      *-----------------------------------------------------------------02173007
       S3100-QJLZ003-CALL-RTN.                                          02174007
                                                                        02175007
      *@1.1 초기화                                                    02176007
           INITIALIZE XQJLZ003-IN                                       02177007
      *@1.2 호출변수 MOVE                                             02179007
      *@   그룹회사코드                                               02179107
           MOVE BICOM-GROUP-CO-CD  TO XQJLZ003-I-GROUP-CO-CD            02179207
      *@   기준년월                                                   02179307
           MOVE XDJL4041-I-BASE-YM TO XQJLZ003-I-BASE-YM                02179407
      *@   국가코드                                                   02179307
           MOVE XDJL4041-I-ISO-NATNL-CD
             TO XQJLZ003-I-ISO-NATNL-CD
      *@1.3 DBIO 호출                                                 02179507
           #DYSQLA QJLZ003 XQJLZ003-CA                                  02179607
      *@1.4 호출결과확인                                              02179707
           IF COND-DBSQL-OK                                             02179807
              MOVE XQJLZ003-O-ENG-NATNL-NAME
                TO XDJL4041-O-ENG-NATNL-NAME
           ELSE                                                         02180107
              MOVE SPACE TO XDJL4041-O-ENG-NATNL-NAME                   02180207
           END-IF                                                       02180307
           .                                                            02180407
       S3100-QJLZ003-CALL-EXT.                                          02180507
           EXIT.                                                        02180607
      *-----------------------------------------------------------------01833422
      *@ 국가별정보조회                                               01833522
      *-----------------------------------------------------------------01833622
       S3200-QJL0411-CALL-RTN.                                          01833722
                                                                        01833822
      *@2.1 변수초기화                                                01833922
           INITIALIZE XQJL0411-IN                                       01834022
                                                                        01834122
      *@2.2 변수 MOVE                                                 01834222
      *@   그룹회사코드                                               01834322
           MOVE BICOM-GROUP-CO-CD                                       01834422
             TO XQJL0411-I-GROUP-CO-CD                                  01834522
      *@   기준년월                                                   01834622
           MOVE XDJL4041-I-BASE-YM                                      01834722
             TO XQJL0411-I-BASE-YM                                      01834822
      *@   국가코드                                                   01834922
           IF XDJL4041-I-ISO-NATNL-CD = SPACE
               MOVE ALL '%'
                 TO XQJL0411-I-ISO-NATNL-CD
           ELSE
               MOVE XDJL4041-I-ISO-NATNL-CD
                 TO XQJL0411-I-ISO-NATNL-CD
           END-IF
                                                                        01835222
      *@2.3 프로그램　호출                                            01835322
           #DYSQLA QJL0411 XQJL0411-CA                                  01835422
                                                                        01835522
      *@2.4 호출결과　확인                                            01835622
           EVALUATE TRUE                                                01835722
               WHEN COND-DBSQL-OK                                       01835822
               WHEN COND-DBSQL-MRNF                                     01835922
                    CONTINUE                                            01836022
               WHEN OTHER                                               01836122
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01836222
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01836322
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        01836422
           END-EVALUATE                                                 01836522
                                                                        01836622
      *@2.5 출력변수 MOVE                                             01836722
                                                                        01836822
      *@   출력건수                                                   01836922
           MOVE DBSQL-SELECT-CNT                                        01837022
             TO XDJL4041-O-OUTPT-LINE-CNT1                              01837122
                                                                        01837222
           PERFORM VARYING WK-I FROM 1 BY 1                             01837322
             UNTIL WK-I > XDJL4041-O-OUTPT-LINE-CNT1                    01837422
      *@           국가코드                                           01837522
                   MOVE XQJL0411-O-ISO-NATNL-CD(WK-I)                   01837622
                     TO XDJL4041-O-ISO-NATNL-CD(WK-I)                   01837722
      *@           국가명                                             01837822
                   MOVE XQJL0411-O-ENG-NATNL-NAME(WK-I)                 01837922
                     TO XDJL4041-O-ENG-NATNL-NAME1(WK-I)                01838022
      *@           전체관리한도                                       01839022
                   MOVE XQJL0411-O-WHOL-MGT-CLAM(WK-I)                  01839122
                     TO XDJL4041-O-WHOL-MGT-CLAM(WK-I)                  01839222
      *@           SP등급                                             01843522
                   MOVE XQJL0411-O-SNP-GRD-DSTCD(WK-I)                  01843622
                     TO XDJL4041-O-SNP-GRD-DSTCD(WK-I)                  01843722
      *@           무디스등급                                         01843822
                   MOVE XQJL0411-O-MODYS-GRD-DSTCD(WK-I)                01843922
                     TO XDJL4041-O-MODYS-GRD-DSTCD(WK-I)                01844022
      *@           피치등급                                           01844122
                   MOVE XQJL0411-O-FITCH-GRD-DSTCD(WK-I)                01844222
                     TO XDJL4041-O-FITCH-GRD-DSTCD(WK-I)                01844322
200227*@           당행국가신용등급구분
                   MOVE XQJL0411-O-OWBNK-NC-GRD-DSTCD(WK-I)
                     TO XDJL4041-O-OWBNK-NC-GRD-DSTCD(WK-I)
      *@           지역구분                                           01844422
                   MOVE XQJL0411-O-LIMT-MGT-AREA-DSTCD(WK-I)            01844522
                     TO XDJL4041-O-LIMT-MGT-AREA-DSTCD(WK-I)            01844622
200227*@           지역관리한도금액
                   MOVE XQJL0411-O-AREA-MGT-CLAM(WK-I)
                     TO XDJL4041-O-AREA-MGT-CLAM(WK-I)
200227*@           국가전체공통한도여부
                   MOVE XQJL0411-O-NATNL-W-CMN-LIMT-YN(WK-I)
                     TO XDJL4041-O-NATNL-W-CMN-LIMT-YN(WK-I)
200227*@           공통관리한도금액
                   MOVE XQJL0411-O-CMN-MGT-CLAM(WK-I)
                     TO XDJL4041-O-CMN-MGT-CLAM(WK-I)
200227*@           국가위험수준구분
                   MOVE XQJL0411-O-NATNL-R-LVEL-DSTCD(WK-I)
                     TO XDJL4041-O-NATNL-R-LVEL-DSTCD(WK-I)
           END-PERFORM                                                  01845322
           .                                                            01845422
       S3200-QJL0411-CALL-EXT.                                          01846022
           EXIT.                                                        01850022
      *-----------------------------------------------------------------04430020
      *@  처리종료                                                    04440020
      *-----------------------------------------------------------------04450018
       S9000-FINAL-RTN.                                                 04460018
      *@3 종료처리                                                    04470018
                                                                        04480018
      *@3.1 프로그램 종료                                           04490018
      *@처리내용 : 프로그램을 정상 종료 함                    04500018
                                                                        04510018
           #OKEXIT  CO-STAT-OK                                          04520018
           .                                                            04530018
       S9000-FINAL-EXT.                                                 04550018
           EXIT.                                                        04560018
