      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJLB272 (포괄신용공여한도산출저장)
      *@처리유형  : DC
      *@처리개요  : 포괄신용공여한도산출저장
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *전우선:20081216: 신규작성
      *김진태:20090622: 프로그램수정
      *김진태:20091211: 에러메세지정비
      *김진태:20091211: 최종사용자번호／사용시간　삭제
      *김진태:20091221: 처리된신청건의기준한도저장시비정상종료후
      *                   단말에서처리
      *                   기준한도저장시신청내역이없으면비정상종료후
      *                   단말에서처리
      * PJH  :20170201:  KB-PIN전환（２차）
      * PJH  :20170626:  KB-PIN전환（３차）
      *=================================================================
      ******************************************************************
      **  TABLE-SYNONYM             : 테이블명           : 접근유형
      **  ------------------------- ------------------------------------
      **  CP관리한도신청이력      : THKJL0007            :  R
      **  CP기준한도수정이력      : THKJL0009            : CRUD
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJLB272.
       AUTHOR.                         전우선.
       DATE-WRITTEN.                   08/12/16.
      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.

      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3000068             PIC  X(008) VALUE 'B3000068'.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B4200066             PIC  X(008) VALUE 'B4200066'.
           03  CO-B4200219             PIC  X(008) VALUE 'B4200219'.
           03  CO-B4200221             PIC  X(008) VALUE 'B4200221'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200224             PIC  X(008) VALUE 'B4200224'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJLB272'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.
           03  CO-STAT-NOTNORMAL       PIC  X(002) VALUE '08'.

           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-2                PIC  X(001) VALUE '2'.

           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.

           03  CO-CHA-002              PIC  X(003) VALUE '002'.
      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  WK-STAT                 PIC X(002).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
      * DBIO INTERFACE PARAMETER
           COPY    YCDBIOCA.
      *-----------------------------------------------------------------
      * TABLE ACCESS INTERFACE PARAMETER
      * LIBRARY : KJL.DDB2.DBCOPY
      *-----------------------------------------------------------------
      * DBIO ACCESS KEY관리
      *CP관리한도신청이력 테이블(KEY)
       01  TKJL0007-KEY.
           COPY  TKJL0007.
      *CP관리한도신청이력 테이블(RECORD)
       01  TRJL0007-REC.
           COPY  TRJL0007.
      *CP기준한도수정이력 테이블(KEY)
       01  TKJL0009-KEY.
           COPY  TKJL0009.
      *CP기준한도수정이력 테이블(RECORD)
       01  TRJL0009-REC.
           COPY  TRJL0009.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------
      * COMMON COPYBOOK
       01  YCCOMMON-CA.
           COPY  YCCOMMON.
      * DC COPYBOOK
       01  XDJLB272-CA.
           COPY  XDJLB272.
      *=================================================================
       PROCEDURE                       DIVISION
      *=================================================================
                                       USING       YCCOMMON-CA
                                                   XDJLB272-CA.
      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.

      *@   WK-AREA 및　프로그램파라미터　초기화
           INITIALIZE       WK-AREA
      *                     DBIO
                            YCDBIOCA-CA
           .
      *@  출력영역　및　결과코드　초기화
           INITIALIZE       XDJLB272-OUT
                            XDJLB272-RETURN
           .
       S1000-INITIALIZE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@처리구분체크
           IF XDJLB272-I-PRCSS-DSTIC NOT = CO-CHA-01
      * 에러메세지 : 처리구분오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-IF
      *@채무자번호체크
           IF XDJLB272-I-BRWR-NO = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
      *@신청번호체크
           IF XDJLB272-I-LIMT-APLCN-NO = SPACE
      * 에러메세지 : 필수항목미입력오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
           END-IF
           .
       S2000-VALIDATION-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  업무처리
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

      *@1 신청정보　존재　여부　확인
           PERFORM S3100-PROCESS-RTN
              THRU S3100-PROCESS-EXT

      *@2 포괄신용공여한도설정가능액산출값저장
           PERFORM S3200-PROCESS-RTN
              THRU S3200-PROCESS-EXT

      *@   처리결과MOVE
           MOVE CO-STAT-OK
             TO WK-STAT
           .
       S3000-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  신청정보　존재　여부　확인
      *-----------------------------------------------------------------
       S3100-PROCESS-RTN.

      *@   초기화
           INITIALIZE TKJL0007-KEY
                      TRJL0007-REC
      *@수정값을 저장하기전에 관리한도신청정보(THKJL0007)가
      *@존재하는지를 확인한다.
      *@만약관리한도신청정보가존재하더라도 이미 처리되었으면
      *@수정값 저장 불가!!!

      *@그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO KJL0007-PK-GROUP-CO-CD
      *@한도신청번호
           MOVE XDJLB272-I-LIMT-APLCN-NO
             TO KJL0007-PK-LIMT-APLCN-NO

      *@DBIO호출
           #DYDBIO SELECT-CMD-N  TKJL0007-PK TRJL0007-REC

      *@호출결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    IF RJL0007-LIMT-P-STUS-DSTCD = CO-CHA-1
                       MOVE CO-STAT-ABNORMAL
                         TO WK-STAT
      *@기처리된신청건의경우비정상종료후단말에서처리한다
                       PERFORM S9000-FINAL-RTN
                          THRU S9000-FINAL-EXT
                    END-IF
               WHEN COND-DBIO-MRNF
                    MOVE CO-STAT-NOTNORMAL
                      TO WK-STAT
      *@기준한도저장시신청정보가없으면비정상종료후단말에서처리
                    PERFORM S9000-FINAL-RTN
                       THRU S9000-FINAL-EXT
               WHEN OTHER
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3100-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  기준한도저장
      *-----------------------------------------------------------------
       S3200-PROCESS-RTN.

      *@   초기화
           INITIALIZE TKJL0009-KEY
                      TRJL0009-REC

      *@2.1 수정기준한도　존재　여부　확인
      *@    존재　　ＵＰＤＡＴＥ
      *@    미존재　ＩＮＳＥＲＴ

      *@그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO KJL0009-PK-GROUP-CO-CD
      *@한도신청번호
           MOVE XDJLB272-I-LIMT-APLCN-NO
             TO KJL0009-PK-LIMT-APLCN-NO

      *@   DBIO CALL
           #DYDBIO SELECT-CMD-Y TKJL0009-PK TRJL0009-REC

      *@   호출결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
      *@            UPDATE
                    PERFORM S3210-THKJL0009-UPDATE-RTN
                       THRU S3210-THKJL0009-UPDATE-EXT
               WHEN COND-DBIO-MRNF
      *@            INSERT
                    PERFORM S3210-THKJL0009-INSERT-RTN
                       THRU S3210-THKJL0009-INSERT-EXT
               WHEN OTHER
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3200-PROCESS-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  CP기준한도수정이력(THKJL0009)수정
      *-----------------------------------------------------------------
       S3210-THKJL0009-UPDATE-RTN.


      *@조회된 화면은 100만단위이므로 저장시 복원시켜준다.
      *@   총자산
           COMPUTE RJL0009-TOTAL-ASST
                 = XDJLB272-I-AMND-TOTAL-ASST * 1000000

      *@   매출액
           COMPUTE RJL0009-SALEPR
                 = XDJLB272-I-AMND-SALEPR * 1000000

      *@   기준년자기자본금
           COMPUTE RJL0009-BASE-YR-ONCP-AMT
                 = XDJLB272-I-AMND-B-YR-ONCP-AMT * 1000000

      *@   금융비용차입금
           COMPUTE RJL0009-FNCS-AMBR
                 = XDJLB272-I-AMND-FNCS-AMBR * 1000000

      *@   당행차입금
           COMPUTE RJL0009-OWBNK-AMBR
                 = XDJLB272-I-AMND-OWBNK-AMBR * 1000000

      *@   영업현금흐름액
           COMPUTE RJL0009-BZOPR-ACF
                 = XDJLB272-I-AMND-BZOPR-ACF * 1000000

      *@   업체평균이자율
           MOVE XDJLB272-I-AMND-ENTP-AVG-IRT
             TO RJL0009-ENTP-AVG-INT-RT

      *@   여신성자산한도
           COMPUTE RJL0009-LNBZ-I-ASST-CLAM
                 = XDJLB272-I-AMND-LI-ASST-CLAM * 1000000

      *@   신용등급지원비율
           MOVE XDJLB272-I-CRDRAT-SPORT-RATO
             TO RJL0009-CRDRAT-SPORT-RATO

      *@   자기자본기준금액
           COMPUTE RJL0009-ONCP-BSAMT
                 = XDJLB272-I-AMND-O-CAPTL-BSAMT * 1000000

      *@   영업활동기준한도
           COMPUTE RJL0009-BZOPR-A-BASE-CLAM
                 = XDJLB272-I-AMND-BA-BASE-CLAM * 1000000

      *@   포괄설정가능금액
           COMPUTE RJL0009-INLS-STUP-ABLAMT
                 = XDJLB272-I-AMND-I-STUP-ABLAMT * 1000000

      *@   DBIO CALL
           #DYDBIO UPDATE-CMD-Y  TKJL0009-PK TRJL0009-REC

      *@   결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    CONTINUE
               WHEN OTHER
      *@원장갱신오류일경우
      *@에러메세지 : 테이블 UPDATE 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3210-THKJL0009-UPDATE-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  CP기준한도수정이력(THKJL0009)등록
      *-----------------------------------------------------------------
       S3210-THKJL0009-INSERT-RTN.

      *@2.1.2 원장등록
      *@관련테이블 : 포괄신용공여한도산출저장  접근유형 : CREATE

      *@   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO RJL0009-GROUP-CO-CD

      *@   한도신청번호
           MOVE XDJLB272-I-LIMT-APLCN-NO
             TO RJL0009-LIMT-APLCN-NO

170201*@   차주번호　
           MOVE SPACE
             TO RJL0009-BRWR-NO

170201*@   고객식별자
170626     MOVE XDJLB272-I-BRWR-NO
             TO RJL0009-CUST-IDNFR

      *@조회된 화면은 100만단위이므로 저장시 복원시켜준다.
      *@   총자산
           COMPUTE RJL0009-TOTAL-ASST
                 = XDJLB272-I-AMND-TOTAL-ASST * 1000000

      *@   매출액
           COMPUTE RJL0009-SALEPR
                 = XDJLB272-I-AMND-SALEPR * 1000000

      *@   기준년자기자본금
           COMPUTE RJL0009-BASE-YR-ONCP-AMT
                 = XDJLB272-I-AMND-B-YR-ONCP-AMT * 1000000

      *@   금융비용차입금
           COMPUTE RJL0009-FNCS-AMBR
                 = XDJLB272-I-AMND-FNCS-AMBR * 1000000

      *@   당행차입금
           COMPUTE RJL0009-OWBNK-AMBR
                 = XDJLB272-I-AMND-OWBNK-AMBR * 1000000

      *@   영업현금흐름액
           COMPUTE RJL0009-BZOPR-ACF
                 = XDJLB272-I-AMND-BZOPR-ACF * 1000000

      *@   업체평균이자율
           MOVE XDJLB272-I-AMND-ENTP-AVG-IRT
             TO RJL0009-ENTP-AVG-INT-RT

      *@   여신성자산한도
           COMPUTE RJL0009-LNBZ-I-ASST-CLAM
                 = XDJLB272-I-AMND-LI-ASST-CLAM * 1000000

      *@   신용등급지원비율
           MOVE XDJLB272-I-CRDRAT-SPORT-RATO
             TO RJL0009-CRDRAT-SPORT-RATO

      *@   자기자본기준금액
           COMPUTE RJL0009-ONCP-BSAMT
                 = XDJLB272-I-AMND-O-CAPTL-BSAMT * 1000000

      *@   영업활동기준한도
           COMPUTE RJL0009-BZOPR-A-BASE-CLAM
                 = XDJLB272-I-AMND-BA-BASE-CLAM * 1000000

      *@   포괄설정가능금액
           COMPUTE RJL0009-INLS-STUP-ABLAMT
                 = XDJLB272-I-AMND-I-STUP-ABLAMT * 1000000

      *@   DBIO CALL
           #DYDBIO INSERT-CMD-Y  TKJL0009-PK TRJL0009-REC

      *@   결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    CONTINUE
               WHEN OTHER
      *@원장등록오류일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .
       S3210-THKJL0009-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  처리종료
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.
      *@3 종료처리

      *@   처리결과MOVE
           MOVE WK-STAT
             TO XDJLB272-O-PRCSS-RSULT

      *@3.1 프로그램 종료
      *@처리내용 : 프로그램을 정상 종료 함

           #OKEXIT  CO-STAT-OK
           .
       S9000-FINAL-EXT.
           EXIT.
