      *=================================================================00010003
      *@업무명    : KJL     (Total Exposure)                          00020003
      *@프로그램명: DJLB023 (DC본부부서기준값등록)                  00030003
      *@처리유형  : DC                                                00040003
      *@처리개요  : 자기자본 정보 및 가중치 정보를          00050003
      *@            : 등록처리하는 프로그램이다                     00060003
      *-----------------------------------------------------------------00070003
      *                 P R O G R A M   변　경　이　력                00080003
      *-----------------------------------------------------------------00090003
      *@성명 : 일자 : 변　경　내　용                              00100003
      * ----------------------------------------------------------------00110003
      *이동구:20090129: 신규작성                                    00120003
      *김진태:20090331: 프로그램수정                                00121013
      *김진태:20091022: 업종가중치입력체크변경：０　가능            00121013
      *                   에러메세지　정비                            00121013
      *                   최종사용자／최종사용시간　삭제              00121013
      *김진태:20100511: 렌탈업종기준한도적용배수추가                00121013
      * YBH    :20140718: 자기자본기준,영업활동현금흐름액기준
      *                   한도액계산시 신용등급지원비율 기준변경
      * YBH    :20150226: 장기자산SUB-LIMIT등록 추가
      * YBH    :20210408: 1.한은업종가중치 일괄삭제 추가
      *                   2.장기자산SUB-LIMIT등록을 장외파생상품
      *                     SUB-LIMIT등록으로 변경
      *최주원:20211000:탭추가1 산업분류별적용비율
      *                탭추가2 금융업종평균자기자본비율
      *=================================================================00130003
      ******************************************************************00131013
      **  TABLE            : 테이블명                    : 접근유형 00133013
      **  ----------------   -------------------------------------------00134013
      **  THKJL0045        : 신용등급별가중치            : CRD        00135019
      **  THKJL0047        : 한은업종가중치              : CRD        00135121
      **  THKJL0048        : 기준한도적용배수            : CRD        00135221
      **  THKJL0049        : TE자기자본기본              : CRD        00135321
150226**  THKJL0063        : SUB한도관리                 : CRD        001900
211000**  THKJL0046        : 산업분류가중치기본          : CRD
211000**  THKJL0050        : 금융기관자기자본비율                 : RU
      ******************************************************************00136013
       IDENTIFICATION                  DIVISION.                        00210003
      *=================================================================00220003
       PROGRAM-ID.                     DJLB023.                         00230003
       AUTHOR.                         이동구.                        00240003
       DATE-WRITTEN.                   09/01/29.                        00250003
                                                                        00260003
      *=================================================================00270003
       ENVIRONMENT                     DIVISION.                        00280003
      *=================================================================00290003
       CONFIGURATION                   SECTION.                         00300003
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.

      *=================================================================00320003
       DATA                            DIVISION.                        00330003
      *=================================================================00340003
       WORKING-STORAGE                 SECTION.                         00350003
                                                                        00360003
      *-----------------------------------------------------------------00370003
      *CONSTANT ERROR AREA                                              00380003
      *-----------------------------------------------------------------00390003
       01  CO-ERROR-AREA.                                               00391013
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00392013
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00393013
           03  CO-B4200219             PIC  X(008) VALUE 'B4200219'.    00394013
           03  CO-B4200221             PIC  X(008) VALUE 'B4200221'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.    00394013
           03  CO-B4200224             PIC  X(008) VALUE 'B4200224'.
           03  CO-B3900010             PIC  X(008) VALUE 'B3900010'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------00500003
      * CONSTANT AREA                                                   00510003
      *-----------------------------------------------------------------00520003
       01  CO-AREA.                                                     00530003
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJLB023'.     00540003
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00550003
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00560003
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00570003
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00580003
                                                                        00590003
           03  CO-CHA-1                PIC  X(001) VALUE '1'.           00600013
           03  CO-CHA-2                PIC  X(001) VALUE '2'.           00610013
           03  CO-CHA-3                PIC  X(001) VALUE '3'.           00620013
           03  CO-CHA-4                PIC  X(001) VALUE '4'.           00630013
140718     03  CO-CHA-5                PIC  X(001) VALUE '5'.           00630013
                                                                        00630113
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00631013
           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00632013
           03  CO-CHA-03               PIC  X(002) VALUE '03'.          00633013
           03  CO-CHA-04               PIC  X(002) VALUE '04'.          00634013
150226     03  CO-CHA-05               PIC  X(002) VALUE '05'.          00634013
210408     03  CO-CHA-06               PIC  X(002) VALUE '06'.
211000     03  CO-CHA-07               PIC  X(002) VALUE '07'.
211000     03  CO-CHA-08               PIC  X(002) VALUE '08'.
211000     03  CO-CHA-09               PIC  X(002) VALUE '09'.
                                                                        00635013
           03  CO-CHA-Y                PIC  X(001) VALUE 'Y'.           00640003
           03  CO-CHA-N                PIC  X(001) VALUE 'N'.           00650003
      *-----------------------------------------------------------------00710003
      * WORKING AREA                                                    00720003
      *-----------------------------------------------------------------00730003
       01  WK-AREA.                                                     00740003
           03  WK-I                    PIC S9(004) COMP.                00750019
           03  WK-LIMT-CORP-DSTCD      PIC  X(001).                     00761018
           03  WK-INTNL-CV-GRD-DSTCD   PIC  X(004).                     00762019
           03  WK-SPORT-RATO           PIC  9(003).                     00763019
           03  WK-RPAY-ANTICI-RATO     PIC  9(003).                     00764019
           03  WK-BASE-L-BZTYP-DSTCD   PIC  X(001).                     00780003
           03  WK-BASE-L-APLY-MLPL-RT  PIC  9(003)V9(02).               00790003
      *-----------------------------------------------------------------00870003
      * DBIO SQLIO INTERFACE PARAMETER                                  00880003
      *-----------------------------------------------------------------00890003
      * DBIO  INTERFACE COPYBOOK
           COPY  YCDBIOCA.                                              00900003
      *-----------------------------------------------------------------00930003
      * TABLE ACCESS INTERFACE PARAMETER                                00940003
      * LIBRARY : KJL.DDB2.DBCOPY                                       00950003
      *-----------------------------------------------------------------00960003
      * DBIO ACCESS KEY관리                                           00970003
      *신용등급별가중치　테이블(KEY)                                  00980004
       01  TKJL0045-KEY.                                                00990004
           COPY  TKJL0045.                                              01000004
      *신용등급별가중치　테이블(RECORD)                               01010004
       01  TRJL0045-REC.                                                01020004
           COPY  TRJL0045.                                              01030004
                                                                        01040004
      *한은업종가중치　테이블(KEY)                                    01050004
       01  TKJL0047-KEY.                                                01060004
           COPY  TKJL0047.                                              01070004
      *한은업종가중치　테이블(RECORD)                                 01080004
       01  TRJL0047-REC.                                                01090004
           COPY  TRJL0047.                                              01100004
                                                                        01110004
      *기준한도업종별적용배수이력　테이블(KEY)                        01120004
       01  TKJL0048-KEY.                                                01130004
           COPY  TKJL0048.                                              01140004
      *기준한도업종별적용배수이력　테이블(RECORD)                     01150004
       01  TRJL0048-REC.                                                01160004
           COPY  TRJL0048.                                              01170004
                                                                        01180004
      * TE자기자본기본　테이블(KEY)                                   01190004
       01  TKJL0049-KEY.                                                01200004
           COPY  TKJL0049.                                              01210004
      * TE자기자본기본　테이블(RECORD)                                01220004
       01  TRJL0049-REC.                                                01230004
           COPY  TRJL0049.                                              01240004

150226*    SUB한도관리　테이블(KEY)                                   009200
       01  TKJL0063-KEY.                                                00930000
           COPY  TKJL0063.                                              00940000
      *    SUB한도관리　테이블(RECORD)                                009500
       01  TRJL0063-REC.                                                00960000
           COPY  TRJL0063.                                              00970000

211000*    THKJL0046	산업분류가중치기본
       01  TKJL0046-KEY.
           COPY  TKJL0046.
       01  TRJL0046-REC.
           COPY  TRJL0046.

211000*    THKJL0050 금융기관자기자본비율
       01  TKJL0050-KEY.
           COPY  TKJL0050.
       01  TRJL0050-REC.
           COPY  TRJL0050.

      *-----------------------------------------------------------------01260003
      * PGM INTERFACE PARAMETER                                         01270003
      *-----------------------------------------------------------------01280003
                                                                        01290021
      *-----------------------------------------------------------------01370003
       LINKAGE                         SECTION.                         01380003
      *-----------------------------------------------------------------01390003
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 01400003
           COPY  YCCOMMON.                                              01410003
      * DC COPYBOOK                                                     01420003
       01  XDJLB023-CA.                                                 01430003
           COPY  XDJLB023.                                              01440003
      *=================================================================01460003
       PROCEDURE                       DIVISION                         01470003
                                       USING       YCCOMMON-CA          01480003
                                                   XDJLB023-CA          01490003
                                                   .                    01500003
      *=================================================================01510003
                                                                        01520003
      *-----------------------------------------------------------------01530003
      *@  처리메인                                                    01540003
      *-----------------------------------------------------------------01550003
       S0000-MAIN-RTN.                                                  01560003
                                                                        01570003
      *@초기화                                                        01580003
           PERFORM S1000-INITIALIZE-RTN                                 01590003
              THRU S1000-INITIALIZE-EXT                                 01600003
                                                                        01610003
      *@입력값　CHECK                                                 01620003
           PERFORM S2000-VALIDATION-RTN                                 01630003
              THRU S2000-VALIDATION-EXT                                 01640003
                                                                        01650003
      *@업무처리                                                      01660003
           PERFORM S3000-PROCESS-RTN                                    01670003
              THRU S3000-PROCESS-EXT                                    01680003
                                                                        01690003
      *@처리종료                                                      01700003
           PERFORM S9000-FINAL-RTN                                      01710003
              THRU S9000-FINAL-EXT                                      01720003
           .                                                            01730003
       S0000-MAIN-EXT.                                                  01750003
           EXIT.                                                        01760003
      *-----------------------------------------------------------------01770003
      *@  초기화                                                      01780003
      *-----------------------------------------------------------------01790003
       S1000-INITIALIZE-RTN.                                            01800003

      *@WK-AREA및　프로그램파라미터　초기화                           01820003
                                                                        01830003
           INITIALIZE WK-AREA                                           01840014
      *               DBIO
                      YCDBIOCA-CA                                       01850014
                                                                        01970003
      *@출력영역및　결과코드　초기화                                  01980003
           INITIALIZE XDJLB023-OUT                                      01990014
                      XDJLB023-RETURN                                   02000014
           .                                                            02010003
       S1000-INITIALIZE-EXT.                                            02030003
           EXIT.                                                        02040003
      *-----------------------------------------------------------------02050003
      *@  입력값검증                                                  02060003
      *-----------------------------------------------------------------02070003
       S2000-VALIDATION-RTN.                                            02080003
                                                                        02090013
      *@처리구분입력항목체크
           IF XDJLB023-I-PRCSS-DSTIC = CO-CHA-01 OR                     02091013
                                       CO-CHA-02 OR                     02091113
                                       CO-CHA-03 OR                     02091213
                                       CO-CHA-04 OR                     02091213
150226                                 CO-CHA-05 OR                     02091313
210408                                 CO-CHA-06 OR
211000                                 CO-CHA-07 OR
211000                                 CO-CHA-08 OR
211000                                 CO-CHA-09
               CONTINUE                                                 02092013
           ELSE                                                         02093013
      *@처리구분체크시에러일경우에러처리
      *@에러메세지 : 처리구분오류입니다．                           02094013
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02095013
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR             02096013
           END-IF                                                       02097013
           .                                                            02180003
       S2000-VALIDATION-EXT.                                            02200003
           EXIT.                                                        02210003
      *-----------------------------------------------------------------02220003
      *@  업무처리                                                    02230003
      *-----------------------------------------------------------------02240003
       S3000-PROCESS-RTN.                                               02250003

      *@처리구분에따른프로그램분기                                    02260012
      *@'01' : 자기자본　처리분기                                     02270013
      *@'02' : 신용등급별가중치　처리분기                             02280013
      *@'03' : 한은업종가중치　처리분기                               02290013
      *@'04' : 기준한도적용배수　처리분기                             02300013
150226* '05' : 장외파생상품SUB-LIMIT 처리분기
210408* '06' : 한은업종가중치 일괄삭제
211000* '07' : 산업분류별 적용비율 등록
211000* '08' : 산업분류별 적용비율 삭제
211000* '09' : 금융업종평균 자기자본비율 변경
           EVALUATE XDJLB023-I-PRCSS-DSTIC                              02310013
           WHEN CO-CHA-01                                               02320013
      *@자기자본
                    PERFORM S3100-JAGI-PROC-RTN                         02330013
                       THRU S3100-JAGI-PROC-EXT                         02340013
           WHEN CO-CHA-02                                               02350013
      *@신용등급별가중치
                    PERFORM S3200-SINYONG-PROC-RTN                      02360013
                       THRU S3200-SINYONG-PROC-EXT                      02370013
           WHEN CO-CHA-03                                               02380013
210408     WHEN CO-CHA-06
      *@한은업종가중치
                    PERFORM S3300-HANUN-PROC-RTN                        02390013
                       THRU S3300-HANUN-PROC-EXT                        02400013
           WHEN CO-CHA-04                                               02410013
      *@기준한도적용배수
                    PERFORM S3400-GIJUN-PROC-RTN                        02420013
                       THRU S3400-GIJUN-PROC-EXT                        02430013
150226     WHEN CO-CHA-05                                               02410013
      *@      장외파생상품SUB-LIMIT
               PERFORM S3500-SUBLIMIT-PROC-RTN                          02420013
                  THRU S3500-SUBLIMIT-PROC-EXT                          02430013
211000     WHEN CO-CHA-07
211000     WHEN CO-CHA-08
      *@       산업분류별 적용비율 등록/삭제
               PERFORM S3600-IDSTRY-PROC-RTN
                  THRU S3600-IDSTRY-PROC-EXT
211000     WHEN CO-CHA-09
      *@       금융업종평균 자기자본비율 변경
               PERFORM S3700-FINAC-PROC-RTN
                  THRU S3700-FINAC-PROC-EXT
           END-EVALUATE                                                 02440003
           .                                                            02450003

       S3000-PROCESS-EXT.                                               02470003
           EXIT.                                                        02480003

      *-----------------------------------------------------------------02490003
      *@  자기자본　신규등록처리　프로세스                            02500003
      *-----------------------------------------------------------------02510003
       S3100-JAGI-PROC-RTN.                                             02520003

      *@자기자본등록프로세스처리                                      02530003
      *@입력항목　체크                                                02540003
           PERFORM S3110-INPUT-DATA-CHECK-RTN                           02550013
              THRU S3110-INPUT-DATA-CHECK-EXT                           02560013
                                                                        02570003
      *@TE자기자본기준（BIS )　삭제처리                             02580003
           PERFORM S3120-THKJL0049-DELETE-RTN                           02590013
              THRU S3120-THKJL0049-DELETE-EXT                           02600013
                                                                        02610003
      *@TE자기자본기준（BIS )　등록처리                             02620003
           PERFORM S3130-THKJL0049-INSERT-RTN                           02630013
              THRU S3130-THKJL0049-INSERT-EXT                           02640013
                                                                        02650003
      *@TE자기자본기준（동일인외화）삭제처리                          02660013
           PERFORM S3140-THKJL0049-DELETE-RTN                           02670013
              THRU S3140-THKJL0049-DELETE-EXT                           02680013
                                                                        02690003
      *@TE자기자본기준（동일인외화）등록처리                          02700013
           PERFORM S3150-THKJL0049-INSERT-RTN                           02710013
              THRU S3150-THKJL0049-INSERT-EXT                           02720013
           .                                                            02730003
       S3100-JAGI-PROC-EXT.                                             02750003
           EXIT.                                                        02760003
      *-----------------------------------------------------------------02770003
      *@  입력항목　필수입력　체크                                    02780003
      *@  （자기자본）　　　　　　　                                  02790003
      *-----------------------------------------------------------------02800003
       S3110-INPUT-DATA-CHECK-RTN.                                      02810003
                                                                        02820013
      *@필수입력파라미터값에대한검증
      *@BIS자기자본                                                   02821013
           IF XDJLB023-I-BIS-BASE-ONCP = ZERO                           02830013
      * 에러메세지 : 필수항목미입력오류입니다．                     02831013
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02832013
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02833013
           END-IF                                                       02850003
                                                                        02860003
      *@기준년월
           IF XDJLB023-I-BASE-YM1 = SPACE                               02870013
      * 에러메세지 : 필수항목미입력오류입니다．                     02880013
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02881013
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02882013
           END-IF                                                       02890003
                                                                        02900003
      *@경영지표자기자본
           IF XDJLB023-I-SMPSN-FC-ONCP = ZERO                           02910013
      * 에러메세지 : 필수항목미입력오류입니다．                     02920013
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02921013
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02922013
           END-IF                                                       02930003
                                                                        02940003
      *@기준년월
           IF XDJLB023-I-BASE-YM2 = SPACE                               02950013
      * 에러메세지 : 필수항목미입력오류입니다．                     02960013
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02961013
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02962013
           END-IF                                                       02970003
           .                                                            02980003
       S3110-INPUT-DATA-CHECK-EXT.                                      03000003
           EXIT.                                                        03010003
      *-----------------------------------------------------------------03020003
      *@ TE자기자본기본(THKJL0049)삭제처리                          03030003
      *@ ( BIS )                                                        03040003
      *-----------------------------------------------------------------03050003
       S3120-THKJL0049-DELETE-RTN.                                      03060003
                                                                        03070013
      *@카피북초기화                                                  03071013
           INITIALIZE TKJL0049-KEY                                      03080013
                      TRJL0049-REC                                      03090013
      *@입력파라미터조립
      *@그룹회사코드                                                  03100003
           MOVE BICOM-GROUP-CO-CD                                       03110013
             TO KJL0049-PK-GROUP-CO-CD                                  03111013
      *@기준년월                                                      03120003
           MOVE XDJLB023-I-BASE-YM1                                     03130013
             TO KJL0049-PK-BASE-YM                                      03140013
      *@자기자본구분                                                  03150003
           MOVE CO-CHA-1                                                03160013
             TO KJL0049-PK-ONCP-DSTCD                                   03161013

      *@프로그램호출                                                  03030001
           #DYDBIO SELECT-CMD-Y TKJL0049-PK TRJL0049-REC                03040007
                                                                        03050001
      *@호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
               WHEN COND-DBIO-MRNF                                      03052006
                    CONTINUE                                            03053006
               WHEN OTHER                                               03073006
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03074006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@DBIO CALL                                                       03170013
           #DYDBIO DELETE-CMD-Y TKJL0049-PK TRJL0049-REC                03180013
                                                                        03190003
      *@호출결과확인                                                  03191013
           EVALUATE TRUE                                                03192013
               WHEN COND-DBIO-OK                                        03193013
               WHEN COND-DBIO-MRNF                                      03193113
                    CONTINUE                                            03194013
               WHEN OTHER                                               03195013
      *@원장조회에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   03196013
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03197013
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        03198013
           END-EVALUATE                                                 03199013
           .                                                            03300003
       S3120-THKJL0049-DELETE-EXT.                                      03320003
           EXIT.                                                        03330003
      *-----------------------------------------------------------------03340003
      *@ TE자기자본기본(THKJL0049)등록처리                          03350003
      *@ ( BIS )                                                        03360003
      *-----------------------------------------------------------------03370003
       S3130-THKJL0049-INSERT-RTN.                                      03380003
                                                                        03390013
      *@입력파라미터조립
      *@그룹회사코드                                                  03400003
           MOVE BICOM-GROUP-CO-CD                                       03410013
             TO RJL0049-GROUP-CO-CD                                     03411013
      *@기준년월                                                      03420003
           MOVE XDJLB023-I-BASE-YM1                                     03430013
             TO RJL0049-BASE-YM                                         03440013
      *@자기자본구분                                                  03450003
           MOVE CO-CHA-1                                                03460013
             TO RJL0049-ONCP-DSTCD                                      03461013
      *@자기자본기준금액                                              03470003
           COMPUTE RJL0049-ONCP-BSAMT                                   03480013
                 = XDJLB023-I-BIS-BASE-ONCP * 1000000                   03481013
      *@등록직원번호                                                  03500003
           MOVE BICOM-USER-EMPID                                        03510013
             TO RJL0049-REGI-EMPID                                      03520013
      *@등록년월일                                                    03530003
           MOVE BICOM-TRAN-BASE-YMD                                     03540013
             TO RJL0049-REGI-YMD                                        03550013

      *@DBIO CALL                                                       03560013
           #DYDBIO INSERT-CMD-Y TKJL0049-PK TRJL0049-REC                03570013
                                                                        03580003
      *@호출결과확인                                                  03581013
           EVALUATE TRUE                                                03582013
               WHEN COND-DBIO-OK                                        03583013
                    CONTINUE                                            03584013
               WHEN OTHER                                               03585013
      *@원장조회에러일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   03586013
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03587013
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        03588013
           END-EVALUATE                                                 03589013
           .                                                            03680003
       S3130-THKJL0049-INSERT-EXT.                                      03700003
           EXIT.                                                        03710003
      *-----------------------------------------------------------------03711013
      *@ TE자기자본기본(THKJL0049)삭제처리                          03712013
      *@ （동일인외화）                                               03713013
      *-----------------------------------------------------------------03714013
       S3140-THKJL0049-DELETE-RTN.                                      03715013
                                                                        03716013
      *@카피북초기화                                                  03717013
           INITIALIZE TKJL0049-KEY                                      03718013
                      TRJL0049-REC                                      03719013

      *@입력파라미터조립
      *@그룹회사코드                                                  03719113
           MOVE BICOM-GROUP-CO-CD                                       03719213
             TO KJL0049-PK-GROUP-CO-CD                                  03719313
      *@기준년월                                                      03719413
           MOVE XDJLB023-I-BASE-YM2                                     03719513
             TO KJL0049-PK-BASE-YM                                      03719613
      *@자기자본구분                                                  03719713
           MOVE CO-CHA-2                                                03719813
             TO KJL0049-PK-ONCP-DSTCD                                   03719913

      *@프로그램호출                                                  03030001
           #DYDBIO SELECT-CMD-Y TKJL0049-PK TRJL0049-REC                03040007
                                                                        03050001
      *@호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
               WHEN COND-DBIO-MRNF                                      03052006
                    CONTINUE                                            03053006
               WHEN OTHER                                               03073006
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03074006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@DBIO CALL                                                       03720013
           #DYDBIO DELETE-CMD-Y TKJL0049-PK TRJL0049-REC                03720113
                                                                        03720213
      *@호출결과확인                                                  03720313
           EVALUATE TRUE                                                03720413
               WHEN COND-DBIO-OK                                        03720513
               WHEN COND-DBIO-MRNF                                      03720613
                    CONTINUE                                            03720713
               WHEN OTHER                                               03720813
      *@원장조회에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   03720913
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03721013
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        03721113
           END-EVALUATE                                                 03721213
           .                                                            03721313
       S3140-THKJL0049-DELETE-EXT.                                      03721413
           EXIT.                                                        03721513
      *-----------------------------------------------------------------03721613
      *@ TE자기자본기본(THKJL0049)등록처리                          03721713
      *@ （동일인외화）                                               03721813
      *-----------------------------------------------------------------03721913
       S3150-THKJL0049-INSERT-RTN.                                      03722013
                                                                        03722113
      *@입력파라미터조립
      *@그룹회사코드                                                  03722213
           MOVE BICOM-GROUP-CO-CD                                       03722313
             TO RJL0049-GROUP-CO-CD                                     03722413
      *@기준년월                                                      03722513
           MOVE XDJLB023-I-BASE-YM2                                     03722613
             TO RJL0049-BASE-YM                                         03722713
      *@자기자본구분                                                  03722813
           MOVE CO-CHA-2                                                03722913
             TO RJL0049-ONCP-DSTCD                                      03723013
      *@자기자본기준금액                                              03723113
           COMPUTE RJL0049-ONCP-BSAMT                                   03723213
                 = XDJLB023-I-SMPSN-FC-ONCP * 1000000                   03723313
      *@등록직원번호                                                  03723413
           MOVE BICOM-USER-EMPID                                        03723513
             TO RJL0049-REGI-EMPID                                      03723613
      *@등록년월일                                                    03723713
           MOVE BICOM-TRAN-BASE-YMD                                     03723813
             TO RJL0049-REGI-YMD                                        03723913

      *@DBIO CALL                                                       03724613
           #DYDBIO INSERT-CMD-Y TKJL0049-PK TRJL0049-REC                03724713
                                                                        03724813
      *@호출결과확인                                                  03724913
           EVALUATE TRUE                                                03725013
               WHEN COND-DBIO-OK                                        03725113
                    CONTINUE                                            03725213
               WHEN OTHER                                               03725313
      *@원장등록에러일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   03725413
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03725513
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        03725613
           END-EVALUATE                                                 03725713
           .                                                            03725813
       S3150-THKJL0049-INSERT-EXT.                                      03725913
           EXIT.                                                        03726013
      *-----------------------------------------------------------------04420003
      *@  신용등급별가중치　신규등록처리　프로세스                    04430003
      *@ -기타                                                        04440003
      *@ -그룹                                                        04450003
      *@ -건설                                                        04460003
      *@ -조선                                                        04470003
      *@ -계산
      *-----------------------------------------------------------------04480003
       S3200-SINYONG-PROC-RTN.                                          04490007
                                                                        04500015
           IF XDJLB023-I-OUTPT-LINE-CNT1 > ZERO                         04520015
      *@기타（개별）                                                  04510015
              PERFORM S3210-GITA-PROC-RTN                               04530015
                 THRU S3210-GITA-PROC-EXT                               04540015
           END-IF                                                       04550003
                                                                        04560003
           IF XDJLB023-I-OUTPT-LINE-CNT2 > ZERO                         04580021
      *@그룹                                                          04570003
              PERFORM S3220-GROUP-PROC-RTN                              04590021
                 THRU S3220-GROUP-PROC-EXT                              04600021
           END-IF                                                       04610021
                                                                        04620003
           IF XDJLB023-I-OUTPT-LINE-CNT3 > ZERO                         04640021
      *@건설                                                          04630003
              PERFORM S3230-BUILD-PROC-RTN                              04650021
                 THRU S3230-BUILD-PROC-EXT                              04660021
           END-IF                                                       04670021
                                                                        04680003
           IF XDJLB023-I-OUTPT-LINE-CNT4 > ZERO                         04700021
      *@조선                                                          04690003
              PERFORM S3240-SHIP-PROC-RTN                               04710021
                 THRU S3240-SHIP-PROC-EXT                               04720021
           END-IF                                                       04730021

           IF XDJLB023-I-OUTPT-LINE-CNT5 > ZERO                         04700021
140718*@     포괄신용공여한도 계산용 신용등급지원비율             04690003
              PERFORM S3250-CALC-PROC-RTN                               04710021
                 THRU S3250-CALC-PROC-EXT                               04720021
           END-IF                                                       04730021

           .                                                            04740003
       S3200-SINYONG-PROC-EXT.                                          04760007
           EXIT.                                                        04770003
      *-----------------------------------------------------------------04780003
      *@  신용등급별가중치－기타（개별）처리                          04790018
      *-----------------------------------------------------------------04800003
       S3210-GITA-PROC-RTN.                                             04810003
                                                                        04820015
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  04840019
           PERFORM VARYING WK-I FROM 1 BY 1                             04850015
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT1                    04860015
                                                                        04870003
      *@입력항목체크                                                  04871018
                   IF XDJLB023-I-INTNL-CV-GRD-DSTCD1(WK-I) = SPACE      04872018
      *@입력항목에러일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     04873018
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              04874018
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      04875018
                   END-IF                                               04876018
                                                                        04890118
      *@입력파라미터조립
      *@한도기업구분（기타-개별）                                   04891018
                   MOVE CO-CHA-1                                        04892018
                     TO WK-LIMT-CORP-DSTCD                              04893018
      *@신용등급                                                      04895019
                   MOVE XDJLB023-I-INTNL-CV-GRD-DSTCD1(WK-I)            04896019
                     TO WK-INTNL-CV-GRD-DSTCD                           04897019
      *@지원비율                                                      04898019
                   MOVE XDJLB023-I-SPORT-RATO1(WK-I)                    04899019
                     TO WK-SPORT-RATO                                   04899119
      *@상환예상비율                                                  04899219
                   MOVE XDJLB023-I-RPAY-ANTICI-RATO1(WK-I)              04899319
                     TO WK-RPAY-ANTICI-RATO                             04899419
                                                                        04899519
      *@기타（개별기업）삭제                                          04900018
                   PERFORM S3280-THKJL0045-DEL-RTN                      04901018
                      THRU S3280-THKJL0045-DEL-EXT                      04902018
                                                                        04903018
      *@기타（개별기업）등록                                          04904118
                   PERFORM S3290-THKJL0045-INS-RTN                      04905019
                      THRU S3290-THKJL0045-INS-EXT                      04906019
                                                                        04907018
           END-PERFORM                                                  04910003
           .                                                            05110003
       S3210-GITA-PROC-EXT.                                             05130003
           EXIT.                                                        05140003
      *-----------------------------------------------------------------05150019
      *@  신용등급별가중치－그룹처리                                  05160019
      *-----------------------------------------------------------------05170019
       S3220-GROUP-PROC-RTN.                                            05180019
                                                                        05190019
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  05200019
           PERFORM VARYING WK-I FROM 1 BY 1                             05210019
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT2                    05220019
                                                                        05230019
      *@입력항목체크                                                  05240019
                   IF XDJLB023-I-INTNL-CV-GRD-DSTCD2(WK-I) = SPACE      05250019
      *@입력항목에러일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     05260019
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05270019
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      05280019
                   END-IF                                               05290019
                                                                        05300019
      *@한도기업구분（그룹）                                          05310019
                   MOVE CO-CHA-2                                        05310119
                     TO WK-LIMT-CORP-DSTCD                              05310219
      *@신용등급                                                      05310319
                   MOVE XDJLB023-I-INTNL-CV-GRD-DSTCD2(WK-I)            05310419
                     TO WK-INTNL-CV-GRD-DSTCD                           05310519
      *@지원비율                                                      05310619
                   MOVE XDJLB023-I-SPORT-RATO2(WK-I)                    05310719
                     TO WK-SPORT-RATO                                   05310819
      *@상환예상비율                                                  05310919
                   MOVE XDJLB023-I-RPAY-ANTICI-RATO2(WK-I)              05311019
                     TO WK-RPAY-ANTICI-RATO                             05311119
                                                                        05311219
      *@그룹　삭제                                                    05311319
                   PERFORM S3280-THKJL0045-DEL-RTN                      05311419
                      THRU S3280-THKJL0045-DEL-EXT                      05311519
                                                                        05311619
      *@그룹　등록                                                    05311719
                   PERFORM S3290-THKJL0045-INS-RTN                      05311819
                      THRU S3290-THKJL0045-INS-EXT                      05311919
                                                                        05312019
           END-PERFORM                                                  05312119
           .                                                            05312219
       S3220-GROUP-PROC-EXT.                                            05312319
           EXIT.                                                        05312419
      *-----------------------------------------------------------------05312519
      *@  신용등급별가중치－건설                                      05312619
      *-----------------------------------------------------------------05312719
       S3230-BUILD-PROC-RTN.                                            05312819
                                                                        05312919
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  05313019
           PERFORM VARYING WK-I FROM 1 BY 1                             05313119
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT3                    05313219
                                                                        05313319
      *@입력항목체크                                                  05313419
                   IF XDJLB023-I-INTNL-CV-GRD-DSTCD3(WK-I) = SPACE      05313519
      *@입력항목오류일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     05313619
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05313719
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      05313819
                   END-IF                                               05313919
                                                                        05314019
      *@입력파라미터조립
      *@한도기업구분（건설）                                          05314119
                   MOVE CO-CHA-3                                        05314219
                     TO WK-LIMT-CORP-DSTCD                              05314319
      *@신용등급                                                      05314419
                   MOVE XDJLB023-I-INTNL-CV-GRD-DSTCD3(WK-I)            05314519
                     TO WK-INTNL-CV-GRD-DSTCD                           05314619
      *@지원비율                                                      05314719
                   MOVE XDJLB023-I-SPORT-RATO3(WK-I)                    05314819
                     TO WK-SPORT-RATO                                   05314919
      *@상환예상비율                                                  05315019
                   MOVE XDJLB023-I-RPAY-ANTICI-RATO3(WK-I)              05315119
                     TO WK-RPAY-ANTICI-RATO                             05315219
                                                                        05315319
      *@건설　삭제                                                    05315419
                   PERFORM S3280-THKJL0045-DEL-RTN                      05315519
                      THRU S3280-THKJL0045-DEL-EXT                      05315619
                                                                        05315719
      *@건설　등록                                                    05315819
                   PERFORM S3290-THKJL0045-INS-RTN                      05315919
                      THRU S3290-THKJL0045-INS-EXT                      05316019
                                                                        05316119
           END-PERFORM                                                  05316219
           .                                                            05316319
       S3230-BUILD-PROC-EXT.                                            05316419
           EXIT.                                                        05316519
      *-----------------------------------------------------------------05316619
      *@  신용등급별가중치－조선                                      05316719
      *-----------------------------------------------------------------05316819
       S3240-SHIP-PROC-RTN.                                             05316919
                                                                        05317019
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  05317119
           PERFORM VARYING WK-I FROM 1 BY 1                             05317219
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT4                    05317319
                                                                        05317419
      *@입력항목체크                                                  05317519
                   IF XDJLB023-I-INTNL-CV-GRD-DSTCD4(WK-I) = SPACE      05317619
      *@입력항목체크오류일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     05317719
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05317819
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      05317919
                   END-IF                                               05318019
                                                                        05318119
      *@입력파라미터조립
      *@한도기업구분（조선）                                          05318219
                   MOVE CO-CHA-4                                        05318319
                     TO WK-LIMT-CORP-DSTCD                              05318419
      *@신용등급                                                      05318519
                   MOVE XDJLB023-I-INTNL-CV-GRD-DSTCD4(WK-I)            05318619
                     TO WK-INTNL-CV-GRD-DSTCD                           05318719
      *@지원비율                                                      05318819
                   MOVE XDJLB023-I-SPORT-RATO4(WK-I)                    05318919
                     TO WK-SPORT-RATO                                   05319019
      *@상환예상비율                                                  05319119
                   MOVE XDJLB023-I-RPAY-ANTICI-RATO4(WK-I)              05319219
                     TO WK-RPAY-ANTICI-RATO                             05319319
                                                                        05319419
      *@조선　삭제                                                    05319519
                   PERFORM S3280-THKJL0045-DEL-RTN                      05319619
                      THRU S3280-THKJL0045-DEL-EXT                      05319719
                                                                        05319819
      *@조선　등록                                                    05319919
                   PERFORM S3290-THKJL0045-INS-RTN                      05320019
                      THRU S3290-THKJL0045-INS-EXT                      05320119
                                                                        05320219
           END-PERFORM                                                  05320319
           .                                                            05320419
       S3240-SHIP-PROC-EXT.                                             05320519
           EXIT.                                                        05320619

      *-----------------------------------------------------------------05316619
      *@  신용등급별가중치－계산
      *-----------------------------------------------------------------05316819
       S3250-CALC-PROC-RTN.                                             05316919
                                                                        05317019
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  05317119
           PERFORM VARYING WK-I FROM 1 BY 1                             05317219
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT5
                                                                        05317419
      *@입력항목체크                                                  05317519
                   IF XDJLB023-I-INTNL-CV-GRD-DSTCD5(WK-I) = SPACE      05317619
      *@입력항목체크오류일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     05317719
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05317819
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      05317919
                   END-IF                                               05318019
                                                                        05318119
      *@입력파라미터조립
      *@한도기업구분（계산）                                          05318219
                   MOVE CO-CHA-5
                     TO WK-LIMT-CORP-DSTCD                              05318419
      *@신용등급                                                      05318519
                   MOVE XDJLB023-I-INTNL-CV-GRD-DSTCD5(WK-I)            05318619
                     TO WK-INTNL-CV-GRD-DSTCD                           05318719
      *@지원비율                                                      05318819
                   MOVE XDJLB023-I-SPORT-RATO5(WK-I)                    05318919
                     TO WK-SPORT-RATO                                   05319019
      *@상환예상비율                                                  05319119
                   MOVE ZERO
                     TO WK-RPAY-ANTICI-RATO                             04899419
                                                                        05319419
      *@계산　삭제                                                    05319519
                   PERFORM S3280-THKJL0045-DEL-RTN                      05319619
                      THRU S3280-THKJL0045-DEL-EXT                      05319719
                                                                        05319819
      *@계산　등록                                                    05319919
                   PERFORM S3290-THKJL0045-INS-RTN                      05320019
                      THRU S3290-THKJL0045-INS-EXT                      05320119
                                                                        05320219
           END-PERFORM                                                  05320319
           .                                                            05320419

       S3250-CALC-PROC-EXT.                                             05320519
           EXIT.                                                        05320619

      *-----------------------------------------------------------------05320719
      *@ 신용등급별가중치　기존데이터　삭제                           05320819
      *-----------------------------------------------------------------05320919
       S3280-THKJL0045-DEL-RTN.                                         05321019
                                                                        05321119
      *@카피북초기화
           INITIALIZE TKJL0045-KEY                                      05321319
                      TRJL0045-REC                                      05321419
      *@그룹회사코드                                                  05321519
           MOVE BICOM-GROUP-CO-CD                                       05321619
             TO KJL0045-PK-GROUP-CO-CD                                  05321719
      *@기준년월                                                      05321819
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                05321919
             TO KJL0045-PK-BASE-YM                                      05322019
      *@한도기업구분코드                                              05322119
           MOVE WK-LIMT-CORP-DSTCD                                      05322219
             TO KJL0045-PK-LIMT-CORP-DSTCD                              05322319
      *@내부신용평가등급구분                                          05322419
           MOVE WK-INTNL-CV-GRD-DSTCD                                   05322519
             TO KJL0045-PK-INTNL-CV-GRD-DSTCD                           05322619

      *@프로그램호출                                                  03030001
           #DYDBIO SELECT-CMD-Y TKJL0045-PK TRJL0045-REC                03040007
                                                                        03050001
      *@호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
               WHEN COND-DBIO-MRNF                                      03052006
                    CONTINUE                                            03053006
               WHEN OTHER                                               03073006
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03074006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@DBIO CALL                                                       05322719
           #DYDBIO DELETE-CMD-Y TKJL0045-PK TRJL0045-REC                05322819
                                                                        05322919
      *@호출결과확인                                                  05323019
           EVALUATE TRUE                                                05323119
               WHEN COND-DBIO-OK                                        05323219
               WHEN COND-DBIO-MRNF                                      05323319
                    CONTINUE                                            05323419
               WHEN OTHER                                               05323519
      *@원장삭제에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   05323619
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              05323719
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        05323819
           END-EVALUATE                                                 05323919
           .                                                            05324019
       S3280-THKJL0045-DEL-EXT.                                         05324119
           EXIT.                                                        05325019
      *-----------------------------------------------------------------06550003
      *@ 신용등급별가중치　데이터　등록                               06560019
      *-----------------------------------------------------------------06570003
       S3290-THKJL0045-INS-RTN.                                         06580019
                                                                        06590019
      *@입력파라미터조립
      *@그룹회사코드                                                  06620003
           MOVE BICOM-GROUP-CO-CD                                       06630019
             TO RJL0045-GROUP-CO-CD                                     06640019
      *@기준년월                                                      06650003
           MOVE BICOM-TRAN-BASE-YMD(1:6)                                06660019
             TO RJL0045-BASE-YM                                         06670019
                                                                        06671019
      *@한도기업구분코드                                              06680003
           MOVE WK-LIMT-CORP-DSTCD                                      06690019
             TO RJL0045-LIMT-CORP-DSTCD                                 06710019
                                                                        06711019
      *@내부신용평가등급구분                                          06720003
           MOVE WK-INTNL-CV-GRD-DSTCD                                   06730019
             TO RJL0045-INTNL-CV-GRD-DSTCD                              06750019
                                                                        06751019
      *@지원비율                                                      06760003
           MOVE WK-SPORT-RATO                                           06770019
             TO RJL0045-SPORT-RATO                                      06780019
                                                                        06781019
      *@상환예상비율                                                  06790003
           MOVE WK-RPAY-ANTICI-RATO                                     06800019
             TO RJL0045-RPAY-ANTICI-RATO                                06810019
                                                                        06811019
      *@BIO CALL                                                        06820019
           #DYDBIO INSERT-CMD-Y TKJL0045-PK TRJL0045-REC                06830019
                                                                        06831019
      *@호출결과확인                                                  06840019
           EVALUATE TRUE                                                06841019
               WHEN COND-DBIO-OK                                        06842019
                    CONTINUE                                            06844019
               WHEN OTHER                                               06845019
      *@원장등록에러일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   06846019
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              06847019
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        06848019
           END-EVALUATE                                                 06849019
           .                                                            06940003
       S3290-THKJL0045-INS-EXT.                                         06960019
           EXIT.                                                        06970003
      *-----------------------------------------------------------------10780003
      *@  한은업종가중치　신규등록처리　프로세스                      10790003
      *-----------------------------------------------------------------10800003
       S3300-HANUN-PROC-RTN.                                            10810003
                                                                        10820021
      *@그리드건수만큼루프를돌면서삭제및등록처리구현                  10840021
           PERFORM VARYING WK-I FROM 1 BY 1                             10850021
             UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT6
                                                                        10870003
                   IF XDJLB023-I-BASE-YM6            (WK-I) = SPACE OR  10871021
                      XDJLB023-I-BOK-MTCN-NAME6      (WK-I) = SPACE     10872021
      *@필수입력항목체크시미입력일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     10876121
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              10876221
                      #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR      10876321
                   END-IF                                               10876421
                                                                        10876521
      *@테이블DELETE
                   PERFORM S3310-THKJL0047-DEL-RTN                      10876621
                      THRU S3310-THKJL0047-DEL-EXT                      10876721

210408         IF XDJLB023-I-PRCSS-DSTIC = CO-CHA-03
      *@테이블INSERT
                   PERFORM S3320-THKJL0047-INS-RTN                      10876921
                      THRU S3320-THKJL0047-INS-EXT                      10877021
               END-IF
           END-PERFORM                                                  10910003
           .                                                            11080003
       S3300-HANUN-PROC-EXT.                                            11100003
           EXIT.                                                        11110003
      *-----------------------------------------------------------------11330003
      *@ 한은업종가중치　기존데이터　삭제                             11340003
      *-----------------------------------------------------------------11350003
       S3310-THKJL0047-DEL-RTN.                                         11360021
                                                                        11361021
      *카피북초기화                                                   11370021
           INITIALIZE TKJL0047-KEY                                      11380021
                      TRJL0047-REC                                      11390021
                                                                        11391021
      *@입력파라미터조립
      *@그룹회사코드                                                  11400003
           MOVE BICOM-GROUP-CO-CD                                       11410021
             TO KJL0047-PK-GROUP-CO-CD                                  11420021
                                                                        11421021
      *@기준년월                                                      11430003
           MOVE XDJLB023-I-BASE-YM6(WK-I)                               11440021
             TO KJL0047-PK-BASE-YM                                      11450021
                                                                        11460021
      *@한은매칭코드                                                  11470003
           MOVE XDJLB023-I-BOK-MTCN-CD6(WK-I)                           11480021
             TO KJL0047-PK-BOK-MTCN-CD                                  11490021
                                                                        11500021
      *@프로그램호출                                                  03030001
           #DYDBIO SELECT-CMD-Y TKJL0047-PK TRJL0047-REC                03040007
                                                                        03050001
      *@호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
               WHEN COND-DBIO-MRNF                                      03052006
                    CONTINUE                                            03053006
               WHEN OTHER                                               03073006
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03074006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@DBIO CALL                                                       11510021
           #DYDBIO DELETE-CMD-Y TKJL0047-PK TRJL0047-REC                11520021
                                                                        11530003
      *@호출결과확인                                                  11531021
           EVALUATE TRUE                                                11532021
               WHEN COND-DBIO-OK                                        11533021
               WHEN COND-DBIO-MRNF                                      11534021
                    CONTINUE                                            11535021
               WHEN OTHER                                               11536021
      *@원장삭제에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   11537021
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              11538021
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        11539021
           END-EVALUATE                                                 11539121
           .                                                            11640003
       S3310-THKJL0047-DEL-EXT.                                         11660021
           EXIT.                                                        11670003
      *-----------------------------------------------------------------11680003
      *@ 한은업종가중치　신규데이터　생성                             11690003
      *-----------------------------------------------------------------11700003
       S3320-THKJL0047-INS-RTN.                                         11710021
                                                                        11720021
      *@입력파라미터조립
      *@그룹회사코드                                                  11750003
           MOVE BICOM-GROUP-CO-CD                                       11760021
             TO RJL0047-GROUP-CO-CD                                     11770021
                                                                        11771021
      *@기준년월                                                      11780003
           MOVE XDJLB023-I-BASE-YM6(WK-I)                               11790021
             TO RJL0047-BASE-YM                                         11810021
                                                                        11811021
      *@한은매칭코드                                                  11820003
           MOVE XDJLB023-I-BOK-MTCN-CD6(WK-I)                           11830021
             TO RJL0047-BOK-MTCN-CD                                     11850021
                                                                        11851021
      *@업종가중평균율                                                11860003
           MOVE XDJLB023-I-BZTYP-WGHTG-AVG-RT6(WK-I)                    11870021
             TO RJL0047-BZTYP-WGHTG-AVG-RT                              11880021
                                                                        11881021
      *@차입금매출액비율                                              11890003
           MOVE XDJLB023-I-AMBR-SALEPR-RATO6(WK-I)                      11900021
             TO RJL0047-AMBR-SALEPR-RATO                                11910021
                                                                        11911021
      *@차입금자기자본율                                              11920003
           MOVE XDJLB023-I-AMBR-ONCP-RT6(WK-I)                          11930021
             TO RJL0047-AMBR-ONCP-RT                                    11940021
                                                                        11941021
      *@차입금총자산비율                                              11950003
           MOVE XDJLB023-I-AMBR-T-ASST-RATO6(WK-I)                      11960021
             TO RJL0047-AMBR-T-ASST-RATO                                11970021
                                                                        11971021
      *@한은매칭명                                                    11980003
           MOVE XDJLB023-I-BOK-MTCN-NAME6(WK-I)                         11990021
             TO RJL0047-BOK-MTCN-NAME                                   12000021
                                                                        12000121
      *@DBIO CALL                                                       12010021
           #DYDBIO INSERT-CMD-Y TKJL0047-PK TRJL0047-REC                12020021
                                                                        12030003
      *@호출결과확인                                                  12031021
           EVALUATE TRUE                                                12032021
               WHEN COND-DBIO-OK                                        12033021
                    CONTINUE                                            12034021
               WHEN OTHER                                               12035021
      *@원장등록에러일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   12036021
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              12037021
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        12038021
           END-EVALUATE                                                 12039021
           .                                                            12130003
       S3320-THKJL0047-INS-EXT.                                         12150021
           EXIT.                                                        12160003
      *-----------------------------------------------------------------12170003
      *@  기준한도적용배수　신규등록처리　프로세스                    12180003
      *-----------------------------------------------------------------12190003
       S3400-GIJUN-PROC-RTN.                                            12200003
                                                                        12210016
      *@입력항목체크                                                  12220003
           PERFORM S3410-INPUT-CHECK-RTN                                12240016
              THRU S3410-INPUT-CHECK-EXT                                12250016
                                                                        12260003
      *@등록처리（건설업）                                            12270003
           MOVE CO-CHA-1                                                12280016
             TO WK-BASE-L-BZTYP-DSTCD                                   12281016
                                                                        12282016
           MOVE XDJLB023-I-CNST-A-USAG-MLPL                             12290016
             TO WK-BASE-L-APLY-MLPL-RT                                  12300018
                                                                        12301016
      *@테이블DELETE
           PERFORM S3420-THKJL0048-DEL-RTN                              12310016
              THRU S3420-THKJL0048-DEL-EXT                              12320016
      *@테이블INSERT
           PERFORM S3430-THKJL0048-INS-RTN                              12330016
              THRU S3430-THKJL0048-INS-EXT                              12340016
                                                                        12350003
      *@등록처리（조선업）                                            12360003
           MOVE CO-CHA-2                                                12370016
             TO WK-BASE-L-BZTYP-DSTCD                                   12371016
                                                                        12372016
           MOVE XDJLB023-I-CREW-AA-USAG-MLPL                            12380016
             TO WK-BASE-L-APLY-MLPL-RT                                  12390016

      *@테이블DELETE                                                  12391016
           PERFORM S3420-THKJL0048-DEL-RTN                              12400003
              THRU S3420-THKJL0048-DEL-EXT                              12410003
      *@테이블INSERT
           PERFORM S3430-THKJL0048-INS-RTN                              12420003
              THRU S3430-THKJL0048-INS-EXT                              12430003

      *@등록처리（렌탈업）                                            12360003
           MOVE CO-CHA-3                                                12370016
             TO WK-BASE-L-BZTYP-DSTCD                                   12371016
                                                                        12372016
           MOVE XDJLB023-I-RENTL-O-APLY-MLPL                            12380016
             TO WK-BASE-L-APLY-MLPL-RT                                  12390016

      *@테이블DELETE                                                  12391016
           PERFORM S3420-THKJL0048-DEL-RTN                              12400003
              THRU S3420-THKJL0048-DEL-EXT                              12410003
      *@테이블INSERT
           PERFORM S3430-THKJL0048-INS-RTN                              12420003
              THRU S3430-THKJL0048-INS-EXT                              12430003
           .                                                            12440003
       S3400-GIJUN-PROC-EXT.                                            12460003
           EXIT.                                                        12470003
      *-----------------------------------------------------------------12480003
      *@  입력항목　체크                                              12490003
      *-----------------------------------------------------------------12500003
       S3410-INPUT-CHECK-RTN.                                           12510003
                                                                        12520016
      *@필수입력항목체크
           IF XDJLB023-I-CNST-A-USAG-MLPL = ZERO                        12530016
      *@필수입력항목체크시에러일경우
      *@에러메세지 : 필수항목미입력오류입니다．                     12531016
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              12532016
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              12533016
           END-IF                                                       12550003
                                                                        12560003
           IF XDJLB023-I-CREW-AA-USAG-MLPL = ZERO                       12570016
      * 에러메세지 : 필수항목미입력오류입니다．                     12571016
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              12572016
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              12573016
           END-IF                                                       12590003

           IF XDJLB023-I-RENTL-O-APLY-MLPL = ZERO                       12570016
      * 에러메세지 : 필수항목미입력오류입니다．                     12571016
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              12572016
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              12573016
           END-IF                                                       12590003
           .                                                            12600003
       S3410-INPUT-CHECK-EXT.                                           12620003
           EXIT.                                                        12630003
      *-----------------------------------------------------------------12640003
      *@ 기준한도업종별적용배수이력　기존데이터　삭제                 12650003
      *-----------------------------------------------------------------12660003
       S3420-THKJL0048-DEL-RTN.                                         12670003
                                                                        12671016
      *카피북초기화                                                   12680016
           INITIALIZE TKJL0048-KEY                                      12690003
                      TRJL0048-REC                                      12700003

      *@입력파라미터조립
      *@그룹회사코드                                                  12710003
           MOVE BICOM-GROUP-CO-CD                                       12720016
             TO KJL0048-PK-GROUP-CO-CD                                  12721016
      *@기준한도업종구분                                              12730003
           MOVE WK-BASE-L-BZTYP-DSTCD                                   12740016
             TO KJL0048-PK-BASE-L-BZTYP-DSTCD                           12741016
      *@등록년월일                                                    12750003
           MOVE BICOM-TRAN-BASE-YMD                                     12760016
             TO KJL0048-PK-REGI-YMD                                     12761016

      *@프로그램호출                                                  03030001
           #DYDBIO SELECT-CMD-Y TKJL0048-PK TRJL0048-REC                03040007
                                                                        03050001
      *@호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
               WHEN COND-DBIO-MRNF                                      03052006
                    CONTINUE                                            03053006
               WHEN OTHER                                               03073006
      *@원장조회에러일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   03074006
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@DBIO CALL                                                       12770016
           #DYDBIO DELETE-CMD-Y TKJL0048-PK TRJL0048-REC                12780016
                                                                        12790003
      *@호출결과확인
           IF COND-DBIO-OK OR                                           12800016
              COND-DBIO-MRNF                                            12810016
              CONTINUE                                                  12820016
           ELSE                                                         12830003
      *@원장삭제에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   12831016
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              12832016
              #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR              12833016
           END-IF                                                       12890003
           .                                                            12900003
       S3420-THKJL0048-DEL-EXT.                                         12920003
           EXIT.                                                        12930003
      *-----------------------------------------------------------------12940003
      *@ 기준한도업종별적용배수　등록                                 12950016
      *-----------------------------------------------------------------12960003
       S3430-THKJL0048-INS-RTN.                                         12970003
                                                                        12980016
      *@입력파라미터조립
      *@그룹회사코드                                                  13010003
           MOVE BICOM-GROUP-CO-CD                                       13020016
             TO RJL0048-GROUP-CO-CD                                     13030016
      *@기준한도업종구분                                              13040003
           MOVE WK-BASE-L-BZTYP-DSTCD                                   13050016
             TO RJL0048-BASE-L-BZTYP-DSTCD                              13060016
      *@등록년월일                                                    13070003
           MOVE BICOM-TRAN-BASE-YMD                                     13080016
             TO RJL0048-REGI-YMD                                        13090016
      *@기준한도적용배수율                                            13100003
           MOVE WK-BASE-L-APLY-MLPL-RT                                  13110016
             TO RJL0048-BASE-L-APLY-MLPL-RT                             13120016
      *@DBIO CALL                                                       13130016
           #DYDBIO INSERT-CMD-Y TKJL0048-PK TRJL0048-REC                13140016
                                                                        13150003
      *@호출결과확인                                                  13151016
           EVALUATE TRUE                                                13152016
               WHEN COND-DBIO-OK                                        13153016
                    CONTINUE                                            13154016
               WHEN OTHER                                               13155016
      *@원장등록에러일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   13156016
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              13157016
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        13158016
           END-EVALUATE                                                 13159016
           .                                                            13250003
       S3430-THKJL0048-INS-EXT.                                         13270003
           EXIT.                                                        13280003

      *-----------------------------------------------------------------02490003
      *@  장외파생상품SUB-LIMIT 등록처리　프로세스
      *-----------------------------------------------------------------02510003
       S3500-SUBLIMIT-PROC-RTN.                                         02520003

      *@  장외파생상품SUB-LIMIT등록프로세스처리
      *@  입력항목　체크                                              02540003
           PERFORM S3510-INPUT-DATA-CHECK-RTN                           02550013
              THRU S3510-INPUT-DATA-CHECK-EXT                           02560013

      *@1.1 SUB한도관리(THKJL0063)삭제                              0253
           PERFORM S3520-THKJL0063-DELETE-RTN                           02537009
              THRU S3520-THKJL0063-DELETE-EXT                           02538009
                                                                        02539009
      *@1.2 SUB한도관리(THKJL0063)등록
           PERFORM S3530-THKJL0063-INSERT-RTN                           02539409
              THRU S3530-THKJL0063-INSERT-EXT                           02539509
           .                                                            02730003

       S3500-SUBLIMIT-PROC-EXT.                                         02750003
           EXIT.                                                        02760003

      *-----------------------------------------------------------------02770003
      *@  입력항목　필수입력　체크(장외파생상품)
      *-----------------------------------------------------------------02800003
       S3510-INPUT-DATA-CHECK-RTN.                                      02810003
                                                                        02820013
      *@  필수입력파라미터값에대한검증
      *@   SUB한도                                                    02821013
           IF XDJLB023-I-SUB-CLAM = ZERO                                02830013
      * 에러메세지 : 필수항목미입력오류입니다．                     02831013
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              02832013
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              02833013
           END-IF                                                       02850003
           .                                                            02980003

       S3510-INPUT-DATA-CHECK-EXT.                                      03000003
           EXIT.                                                        03010003

      *-----------------------------------------------------------------02700000
      *@  SUB한도관리(THKJL0063)삭제                                0271
      *-----------------------------------------------------------------02720000
       S3520-THKJL0063-DELETE-RTN.                                      02730000

      *@1.1.1 변수초기화                                              025410
           INITIALIZE TKJL0063-KEY                                      02541109
                      TRJL0063-REC                                      02541209

      *@1.1.2 변수 MOVE                                               025413
      *@  그룹회사코드                                                025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0063-PK-GROUP-CO-CD                                  02541609
      *@  기준년월                                                    025417
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO KJL0063-PK-BASE-YM                                      02541909
      *@   SUB한도구분(3:장외파생상품)
210408     MOVE '3'
             TO KJL0063-PK-SUB-LIMT-DSTCD

      *@1.1.3 프로그램　호출                                          025423
           #DYDBIO SELECT-CMD-Y TKJL0063-PK TRJL0063-REC                02542409

      *@1.1.4 호출결과확인                                            025425
           EVALUATE TRUE                                                02542609
           WHEN COND-DBIO-OK                                            02542709
           WHEN COND-DBIO-MRNF                                          03193113
                CONTINUE
           WHEN OTHER                                                   02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   0254
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               0254
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709

           #DYDBIO DELETE-CMD-Y TKJL0063-PK TRJL0063-REC
                                                                        03190003
      *@호출결과확인                                                  03191013
           EVALUATE TRUE                                                03192013
           WHEN COND-DBIO-OK                                            03193013
           WHEN COND-DBIO-MRNF                                          03193113
                CONTINUE                                                03194013
           WHEN OTHER                                                   03195013
      *@원장조회에러일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   03196013
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03197013
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        03198013
           END-EVALUATE                                                 03199013
           .

       S3520-THKJL0063-DELETE-EXT.                                      02990000
           EXIT.                                                        03000000

      *-----------------------------------------------------------------03440000
      *@  SUB한도관리(THKJL0063)등록
      *-----------------------------------------------------------------03460000
       S3530-THKJL0063-INSERT-RTN.                                      03470000

      *@입력파라미터조립
      *@  그룹회사코드                                                025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO RJL0063-GROUP-CO-CD                                     02541609
      *@  기준년월                                                    025417
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO RJL0063-BASE-YM                                         02541909
210408*@   SUB한도구분(3:장외파생상품)
           MOVE '3'
             TO RJL0063-SUB-LIMT-DSTCD
      *@   SUB한도                                                    025455
           COMPUTE RJL0063-SUB-CLAM                                     03480013
                 = XDJLB023-I-SUB-CLAM * 1000000                        03481013

      *@프로그램호출                                                  025515
           #DYDBIO INSERT-CMD-Y TKJL0063-PK TRJL0063-REC                02551609

      *@호출결과확인                                                  025517
           EVALUATE TRUE                                                02551809
           WHEN COND-DBIO-OK                                            02551909
                CONTINUE                                                02552009
           WHEN OTHER                                                   02552109
      *@에러메세지 : 테이블 INSERT 오류입니다．                   03586013
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03587013
                #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR            03588013
           END-EVALUATE                                                 02552509
           .                                                            03800000

       S3530-THKJL0063-INSERT-EXT.                                      03820000
           EXIT.                                                        03830000

      *-----------------------------------------------------------------
211000*@  산업분류별 적용비율
      *-----------------------------------------------------------------
       S3600-IDSTRY-PROC-RTN.

           #USRLOG  "=================================================="
           #USRLOG  " PRCSS-DSTIC     : " XDJLB023-I-PRCSS-DSTIC
           #USRLOG  " OUTPT-LINE-CNT7 : " XDJLB023-I-OUTPT-LINE-CNT7
           #USRLOG  "=================================================="

      *    07 : 등록
           IF  XDJLB023-I-PRCSS-DSTIC  = CO-CHA-07

               PERFORM VARYING WK-I FROM 1 BY 1
               UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT7

                     PERFORM S3610-THKJL0046-SELECT-RTN
                        THRU S3610-THKJL0046-SELECT-EXT
               END-PERFORM

      *    08 : 삭제
           ELSE
               PERFORM VARYING WK-I FROM 1 BY 1
               UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT7

                     PERFORM S3640-THKJL0046-DELETE-RTN
                        THRU S3640-THKJL0046-DELETE-EXT
               END-PERFORM
           END-IF

           .
       S3600-IDSTRY-PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
211000*@  산업분류별 적용비율 조회
      *-----------------------------------------------------------------
       S3610-THKJL0046-SELECT-RTN.

      *  카피북초기화
           INITIALIZE TKJL0046-KEY
                      TRJL0046-REC

      *@1 입력파라미터　조립
      *   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO KJL0046-PK-GROUP-CO-CD
      *         기준년월
           IF   XDJLB023-I-BASE-YM7 (WK-I)  = SPACE
                MOVE BICOM-TRAN-BASE-YMD(1:6)
                  TO KJL0046-PK-BASE-YM
           ELSE
                MOVE XDJLB023-I-BASE-YM7 (WK-I)
                  TO KJL0046-PK-BASE-YM
           END-IF

      *         TE산업분류코드
           MOVE XDJLB023-I-TE-IDSTRY-CLSFI-CD (WK-I)
             TO KJL0046-PK-TE-IDSTRY-CLSFI-CD

           #USRLOG  "=================================================="
           #USRLOG  "*        INPUT DBIO SELECT DATA                  *"
           #USRLOG  "=================================================="
           #USRLOG  " BASE-YM                 : " KJL0046-PK-BASE-YM
           #USRLOG  " TE-IDSTRY-CLSFI-CD      : "
           KJL0046-PK-TE-IDSTRY-CLSFI-CD
           #USRLOG  "=================================================="

      *@1  DBIO프로그램　호출
           #DYDBIO SELECT-CMD-Y  TKJL0046-PK TRJL0046-REC

      *   호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
      *           수정
                  PERFORM S3620-THKJL0046-UPDATE-RTN
                     THRU S3620-THKJL0046-UPDATE-EXT
           WHEN COND-DBIO-MRNF
      *           등록
                  PERFORM S3630-THKJL0046-INSERT-RTN
                     THRU S3630-THKJL0046-INSERT-EXT
                CONTINUE
           WHEN OTHER
      *원장에러일경우　에러처리
      *@에러메세지 : 데이터를 검색할 수 없습니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
               #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3610-THKJL0046-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  THKJL0046 수정
      *-----------------------------------------------------------------
       S3620-THKJL0046-UPDATE-RTN.

      *--         TE산업분류코드명
           MOVE  XDJLB023-I-TE-I-CLSFI-CD-NAME (WK-I)
             TO  RJL0046-TE-I-CLSFI-CD-NAME
      *--         TE자기자본비율
           MOVE  XDJLB023-I-TE-ONCP-RATO (WK-I)
             TO  RJL0046-TE-ONCP-RATO
      *--         TE매출액비율
           MOVE  XDJLB023-I-TE-SALEPR-RATO (WK-I)
             TO  RJL0046-TE-SALEPR-RATO
      *--         TE총자산비율
           MOVE  XDJLB023-I-TE-TOTAL-ASST-RATO (WK-I)
             TO  RJL0046-TE-TOTAL-ASST-RATO

      *@1 산업분류가중치기본 (수정)
           #DYDBIO UPDATE-CMD-Y TKJL0046-PK TRJL0046-REC

      *   처리결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
               CONTINUE
           WHEN OTHER
      *@에러메세지 : 데이터를 변경 할 수 없습니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
               #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3620-THKJL0046-UPDATE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  THKJL0046 입력
      *-----------------------------------------------------------------
       S3630-THKJL0046-INSERT-RTN.

      *@2.1변수초기화
           INITIALIZE TKJL0046-KEY
                      TRJL0046-REC

      *@입력파라미터조립
      *         그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO RJL0046-GROUP-CO-CD
      *         기준년월
           MOVE BICOM-TRAN-BASE-YMD(1:6)
             TO RJL0046-BASE-YM

      *--         TE산업분류코드
           MOVE  XDJLB023-I-TE-IDSTRY-CLSFI-CD (WK-I)
             TO  RJL0046-TE-IDSTRY-CLSFI-CD
      *--         TE산업분류코드명
           MOVE  XDJLB023-I-TE-I-CLSFI-CD-NAME (WK-I)
             TO  RJL0046-TE-I-CLSFI-CD-NAME
      *--         TE자기자본비율
           MOVE  XDJLB023-I-TE-ONCP-RATO (WK-I)
             TO  RJL0046-TE-ONCP-RATO
      *--         TE매출액비율
           MOVE  XDJLB023-I-TE-SALEPR-RATO (WK-I)
             TO  RJL0046-TE-SALEPR-RATO
      *--         TE총자산비율
           MOVE  XDJLB023-I-TE-TOTAL-ASST-RATO (WK-I)
             TO  RJL0046-TE-TOTAL-ASST-RATO

           #USRLOG  "=================================================="
           #USRLOG  "*        THKJL0046 INSERT DATA                   *"
           #USRLOG  "=================================================="
           #USRLOG  " BASE-YM         : "  RJL0046-BASE-YM
           #USRLOG  " IDSTRY-CLSFI-CD : "  RJL0046-TE-IDSTRY-CLSFI-CD
           #USRLOG  " CLSFI-CD-NAME   : "  RJL0046-TE-I-CLSFI-CD-NAME
      *    #USRLOG  " ONCP-RATO       : "  RJL0046-TE-ONCP-RATO
      *    #USRLOG  " SALEPR-RATO     : "  RJL0046-TE-SALEPR-RATO
      *    #USRLOG  " TOTAL-ASST-RATO : "  RJL0046-TE-TOTAL-ASST-RATO
           #USRLOG  "=================================================="

      *@프로그램호출
           #DYDBIO INSERT-CMD-Y TKJL0046-PK TRJL0046-REC

      *@호출결과확인
           EVALUATE TRUE
               WHEN COND-DBIO-OK
                    CONTINUE
               WHEN OTHER
      *@원장에러일경우에러처리
      *@에러메세지 : 데이터를 생성할 수 없습니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B3900010 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3630-THKJL0046-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  THKJL0046 삭제
      *-----------------------------------------------------------------
       S3640-THKJL0046-DELETE-RTN.

           #USRLOG  " S3640-THKJL0046-DELETE-RTN "

      *  카피북초기화
           INITIALIZE TKJL0046-KEY
                      TRJL0046-REC

      *@1 입력파라미터　조립
      *   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO KJL0046-PK-GROUP-CO-CD
      *         기준년월
           MOVE XDJLB023-I-BASE-YM7 (WK-I)
             TO KJL0046-PK-BASE-YM
      *         TE산업분류코드
           MOVE XDJLB023-I-TE-IDSTRY-CLSFI-CD (WK-I)
             TO KJL0046-PK-TE-IDSTRY-CLSFI-CD

           #USRLOG  "=================================================="
           #USRLOG  " BASE-YM         : " KJL0046-PK-BASE-YM
           #USRLOG  " IDSTRY-CLSFI-CD : " KJL0046-PK-TE-IDSTRY-CLSFI-CD
           #USRLOG  "=================================================="

           #DYDBIO SELECT-CMD-Y  TKJL0046-PK TRJL0046-REC

      *@1 DBIO 처리결과확인 ERROR 처리
           EVALUATE TRUE
           WHEN COND-DBIO-OK
           WHEN COND-DBIO-MRNF
               CONTINUE
           WHEN OTHER
               #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@1  산업분류가중치기본 삭제
           #DYDBIO DELETE-CMD-Y  TKJL0046-PK TRJL0046-REC

           EVALUATE TRUE
           WHEN COND-DBIO-OK
           WHEN COND-DBIO-MRNF
               CONTINUE
           WHEN OTHER
               #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3640-THKJL0046-DELETE-EXT.
           EXIT.

      *-----------------------------------------------------------------
211000*@  금융업종평균 자기자본비율
      *-----------------------------------------------------------------
       S3700-FINAC-PROC-RTN.

           #USRLOG  "=================================================="
           #USRLOG  " PRCSS-DSTIC     : " XDJLB023-I-PRCSS-DSTIC
           #USRLOG  " OUTPT-LINE-CNT8 : " XDJLB023-I-OUTPT-LINE-CNT8
           #USRLOG  "=================================================="

           PERFORM VARYING WK-I FROM 1 BY 1
           UNTIL WK-I > XDJLB023-I-OUTPT-LINE-CNT8

                 PERFORM S3710-THKJL0050-SELECT-RTN
                    THRU S3710-THKJL0050-SELECT-EXT
           END-PERFORM

           .
       S3700-FINAC-PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
211000*@  금융업종평균 자기자본비율
      *-----------------------------------------------------------------
       S3710-THKJL0050-SELECT-RTN.

      *  카피북초기화
           INITIALIZE TKJL0050-KEY
                      TRJL0050-REC

      *@1 입력파라미터　조립
      *   그룹회사코드
           MOVE BICOM-GROUP-CO-CD
             TO KJL0050-PK-GROUP-CO-CD
      *   기준년월
           MOVE XDJLB023-I-BASE-YM8 (WK-I)
             TO KJL0050-PK-BASE-YM
      *   한신평재무업종구분
           MOVE XDJLB023-I-KIS-FZ-BZTYP-DSTIC (WK-I)
             TO KJL0050-PK-KIS-F-BZTYP-DSTCD

           #USRLOG  "=================================================="
           #USRLOG  "*        INPUT DBIO SELECT DATA                  *"
           #USRLOG  "=================================================="
           #USRLOG  " BASE-YM           : " KJL0050-PK-BASE-YM
           #USRLOG  " KIS-F-BZTYP-DSTCD : " KJL0050-PK-KIS-F-BZTYP-DSTCD
           #USRLOG  "=================================================="

      *@1  DBIO프로그램　호출
           #DYDBIO SELECT-CMD-Y  TKJL0050-PK TRJL0050-REC

      *   호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
                  CONTINUE
           WHEN OTHER
      *원장에러일경우　에러처리
      *@에러메세지 : 데이터를 검색할 수 없습니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
               #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *--  금융자기자본비율
           MOVE  XDJLB023-I-FINAC-ONCP-RATO (WK-I)
             TO  RJL0050-FINAC-ONCP-RATO

      *@1 DBIO프로그램　호출
           #DYDBIO UPDATE-CMD-Y TKJL0050-PK TRJL0050-REC

      *   처리결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
               CONTINUE
           WHEN OTHER
      *@에러메세지 : 데이터를 변경 할 수 없습니다.
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
               #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

           .
       S3710-THKJL0050-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------13290003
      *@  처리종료                                                    13300003
      *-----------------------------------------------------------------13310003
       S9000-FINAL-RTN.                                                 13320003

      *    정상종료                                                   13330003
           MOVE CO-STAT-OK                                              13331016
             TO XDJLB023-O-PRCSS-RSULT                                  13332016
                                                                        13333016
           #OKEXIT  CO-STAT-OK                                          13340003
           .                                                            13350003
       S9000-FINAL-EXT.                                                 13370003
           EXIT.                                                        13380003
