      *=================================================================
      *@업무명    : KJL     (Total Exposure)
      *@프로그램명: DJLB191 (DC신용공여계정과목정보등록)
      *@처리유형  : DC
      *@처리개요  : 신용공여관련 계정과목정보를 등록하는
      *@            : 프로그램이다
      *-----------------------------------------------------------------
      *                 P R O G R A M   변　경　이　력
      *-----------------------------------------------------------------
      *@성명 : 일자 : 변　경　내　용
      * ----------------------------------------------------------------
      *홍길동:20120906: 신규작성
      *박정수:20240425: 신용공여중분류 추가
      *=================================================================
      ******************************************************************
      **
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형
      **  ----------------   -------------------------------------------
      **                   : THKJL0119                     : CRUD
      **
      ******************************************************************
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     DJLB191.
       AUTHOR.                        하윤희.
       DATE-WRITTEN.                   12/09/06.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.

      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.

      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJLB191'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-DUPM            PIC  X(002) VALUE '01'.
           03  CO-STAT-NOTFND          PIC  X(002) VALUE '02'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.

           03  CO-B4200221             PIC  X(008) VALUE 'B4200221'.
           03  CO-B4200224             PIC  X(008) VALUE 'B4200224'.
           03  CO-B4200066             PIC  X(008) VALUE 'B4200066'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200219             PIC  X(008) VALUE 'B4200219'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).
      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      * TABLE INTERFACE PARAMETER
      *-----------------------------------------------------------------
       01  TRJL0119-REC.
           COPY  TRJL0119.

       01  TKJL0119-KEY.
           COPY  TKJL0119.

      *-----------------------------------------------------------------
      * DBIO SQLIO INTERFACE PARAMETER
      *-----------------------------------------------------------------
           COPY    YCDBIOCA.
           COPY    YCDBSQLA.
      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------

       01  YCCOMMON-CA.
           COPY  YCCOMMON.

       01  XDJLB191-CA.
           COPY  XDJLB191.


      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XDJLB191-CA
                                                   .
      *=================================================================

      *-----------------------------------------------------------------
      *@  처리메인
      *-----------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  초기화
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  입력값　CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  업무처리
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  처리종료
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  초기화
      *-----------------------------------------------------------------
       S1000-INITIALIZE-RTN.
           INITIALIZE       WK-AREA
                            XDJLB191-OUT
                            XDJLB191-RETURN
      *@DBIO, SQLIO PARAMETER 초기화
                            YCDBIOCA-CA
                            YCDBSQLA-CA
                            .
       S1000-INITIALIZE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  입력값검증
      *-----------------------------------------------------------------
       S2000-VALIDATION-RTN.
       S2000-VALIDATION-EXT.
           EXIT.

      *------------------------------------------------------------------
      *@  업무처리
      *------------------------------------------------------------------
       S3000-PROCESS-RTN.

      *   처리구분
           EVALUATE XDJLB191-I-PRCSS-DSTIC
           WHEN CO-CHA-02
      *#1     처리구분이 ０２등록인 경우
      *@1     신용공여기관정보등록
               PERFORM S3100-INSERT-PROC-RTN
                  THRU S3100-INSERT-PROC-EXT
           WHEN CO-CHA-04
      *#1     처리구분이 ０４삭제인 인경우
      *@1     신용공여기관정보삭제
               PERFORM S3200-DELETE-PROC-RTN
                  THRU S3200-DELETE-PROC-EXT
           END-EVALUATE

                        .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여계정과목정보(THKJL0119)
      *-----------------------------------------------------------------
       S3100-INSERT-PROC-RTN.

      *    카피북초기화
           INITIALIZE                  TKJL0119-KEY
                                       TRJL0119-REC

      *@1  입력파라미터　조립
      *    그룹회사코드
           MOVE  BICOM-GROUP-CO-CD
             TO  KJL0119-PK-GROUP-CO-CD

      *    기준년월
           MOVE  XDJLB191-I-BASE-YM
             TO  KJL0119-PK-BASE-YM

      *    통합계정과목코드

           MOVE  XDJLB191-I-INTGRA-TIACC-CD
             TO  KJL0119-PK-INTGRA-TIACC-CD

      *@1  DBIO프로그램　호출
           #DYDBIO  SELECT-CMD-Y  TKJL0119-PK  TRJL0119-REC

      *    호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
      *#1      원장에 존재할 경우
      *@1      신용공여계정과목정보수정
               PERFORM S3140-THKJL0119-UPDATE-RTN
                  THRU S3140-THKJL0119-UPDATE-EXT
           WHEN COND-DBIO-MRNF
      *#1      원장에존재하지않을경우
      *@1      신용공여계정과목정보등록
               PERFORM S3130-THKJL0119-INSERT-RTN
                  THRU S3130-THKJL0119-INSERT-EXT
           WHEN OTHER
      *       원장에러일경우　에러처리
               #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .

       S3100-INSERT-PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여계정과목정보등록처리
      *-----------------------------------------------------------------
       S3130-THKJL0119-INSERT-RTN.

      *@1 입력값조립

      *    그룹회사코드
           MOVE  BICOM-GROUP-CO-CD
             TO  RJL0119-GROUP-CO-CD

      *    기준년월
           MOVE  XDJLB191-I-BASE-YM
             TO  RJL0119-BASE-YM

      *    통합계정과목코드
           MOVE  XDJLB191-I-INTGRA-TIACC-CD
             TO  RJL0119-INTGRA-TIACC-CD

      *    계정과목명
           MOVE  XDJLB191-I-TIACC-NAME
             TO  RJL0119-TIACC-NAME

      *    계정과목CCF환산율
           MOVE  XDJLB191-I-TIACC-CCF-UTCRT
             TO  RJL0119-TIACC-CCF-UTCRT

      *    신용공여계정구분
           MOVE  XDJLB191-I-GRCR-ACITM-DSTCD
             TO  RJL0119-GRCR-ACITM-DSTCD

      *    신용공여대상구분
           MOVE  XDJLB191-I-GRCR-TAGET-DSTCD
             TO  RJL0119-GRCR-TAGET-DSTCD

240425*    신용공여중분류코드
           MOVE  XDJLB191-I-GRCR-MIDL-CLSFI-CD
             TO  RJL0119-GRCR-MIDL-CLSFI-CD

240425*    신용공여중분류코드명
           MOVE  XDJLB191-I-GRCR-MC-CD-NAME
             TO  RJL0119-GRCR-MC-CD-NAME

      *@1  신용공여계정과목정보등록 프로그램호출
           #DYDBIO  INSERT-CMD-Y  TKJL0119-PK  TRJL0119-REC

      *    DBIO호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
                CONTINUE
           WHEN OTHER
                #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

                                 .
       S3130-THKJL0119-INSERT-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여계정과목정보수정처리
      *-----------------------------------------------------------------
       S3140-THKJL0119-UPDATE-RTN.

      *@1 입력값조립

      *    계정과목명
           MOVE  XDJLB191-I-TIACC-NAME
             TO  RJL0119-TIACC-NAME

      *    계정과목CCF환산율
           MOVE  XDJLB191-I-TIACC-CCF-UTCRT
             TO  RJL0119-TIACC-CCF-UTCRT

      *    신용공여계정구분
           MOVE  XDJLB191-I-GRCR-ACITM-DSTCD
             TO  RJL0119-GRCR-ACITM-DSTCD

      *    신용공여대상구분
           MOVE  XDJLB191-I-GRCR-TAGET-DSTCD
             TO  RJL0119-GRCR-TAGET-DSTCD

240425*    신용공여중분류코드
           MOVE  XDJLB191-I-GRCR-MIDL-CLSFI-CD
             TO  RJL0119-GRCR-MIDL-CLSFI-CD

240425*    신용공여중분류명
           MOVE  XDJLB191-I-GRCR-MC-CD-NAME
             TO  RJL0119-GRCR-MC-CD-NAME

      *@1 신용공여계정과목정보수정 프로그램호출
           #DYDBIO  UPDATE-CMD-Y  TKJL0119-PK  TRJL0119-REC

      *   처리결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
               CONTINUE
           WHEN OTHER
               #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

                                 .
       S3140-THKJL0119-UPDATE-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  신용공여계정과목정보삭제처리
      *-----------------------------------------------------------------
       S3200-DELETE-PROC-RTN.

      *    카피북초기화
           INITIALIZE                  TKJL0119-KEY
                                       TRJL0119-REC

      *@1  입력파라미터　조립
      *    그룹회사코드
           MOVE  BICOM-GROUP-CO-CD
             TO  KJL0119-PK-GROUP-CO-CD

      *    기준년월
           MOVE  XDJLB191-I-BASE-YM
             TO  KJL0119-PK-BASE-YM

      *    통합계정과목코드
           MOVE  XDJLB191-I-INTGRA-TIACC-CD
             TO  KJL0119-PK-INTGRA-TIACC-CD

      *@1  DBIO프로그램호출
           #DYDBIO  SELECT-CMD-Y  TKJL0119-PK  TRJL0119-REC

      *   호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
               CONTINUE
           WHEN COND-DBIO-MRNF
               #ERROR CO-B4200066 CO-UKJL0036 CO-STAT-ERROR
           WHEN OTHER
               #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

      *@1 원장삭제를위한DBIO프로그램호출
           #DYDBIO DELETE-CMD-Y TKJL0119-PK TRJL0119-REC

      *   호출결과확인
           EVALUATE TRUE
           WHEN COND-DBIO-OK
               CONTINUE
           WHEN OTHER
               #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE

                            .
       S3200-DELETE-PROC-EXT.
           EXIT.
      *------------------------------------------------------------------
      *@  처리종료
      *------------------------------------------------------------------
       S9000-FINAL-RTN.
           #OKEXIT  CO-STAT-OK.
       S9000-FINAL-EXT.
           EXIT.
