      *=================================================================00010000
      *@업무명    : KJL     (Total Exposure)                          00020000
      *@프로그램명: DJLB044 (DC한도관리제외대상차주등록)            00030000
      *@처리유형  : DC                                                00040000
      *@처리개요  : 한도관리 제외대상 차주 등록처리하는 프  00050000
      *@            : 로그램이다                                      00060000
      *-----------------------------------------------------------------00070000
      *                 P R O G R A M   변　경　이　력                00080000
      *-----------------------------------------------------------------00090000
      *@성명 : 일자 : 변　경　내　용                              00100000
      * ----------------------------------------------------------------00110000
      *이동구:20081127: 신규작성                                    00120000
      *김진태:20090720: 프로그램수정                                00120000
      *김진태:20091008: 시스템최종처리일시，시스템최종사용자번호삭제00120000
      *김진태:20091211: 에러메세지정비                              00120000
      *김진태:20091211: DBIO => SQLIO (QJLZ001)                       00120000
      *박주희:20170626: KB-PIN 전환（３차）　                       0012
      *=================================================================00130000
      ******************************************************************00140000
      **  TABLE-SYNONYM    : 테이블명                    : 접근유형 00160000
      **  ----------------   -------------------------------------------00170000
      ** 채무자고객기본  : THKJL0015                     : XRXX       00180000
      ** 한도관리제외대상: THKJL0017                     : CRUD       00190000
      ******************************************************************00220000
       IDENTIFICATION                  DIVISION.                        00230000
      *=================================================================00240000
       PROGRAM-ID.                     DJLB044.                         00250000
       AUTHOR.                         이동구.                        00260000
       DATE-WRITTEN.                   08/11/27.                        00270000
      *=================================================================00290000
       ENVIRONMENT                     DIVISION.                        00300000
      *=================================================================00310000
       CONFIGURATION                   SECTION.                         00320000
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00340000
       DATA                            DIVISION.                        00350000
      *=================================================================00360000
       WORKING-STORAGE                 SECTION.                         00370000
      *-----------------------------------------------------------------00380000
      *CONSTANT ERROR AREA                                              00390000
      *-----------------------------------------------------------------00400000
       01  CO-ERROR-AREA.
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.
           03  CO-B4200066             PIC  X(008) VALUE 'B4200066'.
           03  CO-B4200219             PIC  X(008) VALUE 'B4200219'.
           03  CO-B4200221             PIC  X(008) VALUE 'B4200221'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200224             PIC  X(008) VALUE 'B4200224'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.
      *-----------------------------------------------------------------00510000
      * CONSTANT AREA                                                   00520000
      *-----------------------------------------------------------------00530000
       01  CO-AREA.                                                     00540000
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJLB044'.     00550000
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00560000
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00570000
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00580000
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00590000
                                                                        00600000
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00610000
           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00620000
           03  CO-CHA-03               PIC  X(002) VALUE '03'.          00630000
           03  CO-CHA-04               PIC  X(002) VALUE '04'.          00640000

           03  CO-CHA-I                PIC  X(001) VALUE 'I'.
           03  CO-CHA-U                PIC  X(001) VALUE 'U'.
      *-----------------------------------------------------------------00650000
      * WORKING AREA                                                    00660000
      *-----------------------------------------------------------------00670000
       01  WK-AREA.                                                     00680000
           03  WK-I                    PIC  9(005) COMP.                00690000
           03  WK-BIT                  PIC  X(001).                     00700000
      *-----------------------------------------------------------------00720000
      * DBIO SQLIO INTERFACE PARAMETER                                  00730000
      *-----------------------------------------------------------------00740000
      * DBIO  INTERFACE PARAMETER
           COPY  YCDBIOCA.                                              00750000
      * SQLIO INTERFACE PARAMETER
           COPY  YCDBSQLA.                                              00750000
      *-----------------------------------------------------------------00780000
      * TABLE ACCESS INTERFACE PARAMETER                                00790000
      * LIBRARY : KJL.DDB2.DBCOPY                                       00800000
      *-----------------------------------------------------------------00810000
      * DBIO ACCESS KEY관리                                           00820000
      *한도관리제외대상차주명세　테이블(KEY)                          00920000
       01  TKJL0017-KEY.                                                00930000
           COPY  TKJL0017.                                              00940000
      *한도관리제외대상차주명세　테이블(RECORD)                       00950000
       01  TRJL0017-REC.                                                00960000
           COPY  TRJL0017.                                              00970000
170626*채무자고객기본　테이블(KEY)                                    00920000
       01  TKJL0015-KEY.                                                00930000
           COPY  TKJL0015.                                              00940000
      *채무자고객기본　테이블(RECORD)                                 00950000
       01  TRJL0015-REC.                                                00960000
           COPY  TRJL0015.                                              00970000
      *-----------------------------------------------------------------00990000
      * PGM INTERFACE PARAMETER                                         01000000
      *-----------------------------------------------------------------01010000
      *-----------------------------------------------------------------01030000
       LINKAGE                         SECTION.                         01040000
      *-----------------------------------------------------------------01050000
      * COMMON COPYBOOK                                                 01060000
       01  YCCOMMON-CA.                                                 01070000
           COPY  YCCOMMON.                                              01080000
      * DC COPYBOOK                                                     01090000
       01 XDJLB044-CA.                                                  01100000
           COPY  XDJLB044.                                              01110000
      *=================================================================01140000
       PROCEDURE                       DIVISION                         01150000
                                       USING       YCCOMMON-CA          01160000
                                                   XDJLB044-CA          01170000
                                                   .                    01180000
      *=================================================================01190000
                                                                        01200000
      *-----------------------------------------------------------------01210000
      *@  처리메인                                                    01220000
      *-----------------------------------------------------------------01230000
       S0000-MAIN-RTN.                                                  01240000
                                                                        01250000
      *@  초기화                                                      01260000
           PERFORM S1000-INITIALIZE-RTN                                 01270000
              THRU S1000-INITIALIZE-EXT                                 01280000
                                                                        01290000
      *@  입력값　CHECK                                               01300000
           PERFORM S2000-VALIDATION-RTN                                 01310000
              THRU S2000-VALIDATION-EXT                                 01320000
                                                                        01330000
      *@  업무처리                                                    01340000
           PERFORM S3000-PROCESS-RTN                                    01350000
              THRU S3000-PROCESS-EXT                                    01360000
                                                                        01370021
      *@  처리종료                                                    01420000
           PERFORM S9000-FINAL-RTN                                      01430000
              THRU S9000-FINAL-EXT                                      01440000
           .                                                            01450000
       S0000-MAIN-EXT.                                                  01460000
           EXIT.                                                        01470000
      *-----------------------------------------------------------------01490000
      *@  초기화                                                      01500000
      *-----------------------------------------------------------------01510000
       S1000-INITIALIZE-RTN.                                            01520000
                                                                        01530000
      *@WK-AREA및　프로그램파라미터　초기화                           01540000
           INITIALIZE WK-AREA                                           01560000
      *               DBIO
                      YCDBIOCA-CA                                       01570000
      *               SQLIO
                      YCDBSQLA-CA                                       01570000
                                                                        01630000
      *@출력영역및　결과코드　초기화                                  01640000
           INITIALIZE XDJLB044-OUT                                      01650000
                      XDJLB044-RETURN                                   01660000
           .                                                            01670000
       S1000-INITIALIZE-EXT.                                            01690000
           EXIT.                                                        01700000
      *-----------------------------------------------------------------01710000
      *@  입력값검증                                                  01720000
      *@처리구분＇０２＇　：　등록                                    01730000
      *@　　　　＇０４＇　：　삭제                                    01740000
      *-----------------------------------------------------------------01750000
       S2000-VALIDATION-RTN.                                            01760000

      *@처리구분이　＇등록및삭제＇　이외는 ERROR                      01701008
           IF XDJLB044-I-PRCSS-DSTIC = CO-CHA-02 OR CO-CHA-04           01702008
              CONTINUE                                                  01703008
           ELSE                                                         01704008
      *@에러메세지 : 처리구분오류입니다．                           01705008
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              01706008
              #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR              01707008
           END-IF                                                       01708008
                                                                        01709008
      *@   채무자번호                                                 01709108
           IF XDJLB044-I-BRWR-NO = SPACE                                01709208
      * 에러메세지 : 필수항목미입력오류입니다．                     01709308
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01709408
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01709508
           END-IF                                                       01709608
                                                                        01709708
      *@   제외사유                                                   01711208
           IF XDJLB044-I-ECLUD-RESN = SPACE                             01711308
      * 에러메세지 : 필수항목미입력오류입니다．                     01711408
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.              01711508
              #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR              01711608
           END-IF                                                       01711708
                                                                        01711808
           .                                                            02330001
       S2000-VALIDATION-EXT.                                            01980000
           EXIT.                                                        01990000
      *-----------------------------------------------------------------02000000
      *@  업무처리                                                    02010000
      *-----------------------------------------------------------------02020000
       S3000-PROCESS-RTN.                                               02030000
                                                                        02040000
      *@   등록（수정）분기                                           02411008
           EVALUATE XDJLB044-I-PRCSS-DSTIC                              02412008
               WHEN CO-CHA-02                                           02414008
      *@1      등록（수정）                                           02413008
                    PERFORM S3100-INSERT-PROC-RTN                       02415008
                       THRU S3100-INSERT-PROC-EXT                       02416008
               WHEN CO-CHA-04                                           02416208
      *@2      삭제                                                   02416108
                    PERFORM S3200-DELETE-PROC-RTN                       02416308
                       THRU S3200-DELETE-PROC-EXT                       02416408
               WHEN OTHER                                               02418008
      *@3      기타                                                   02417008
                    CONTINUE                                            02419008
           END-EVALUATE                                                 02419108
           .                                                            02130000
       S3000-PROCESS-EXT.                                               02150000
           EXIT.                                                        02160000
      *-----------------------------------------------------------------02170000
      *@  신규등록처리　프로세스                                      02180000
      *-----------------------------------------------------------------02190000
       S3100-INSERT-PROC-RTN.                                           02200000
                                                                        02210000
      *@1.1 제외대상차주원장(THKJL0017)검색                         02536009
           PERFORM S3110-THKJL0017-SELECT-RTN                           02537009
              THRU S3110-THKJL0017-SELECT-EXT                           02538009
                                                                        02539009
      *@1.2 등록／수정　분기                                          02539109
           EVALUATE WK-BIT                                              02539209
               WHEN CO-CHA-U                                            02539309
      *@UPDATE
                    PERFORM S3120-THKJL0017-UPDATE-RTN                  02539409
                       THRU S3120-THKJL0017-UPDATE-EXT                  02539509
               WHEN CO-CHA-I                                            02539609
      *@INSERT
      *@           채무자명조회(THKJL0015)검색
                    PERFORM S3300-THKJL0015-SELECT-RTN
                       THRU S3300-THKJL0015-SELECT-EXT

                    PERFORM S3130-THKJL0017-INSERT-RTN                  02539709
                       THRU S3130-THKJL0017-INSERT-EXT                  02539809
               WHEN OTHER                                               02539909
                    CONTINUE                                            02540009
           END-EVALUATE                                                 02540109
           .                                                            02360000
       S3100-INSERT-PROC-EXT.                                           02380000
           EXIT.                                                        02390000
      *-----------------------------------------------------------------02700000
      *@  한도관리제외대상차주명세(THKJL0017)검색                   02710000
      *-----------------------------------------------------------------02720000
       S3110-THKJL0017-SELECT-RTN.                                      02730000

      *@1.1.1 변수초기화                                              02541009
           INITIALIZE TKJL0017-KEY                                      02541109
                      TRJL0017-REC                                      02541209
      *@1.1.2 변수 MOVE                                               02541309
      *@   그룹회사코드                                               02541409
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0017-PK-GROUP-CO-CD                                  02541609
170201*@    KB-PIN
170626     MOVE XDJLB044-I-BRWR-NO                                      02541809
))           TO KJL0017-PK-CUST-IDNFR                                   02541909
      *@1.1.3 프로그램　호출                                          02542309
           #DYDBIO SELECT-CMD-Y TKJL0017-PK TRJL0017-REC                02542409
      *@1.1.4 호출결과확인                                            02542509
           EVALUATE TRUE                                                02542609
               WHEN COND-DBIO-OK                                        02542709
                    MOVE CO-CHA-U                                       02542809
                      TO WK-BIT                                         02542909
               WHEN COND-DBIO-MRNF                                      02543009
                    MOVE CO-CHA-I                                       02543109
                      TO WK-BIT                                         02543209
               WHEN OTHER                                               02543309
      *@원장오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02543409
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02543509
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709
           .                                                            02543809
       S3110-THKJL0017-SELECT-EXT.                                      02990000
           EXIT.                                                        03000000
      *-----------------------------------------------------------------03440000
      *@  한도관리제외대상차주명세(THKJL0017)수정                   03450000
      *-----------------------------------------------------------------03460000
       S3120-THKJL0017-UPDATE-RTN.                                      03470000

      *@한도관리제외구분                                              02544909
           MOVE XDJLB044-I-ECLUD-RESN                                   02545009
             TO RJL0017-LIMT-M-ECLUD-DSTCD                              02545109
      *@등록년월일                                                    02545509
           MOVE BICOM-TRAN-BASE-YMD                                     02545609
             TO RJL0017-REGI-YMD                                        02545709

      *@   프로그램호출                                               02551509
           #DYDBIO UPDATE-CMD-Y TKJL0017-PK TRJL0017-REC                02551609
      *@   호출결과확인                                               02551709
           EVALUATE TRUE                                                02551809
               WHEN COND-DBIO-OK                                        02551909
                    CONTINUE                                            02552009
               WHEN OTHER                                               02552109
      *@원장오류일경우
      *@에러메세지 : 테이블 UPDATE 오류입니다．                   02552209
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02552309
                    #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR        02552409
           END-EVALUATE                                                 02552509
           .                                                            03800000
       S3120-THKJL0017-UPDATE-EXT.                                      03820000
           EXIT.                                                        03830000
      *-----------------------------------------------------------------03010000
      *@  한도관리제외대상차주명세(THKJL0017)등록                   03020000
      *-----------------------------------------------------------------03030000
       S3130-THKJL0017-INSERT-RTN.                                      03040000
                                                                        03050000
      *@입력파라미터조립
      *@그룹회사코드                                                  02553409
           MOVE BICOM-GROUP-CO-CD                                       02553509
             TO RJL0017-GROUP-CO-CD                                     02553609

170201*@ KB-PIN                                                         541709
170626     MOVE XDJLB044-I-BRWR-NO                                      02541809
))           TO RJL0017-CUST-IDNFR                                      02541909

      *@차주번호                                                      02553709
           MOVE SPACE                                                   02553809
             TO RJL0017-BRWR-NO                                         02553909

      *@채무자명                                                      02554009
170626     MOVE RJL0015-DBTRZ-NAME                                      02555009
             TO RJL0017-DBTRZ-NAME                                      02556009

      *@한도관리제외구분                                              02557009
           MOVE XDJLB044-I-ECLUD-RESN                                   02558009
             TO RJL0017-LIMT-M-ECLUD-DSTCD                              02559009

      *@등록년월일                                                    02560309
           MOVE BICOM-TRAN-BASE-YMD                                     02560409
             TO RJL0017-REGI-YMD                                        02560509

      *@   프로그램　호출                                             02565109
           #DYDBIO INSERT-CMD-Y TKJL0017-PK TRJL0017-REC                02565209
      *@   호출결과확인                                               02565309
           EVALUATE TRUE                                                02565409
               WHEN COND-DBIO-OK                                        02565509
                    CONTINUE                                            02565609
               WHEN OTHER                                               02565709
      *@원장등록오류일경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   02565809
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              02565909
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        02566009
           END-EVALUATE                                                 02566109
           .                                                            03400000
       S3130-THKJL0017-INSERT-EXT.                                      03420000
           EXIT.                                                        03430000
      *-----------------------------------------------------------------03840000
      *@  삭제처리　프로세스                                          03850000
      *-----------------------------------------------------------------03860000
       S3200-DELETE-PROC-RTN.                                           03870000
                                                                        03880000
      *@2.1 THKJL0017 DELETE                                            02570009
           PERFORM S3210-DEL-THKJL0017-RTN                              02580009
              THRU S3210-DEL-THKJL0017-EXT                              02590009
           .                                                            03940022
       S3200-DELETE-PROC-EXT.                                           03960000
           EXIT.                                                        03970000
      *-----------------------------------------------------------------02780009
      *@  제외대상(THKJL0017)삭제처리                               02790009
      *-----------------------------------------------------------------02800009
       S3210-DEL-THKJL0017-RTN.                                         02810009
                                                                        02820009
      *@입력파라미터조립
      *@변수초기화                                                    02830009
           INITIALIZE TKJL0017-KEY                                      02840009
                      TRJL0017-REC                                      02850009
      *@그룹회사코드                                                  02860009
           MOVE BICOM-GROUP-CO-CD                                       02870009
             TO KJL0017-PK-GROUP-CO-CD                                  02871009
170201*@ KB-PIN                                                         541709
((         MOVE XDJLB044-I-BRWR-NO                                      02541809
))           TO KJL0017-PK-CUST-IDNFR                                   02541909

      *@프로그램　호출                                                02542309
           #DYDBIO SELECT-CMD-Y TKJL0017-PK TRJL0017-REC                02542409

      *@호출결과확인                                                  02542509
           EVALUATE TRUE                                                02542609
               WHEN COND-DBIO-OK                                        02542709
                    CONTINUE                                            02542909
               WHEN COND-DBIO-MRNF                                      02543009
      *@원장NOT FOUND일경우
      *@에러메세지 : 원장없음오류입니다
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B4200066 CO-UKJL0036 CO-STAT-ERROR
               WHEN OTHER                                               02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   02543409
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               02543509
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709

      *@프로그램호출                                                  02950009
           #DYDBIO DELETE-CMD-Y TKJL0017-PK TRJL0017-REC                02960009
      *@호출결과확인                                                  02970009
           EVALUATE TRUE                                                02980009
               WHEN COND-DBIO-OK                                        02990009
                    CONTINUE                                            03000009
               WHEN OTHER                                               03010009
      *@원장삭제오류일경우
      *@에러메세지 : 테이블 DELETE 오류입니다．                   03020009
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              03030009
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        03040009
           END-EVALUATE                                                 03050009
           .                                                            03060009
       S3210-DEL-THKJL0017-EXT.                                         03070009
           EXIT.                                                        03080009
170626*-----------------------------------------------------------------
      *@  채무자명추출
      *-----------------------------------------------------------------
       S3300-THKJL0015-SELECT-RTN.

      *@초기화　　　　                                                025534
           INITIALIZE TKJL0015-KEY                                      02541109
                      TRJL0015-REC                                      02541209
      *@   그룹회사코드                                               025414
           MOVE BICOM-GROUP-CO-CD                                       02541509
             TO KJL0015-PK-GROUP-CO-CD                                  02541609
170201*@   고객식별자                                                 025417
           MOVE XDJLB044-I-BRWR-NO                                      02541809
             TO KJL0015-PK-CUST-IDNFR                                   02541909

           #DYDBIO SELECT-CMD-Y TKJL0015-PK TRJL0015-REC                02542409

           EVALUATE TRUE                                                02542609
               WHEN COND-DBIO-OK                                        02542709
               WHEN COND-DBIO-MRNF                                      02543009
                    CONTINUE
               WHEN OTHER                                               02543309
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   0254
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               0254
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        02543609
           END-EVALUATE                                                 02543709
           .                                                            02543809
       S3300-THKJL0015-SELECT-EXT.
           EXIT.

      *-----------------------------------------------------------------04460000
      *@  처리종료                                                    04470000
      *-----------------------------------------------------------------04480000
       S9000-FINAL-RTN.                                                 04490000
                                                                        04500000
      *@처리결과
           MOVE CO-STAT-OK
             TO XDJLB044-O-PRCSS-RSULT
      *@정상종료
           #OKEXIT  CO-STAT-OK.                                         04510000
           .
       S9000-FINAL-EXT.                                                 04530000
           EXIT.                                                        04540000
