      *=================================================================00010001
      *@업무명    : KJL     (Total Exposure)                          00020001
      *@프로그램명: DJLB041 (DC국가별정보관리)                      00030001
      *@처리유형  : DC                                                00040001
      *@처리개요  : 국가별 관리한도정보를 등록처리하는 프로   00050001
      *@            : 그램이다                                        00060001
      *-----------------------------------------------------------------00070001
      *                 P R O G R A M   변　경　이　력                00080001
      *-----------------------------------------------------------------00090001
      *@성명 : 일자 : 변　경　내　용                              00100001
      * ----------------------------------------------------------------00110001
      *이동구:20090107: 신규작성                                    00120001
      *김진태:20090330: 프로그램수정                                00121005
      *김진태:20091211: 에러메세지정비                              00121005
      *김진태:20091211: 최종처리일시／사용자번호　삭제              00121005
      *김진태:20100115: 테이블컬럼변경                              00121005
      *김진태:20100408: TABLE/COPYBOOK 변경                         00121005
      * YBH    :20200227: 지역 및 공통한도 추가
      *=================================================================00130001
      ******************************************************************00131005
      **  TABLE            : 테이블명                    : 접근유형 00133005
      **  ----------------   -------------------------------------------00134005
      **  THKJL0056        : 국별부점별한도기본          : CRUD       00135005
200227**  THKJL0053        : 국가별지역한도관리          : CRUD
      ******************************************************************00137005
       IDENTIFICATION                  DIVISION.                        00210001
      *=================================================================00220001
       PROGRAM-ID.                     DJLB041.                         00230001
       AUTHOR.                         이동구.                        00240001
       DATE-WRITTEN.                   09/01/07.                        00250001
      *=================================================================00270001
       ENVIRONMENT                     DIVISION.                        00280001
      *=================================================================00290001
       CONFIGURATION                   SECTION.                         00300001
       SOURCE-COMPUTER.                IBM-3090.
       OBJECT-COMPUTER.                IBM-3090.
      *=================================================================00320001
       DATA                            DIVISION.                        00330001
      *=================================================================00340001
       WORKING-STORAGE                 SECTION.                         00350001
      *-----------------------------------------------------------------00361005
      *CONSTANT ERROR AREA                                              00362005
      *-----------------------------------------------------------------00363005
       01  CO-ERROR-AREA.                                               00364005
           03  CO-B3000070             PIC  X(008) VALUE 'B3000070'.    00365005
           03  CO-B3800004             PIC  X(008) VALUE 'B3800004'.    00366005
           03  CO-B4200219             PIC  X(008) VALUE 'B4200219'.
           03  CO-B4200221             PIC  X(008) VALUE 'B4200221'.
           03  CO-B3900009             PIC  X(008) VALUE 'B3900009'.
           03  CO-B4200224             PIC  X(008) VALUE 'B4200224'.
           03  CO-B4200066             PIC  X(008) VALUE 'B4200066'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.    00368005
      *-----------------------------------------------------------------00369005
      * CONSTANT AREA                                                   00369105
      *-----------------------------------------------------------------00369205
       01  CO-AREA.                                                     00369305
           03  CO-PGM-ID               PIC  X(008) VALUE 'DJLB041'.     00369405
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.          00369505
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.          00369605
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.          00369705
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.          00369805
                                                                        00369905
           03  CO-CHA-01               PIC  X(002) VALUE '01'.          00370305
           03  CO-CHA-02               PIC  X(002) VALUE '02'.          00370405
           03  CO-CHA-03               PIC  X(002) VALUE '03'.          00370505
           03  CO-CHA-04               PIC  X(002) VALUE '04'.          00370605
200227     03  CO-CHA-05               PIC  X(002) VALUE '05'.          00370605
200227     03  CO-CHA-06               PIC  X(002) VALUE '06'.          00370605
                                                                        00370705
           03  CO-CHA-I                PIC  X(001) VALUE 'I'.           00371005
           03  CO-CHA-U                PIC  X(001) VALUE 'U'.           00372005
      *-----------------------------------------------------------------00640001
      * WORKING AREA                                                    00650001
      *-----------------------------------------------------------------00660001
       01  WK-AREA.                                                     00670001
           03  WK-BIT                  PIC  X(001).                     00681005
      *-----------------------------------------------------------------00710001
      * DBIO SQLIO INTERFACE PARAMETER                                  00720001
      *-----------------------------------------------------------------00730001
      * DBIO INTERFACE PARAMETER
           COPY    YCDBIOCA.                                            00740001
      *-----------------------------------------------------------------00770001
      * TABLE ACCESS INTERFACE PARAMETER                                00780001
      * LIBRARY : KJL.DDB2.DBCOPY                                       00790001
      *-----------------------------------------------------------------00800001
      *국별부점별한도기본　테이블(KEY)                                00830001
       01  TKJL0056-KEY.                                                00840001
           COPY  TKJL0056.                                              00850001
      *국별부점별한도기본　테이블(RECORD)                             00860001
       01  TRJL0056-REC.                                                00870001
           COPY  TRJL0056.                                              00880001
200227*   국가별지역한도관리　테이블(KEY)                             00830001
       01  TKJL0053-KEY.                                                00840001
           COPY  TKJL0053.                                              00850001
200227*   국가별지역한도관리　테이블(RECORD)                          00860001
       01  TRJL0053-REC.                                                00870001
           COPY  TRJL0053.                                              00880001

      *-----------------------------------------------------------------00900001
      * PGM INTERFACE PARAMETER                                         00910001
      *-----------------------------------------------------------------00920001
      *-----------------------------------------------------------------00940001
       LINKAGE                         SECTION.                         00950001
      *-----------------------------------------------------------------00960001
      * COMMON AREA COPYBOOK
       01  YCCOMMON-CA.                                                 00970001
           COPY  YCCOMMON.                                              00980001
      * DC COPYBOOK                                                     00990001
       01  XDJLB041-CA.                                                 01000001
           COPY  XDJLB041.                                              01010001
      *=================================================================01030001
       PROCEDURE                       DIVISION                         01040001
                                       USING       YCCOMMON-CA          01050001
                                                   XDJLB041-CA          01060001
                                                   .                    01070001
      *=================================================================01080001
                                                                        01090001
      *-----------------------------------------------------------------01100001
      *@  처리메인                                                    01110001
      *-----------------------------------------------------------------01120001
       S0000-MAIN-RTN.                                                  01130001
                                                                        01140001
      *@  초기화                                                      01150001
           PERFORM  S1000-INITIALIZE-RTN                                01160001
              THRU  S1000-INITIALIZE-EXT                                01170001
                                                                        01180001
      *@  입력값　CHECK                                               01190001
           PERFORM  S2000-VALIDATION-RTN                                01200001
              THRU  S2000-VALIDATION-EXT                                01210001
                                                                        01220001
      *@  업무처리                                                    01230001
           PERFORM  S3000-PROCESS-RTN                                   01240001
              THRU  S3000-PROCESS-EXT                                   01250001
                                                                        01260001
      *@  처리종료                                                    01270001
           PERFORM  S9000-FINAL-RTN                                     01280001
              THRU  S9000-FINAL-EXT                                     01290001
           .                                                            01300001
       S0000-MAIN-EXT.                                                  01320001
           EXIT.                                                        01330001
      *-----------------------------------------------------------------01340001
      *@  초기화                                                      01350001
      *-----------------------------------------------------------------01360001
       S1000-INITIALIZE-RTN.                                            01370001
                                                                        01380005
      *@WK-AREA및　프로그램파라미터　초기화                           01390001
                                                                        01400001
           INITIALIZE WK-AREA                                           01410001
      *               DBIO
                      YCDBIOCA-CA                                       01420001
                                                                        01460001
      *@출력영역및　결과코드　초기화                                  01470001
           INITIALIZE XDJLB041-OUT                                      01480001
                      XDJLB041-RETURN                                   01490001
           .                                                            01500001
       S1000-INITIALIZE-EXT.                                            01520001
           EXIT.                                                        01530001
      *-----------------------------------------------------------------01540001
      *@  입력값검증                                                  01550001
      *@처리구분＇０２＇　：　등록                                    01560001
      *-----------------------------------------------------------------01570001
       S2000-VALIDATION-RTN.                                            01580001
                                                                        01590005
      *@처리구분이　＇등록／삭제/지역한도/공통한도＇이외는　에러
           EVALUATE XDJLB041-I-PRCSS-DSTIC
           WHEN CO-CHA-02
           WHEN CO-CHA-04
      *@    기준년월
               IF XDJLB041-I-BASE-YM = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    국가코드
               IF XDJLB041-I-ISO-NATNL-CD = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    국가명
               IF XDJLB041-I-ENG-NATNL-NAME = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    S&P등급
               IF XDJLB041-I-SNP-GRD-DSTCD = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    무디스등급
               IF XDJLB041-I-MODYS-GRD-DSTCD = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    피치등급
               IF XDJLB041-I-FITCH-GRD-DSTCD = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF

      *@    지역코드
               IF XDJLB041-I-LIMT-MGT-AREA-DSTCD = SPACE
                  #ERROR CO-B3800004 CO-UKJL0036 CO-STAT-ERROR
               END-IF
200227     WHEN CO-CHA-05
200227     WHEN CO-CHA-06
               CONTINUE
           WHEN OTHER
      *@에러메세지 : 처리구분오류입니다．
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.
               #ERROR CO-B3000070 CO-UKJL0036 CO-STAT-ERROR
           END-EVALUATE
           .                                                            01660001
       S2000-VALIDATION-EXT.                                            01680001
           EXIT.                                                        01690001
      *-----------------------------------------------------------------01700001
      *@  업무처리                                                    01710001
      *-----------------------------------------------------------------01720001
       S3000-PROCESS-RTN.                                               01730001
                                                                        01740005
      *@   등록（수정）분기                                           01741005
           EVALUATE XDJLB041-I-PRCSS-DSTIC                              01742005
      *@       등록（수정）                                           01743005
               WHEN CO-CHA-02                                           01744005
                    PERFORM S3100-INSERT-PROC-RTN                       01745005
                       THRU S3100-INSERT-PROC-EXT                       01746005
      *@       삭제                                                   01743005
               WHEN CO-CHA-04                                           01744005
                    PERFORM S3200-DELETE-PROC-RTN                       01745005
                       THRU S3200-DELETE-PROC-EXT                       01746005
200227*@       지역/공통한도등록
               WHEN CO-CHA-05
               WHEN CO-CHA-06
                    PERFORM S3300-INSERT-PROC-RTN
                       THRU S3300-INSERT-PROC-EXT
      *@       기타                                                   01749605
               WHEN OTHER                                               01749705
                    CONTINUE                                            01749805
           END-EVALUATE                                                 01749905
           .                                                            01920001
       S3000-PROCESS-EXT.                                               01940001
           EXIT.                                                        01950001
      *-----------------------------------------------------------------01951005
      *@  등록（수정）　프로세스                                      01952005
      *-----------------------------------------------------------------01953005
       S3100-INSERT-PROC-RTN.                                           01954005
                                                                        01955005
      *@    국별부점별한도기본(THKJL0056)검색                       01956005
           PERFORM S3110-THKJL0056-SELECT-RTN                           01957005
              THRU S3110-THKJL0056-SELECT-EXT                           01958005
                                                                        01959005
      *@    등록／수정　분기                                          01959105
           EVALUATE WK-BIT                                              01959205
               WHEN CO-CHA-U                                            01959305
      *@            UPDATE
                    PERFORM S3120-THKJL0056-UPDATE-RTN                  01959405
                       THRU S3120-THKJL0056-UPDATE-EXT                  01959505
               WHEN CO-CHA-I                                            01959605
      *@            INSERT
                    PERFORM S3130-THKJL0056-INSERT-RTN                  01959705
                       THRU S3130-THKJL0056-INSERT-EXT                  01959805
               WHEN OTHER                                               01959905
                    CONTINUE                                            01960005
           END-EVALUATE                                                 01960105
           .                                                            01960205
       S3100-INSERT-PROC-EXT.                                           01960305
           EXIT.                                                        01960405
      *-----------------------------------------------------------------01960505
      *@  국별부점별한도기본(THKJL0056)검색                         01960605
      *-----------------------------------------------------------------01960705
       S3110-THKJL0056-SELECT-RTN.                                      01960805
                                                                        01960905
      *@변수초기화                                                    01961005
           INITIALIZE TKJL0056-KEY                                      01961105
                      TRJL0056-REC                                      01961205
      *@변수 MOVE                                                     01961305
      *@그룹회사코드                                                  01961405
           MOVE BICOM-GROUP-CO-CD                                       01961505
             TO KJL0056-PK-GROUP-CO-CD                                  01961605
      *@기준년월                                                      01961705
           MOVE XDJLB041-I-BASE-YM                                      01961805
             TO KJL0056-PK-BASE-YM                                      01961905
      *@국가코드                                                      01962005
           MOVE XDJLB041-I-ISO-NATNL-CD
             TO KJL0056-PK-ISO-NATNL-CD                                 01962205
      *@프로그램　호출                                                01963805
           #DYDBIO SELECT-CMD-Y TKJL0056-PK TRJL0056-REC                01963905
      *@호출결과확인                                                  01964005
           EVALUATE TRUE                                                01964105
               WHEN COND-DBIO-OK                                        01964205
                    MOVE CO-CHA-U                                       01964305
                      TO WK-BIT                                         01964405
               WHEN COND-DBIO-MRNF                                      01964505
                    MOVE CO-CHA-I                                       01964605
                      TO WK-BIT                                         01964705
               WHEN OTHER                                               01964805
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01964905
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01965005
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        01965105
           END-EVALUATE                                                 01965205
           .                                                            01965305
       S3110-THKJL0056-SELECT-EXT.                                      01965405
           EXIT.                                                        01965505
      *-----------------------------------------------------------------01965606
      *@  국별부점별한도기본(THKJL0056)수정                         01965706
      *-----------------------------------------------------------------01965806
       S3120-THKJL0056-UPDATE-RTN.                                      01965906
                                                                        01966006
      *@입력파라미터조립
      *@영문국가명                                                    01966106
           MOVE XDJLB041-I-ENG-NATNL-NAME                               01966206
             TO RJL0056-ENG-NATNL-NAME                                  01966306
      *@전체관리한도                                                  01968506
           MOVE XDJLB041-I-WHOL-MGT-CLAM                                01968606
             TO RJL0056-WHOL-MGT-CLAM                                   01968706
      *@S&P 등급구분                                                  01967606
           MOVE XDJLB041-I-SNP-GRD-DSTCD                                01967706
             TO RJL0056-SNP-GRD-DSTCD                                   01967806
      *@무디스등급                                                    01967906
           MOVE XDJLB041-I-MODYS-GRD-DSTCD                              01968006
             TO RJL0056-MODYS-GRD-DSTCD                                 01968106
      *@피치등급                                                      01968206
           MOVE XDJLB041-I-FITCH-GRD-DSTCD                              01968306
             TO RJL0056-FITCH-GRD-DSTCD                                 01968406
200227*   당행국가신용등급구분
           MOVE XDJLB041-I-OWBNK-NC-GRD-DSTCD
             TO RJL0056-OWBNK-NC-GRD-DSTCD
      *@한도관리지역구분                                              01966406
           MOVE XDJLB041-I-LIMT-MGT-AREA-DSTCD                          01966506
             TO RJL0056-LIMT-MGT-AREA-DSTCD                             01966606
200227*   국가전체공통한도여부
           MOVE XDJLB041-I-NATNL-W-CMN-LIMT-YN
             TO RJL0056-NATNL-W-CMN-LIMT-YN
200227*   국가위험수준구분
           MOVE XDJLB041-I-NATNL-R-LVEL-DSTCD
             TO RJL0056-NATNL-R-LVEL-DSTCD

      *@프로그램호출                                                  01972706
           #DYDBIO UPDATE-CMD-Y TKJL0056-PK TRJL0056-REC                01972806
      *@호출결과확인                                                  01972906
           EVALUATE TRUE                                                01973006
               WHEN COND-DBIO-OK                                        01973106
                    CONTINUE                                            01973206
               WHEN OTHER                                               01973306
      *@테이블갱신에러일경우
      *@에러메세지 : 테이블 UPDATE 오류입니다．                   01973406
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              01973506
                    #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR        01973606
           END-EVALUATE                                                 01973706
           .                                                            01973806
       S3120-THKJL0056-UPDATE-EXT.                                      01973906
           EXIT.                                                        01974006
      *-----------------------------------------------------------------01974106
      *@  국별부점별한도기본(THKJL0056)등록                         01974206
      *-----------------------------------------------------------------01974306
       S3130-THKJL0056-INSERT-RTN.                                      01974406
                                                                        01974506
      *@입력파라미터조립
      *@그룹회사코드                                                  01974606
           MOVE BICOM-GROUP-CO-CD                                       01974706
             TO RJL0056-GROUP-CO-CD                                     01974806
      *@기준년월                                                      01974906
           MOVE XDJLB041-I-BASE-YM                                      01975006
             TO RJL0056-BASE-YM                                         01975106
      *@국가코드                                                      01975206
           MOVE XDJLB041-I-ISO-NATNL-CD
             TO RJL0056-ISO-NATNL-CD                                    01975406
      *@영문국가명                                                    01975506
           MOVE XDJLB041-I-ENG-NATNL-NAME                               01975606
             TO RJL0056-ENG-NATNL-NAME                                  01975706
      *@한도관리지역구분                                              01975806
           MOVE XDJLB041-I-LIMT-MGT-AREA-DSTCD                          01975906
             TO RJL0056-LIMT-MGT-AREA-DSTCD                             01976006
      *@한도국가체질구분                                              01976106
      *@경보발령여부                                                  01976706
      *@경보발령등록년월일                                            01976706
      *@모니터링여부                                                  01976706
      *@모니터링등록년월일                                            01976706
      *@S&P 등급구분                                                  01977006
           MOVE XDJLB041-I-SNP-GRD-DSTCD                                01977106
             TO RJL0056-SNP-GRD-DSTCD                                   01977206
      *@무디스등급                                                    01977306
           MOVE XDJLB041-I-MODYS-GRD-DSTCD                              01977406
             TO RJL0056-MODYS-GRD-DSTCD                                 01977506
      *@피치등급                                                      01977606
           MOVE XDJLB041-I-FITCH-GRD-DSTCD                              01977706
             TO RJL0056-FITCH-GRD-DSTCD                                 01977806
      *@전체관리한도                                                  01977906
           MOVE XDJLB041-I-WHOL-MGT-CLAM                                01978006
             TO RJL0056-WHOL-MGT-CLAM                                   01978106
200227*   당행국가신용등급구분
           MOVE XDJLB041-I-OWBNK-NC-GRD-DSTCD
             TO RJL0056-OWBNK-NC-GRD-DSTCD
200227*   국가전체공통한도여부
           MOVE XDJLB041-I-NATNL-W-CMN-LIMT-YN
             TO RJL0056-NATNL-W-CMN-LIMT-YN
200227*   국가위험수준구분
           MOVE XDJLB041-I-NATNL-R-LVEL-DSTCD
             TO RJL0056-NATNL-R-LVEL-DSTCD

      *@프로그램　호출                                                01982706
           #DYDBIO INSERT-CMD-Y TKJL0056-PK TRJL0056-REC                01982806
      *@호출결과확인                                                  01982906
           EVALUATE TRUE                                                01983006
               WHEN COND-DBIO-OK                                        01983106
                    CONTINUE                                            01983206
               WHEN OTHER                                               01983306
      *@원장등록오류인경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   01983406
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              01983506
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        01983606
           END-EVALUATE                                                 01983706
           .                                                            01983806
       S3130-THKJL0056-INSERT-EXT.                                      01983906
           EXIT.                                                        01984006
      *-----------------------------------------------------------------
      *@  삭제처리　프로세스
      *-----------------------------------------------------------------
       S3200-DELETE-PROC-RTN.

      *@ 원장삭제                                                     04240001
           PERFORM S3210-THKJL0056-DELETE-RTN                           04250001
              THRU S3210-THKJL0056-DELETE-EXT                           04260001
           .
       S3200-DELETE-PROC-EXT.
           EXIT.
      *-----------------------------------------------------------------04480001
      *@  국가정보(THKJL0056)삭제처리                               04490001
      *-----------------------------------------------------------------04500001
       S3210-THKJL0056-DELETE-RTN.                                      04510001

      *@ 원장삭제
      *@ 관련테이블 : 상품정보원장  접근유형 : DELETE

      *@ 카피북초기화
           INITIALIZE TKJL0056-KEY                                      02910001
                      TRJL0056-REC                                      02920001

      *@변수 MOVE                                                     01961305
      *@그룹회사코드                                                  01961405
           MOVE BICOM-GROUP-CO-CD                                       01961505
             TO KJL0056-PK-GROUP-CO-CD                                  01961605
      *@기준년월                                                      01961705
           MOVE XDJLB041-I-BASE-YM                                      01961805
             TO KJL0056-PK-BASE-YM                                      01961905
      *@국가코드                                                      01962005
           MOVE XDJLB041-I-ISO-NATNL-CD
             TO KJL0056-PK-ISO-NATNL-CD                                 01962205

      *@ DBIO프로그램호출                                             03030001
           #DYDBIO SELECT-CMD-Y TKJL0056-PK TRJL0056-REC                03040007
                                                                        03050001
      *@ 호출결과확인
           EVALUATE TRUE                                                03051006
               WHEN COND-DBIO-OK                                        03052006
                    CONTINUE                                            03053006
               WHEN COND-DBIO-MRNF                                      03052006
      * 에러메세지 : 원장없음오류입니다．
      * 조치메세지 : 전산업무담당자에게　문의바랍니다.
                    #ERROR CO-B4200066 CO-UKJL0036 CO-STAT-ERROR
               WHEN OTHER                                               03073006
      *@ 원장조회오류일경우는에러처리
      *@ 에러메세지 : 테이블 SELECT 오류입니다．                  03074006
      *@ 조치메세지 : 전산업무담당자에게　문의바랍니다              03075006
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        03076006
           END-EVALUATE                                                 03076106

      *@ 원장삭제를위한DBIO프로그램호출                             04650001
           #DYDBIO DELETE-CMD-Y TKJL0056-PK TRJL0056-REC                04660001
                                                                        04670001
      *@ 호출결과확인
           EVALUATE TRUE                                                04671007
               WHEN COND-DBIO-OK                                        04672007
                    CONTINUE                                            04673007
               WHEN OTHER                                               04674007
      *@ 원장삭제오류일경우는에러처리
      *@ 에러메세지 : 테이블 DELETE 오류입니다．                  04675007
      *@ 조치메세지 : 전산업무담당자에게　문의바랍니다.             04676007
                    #ERROR CO-B4200219 CO-UKJL0036 CO-STAT-ERROR        04677007
           END-EVALUATE                                                 04678007
           .                                                            04770001
       S3210-THKJL0056-DELETE-EXT.                                      04790001
           EXIT.                                                        04800001

      *-----------------------------------------------------------------01951005
200227*@  지역/공통한도등록（수정）　프로세스
      *-----------------------------------------------------------------01953005
       S3300-INSERT-PROC-RTN.                                           01954005
                                                                        01955005
      *@  국가별지역한도관리(THKJL0053)검색                         01956005
           PERFORM S3310-TKJL0053-SELECT-RTN                            01957005
              THRU S3310-TKJL0053-SELECT-EXT                            01958005
                                                                        01959005
      *@    등록／수정　분기                                          01959105
           EVALUATE WK-BIT                                              01959205
               WHEN CO-CHA-U                                            01959305
      *@            UPDATE
                    PERFORM S3320-TKJL0053-UPDATE-RTN                   01959405
                       THRU S3320-TKJL0053-UPDATE-EXT                   01959505
               WHEN CO-CHA-I                                            01959605
      *@            INSERT
                    PERFORM S3330-TKJL0053-INSERT-RTN                   01959705
                       THRU S3330-TKJL0053-INSERT-EXT                   01959805
               WHEN OTHER                                               01959905
                    CONTINUE                                            01960005
           END-EVALUATE                                                 01960105
           .                                                            01960205
       S3300-INSERT-PROC-EXT.                                           01960305
           EXIT.                                                        01960405
      *-----------------------------------------------------------------01960505
200227*@  국가별지역한도관리(THKJL0053)검색                         01960605
      *-----------------------------------------------------------------01960705
       S3310-TKJL0053-SELECT-RTN.                                       01960805
                                                                        01960905
      *@변수초기화                                                    01961005
           INITIALIZE TKJL0053-KEY                                      01961105
                      TRJL0053-REC                                      01961205
      *@변수 MOVE                                                     01961305
      *@그룹회사코드                                                  01961405
           MOVE BICOM-GROUP-CO-CD                                       01961505
             TO KJL0053-PK-GROUP-CO-CD                                  01961605
      *@기준년월                                                      01961705
           MOVE XDJLB041-I-BASE-YM                                      01961805
             TO KJL0053-PK-BASE-YM                                      01961905
      *@  한도관리지역구분(9:공통한도로사용)
           IF XDJLB041-I-PRCSS-DSTIC = CO-CHA-05
               MOVE XDJLB041-I-LIMT-MGT-AREA-DSTCD
                 TO KJL0053-PK-LIMT-MGT-AREA-DSTCD
           ELSE
               MOVE '9'
                 TO KJL0053-PK-LIMT-MGT-AREA-DSTCD
           END-IF

      *@프로그램　호출                                                01963805
           #DYDBIO SELECT-CMD-Y TKJL0053-PK TRJL0053-REC                01963905
      *@호출결과확인                                                  01964005
           EVALUATE TRUE                                                01964105
               WHEN COND-DBIO-OK                                        01964205
                    MOVE CO-CHA-U                                       01964305
                      TO WK-BIT                                         01964405
               WHEN COND-DBIO-MRNF                                      01964505
                    MOVE CO-CHA-I                                       01964605
                      TO WK-BIT                                         01964705
               WHEN OTHER                                               01964805
      *@원장조회오류일경우
      *@에러메세지 : 테이블 SELECT 오류입니다．                   01964905
      *@조치메세지 : 전산업무담당자에게　문의바랍니다               01965005
                    #ERROR CO-B3900009 CO-UKJL0036 CO-STAT-ERROR        01965105
           END-EVALUATE                                                 01965205
           .                                                            01965305
       S3310-TKJL0053-SELECT-EXT.                                       01965405
           EXIT.                                                        01965505
      *-----------------------------------------------------------------01965606
200227*@  국가별지역한도관리(THKJL0053)수정                         01965706
      *-----------------------------------------------------------------01965806
       S3320-TKJL0053-UPDATE-RTN.                                       01965906
                                                                        01966006
      *@입력파라미터조립
      *@  지역관리한도금액(지역/공통한도로 같이사용)
           MOVE XDJLB041-I-WHOL-MGT-CLAM                                01968606
             TO RJL0053-AREA-MGT-CLAM

      *@프로그램호출                                                  01972706
           #DYDBIO UPDATE-CMD-Y TKJL0053-PK TRJL0053-REC                01972806
      *@호출결과확인                                                  01972906
           EVALUATE TRUE                                                01973006
               WHEN COND-DBIO-OK                                        01973106
                    CONTINUE                                            01973206
               WHEN OTHER                                               01973306
      *@테이블갱신에러일경우
      *@에러메세지 : 테이블 UPDATE 오류입니다．                   01973406
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              01973506
                    #ERROR CO-B4200224 CO-UKJL0036 CO-STAT-ERROR        01973606
           END-EVALUATE                                                 01973706
           .                                                            01973806
       S3320-TKJL0053-UPDATE-EXT.                                       01973906
           EXIT.                                                        01974006
      *-----------------------------------------------------------------01974106
200227*@  국가별지역한도관리(THKJL0053)등록                         01974206
      *-----------------------------------------------------------------01974306
       S3330-TKJL0053-INSERT-RTN.                                       01974406
                                                                        01974506
      *@입력파라미터조립
      *@그룹회사코드                                                  01974606
           MOVE BICOM-GROUP-CO-CD                                       01974706
             TO RJL0053-GROUP-CO-CD                                     01974806
      *@기준년월                                                      01974906
           MOVE XDJLB041-I-BASE-YM                                      01975006
             TO RJL0053-BASE-YM                                         01975106
      *@  한도관리지역구분(9:공통한도로사용)
           IF XDJLB041-I-PRCSS-DSTIC = CO-CHA-05
               MOVE XDJLB041-I-LIMT-MGT-AREA-DSTCD
                 TO RJL0053-LIMT-MGT-AREA-DSTCD
           ELSE
               MOVE '9'
                 TO RJL0053-LIMT-MGT-AREA-DSTCD
           END-IF
      *@  지역관리한도금액(지역/공통한도로 같이사용)
           MOVE XDJLB041-I-WHOL-MGT-CLAM                                01978006
             TO RJL0053-AREA-MGT-CLAM

      *@프로그램　호출                                                01982706
           #DYDBIO INSERT-CMD-Y TKJL0053-PK TRJL0053-REC                01982806
      *@호출결과확인                                                  01982906
           EVALUATE TRUE                                                01983006
               WHEN COND-DBIO-OK                                        01983106
                    CONTINUE                                            01983206
               WHEN OTHER                                               01983306
      *@원장등록오류인경우
      *@에러메세지 : 테이블 INSERT 오류입니다．                   01983406
      *@조치메세지 : 전산업무담당자에게　문의바랍니다.              01983506
                    #ERROR CO-B4200221 CO-UKJL0036 CO-STAT-ERROR        01983606
           END-EVALUATE                                                 01983706
           .                                                            01983806
       S3330-TKJL0053-INSERT-EXT.                                       01983906
           EXIT.                                                        01984006

      *-----------------------------------------------------------------03270001
      *@  처리종료                                                    03280001
      *-----------------------------------------------------------------03290001
       S9000-FINAL-RTN.                                                 03300001
                                                                        03310006
      *@   처리결과                                                   03310106
           MOVE CO-STAT-OK                                              03311006
             TO XDJLB041-O-PRCSS-RSULT                                  03312006
                                                                        03313006
      *@   정상종료
           #OKEXIT  CO-STAT-OK.                                         03320001

       S9000-FINAL-EXT.                                                 03340001
           EXIT.                                                        03350001
