      *=================================================================
      *@¾÷¹«¸í    : KJL     (ÅäÅ»ÀÍ½ºÆ÷Á®)
      *@ÇÁ·Î±×·¥¸í: FJL0001 (FCÅäÅ»ÀÍ½ºÆ÷Á®ºÎÁ¡Á¤º¸Á¶È¸)
      *@Ã³¸®À¯Çü  : FC
      *@Ã³¸®°³¿ä  :ÅäÅ»ÀÍ½ºÆ÷Á® ºÎÁ¡ÄÚµå¡¡°ü¸® ¸ðµâ
      *@Á¶È¸±¸ºÐ  : ×01ø ÁÖ¹«ºÎ¼­ Á¶È¸½Ã ÀüÃ¼ºÎÁ¡(9999) Á¶È¸
      *@            : ×02ø À¯µ¿È­ºÎÁ¡ (8961) Á¶È¸
      *             : ×03ø º»ºÎºÎÁ¡ ¿µ¾÷Áö¿øº»ºÎºÎÁ¡±¸ºÐ(BJLD701)
      *             : ×04ø ÀÌ»çÈ¸½ÂÀÎ³»¿ª ºÎÁ¡(3810 , 1502) Á¶È¸
      *-----------------------------------------------------------------
      *                 P R O G R A M   º¯¡¡°æ¡¡ÀÌ¡¡·Â
      *-----------------------------------------------------------------
      *@¼º¸í : ÀÏÀÚ : º¯¡¡°æ¡¡³»¡¡¿ë
      * ----------------------------------------------------------------
      *ÇÏÀ±Èñ:20170310: ½Å±ÔÀÛ¼º
      * YBH    :20180117: ±Û·Î¹ú»ç¾÷ºÎ(5106) Ãß°¡
      *¹ÚÁ¤¼ö:20240530: ÀÚº»½ÃÀåÇÃ·§ÆûºÎ(3810), ÀÚ±ÝºÎ(1502) Ãß°¡
      *=================================================================
       IDENTIFICATION                  DIVISION.
      *=================================================================
       PROGRAM-ID.                     FJL0001.
       AUTHOR.                         ÇÏÀ±Èñ.
       DATE-WRITTEN.                   17/03/10.

      *=================================================================
       ENVIRONMENT                     DIVISION.
      *=================================================================
       CONFIGURATION                   SECTION.
       SOURCE-COMPUTER.                IBM-Z10.
       OBJECT-COMPUTER.                IBM-Z10.

      *=================================================================
       DATA                            DIVISION.
      *=================================================================
       WORKING-STORAGE                 SECTION.
      *-----------------------------------------------------------------
      *CONSTANT ERROR AREA
      *-----------------------------------------------------------------
       01  CO-ERROR-AREA.
           03  CO-B3002387             PIC  X(008) VALUE 'B3002387'.
           03  CO-UKJL0036             PIC  X(008) VALUE 'UKJL0036'.

      *-----------------------------------------------------------------
      * CONSTANT AREA
      *-----------------------------------------------------------------
       01  CO-AREA.
           03  CO-PGM-ID               PIC  X(008) VALUE 'FJL0001'.
           03  CO-STAT-OK              PIC  X(002) VALUE '00'.
           03  CO-STAT-ERROR           PIC  X(002) VALUE '09'.
           03  CO-STAT-ABNORMAL        PIC  X(002) VALUE '98'.
           03  CO-STAT-SYSERROR        PIC  X(002) VALUE '99'.

           03  CO-CHA-0                PIC  X(001) VALUE '0'.
           03  CO-CHA-1                PIC  X(001) VALUE '1'.
           03  CO-CHA-01               PIC  X(002) VALUE '01'.
           03  CO-CHA-02               PIC  X(002) VALUE '02'.
           03  CO-CHA-03               PIC  X(002) VALUE '03'.
           03  CO-CHA-04               PIC  X(002) VALUE '04'.
           03  CO-CHA-9999             PIC  X(004) VALUE '9999'.
           03  CO-CHA-8961             PIC  X(004) VALUE '8961'.

           03  CO-CHA-6927             PIC  X(004) VALUE '6927'.
           03  CO-CHA-1948             PIC  X(004) VALUE '1948'.
           03  CO-CHA-3933             PIC  X(004) VALUE '3933'.
           03  CO-CHA-9636             PIC  X(004) VALUE '9636'.
180117     03  CO-CHA-5106             PIC  X(004) VALUE '5106'.

           03  CO-CHA-0015             PIC  X(004) VALUE '0015'.
           03  CO-CHA-4004             PIC  X(004) VALUE '4004'.
           03  CO-CHA-8169             PIC  X(004) VALUE '8169'.

240530     03  CO-CHA-3810             PIC  X(004) VALUE '3810'.
240530     03  CO-CHA-1502             PIC  X(004) VALUE '1502'.

           03  CO-NUM-1                PIC  9(003) VALUE  1.

      *-----------------------------------------------------------------
      * WORKING AREA
      *-----------------------------------------------------------------
       01  WK-AREA.
           03  FILLER                  PIC  X(001).

      *-----------------------------------------------------------------
      * PGM INTERFACE PARAMETER
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       LINKAGE                         SECTION.
      *-----------------------------------------------------------------

       01  YCCOMMON-CA.
           COPY  YCCOMMON.

       01 XFJL0001-CA.
           COPY  XFJL0001.

      *=================================================================
       PROCEDURE                       DIVISION
                                       USING       YCCOMMON-CA
                                                   XFJL0001-CA
                                                   .
      *=================================================================

      *------------------------------------------------------------------
      *@  Ã³¸®¸ÞÀÎ
      *------------------------------------------------------------------
       S0000-MAIN-RTN.

      *@  ÃÊ±âÈ­
           PERFORM S1000-INITIALIZE-RTN
              THRU S1000-INITIALIZE-EXT

      *@  ÀÔ·Â°ª¡¡CHECK
           PERFORM S2000-VALIDATION-RTN
              THRU S2000-VALIDATION-EXT

      *@  ¾÷¹«Ã³¸®
           PERFORM S3000-PROCESS-RTN
              THRU S3000-PROCESS-EXT

      *@  Ã³¸®Á¾·á
           PERFORM S9000-FINAL-RTN
              THRU S9000-FINAL-EXT
           .
       S0000-MAIN-EXT.
           EXIT.

      *------------------------------------------------------------------
      *@  ÃÊ±âÈ­
      *------------------------------------------------------------------
       S1000-INITIALIZE-RTN.

           INITIALIZE   WK-AREA
                        XFJL0001-RETURN
                        XFJL0001-OUT.

       S1000-INITIALIZE-EXT.
           EXIT.

      *------------------------------------------------------------------
      *@  ÀÔ·Â°ª°ËÁõ
      *------------------------------------------------------------------
       S2000-VALIDATION-RTN.

      *@¿¡·¯¸Þ½ÃÁö:°Å·¡±¸ºÐÄÚµå ¿À·ùÀÔ´Ï´Ù.
      *@Á¶Ä¡¸Þ½ÃÁö:Àü»ê¾÷¹«´ã´çÀÚ¿¡°Ô¡¡¹®ÀÇ¹Ù¶ø´Ï´Ù.
           IF XFJL0001-I-INQURY-DSTCD = SPACE
              #ERROR CO-B3002387 CO-UKJL0036 CO-STAT-ERROR
           END-IF

           .
       S2000-VALIDATION-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  ¾÷¹«Ã³¸®
      *-----------------------------------------------------------------
       S3000-PROCESS-RTN.

           EVALUATE  XFJL0001-I-INQURY-DSTCD
               WHEN  CO-CHA-01
      *@            ÁÖ¹«ºÎ¼­ Á¶È¸½Ã ÀüÃ¼ºÎÁ¡ÄÚµå(9999) Á¶È¸
                     PERFORM  S3100-DSTCD_01_PROC-RTN
                        THRU  S3100-DSTCD_01_PROC-EXT
               WHEN  CO-CHA-02
      *@            À¯µ¿È­ºÎÁ¡(8961) Á¶È¸
                     PERFORM  S3100-DSTCD_02_PROC-RTN
                        THRU  S3100-DSTCD_02_PROC-EXT
               WHEN  CO-CHA-03
      *@            º»ºÎºÎÁ¡ ¿µ¾÷Áö¿øº»ºÎºÎÁ¡±¸ºÐ Á¶È¸
                     PERFORM  S3100-DSTCD_03_PROC-RTN
                        THRU  S3100-DSTCD_03_PROC-EXT
               WHEN  CO-CHA-04
      *@            ÀÌ»çÈ¸½ÂÀÎ³»¿ª ºÎÁ¡(3810 , 1502) Á¶È¸
                     PERFORM  S3100-DSTCD_04_PROC-RTN
                        THRU  S3100-DSTCD_04_PROC-EXT
               WHEN  OTHER
                     CONTINUE
           END-EVALUATE

           .
       S3000-PROCESS-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  Á¶È¸±¸ºÐ ×01ø ÁÖ¹«ºÎ¼­ Á¶È¸½Ã ÀüÃ¼ºÎÁ¡Á¶È¸
      *-----------------------------------------------------------------
       S3100-DSTCD_01_PROC-RTN.

      *   Æ¯Á¤ºÎÁ¡È®ÀÎ
      *    6914 : ½Å¿ë¸®½ºÅ©ºÎ
      *    9303 : ±â¾÷¿©½Å½É»çºÎ
      *    4055 : ¿©½ÅITºÎ

           IF  XFJL0001-I-BRNCD = ('6914' OR
                                   '9303' OR
                                   '4055' )

               MOVE  CO-CHA-9999       TO  XFJL0001-O-BRNCD(1)
           ELSE
               MOVE  XFJL0001-I-BRNCD  TO  XFJL0001-O-BRNCD(1)
           END-IF

      *   ºÎÁ¡ÄÚµå°ËÁõ¿©ºÎ
           MOVE  CO-CHA-1              TO  XFJL0001-O-BRNCD-VALDN-YN
      *   ºÎÁ¡ÄÚµå°Ç¼ö
           MOVE  CO-NUM-1              TO  XFJL0001-O-BRN-NOITM

           .
       S3100-DSTCD_01_PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  Á¶È¸±¸ºÐ ×02ø À¯µ¿È­ºÎÁ¡ Á¶È¸
      *-----------------------------------------------------------------
       S3100-DSTCD_02_PROC-RTN.

      *   ºÎÁ¡ÄÚµå
           MOVE  CO-CHA-8961           TO  XFJL0001-O-BRNCD(1)
      *   ºÎÁ¡ÄÚµå°ËÁõ¿©ºÎ
           MOVE  CO-CHA-1              TO  XFJL0001-O-BRNCD-VALDN-YN
      *   ºÎÁ¡ÄÚµå°Ç¼ö
           MOVE  CO-NUM-1              TO  XFJL0001-O-BRN-NOITM

           .
       S3100-DSTCD_02_PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
      *@  Á¶È¸±¸ºÐ ×03ø º»ºÎºÎÁ¡ ¿µ¾÷Áö¿øº»ºÎºÎÁ¡±¸ºÐ Á¶È¸
      *-----------------------------------------------------------------
       S3100-DSTCD_03_PROC-RTN.

      *@   Áö¿ªº»ºÎ(¿µ¾÷Áö¿øº»ºÎºÎÁ¡) ºÐ·ù ¿ä°Ç
      *  1)  1948: ÅõÀÚ±ÝÀ¶ºÎ
      *      3933: ±¸Á¶È­±ÝÀ¶ºÎ
      *      9636: ÀÎÇÁ¶ó±ÝÀ¶ºÎ
      *    ==> 6927: CIB±âÈ¹ºÎ
      *
      *  2)  0015: ¸íµ¿¿µ¾÷ºÎ
      *      4004: ¿©ÀÇµµ¿µ¾÷ºÎ
      *      8169: ¼­¿©ÀÇµµ¿µ¾÷ºÎ
      *    ==> ÇØ´çºÎÁ¡À» ¿µ¾÷Áö¿øº»ºÎºÎÁ¡À¸·Î ºÐ·ù
      *
      *  3)  ºÎÁ¡±¸ºÐ 06:ÇØ¿Ü¿µ¾÷Á¡ 07:ÇØ¿ÜÇöÁö¹ýÀÎ
      *    ==> 5106: ±Û·Î¹ú»ç¾÷ºÎ

      *   ºÎÁ¡ÄÚµå
           MOVE  CO-CHA-6927           TO  XFJL0001-O-BRNCD(1)
           MOVE  CO-CHA-1948           TO  XFJL0001-O-BRNCD(2)
           MOVE  CO-CHA-3933           TO  XFJL0001-O-BRNCD(3)
           MOVE  CO-CHA-9636           TO  XFJL0001-O-BRNCD(4)

           MOVE  CO-CHA-0015           TO  XFJL0001-O-BRNCD(5)
           MOVE  CO-CHA-4004           TO  XFJL0001-O-BRNCD(6)
           MOVE  CO-CHA-8169           TO  XFJL0001-O-BRNCD(7)

180117     MOVE  CO-CHA-5106           TO  XFJL0001-O-BRNCD(8)
           .
       S3100-DSTCD_03_PROC-EXT.
           EXIT.

      *-----------------------------------------------------------------
240530*@  Á¶È¸±¸ºÐ ×04ø ÀÌ»çÈ¸½ÂÀÎ³»¿ª ºÎÁ¡(3810 , 1502) Á¶È¸
      *-----------------------------------------------------------------
       S3100-DSTCD_04_PROC-RTN.

      *   Æ¯Á¤ºÎÁ¡È®ÀÎ
      *    3810 : ÀÚº»½ÃÀåÇÃ·§ÆûºÎ
      *    1502 : ÀÚ±ÝºÎ

           IF  XFJL0001-I-BRNCD = ('3810' OR
                                   '1502' )

               MOVE  CO-CHA-3810       TO  XFJL0001-O-BRNCD(1)
               MOVE  CO-CHA-1502       TO  XFJL0001-O-BRNCD(2)

      *   ºÎÁ¡ÄÚµå°ËÁõ¿©ºÎ
               MOVE  CO-CHA-1          TO  XFJL0001-O-BRNCD-VALDN-YN

           ELSE
               MOVE  XFJL0001-I-BRNCD  TO  XFJL0001-O-BRNCD(1)

      *   ºÎÁ¡ÄÚµå°ËÁõ¿©ºÎ
               MOVE  CO-CHA-0          TO  XFJL0001-O-BRNCD-VALDN-YN
           END-IF
           .
       S3100-DSTCD_04_PROC-EXT.
           EXIT.
      *-----------------------------------------------------------------
      *@  Ã³¸®Á¾·á
      *-----------------------------------------------------------------
       S9000-FINAL-RTN.

           #OKEXIT  CO-STAT-OK.

       S9000-FINAL-EXT.
           EXIT.
