#!/bin/sh

#####################################################
# 프로그램 : BUBIP0001
# 업      무 : 기업그룹 관계관리
# 배 치  명 : 기업그룹 관계관리 배치처리
# 설      명 : 월별 기업그룹 관계관리 배치 프로세스
# 작 성  자 : MultiQ4KBBank
# 작 성  일 : 2024-09-15
# ===================================================
# 버전      일자                   작성자                                 설명
# ===================================================
#  1.0   20240915   MultiQ4KBBank   기업그룹 관계관리 배치 초기 생성
#
#####################################################

CURRDIR=$(realpath $(dirname $0))
cd $CURRDIR
SHELL_NAME=$(basename $0)
WAS_DOMAIN=$(echo $CURRDIR | cut -d/ -f 3)

. /fsapp/$WAS_DOMAIN/sqc/runtime/batch/config/shell/setEnv.sh

#====================================================
# 배치 프로그램 클래스명 설정
# 역할분리방식 병렬처리시에는 클래스를 2개 지정가능함
#====================================================
NC_BATCH_CLASS1=com.kbstar.edu.c2j.batch.BUBIP0001
NC_BATCH_CLASS2=
NC_BATCH_CLASS3=
NC_BATCH_CLASS4=
NC_BATCH_CLASS5=

#====================================================
# 로그 디렉토리 확인
#====================================================
if [ ! -e "${NEXCORE_LOG_HOME}" ]; then
        mkdir -p ${NEXCORE_LOG_HOME}
fi

#====================================================
# 배치 Job 개별 파라미터를 여기에 설정
# NC_PARAMn=파라미터명=파라미터값
#====================================================
NC_PARAM1=workBsd=${1:-$(date +%Y%m%d)}
NC_PARAM2=OUTPUT_FILE=$2
NC_PARAM3=
NC_PARAM4=
NC_PARAM5=

#====================================================
# BATCH 파라미터 설정
#====================================================
ARGS=
. ${NEXCORE_BATCH_HOME}/config/shell/setArguments.sh "$*"

#====================================================
# 데몬 배치 여부
#====================================================
if [ "${DAEMON_YN}" = "Y" ]; then
        ARGS="${ARGS} -DAEMON=Y"
fi

#====================================================
# JVM Options
#====================================================
JAVA_OPTS="$MEM_OPTS $JAVA_OPTS"

#====================================================
# 배치 프로그램 실행
#====================================================
. $NEXCORE_HOME/batch/config/shell/batchrun.sh ${ARGS}

#====================================================
# 실행결과 에러/정상 여부 판단. (종료코드가 0이면 정상, 그외 에러)
#====================================================

echo [`date +"%Y-%m-%d %H:%M:%S"`] ENDED JAVA BATCH. Exit:${NC_RETURNCODE}
exit ${NC_RETURNCODE}
